


# see: chars_of.try_CJK_name

from pprint import pprint


cs_STROKE = '㇀㇁㇂㇃㇄㇅㇆㇇㇈㇉㇊㇋㇌㇍㇎㇏㇐㇑㇒㇓㇔㇕㇖㇗㇘㇙㇚㇛㇜㇝㇞㇟㇠㇡㇢㇣'
en_cn = 'B大D点G钩H横N捺P撇Q圈S竖T提W弯X斜Z折'
cn_short_stroke_names = \
       ['提', '弯钩', '斜钩', '大斜钩', '竖弯',
        '横折折', '横折钩', '横撇', '横折弯钩', '竖折弯钩',
        '横折提', '横折折撇', '横撇弯钩', '横折弯', '横折折折',
        '捺', '横', '竖', '撇', '竖撇',
        '点', '横折', '横钩', '竖折', '竖弯折',
        '竖提', '竖钩', '撇点', '撇折', '提捺',
        '竖折折', '竖弯钩', '横斜弯钩', '横折折折钩', '撇钩',
        '圈']

assert len(cs_STROKE) == len(cn_short_stroke_names) == 36
stroke_and_name_pairs = list(zip(cs_STROKE, cn_short_stroke_names))
# pprint(stroke_and_name_pairs)
assert stroke_and_name_pairs == \
[('㇀', '提'),
 ('㇁', '弯钩'),
 ('㇂', '斜钩'),
 ('㇃', '大斜钩'),
 ('㇄', '竖弯'),
 ('㇅', '横折折'),
 ('㇆', '横折钩'),
 ('㇇', '横撇'),
 ('㇈', '横折弯钩'),
 ('㇉', '竖折弯钩'),
 ('㇊', '横折提'),
 ('㇋', '横折折撇'),
 ('㇌', '横撇弯钩'),
 ('㇍', '横折弯'),
 ('㇎', '横折折折'),
 ('㇏', '捺'),
 ('㇐', '横'),
 ('㇑', '竖'),
 ('㇒', '撇'),
 ('㇓', '竖撇'),
 ('㇔', '点'),
 ('㇕', '横折'),
 ('㇖', '横钩'),
 ('㇗', '竖折'),
 ('㇘', '竖弯折'),
 ('㇙', '竖提'),
 ('㇚', '竖钩'),
 ('㇛', '撇点'),
 ('㇜', '撇折'),
 ('㇝', '提捺'),
 ('㇞', '竖折折'),
 ('㇟', '竖弯钩'),
 ('㇠', '横斜弯钩'),
 ('㇡', '横折折折钩'),
 ('㇢', '撇钩'),
 ('㇣', '圈')]



