r'''[[[
约束:各方案选用代表字时应避免与其他方案代表字产生交集
    多比特情形应当尽量使用统一部首

[[结果速报:
8bit 256字 方案没找到
4bit 16字 方案很多，见下面『笔画类分组囗前几笔囗前几笔笔顺大类码到汉字串囗囗摘选列表囗四比特八比特版』
    4笔*1bit每笔 的 方案，选一:
        按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字 = '羽立六井太左共而木手父介仁少行血'
        #14_23__sp5
    2笔*2bit每笔 的 方案，选一:
        按横为零零撇为零一捺为一零竖为一一忽略折笔记为二进制数时前两笔的十六个代表字 = '二大至丁乞反人川亡羊之祖口小光山'
        #1_3_4_2__sp5

6bit 方案:
    6笔*1bit每笔 的 方案，选一:
        按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字 = '泣汗江洪浮浴沙派廊唐廉度底店府刑捧扶持描授扮拍拙茫芋苔茸草芥芹花膀旱是最昌晃昭易忿坐企斧肖竹敞盆信位停偏佳佐供僧伶件俗蜀伯悠循催'
        #14_23__sp5
]]
汉字笔划 --> 4bit/8bit  ...6bit?
    用汉字的前几笔的笔划种类编码二进制数
    因为笔划更加直观，[0-9A-F]完全看不出比特位，[01]又太长。

5种笔画类 [1-5]

A. 每笔编码1/2bit.
A1. 每笔编码1bit.
    5笔画类 分:数值类2类(非空集合)+空格类1类(允空集合)
    0空格:
        0C5*(1C5+2C5)=1*(5+10)=15
    1空格:
        1C5*(1C4+2C4/2!)=5*(4+3)=35
    2空格:
        2C5*(1C3)=10*(3)=30
    3空格:
        3C5*(1C2/2!)=10*(1)=10
    共计 15+35+30+10=90
A2. 每笔编码2bit.
    5笔画类 分:数值类4类(非空集合)+空格类1类(允空集合)
    0空格:
        0C5*(2C5)=1*(10)=10
    1空格:
        1C5*(1)=5*(1)=5
    共计 10+5=15

B. 每字编码4/8bit
B1. 每字编码4bit xdigit
    B1A1. 每字使用 首4笔 编码
    B1A2. 每字使用 首2笔 编码
    找出16字
B2. 每字编码8bit byte
    B2A1. 每字使用 首8笔 编码
    B2A2. 每字使用 首4笔 编码
    找出256字

######################
######################
######################
######################
e script/repr_binary_by_hz_stroke_kind.py
py script/repr_binary_by_hz_stroke_kind.py
py script/repr_binary_by_hz_stroke_kind.py > /sdcard/0my_files/tmp/_.txt
view  /sdcard/0my_files/tmp/_.txt
!du -h  /sdcard/0my_files/tmp/_.txt
    44K # _search__6bit_7bit

DOING:笔画类分组囗前几笔囗前几笔笔顺大类码到汉字串囗囗摘选列表囗六比特七比特版
    #1_3_4_5__sp2
        #！！！已取消1_3_4_5__sp2，见下面『阪』！！！

view ../../python3_src/nn_ns/CJK/cjk_subsets/共享汉字集笔顺码.py.out.另档.cjk_common_subset_2513.汉字到笔顺码.txt
view ../../python3_src/nn_ns/CJK/cjk_subsets/共享汉字集笔顺码.py


#]]]'''


__all__ = '''
按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字
按横为零零撇为零一捺为一零竖为一一忽略折笔记为二进制数时前两笔的十六个代表字
按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字

search_all_possible
    笔画类分组囗前几笔囗前几笔笔顺大类码到汉字串囗囗摘选列表囗四比特八比特版
    笔画类分组囗前几笔囗前几笔笔顺大类码到汉字串囗囗摘选列表囗六比特七比特版

    '''.split()
from nn_ns.CJK.cjk_subsets.hanzi import hz_sp_str2hz_set, hz_set2sorted_hz_str
from itertools import combinations
from seed.func_tools.fmapT.fmapT__tiny import dot, fmapT__iter, fmapT__dict#, fmapT__list
from seed.func_tools.fmapT.filterT__tiny import filterT__dict
from seed.func_tools.fmapT.predT__tiny import len_geT
from seed.tiny import group4dict_value, snd, echo
from pprint import pprint





def list_groups__A(stroke_kinds, num_groups, /):
    '-> frozenset<frozenset<frozenset<stroke_kind> > > #frozenset<groups>'
    def _mk(*gs):
        return frozenset(gs)
    def base_case__0sp(stroke_kinds, num_groups, /):
        '-> Iter<frozenset<frozenset<stroke_kind> > > #Iter<groups>'
        if num_groups < 0 or len(stroke_kinds) < num_groups:
            return
        elif 1 == num_groups:
            yield _mk(stroke_kinds)
        elif len(stroke_kinds) == num_groups:
            yield frozenset(map(_mk, stroke_kinds))
        elif num_groups == 0 < len(stroke_kinds):
            return
        else:
            raise logic-err--'not base_case'
    def top_case__allow_sp(stroke_kinds, num_groups, /):
        '-> Iter<frozenset<frozenset<stroke_kind> > > #Iter<groups>'
        if num_groups <= 0 or len(stroke_kinds) <= num_groups:
            yield from base_case__0sp(stroke_kinds, num_groups)
        else:
            for n in range(0, len(stroke_kinds)-num_groups +1):
                for sp in map(frozenset, combinations(stroke_kinds, n)):
                    assert len(sp) == n
                    _stroke_kinds = stroke_kinds - sp
                    #bug:yield from recur__has_no_sp(_stroke_kinds, num_groups-n)
                    yield from recur__has_no_sp(_stroke_kinds, num_groups)
    def recur__has_no_sp(stroke_kinds, num_groups, /):
        '-> Iter<frozenset<frozenset<stroke_kind> > > #Iter<groups>'
        #print(stroke_kinds, num_groups)
        if num_groups <= 0 or len(stroke_kinds) <= num_groups:
            yield from base_case__0sp(stroke_kinds, num_groups)
        else:
            L = len(stroke_kinds)
            D = L - num_groups
            m = (D+num_groups-1)//num_groups
            if len(stroke_kinds) == 1+num_groups:
                assert m==D==1
            for n in range(1+m, 1+D+1):
                for g0 in map(frozenset, combinations(stroke_kinds, n)):
                    _stroke_kinds = stroke_kinds - g0
                    #bug:for gs in recur__has_no_sp(_stroke_kinds, num_groups-n):
                    for gs in recur__has_no_sp(_stroke_kinds, num_groups-1):
                        yield _mk(g0, *gs)

    def main():
        ksss = gss = frozenset(top_case__allow_sp(stroke_kinds, num_groups))
        f = sorted
            #ks
        ff = dot[f, fmapT__iter(f)]
            #kss
        fff = dot[f, fmapT__iter(ff)]
            #ksss
        gss = ksss = fff(ksss)
        groups_list = gss
        return groups_list
    return main()

_stroke_kinds = frozenset(range(1,6))
if 0:
    #print(len(list_groups__A(_stroke_kinds, 2)))
    assert len(list_groups__A(_stroke_kinds, 2)) == 90
    assert len(list_groups__A(_stroke_kinds, 4)) == 15
def _t(show, /):
    groups_list__1bit__90 = list_groups__A(_stroke_kinds, 2)
    groups_list__2bit__15 = list_groups__A(_stroke_kinds, 4)
    assert len(groups_list__1bit__90) == 90
    assert len(groups_list__2bit__15) == 15
    assert set(map(len, groups_list__1bit__90)) == {2**1}
    assert set(map(len, groups_list__2bit__15)) == {2**2}
    assert set(fmapT__iter(dot[sum, fmapT__iter(len)])(groups_list__1bit__90)) <= {2,3,4,5}
    assert set(fmapT__iter(dot[sum, fmapT__iter(len)])(groups_list__2bit__15)) <= {4,5}
    if show:
        pprint(groups_list__1bit__90)
        pprint(groups_list__2bit__15)
#_t(False)
groups_list__1bit__90 = \
[[[1], [2]]
,[[1], [2, 3]]
,[[1], [2, 3, 4]]
,[[1], [2, 3, 4, 5]]
,[[1], [2, 3, 5]]
,[[1], [2, 4]]
,[[1], [2, 4, 5]]
,[[1], [2, 5]]
,[[1], [3]]
,[[1], [3, 4]]
,[[1], [3, 4, 5]]
,[[1], [3, 5]]
,[[1], [4]]
,[[1], [4, 5]]
,[[1], [5]]
,[[1, 2], [3]]
,[[1, 2], [3, 4]]
,[[1, 2], [3, 4, 5]]
,[[1, 2], [3, 5]]
,[[1, 2], [4]]
,[[1, 2], [4, 5]]
,[[1, 2], [5]]
,[[1, 2, 3], [4]]
,[[1, 2, 3], [4, 5]]
,[[1, 2, 3], [5]]
,[[1, 2, 3, 4], [5]]
,[[1, 2, 3, 5], [4]]
,[[1, 2, 4], [3]]
,[[1, 2, 4], [3, 5]]
,[[1, 2, 4], [5]]
,[[1, 2, 4, 5], [3]]
,[[1, 2, 5], [3]]
,[[1, 2, 5], [3, 4]]
,[[1, 2, 5], [4]]
,[[1, 3], [2]]
,[[1, 3], [2, 4]]
,[[1, 3], [2, 4, 5]]
,[[1, 3], [2, 5]]
,[[1, 3], [4]]
,[[1, 3], [4, 5]]
,[[1, 3], [5]]
,[[1, 3, 4], [2]]
,[[1, 3, 4], [2, 5]]
,[[1, 3, 4], [5]]
,[[1, 3, 4, 5], [2]]
,[[1, 3, 5], [2]]
,[[1, 3, 5], [2, 4]]
,[[1, 3, 5], [4]]
,[[1, 4], [2]]
,[[1, 4], [2, 3]]
,[[1, 4], [2, 3, 5]]
,[[1, 4], [2, 5]]
,[[1, 4], [3]]
,[[1, 4], [3, 5]]
,[[1, 4], [5]]
,[[1, 4, 5], [2]]
,[[1, 4, 5], [2, 3]]
,[[1, 4, 5], [3]]
,[[1, 5], [2]]
,[[1, 5], [2, 3]]
,[[1, 5], [2, 3, 4]]
,[[1, 5], [2, 4]]
,[[1, 5], [3]]
,[[1, 5], [3, 4]]
,[[1, 5], [4]]
,[[2], [3]]
,[[2], [3, 4]]
,[[2], [3, 4, 5]]
,[[2], [3, 5]]
,[[2], [4]]
,[[2], [4, 5]]
,[[2], [5]]
,[[2, 3], [4]]
,[[2, 3], [4, 5]]
,[[2, 3], [5]]
,[[2, 3, 4], [5]]
,[[2, 3, 5], [4]]
,[[2, 4], [3]]
,[[2, 4], [3, 5]]
,[[2, 4], [5]]
,[[2, 4, 5], [3]]
,[[2, 5], [3]]
,[[2, 5], [3, 4]]
,[[2, 5], [4]]
,[[3], [4]]
,[[3], [4, 5]]
,[[3], [5]]
,[[3, 4], [5]]
,[[3, 5], [4]]
,[[4], [5]]
]
groups_list__2bit__15 = \
[[[1], [2], [3], [4]]
,[[1], [2], [3], [4, 5]]
,[[1], [2], [3], [5]]
,[[1], [2], [3, 4], [5]]
,[[1], [2], [3, 5], [4]]
,[[1], [2], [4], [5]]
,[[1], [2, 3], [4], [5]]
,[[1], [2, 4], [3], [5]]
,[[1], [2, 5], [3], [4]]
,[[1], [3], [4], [5]]
,[[1, 2], [3], [4], [5]]
,[[1, 3], [2], [4], [5]]
,[[1, 4], [2], [3], [5]]
,[[1, 5], [2], [3], [4]]
,[[2], [3], [4], [5]]
]



def 求囗笔画类再归类(stroke_kinds, stroke_kind_groups, /):
    d0 = dict.fromkeys(stroke_kinds, '')
    d1 = {stroke_kind:K for g, K in zip(stroke_kind_groups, 'ABCD') for stroke_kind in g}
    d0.update(d1)
    笔画类再归类 = {str(k):K for k, K in d0.items()}
    #print(笔画类再归类); raise
    return 笔画类再归类
def 求囗笔顺大类码(笔画类再归类翻译表, 笔顺码):
    笔顺大类码 = 笔顺码.translate(笔画类再归类翻译表)
    r'''
    笔顺大类码 = '12345'.translate(笔画类再归类翻译表)
    print((笔顺大类码, (笔画类再归类翻译表, 笔顺码))); raise
        ('1', ({'1': 'A', '2': 'B', '3': '', '4': '', '5': ''}, '1'))
str.translate(table)
    Return a copy of the string in which each character has been mapped through the given translation table.
    The table must be an object that implements indexing via __getitem__(), typically a mapping or sequence.
    When indexed by a Unicode ordinal (an integer)
        , the table object can do any of the following:
        return a Unicode ordinal or a string, to map the character to one or more other characters;
        return None, to delete the character from the return string;
        or raise a LookupError exception, to map the character to itself.

    You can use str.maketrans() to create a translation map from character-to-character mappings in different formats.
    #'''
    return 笔顺大类码
def 求囗汉字到笔顺大类码(笔画类再归类, 汉字到笔顺码):
    笔画类再归类翻译表 = str.maketrans(笔画类再归类)
    f = lambda 笔顺码:求囗笔顺大类码(笔画类再归类翻译表, 笔顺码)
    汉字到笔顺大类码 = fmapT__dict(f)(汉字到笔顺码)
    return 汉字到笔顺大类码
def 汉字归组(前几笔, 汉字到笔顺大类码):
    assert type(汉字到笔顺大类码) is dict
    汉字到笔顺大类码 = filterT__dict(dot[len_geT(前几笔), snd])(汉字到笔顺大类码)
    assert type(汉字到笔顺大类码) is dict

    f = lambda 笔顺大类码:笔顺大类码[:前几笔]
    汉字到前几笔笔顺大类码 = fmapT__dict(f)(汉字到笔顺大类码)

    前几笔笔顺大类码到汉字到前几笔笔顺大类码 = group4dict_value(echo, 汉字到前几笔笔顺大类码)
    f = hz_set2sorted_hz_str
    前几笔笔顺大类码到汉字串 = fmapT__dict(f)(前几笔笔顺大类码到汉字到前几笔笔顺大类码)
    return 前几笔笔顺大类码到汉字串


def 批量处理(groups_list, 前几笔列表, 汉字到笔顺码, stroke_kinds, /, verbose):
    num_bits_per_stroke = len(groups_list[0]).bit_length() - 1
    assert num_bits_per_stroke > 0
    assert 2**num_bits_per_stroke == len(groups_list[0])

    for stroke_kind_groups in groups_list:
        for 前几笔, 前几笔笔顺大类码到汉字串 in 单个处理(stroke_kind_groups, 前几笔列表, 汉字到笔顺码, stroke_kinds):
            num_bits_per_hz = num_bits_per_stroke * 前几笔
            前几笔笔顺大类码总数 = 2**num_bits_per_hz
            L = len(前几笔笔顺大类码到汉字串)
            if not L <= 前几笔笔顺大类码总数:
                print((stroke_kind_groups, 前几笔, 前几笔笔顺大类码总数, L))
                print(sorted(前几笔笔顺大类码到汉字串))
            assert L <= 前几笔笔顺大类码总数
            if L == 前几笔笔顺大类码总数:
                if verbose:
                    yield (stroke_kind_groups, 前几笔, 前几笔笔顺大类码到汉字串)
                else:
                    yield (stroke_kind_groups, 前几笔)


def 单个处理(stroke_kind_groups, 前几笔列表, 汉字到笔顺码, stroke_kinds, /):
    笔画类再归类 = 求囗笔画类再归类(stroke_kinds, stroke_kind_groups)
    汉字到笔顺大类码 = 求囗汉字到笔顺大类码(笔画类再归类, 汉字到笔顺码)
    for 前几笔 in 前几笔列表:
        前几笔笔顺大类码到汉字串 = 汉字归组(前几笔, 汉字到笔顺大类码)
        yield 前几笔, 前几笔笔顺大类码到汉字串

def search_all_possible(*, verbose, argss=None, 汉字到笔顺码=None):
    if 汉字到笔顺码 is None:
        from nn_ns.CJK.cjk_subsets.共享汉字集笔顺码 import 只读囗共享汉字到笔顺码
        汉字到笔顺码 = 只读囗共享汉字到笔顺码
    stroke_kinds = _stroke_kinds

    if argss is None:
        argss = argss__4bit_8bit = [
        (groups_list__1bit__90, [4,8])
        ,(groups_list__2bit__15, [2,4])
        ]

    xprint = pprint if verbose else print

    for groups_list, 前几笔列表 in argss:
        for rs in 批量处理(groups_list, 前几笔列表, 汉字到笔顺码, stroke_kinds, verbose=verbose):
            xprint(rs)
def _search__4bit_8bit():
    argss__4bit_8bit = [
        (groups_list__1bit__90, [4,8])
        ,(groups_list__2bit__15, [2,4])
        ]

    search_all_possible(verbose=False, argss=argss__4bit_8bit)

if 0:
    _search__4bit_8bit()
if 0:
    search_all_possible(verbose=True, argss=[
    ([[[1], [2]]
    , [[1, 4], [2, 3]]], [4]
    )
    ,([[[1], [2, 3], [4], [5]]
    , [[1], [2], [3], [4]]], [2]
    )
    ])
r'''[[[see also: _search__6bit_7bit
#_search__4bit_8bit
search_all_possible(verbose=False)
    #4bit, 没有8bit!
    四笔方案摘选:
        ([[1], [2]], 4)
        ([[1, 4], [2, 3]], 4)
    两笔方案摘选:
        ([[1], [2, 3], [4], [5]], 2)
        ([[1], [2], [3], [4]], 2)
====
([[1], [2]], 4)
([[1], [2, 3]], 4)
([[1], [2, 3, 4]], 4)
([[1], [2, 4]], 4)
([[1], [2, 4, 5]], 4)
([[1], [2, 5]], 4)
([[1], [3]], 4)
([[1], [3, 4]], 4)
([[1], [3, 4, 5]], 4)
([[1], [3, 5]], 4)
([[1], [4]], 4)
([[1], [4, 5]], 4)
([[1], [5]], 4)
([[1, 2], [3]], 4)
([[1, 2], [3, 4]], 4)
([[1, 2], [3, 4, 5]], 4)
([[1, 2], [3, 5]], 4)
([[1, 2], [4]], 4)
([[1, 2], [4, 5]], 4)
([[1, 2], [5]], 4)
([[1, 2, 3], [4]], 4)
([[1, 2, 3], [4, 5]], 4)
([[1, 2, 3], [5]], 4)
([[1, 2, 4], [3, 5]], 4)
([[1, 2, 5], [3]], 4)
([[1, 2, 5], [3, 4]], 4)
([[1, 2, 5], [4]], 4)
([[1, 3], [2, 4]], 4)
([[1, 3], [2, 4, 5]], 4)
([[1, 3], [2, 5]], 4)
([[1, 3], [4]], 4)
([[1, 3], [4, 5]], 4)
([[1, 3], [5]], 4)
([[1, 3, 4], [2, 5]], 4)
([[1, 3, 5], [2, 4]], 4)
([[1, 4], [2]], 4)
([[1, 4], [2, 3]], 4)
([[1, 4], [2, 3, 5]], 4)
([[1, 4], [2, 5]], 4)
([[1, 4], [3]], 4)
([[1, 4], [3, 5]], 4)
([[1, 4], [5]], 4)
([[1, 4, 5], [2, 3]], 4)
([[1, 4, 5], [3]], 4)
([[1, 5], [2, 3]], 4)
([[1, 5], [2, 3, 4]], 4)
([[1, 5], [2, 4]], 4)
([[1, 5], [3]], 4)
([[1, 5], [3, 4]], 4)
([[1, 5], [4]], 4)
([[2], [3]], 4)
([[2], [3, 4]], 4)
([[2], [3, 4, 5]], 4)
([[2], [3, 5]], 4)
([[2], [4]], 4)
([[2], [4, 5]], 4)
([[2], [5]], 4)
([[2, 3], [4]], 4)
([[2, 3], [4, 5]], 4)
([[2, 3], [5]], 4)
([[2, 3, 4], [5]], 4)
([[2, 4], [3]], 4)
([[2, 4], [3, 5]], 4)
([[2, 4], [5]], 4)
([[2, 5], [3]], 4)
([[2, 5], [3, 4]], 4)
([[2, 5], [4]], 4)
([[3], [4]], 4)
([[3], [4, 5]], 4)
([[3], [5]], 4)
([[3, 4], [5]], 4)
([[3, 5], [4]], 4)
([[4], [5]], 4)
([[1], [2], [3], [4]], 2)
([[1], [2], [3], [5]], 2)
([[1], [2], [4], [5]], 2)
([[1], [2, 3], [4], [5]], 2)
([[1], [2, 4], [3], [5]], 2)
([[1], [2, 5], [3], [4]], 2)
([[1], [3], [4], [5]], 2)
([[1, 2], [3], [4], [5]], 2)
([[2], [3], [4], [5]], 2)
#]]]'''



r'''[[[
search_all_possible(verbose=True, argss=[
    ([[[1], [2]]
    , [[1, 4], [2, 3]]], [4]
    )
    ,([[[1], [2, 3], [4], [5]]
    , [[1], [2], [3], [4]]], [2]
    )
    ])

=====输出 见下面『笔画类分组囗前几笔囗前几笔笔顺大类码到汉字串囗囗摘选列表囗四比特八比特版』
#]]]'''
笔画类分组囗前几笔囗前几笔笔顺大类码到汉字串囗囗摘选列表囗四比特八比特版 = ''
笔画类分组囗前几笔囗前几笔笔顺大类码到汉字串囗囗摘选列表 = \
[
([[1], [2]],
 4,
 {'AAAA': '凄匏奉奏娠嫉嫌差庠廉建弱拜拳旌族替朋朕朗望洋津渠渥湃溺滓澹濂瓣疾痍痒痕痴矩秦竺竿笙笠筋筌筐箴簇簪簿籍翊翌翔翠聿肄肇肝腱腿膀膣膳臆辣辨辱靖',
  'AAAB': '兼冠凝割匡唇唐善奈契奸妹妻姓娜宰害尉屋巽康庸廊彗慧慰斌新旒旗春朦殊毓汗汪沫注泰洙涯淘淙添渡游漏潼濯烽燮率疳病症痔痘痢瘠癖短矮秉第等筑答策筮箔箕箝箭箱箸篇簧繁羊羞耕耗耘肛肢肺胚脯腋腑腔腰腹膈膊膜膝膨臧蜃蠢言豁辛逢邦',
  'AABA': '主全凋凌到剖君咸奇奎奔套奢妊姜娃娥婚嫡嫩嬉孀室寄寇屠左年庄座庭庵廓弄式弼彰恙意感摩敖斑斛斜旋智武毒江河法洗洽浙浦浩淀淅淆淋淫淳淹渚源溥溯滴演漕漱潺澄澎濠濡瀛焙熬狂猜玉王玖玩玲玳珀珂珊珍珞珠珥班球琅理琉琢琥琳琴琵琶瑁瑕瑙瑚瑛瑜瑞瑟瑾璃璋璞生甥疆疑疵疸疽痂痛痼瘟瘤癌看眷知碧磐磨窒窘站竟章童竭笛笞符筏筒筵算管篁粥素纂纛美羔群羲羹翼肥胎胛胱胴脂脾腥腺至致臻艇蟹表解逮邂郡部酒金釜雉靡音韶魂魔麻麾',
  'AABB': '冽刊刑判制匿型塞姑媒寒寨居展席度庶慝殖殿沛沽泄洌洪活淇渣渤渫港湖湘湛湮溢漂漆漠潘潭潮瀚灌疝盂端缶缸缺罐臀舍舒舞蹇遮',
  'ABAA': '乍事亭准前剪劈匍匣匪卦厘厚原哲圭圻均坊坑坪垓垠垢垣埃城域埴培堀堪堰堵塑塔塘境壁壅壕壤壹夏奄奠姐姻娼婢嫂嬖宣宥寡寮寺封尊巧幸廛惑惠愈愿懿或戚扉打托扶批扼技抉抗折抱抵抹拂拇拉拌拒拓拔括拭拮拱拷拾拿持按挑挫振挺捕捧据捷捺掖掘掠探接控掩措揄揆描握援揶搏搬搭摘摸摺撒撞撤播撰擅擒擘擢擦攘攻救敷斫昏更有朔杆杵枉柱栓株根栽桎梅梓械棒棕棚椅椿楔榛榜樟檗款殉毫汨沮泊洵涅涌淑淮混渺湟溟滔漫激瀑炸煎燎牡牧牲特犀猷璧甫登百皆盲砒砥硅硫硬硼碇碌碎磁磅磊磋秤秩窄粒粹精糖糠羸翅翕考肆肩育肴脊臂舶衰裁誓譬豆豌豪貊蹙逋逗逝逵逾遐道遵避郁酉酊酋酌配酎酢酩酪酬酵酷酸醇醉醋醍醒醯醴醵重雄雇雍雪震首',
  'ABAB': '亨享京剌副匐卉博可吉吾告周命哉哥喜嘉在地址坡坤坦垂埋埠堆堤塾墟娟媚孝孰孱宦寅富就履店府彬彭截戴扁扈抄把抑抒披押抽拈拍拐拘拙招拯指挽捉捌捏捐掉排推提揖搜撮操攀攫政敦敲整料曹材村杜束杯析林枝枯柄柑柝柬柯栖桀桂桓桔梏梗梧梯梳梵棋森植椰楚楠楮楷楸榧槁槽槿樊樗模樽橄橙檀檎歌正歪汞油沾洞涓涵渭溜澳烹焉焚煮熏熟熹猿畜畿盒砂砧破硝碑碣磬礁禁科稀稠稽稿穗穰竹粳糊糟絮翩者耆腐膏臣融衷袁襄赤赦赫走赳赴起超越趣速造逼遍遭郭都雕需霆霖霜霞霰霹馨高魏麓鼓',
  'ABBA': '世乖乘乾克兢共其再刮剩勃勒勘勤南取古否和商基娶嫦存季屑巷恭想惹憩懋戟戡故敢散斟斡斯昔普朝期李杏杳杷枳枷枸柏某柚格桁桐桶棉棍棘棹棺椎椒楫榕榴榻槌槐樵橡檄欺消湍滑煤熙燔燕甘甚番直相盾矗租秧程稗稚稷稻穆粕粗粘翰耳耶耽耿聆聊聘聚胡膺舌芋芒芙芳芸芹芽苛苞若苦茂范茉茨茫茱茶茸茹荒莉莎莞莪莽菁菊菜菩菱萃萄萍萎萱落著葡董葫葬葵蒙蒜蒡蒲蒿蓄蓍蓑蓬蓼蔗蔚蔡蕃蕨薄薪藉藏藕藜藤藩藻裂裔褒辜遁邯釉雁雅雷霓露革靴鞋鞍鞠鞫鞭香馥鹿麒麝麟黍黎',
  'ABBB': '利刷刺剃剽募墓寞屈幕慕敬暮栗梢梨楞楹橘犁瓢甄益盛票稍窟粟而耐芥芭花苒苔苗苟英茄茅茗茯茴茵荀草荏荷莫菅菌菖菰菲菽萌萸葛葺蒸蓉蔑蔓蔬蔽蕉薇薛薨薯要覃覆警面',
  'BAAA': '且佯侯俎信俸健兜具冥凰剿助匙卑呈味喊嗟嗾噫圈宜宴寐射影律息悲愆慊慨慷承斐旦早旱旺昆昊明星昧昨是晁晏晟晤晦晨景晴暄暇暑暖暗暴暾曜曦最果段焦煌熄爆狙猊猩皇皎皓盟目眄眈眠眩眸眺眼睛睡睦睫睹瞑瞬瞰瞳瞻瞿祥翡耀自臭臼臾舅虐虔蜚衍裴褥身躬逞遑遽邀量阜隆集雎非餐魁魃魅鼎鼠鼻',
  'BAAB': '件伴住佐侏倍倒倚倨傲僭冀冒冕剔勇叔吐呵呼哄哈哮哺唾啼喇喧嗔嗜嗽嘲嘶嚆墅壑孺寂寓寤帛往徐御性悴情惰愚憧憾懈昌映昭昴晃晶暝暹曙曝曼架泉煦照牒狎狸猖甬甲申督睿粲背虞行裙褶通遇鄙里野陛除陪陶隋障魄',
  'BABA': '丘串些仕任企伍伺佑何作佰佳佶使侍侑便俄俯俺倭偃假偏偕停傅僖僚僻儒兵凸卓占同吼呻咀咐咽品哭唯唱喀喉喝嗅嗣嘴器困圃圄墨宙宿岳征待徒思怪怯恁恃恰悚悟患愉愎懦柴止此燥牌猥田由男甸町界畏畔留畛略畦畸疏眉砦社祚祠福禧禳紫累肯胃胄胥虹蚊蚌蚓蚣蚤蛇蛋蛔蛙蛛蛟蛤蛭蛾蜂蜈蜘蜜蝎蝗蝴蝶螂螟螳螺蟠蟾街衙襁襟足趺趾跋跌跏跛距跣跨路跳踊踏踞踵蹂蹄蹈蹉蹊蹴蹶躁躇迪遣邑邱鄂阿陌陵隔雌黔默黛黜',
  'BABB': '佩例供借做典吊哨喘嗤嚼固孟岱循怖恬悖悸惜慌曲猛祺禹隘',
  'BBAA': '伯伸但俑俚保俳候倡倪偈偶傀削回堂堡宵岷岸峰崇崎崖崩嵯帙幄幢弊徇得徘徨恂悍惟惶惺愧慢憔憬掌棠沓猾省祖神肖衢袒裨裳裸褐逍阻陷隅隍雀骨骸髓',
  'BBAB': '仲佃侃促倬儡岐岩峙峨嵌嵩嶝巍常幅幡徙悼愕懊曾甑瞥祉蚩衡袖附陟',
  'BBBA': '僧岫岬崔嵋嵬帖帽幌徊微徽憎敞爵皿盆盈睾罪置署罹蜀血褓隙',
  'BBBB': '催恤'})
,
#14_23__sp5
([[1, 4], [2, 3]],
 4,
 {'AAAA': '凄割塞宇完宗室宰害密寇寒寥寨建弦弱忌忘戮朗桑氓汀汁汗江汪汰沁沈沌沐沛沫河沸治沽泄泌泓法泣泥注泯泳洋洌津洪洲流浙浚浣浦浪浸涌涕涯液淀淅淇淋淙淞淡深淳淹添渚渠渡渣渤渥渫港游湖湘湛湮源溟溢溥溯溶溺滂滋滓滴漂漆漏演漕漠漱潭潮潺潼澄澎濂濠濡濯瀚瀛灌燮率羽翌翠翼聿蜜言豁蹇酒',
     #羽言
  'AAAB': '主充冠冶冽凌到剖匡商奉奏契妻妾娑婆守宋宏宕定宣宥宦家宸寄寅富寞寡寮巽帝彗彰意慧斗新旁春染梁毅汐汕汝池汨汲汽汾沂沃沙沮油沼沾沿泊泗泛泡波泰洗洙洛洞洵活洽派浩浮浴海涅消涎涓涵淆淑淘淫淮混渭渺湃湍湟湫溜溪滑滔漫潘澳澹激瀑瓣畜畿秦立站竟章竣童竭端粱翊耕耗耘育至致臻良蠢裟辛辣辨邦部靖音韶魂',
    #立池斗
  'AABA': '交亨享京亭亮六冷凋卒卞吝哀唐塾天夫夷妄字孰宅安官宙宛宜客宴宵容寂寐寓察寤就席平庄庇床序庚庠度庵庶康庸廉廊廓廖弄式必忖忙快怖怡怪怯恃恢恨悌悖悚悛悟悴情惜惰愍慊慌慨慷憎憧憾懦房扇摩效敖敦敲文斌斑替望案武毒毫烹熟熬牢玉王玖玩玲玳珀珂珊珍珞珠珥班球琅理琉琢琥琳琴琵琶瑁瑕瑙瑚瑛瑜瑞瑟瑾璃璋璞疆疝疥疫疲疳疵疸疹疼疽疾痂病症痍痒痔痕痘痛痢痰痴痼瘟瘠瘢瘤癌癖盲碧磨穴究穹空穿突窄窈窒窕窘窟粥紊素纛羸脊膏艮蚤表衰衷襄豪迂退逮遮邃郊郭雪零雷雹需霆震霓霖霜霞霰露霹靡高魔麻麾',
    #六天王
  'AABB': '井亥亦准凝刊刑刻劾匿君咨型壅夜奕姿宿市底店府座庭廛弁弼形怏怜性恂恍恣恤恪恬恰悍悔悸悼惚惟惶惺愉愎愕愧慝慢憔憬懈懊戎戒扁扈扉放於施旅旋旌族旒旗未末次瓷盂示群翩肇肩腐膺衣裔褒遍那郡雇雍鹿麒麝麟',
    #井形
  'ABAA': '事兼冥判券劫勇匏匣匪半卦卷去叛唇善圭坊坑坪垓垠垣埃城域埴培堀堪堰堵塔塘境壕壤壹太奇奈奎奔套奢姜寺封尉屋巧差幸志怠恙惑惠慈慰懿或打扶批扼技抉抒抗抹拂拇拉拌拒拓拔拗拭拮拱拳拷持按振捕捧据捷捺掖掘掠探接控掩措揆描握揶搏搭摘摸摺撒撞撤撰擅擢擦攘救敷更栽款殆殖求熊牟犬瓠甫甬眷矣社祀祠祥祺福禧禳索罕羊羌美羔羚羞羲羹翅翔肆能蜃裁豆豌辰辱迅送逋逑逗通遐',
    #太犬打奇巧
  'ABAB': '列剃剌前剪副功勃卉博厥可吉吏吾咫咸哉哥哲喜嘉地圻址均坎坡坤坦垢埋埠堆堤塑墟奄奠威孝尊居屎展屠州左弟彭恐感戌戍截戴托扮抄把抑投折披抱抵押抽拈拍拐拘拙招括拯拾指挑挫挺挽捉捌捏捐捻授掉排推揄提揖援搜搬播撮操擒攫改攻政整料昶普曹朔束柬歌正死殃殄殉殊殿汞灰烈焉煎煮熹爽猷益磬祁祈祉祖祗祚祝神米粉粒粕粗粘粳粹精糊糖糟糠老考者耆臀臣臧融袁裂誓赤赦赫走赳赴起超越趣迷逆逝速逡逵逼遂道遭遵都酋雄首馨鼓',
    #左地正老功前
  'ABBA': '不丕世丙乾仄克兢共其再初劈勒勘勤匠南厘厚取古右否在基壁夏娶嬖孱尾局屑巫巷弧彬恭想惹懋戊成戚戟戡擘攀故敢散斟斡斫斯昔有朝期木本札朴机朽杆杉李杏材村杓杖杜杞杭杯杰杳杵杷松板枇枉枋析枕林枚枝枯枳枷枸柄柏某柑柔柚柝柩柯柱柳栓栖校株核根格桁桂桃桎桐桓桔桶梅梏梓梗梢梧梭梯械梳梵棉棋棍棒棕棚森棹棺椅植椎椒椰椽椿楔楚楞楠楫楮楷楸楹榕榛榜榧榴榻槁槌槐槽槿樊樗樟模樵樽橄橘橙橡檀檄檎檗欺歪火灼炊炎炒炬炯炳炸烙烽焙焚煌煤煽熄熔熙燃燎燔燕燥燧爆犀璧甘甚癸登百盛直相矗石砂砒砥砧破硅硝硫硬硼碇碌碎碑碗碣磁磅磊磋礁禁翰耳耶耽耿聆聊聘聚胡臂芋芒芙芝芯芳芸芽苔苛苡若苦茂范茅茉茨茫茸荒莎莞莽菁菅菩菱萃萍萱落著葫葬葵蒙蒜蒡蒲蒿蓄蓉蓍蓑蓼蔗蔚蔽蕨薄薪藉藏藕藩藻衫衲衿袂袍袒袖被裕裙裨裸褐褓褥褪褶襁襟西譬蹙辜述避邯郁酉酊酌配酎酢酩酪酬酵酷酸醇醉醋醍醒醯醴醵雨革靴鞋鞍鞠鞫鞭麓',
    #共木仄火
  'ABBB': '刷刺剽募原墓存尿屈履布幕弊彖愿慕敬暮曾栗棘瓢甄甑皆瞥矜票粟而耐艾芍芟芥芬芭花芹苑苒苗苞苟英茄茗茯茱茴茵茶茹荀草荏荷荻莉莪莫菊菌菖菜菰菲菽萄萌萎萸葛葡董葺蒸蓬蔑蔓蔡蔬蕃蕉薇薛薨薯藜藤要覃覆警豕豫逐邪雁雅面',
    #而豕
  'BAAA': '且令余全具冬剿助匙呈味咬咳啼喀喧嗾噫壑奸妨妹姆姨娘娜婉嫁嫉嫡孀孩孺弩影忍念怒急怨悲承敏斐斜旦早旱旺昆昊昧是晏晟晤晨景晴暄暇暑暗暝暴暾曜曦最朕朦果毓炙然瓮目眄眈眠眩眸眺眼睛睡睦睫睹睿瞑瞬瞰瞳瞻瞿祭禽秉繁翁翡肛肝肢肪肱肺胎胚脯腋腑腔腕腰腱腿膀膈膊膜膝膣膨膳臆舍舒蜚衾裴豚途逞逢量金院陪障雎非食鼎',
    #目旦且
  'BAAB': '乳仝兆冀冒冕函制剔努北午叔受合吐吠含呵命哄哮哺唆啄啖喇喊喙嗔嗜嗟嗽嘲嘶嚆墅失奚妓妥始姑娃娠媒嫌嫩嬉孚希帑年幽彩愈愚手拜拿昌明易星映昨昭昴晁晃晦晶智暖暹曙曝曳曷曼朋服朱桀歇灸煦照爰爵牛生甥用甲申盒盟看督矢知矩短矮竺竿笏笑笙笛笞笠符第等筋筌筏筐筑筒答策筮筵箔箕算箝管箭箱箴箸篁篆篇簇簧簪簿籍纂缶缸缺罐翕肋肌股肥肴背胛胞胱胴胸脂脆脾腥腹腺舛舜舞豹豺貂貊貌迭逃逾遇邸鄙采里野阮防陀限雉',
    #手受牛午合命失矢
  'BABA': '串乍乎些企俎先光凸匍匐卓占只叭史吃各同名吟吩吸吼告周呻呼咀咆咎咽品哈哨哭唱唾喝嗣嘴器嚼因圃圄圈坐垂堂墨壬外夙多夭央好如妊妖姐姓姚姻娟娥娼婚媚媛嫦孜常廷彪忠忿思恕恩悉患我掌斧昏柴棠欲止此熏父爻牝牡牧物牲特田由男町界畏畔畛略畦番畸疋疏砦粲紫累絮罔耀肯胃胄胤胥虎虐虔虞虹蚊蚌蚓蚣蛇蛋蛔蛙蛛蛟蛤蛭蛾蜂蜈蜘蝎蝗蝴蝶螂螟螳螺蟠蟾裳谷足趺趾跋跌跏跛距跣跨路跳踊踏踞踵蹂蹄蹈蹉蹊蹴蹶躁躇迪造遣遽邑鄂釉重釜阿陛陵隋隔隘隧雌雕餐骨骸髓黔默黜',
    #父光止
  'BABB': '乖乘介典刈利刮削剩升卵吊吹吻呱和咐唯喉喘嗅嗤困固妙委娩婢嫂孟季孤孵愁憩敞曲梨犁留盆盈眉禾秀私秋科秒秕秘租秤秧秩移稀程稍稔稗稚稠稷稻稼稽稿穆穗穰竹系肖舌逍透陋陌香馥魏黍黎',
    #介禾舌升竹
  'BBAA': '丞仁代伉伊位住依侵信俯俸倍倒偏停健傍傲儒兜卑卿囚回囹射尖岱岷崇嵩帛幢延息斛旨旬旭架段殷泉焦牒狂狡狩狼猜猝瓜疑白的皇皎皓磐肄自臭臼臾舅舟航舫般舵舶舷船艇蟹袈袋角解身躬迎返迦迫追遑邀邂阜阻降除隅隆集鬼魁魃魄魅黛鼠鼻',
    #仁白
  'BBAB': '丘什仕仗付伍伎伏伐休伴伺似佐佑何佛佯佰佳佶使例侍侑供侯便俊俑俟俺倚借倦倨偃假偕做傅僖僚僧僭僻免兵劣勉匈后少岐岩岳岸峙峻崎崖嵌嵯嶝幄幅所收斤斥欣沓炭版牌狄猿獗甸盾省禹肉蚩象近逅逸遁邱邵阡陟雀',
    #少斤
  'BBBA': '仔仟仲件价任伶伸佃但低佚作佩侃侈侏侮促俄俗俚保俳候倡倬倭偈偶儡凰向堡屹岑岫岬峨峰崩嵋巍帆帖帙帽幌幡彷往征待律後徒忽恁愆爪爬狎狙狸猖猛猥猩猾皿罪置署罹蜀行衍街衙阪陂附陶隍隙',
    #行爪皿
  'BBBB': '仙仰伯伽修倪傀催像刎崔嵬役彼徇徊徐得徘徙御徨循微徽悠攸狐狗猊睾血衡衢陷'})
    #仙血-->血仙
    #『仙』繁简非平凡
    #   assert not '仙' in 只读囗平凡繁简囗共享汉字到笔顺码.keys()
    #   现:『血』比『仙』更优先
    #
    #[[1, 4], [2, 3]]#14_23__sp5
    ###deprecated:羽立六井,太左共而,木手父介,仁少行仙
    #羽立六井,太左共而,木手父介,仁少行血
    #   改『仙』为『血』
    #
,
([[1], [2, 3], [4], [5]],
 2,
 {'AA': '三二于云井元刊刑匡匿型天夫奉奏契干弄式彗形慝慧戎戒敖斑春替未末武毒泰熬玉王玖玩玲玳珀珂珊珍珞珠珥班球琅理琉琢琥琳琴琵琶瑁瑕瑙瑚瑛瑜瑞瑟瑾璃璋璞盂碧示秦素纛耕耗耘蠢表迂邦魂',
  'AB': '丁丈下不丕世丙乾事五仄兀克兢共其再列刺剌副剽功劫勃勒勘募勤匏匠匣匪匹十卉南博卦厄厘厚原厥去友取古可右吉吏否吾咸哉哥哲唇喜嘉土在圭地圻址均坊坎坑坡坤坦坪垓垠垢垣埃埋城域埠埴培基堀堆堤堪堰堵塔塘境墓墟壕壤士壹夏大太奄奇奈奎奔套奢威娶存孝寸寺封尤工左巧巫巷布幕幸彬彭志恐恭惑惠想惹感愿慕懋懿戊戌戍成或戚戟戡截戴才打托扮扶批扼技抄抉把抑抒投抗折披抱抵抹押抽拂拇拈拉拌拍拐拒拓拔拗拘拙招括拭拮拯拱拷拾持指按挑挫振挺挽捉捌捏捐捕捧据捷捺捻授掉排掖掘掠探接控推掩措揄揆描提揖握援揶搏搜搬搭摘摸摺撒撞撤播撮撰擅操擒擢擦攀攘攫支攻政故救散敬整敷斟斡斫斯昔暮更曹有朝期木本札朴机朽杆杉李杏材村杓杖杜杞束杭杯杰杳杵杷松板枇枉枋析枕林枚枝枯枳枷枸柄柏某柑柚柝柩柬柯柱柳栓栖栗校株核根格栽桁桂桃桎桐桓桔桶梅梏梓梗梢梧梭梯械梳梵棉棋棍棒棕棘棚森棹棺椅植椎椒椰椽椿楔楚楞楠楫楮楷楸楹榕榛榜榧榴榻槁槌槐槽槿樊樗樟模樵樽橄橘橙橡檀檄檎欺款歌正歪死殃殄殆殉殊殖求汞灰烈焉焚煮熙熹燕爽犬瓠瓢甄甘甚甫百盛直相矗石砂砒砥砧破硅硝硫硬硼碇碌碎碑碗碣磁磅磊磋磬礁票禁粟索翅翰老考者耆而耐耳耶耽耿聆聊聘聚肆胡臣臧艾芋芍芒芙芝芟芥芬芭芯花芳芸芹芽苑苒苔苗苛苞苟苡若苦英茂范茄茅茉茗茨茫茯茱茴茵茶茸茹荀草荏荒荷荻莉莎莞莪莫莽菁菅菊菌菖菜菩菰菱菲菽萃萄萌萍萎萱萸落著葛葡董葫葬葵葺蒙蒜蒡蒲蒸蒿蓄蓉蓍蓑蓬蓼蔑蔓蔗蔚蔡蔬蔽蕃蕉蕨薄薇薛薨薪薯藉藏藕藜藤藩藻蜃融袁裁裂西要覃覆誓警豆豌豕赤赦赫走赳赴起超越趣蹙辜辰辱述逋逐逑逗逝速逵逼遭邯郁都酉酊酌配酎酢酩酪酬酵酷酸醇醉醋醍醒醯醴醵雁雄雨面革靴鞋鞍鞠鞫鞭馨麓鼓',
  'AC': '平雪零雷雹需霆震霓霖霜霞霰露霹',
  'AD': '七万互切到夷妻屯巨戈比牙瓦皆至致臻邪雅',
  'BA': '上乍乖乘乞些先冀凸利刮制剩北千升午卓占叔告和垂壑壬夭失委季年廷彪悲愁憩我手拜敏斐智朱柴梨止此毓毛熏牛牝牡牧物牲特犁生甥看督睿矢知矩短矮砦禾秀私秉秋科秒秕秘租秤秧秩移稀程稍稔稗稚稠稷稻稼稽稿穆穗穰竹竺竿笏笑笙笛笞笠符第等筋筌筏筐筑筒答策筮筵箔箕算箝管箭箱箴箸篁篆篇簇簧簪簿籍粲紫繁纂缶缸缺罐翡肯背舌舞虎虐虔虞蜚裴迭透造遽重雉雌非餐香馥魏黍黎',
  'BB': '丘什仁仇仍仔仕他仗付仙仟代仰仲件价任伉伊伍伎伏伐休伯伴伶伸伺似伽佃但位低住佐佑何佚佛作佩佯佰佳佶使侃侈例侍侏侑供依侮侯侵便促俄俊俑俗俚保俟信修俯俳俸俺倍倒候倚借倡倦倨倪倬倭偃假偈偏偕做停健偶傀傅傍催傲像僖僚僧僭僻儒儡兜兵劣化卑反后向堡射小少尖岱岳川帛延彷役彼往征待徇徊律後徐徒得徘徙御徨循微徽恁息悠愆所攸斤斥欣段殷泉焦爪爬片版牌牒瓜白的皇皎皓盾省睾磐禹自臭臼臾舅舟航舫般舵舶舷船艇血行衍街衙衡衢袋身躬近返迫追逅遁遑邀邱阜雀集鬼魁魃魄魅黛鼠鼻',
  'BC': '乎乏乳人今介仝令企余俎兆光入全八公兮凶分刈削卜受合含命坐堂奚妥孚希常彩念忿悉愈拿掌敞斜斧棠欲爰爵父爻瓮番盆盒禽翁翕耀肖肴舍舒舜衾裳谷豹豺貂貊貌逃逍途逾采釉金釜食',
  'BD': '且中串丸丹久九兄免具典冒冕冬凡凰凹刎剔助勉勺勾勿包匈匍匐匕匙卯印危卵卿及口句叩只叫叭叱史吃各吊同名吐吟吠吩吸吹吻吼呈周呱味呵呻呼咀咆咎咐咬咳咽品哄哈哨哭哮哺唆唯唱唾啄啖啼喀喇喉喊喘喙喝喧嗅嗔嗜嗟嗣嗤嗽嗾嘲嘴嘶器噫嚆嚼囚四回因困囹固圃圄圈墅墨夕外夙多央孵山屹岐岑岩岫岬岷岸峙峨峰峻崇崎崔崖崩嵋嵌嵩嵬嵯嶝巍巾帆帖帙帽幄幅幌幡幢幽影忠忽思急怨恩患愚斛日旦旨早旬旭旱旺昆昊昌明昏易星映昧昨昭是昴晁晃晏晟晤晦晨景晴晶暄暇暑暖暗暝暴暹暾曙曜曝曦曰曲曳曷曼最月朋服朕朦果桀欠歇氏水沓灸炙炭然煦照犯狂狄狎狐狗狙狡狩狸狼猊猖猛猜猝猥猩猾猿獗用田由甲申男甸町界畏畔留畛略畦畸疑皿盟目眄眈眠眩眸眺眼睛睡睦睫睹瞑瞬瞰瞳瞻瞿祭系累罔罪置署罹肄肉肋肌肛肝股肢肥肪肱肺胃胄胎胚胛胞胤胱胴胸脂脆脯脾腋腑腔腕腥腰腱腹腺腿膀膈膊膜膝膣膨膳臆舛色虹蚊蚌蚓蚣蛇蛔蛙蛛蛟蛤蛭蛾蜀蜂蜈蜘蝎蝗蝴蝶螂螟螳螺蟠蟹蟾角解豚象足趺趾跋跌跏跛距跣跨路跳踊踏踞踵蹂蹄蹈蹉蹊蹴蹶躁躇迎迪逞逢逸遇遣邂邑邸鄂鄙里野量雎雕骨骸髓黔默黜鼎',
  'CA': '主亡亢交亥亦亨享京亭亮充六冶冷冽凄准凋凌凝刻剖劾卒卞吝咨哀唐商塾壅夜奕妄妾姿孰就市帝席庄庇床序底店庚府庠度座庭庵庶康庸廉廊廓廖廛彰忘恣意摩放效敦敲文斌新方於施旁旅旋旌族旒旗望次毅毫氓烹熟燮玄率瓣瓷畜疝疥疫疲疳疵疸疹疼疽疾痂病症痍痒痔痕痘痛痢痰痴痼瘟瘠瘢瘤癌癖盲磨立站竟章竣童竭端紊羸翊育脊腐膏膺衣衰衷裔褒襄言豪辛辣辨遮郊部郭雍靖靡音韶高魔鹿麒麝麟麻麾',
  'CB': '兼判券剃前剪半卷叛善塑奠姜尊州差弊弟恙慈拳料普曾朔火灼炊炎炒炬炯炳炸烙烽焙煌煎煤煽熄熔燃燎燔燥燧爆猷甑益眷瞥米粉粒粕粗粘粳粹精糊糖糟糠羊羌美羔羚羞羲羹翔迷送逆遂道遵酋首',
  'CC': '割塞娑婆字宅宇守安宋完宏宕宗官宙定宛宜客宣室宥宦宰害宴宵家宸容宿寂寄寅密寇富寐寒寓寞察寡寤寥寨寮忖忙快怏怖怜怡性怪怯恂恃恍恢恤恨恪恬恰悌悍悔悖悚悛悟悴悸悼情惚惜惟惰惶惺愉愎愕愧慊慌慢慨慷憎憔憧憬憾懈懊懦斗染案梁汀汁汐汕汗汝江池汨汪汰汲汽汾沁沂沃沈沌沐沙沛沫沮河沸油治沼沽沾沿泄泊泌泓法泗泛泡波泣泥注泯泳洋洌洗洙洛洞津洪洲洵活洽派流浙浚浣浦浩浪浮浴海浸涅消涌涎涓涕涯液涵淀淅淆淇淋淑淘淙淞淡淫淮深淳混淹添渚渠渡渣渤渥渫渭港游渺湃湍湖湘湛湟湫湮源溜溟溢溥溪溯溶溺滂滋滑滓滔滴漂漆漏演漕漠漫漱潘潭潮潺潼澄澎澳澹激濂濠濡濯瀑瀚瀛灌牢穴究穹空穿突窄窈窒窕窘窟粱蜜裟豁蹇邃酒',
  'CD': '之冗冠冥初心必房扁扇扈扉昶朗永社祀祁祈祉祖祗祚祝神祠祥祺福禧禳罕翩肇肩良衫衲衿袂袍袒袖被裕裙裨裸褐褓褥褪褶襁襟遍雇',
  'DA': '刷劈司君咫壁嬖孱尉尸尹尺尻尼尾尿局居屈屋屎屑展屠履己已巳巽建弓引弗弘弛弦弧弱弼忌愍慰擘改敢檗殿民犀璧疆粥群聿臀臂艮譬迅退逮遐避那郡',
  'DB': '丑丞乃也了出函刀刃力加努召女奴奸好如妃妊妓妖妙妨妹姆始姐姑姓姚姨姻娃娘娜娟娠娥娩娼婉婚婢媒媚媛嫁嫂嫉嫌嫡嫦嫩嬉孀子孑孔孕孜孟孤孩孺巴帑弩忍怒恕承收架疋疏皮盈眉絮胥蚩蛋袈迦邵阡阪阮防阻阿陀陂附陋陌降限陛陟院除陪陵陶陷隅隆隋隍隔隘隙障隧',
  'DC': '予以允勇又叉台弁怠戮柔桑熊牟甬癸登矛矜矣羽翌翠翼能蚤豫通逡',
  'DD': '剿巡幻幼彖毋母畿'})
,
([[1], [2], [3], [4]],
 2,
 {'AA': '三二于云互井元刊刑匡匿君型天夫夷奉奏契妻尹巨巽干建弄式弼彗形愍慝慧戎戒敖斑春替未末武毒民泰熬玉王玖玩玲玳珀珂珊珍珞珠珥班球琅理琉琢琥琳琴琵琶瑁瑕瑙瑚瑛瑜瑞瑟瑾璃璋璞疆盂碧示秦素纛群耕耗耘聿艮蠢表迂退逮那邦郡魂',
     #二
  'AB': '丁下世丙乾事五克兢共其再刺剌副剽功劫勃勒勘募勤匣匪十卉南博卦去取古可司吉吏吾哉哥哲喜嘉土圭地圻址均坊坎坑坡坤坦坪垓垠垢垣埃埋城域埠埴培基堀堆堤堪堰堵塔塘境墓墟壕壤士壹娶孝寸寺封屯工巧巫巷幕幸引弛彬彭志恐恭惑惠想惹慕懋懿或戟戡截戴才打托扮扶批扼技抄抉把抑抒投抗折披抱抵抹押抽拂拇拈拉拌拍拐拒拓拔拗拘拙招括拭拮拯拱拷拾持指按挑挫振挺挽捉捌捏捐捕捧据捷捺捻授掉排掖掘掠探接控推掩措揄揆描提揖握援揶搏搜搬搭摘摸摺撒撞撤播撮撰擅操擒擢擦攀攘攫支攻政故救敢散敬整敷斟斡斯昔暮更曹朝期木本札朴机朽杆杉李杏材村杓杖杜杞束杭杯杰杳杵杷松板枇枉枋析枕林枚枝枯枳枷枸柄柏某柑柚柝柩柬柯柱柳栓栖栗校株核根格栽桁桂桃桎桐桓桔桶梅梏梓梗梢梧梭梯械梳梵棉棋棍棒棕棘棚森棹棺椅植椎椒椰椽椿楔楚楞楠楫楮楷楸楹榕榛榜榧榴榻槁槌槐槽槿樊樗樟模樵樽橄橘橙橡檀檄檎欺款歌正求汞焉焚煮熙熹燕牙瓢甄甘甚甫直相矗磬票禁粟索翅翰老考者耆耳耶耽耿聆聊聘聚肆胡臣艾芋芍芒芙芝芟芥芬芭芯花芳芸芹芽苑苒苔苗苛苞苟苡若苦英茂范茄茅茉茗茨茫茯茱茴茵茶茸茹荀草荏荒荷荻莉莎莞莪莫莽菁菅菊菌菖菜菩菰菱菲菽萃萄萌萍萎萱萸落著葛葡董葫葬葵葺蒙蒜蒡蒲蒸蒿蓄蓉蓍蓑蓬蓼蔑蔓蔗蔚蔡蔬蔽蕃蕉蕨薄薇薛薨薪薯藉藏藕藜藤藩藻融袁裁西要覃覆誓警豆豌赤赦赫走赳赴起超越趣辜迅述逋逑逗逝速逵逼遐遭邪邯都酉酊酌配酎酢酩酪酬酵酷酸醇醉醋醍醒醯醴醵雅雨革靴鞋鞍鞠鞫鞭馨麓鼓',
     #丁
  'AC': '万丈不丕仄兀切列刷劈匏匠匹厄厘厚原厥友右否咫咸唇在壁夏大太奄奇奈奎奔套奢威嬖存孱尉尤尸尺尻尼尾尿局居屈屋屎屑展屠履左布弗弧彖感愿慰戈戊戌戍成戚擘改斫有檗歪死殃殄殆殉殊殖殿比灰烈爽犀犬璧瓠百皆盛石砂砒砥砧破硅硝硫硬硼碇碌碎碑碗碣磁磅磊磋礁而耐臀臂臧蜃裂譬豕蹙辰辱逐避郁雁雄面',
     #大
  'AD': '到平弘弦弱忌瓦粥至致臻雪零雷雹需霆震霓霖霜霞霰露霹',
    #至平瓦
  'BA': '上丑且中串些兄具典冀冒冕凸剔剿助北匙卓占叔口叩只叫叭叱史吃吊同吐吟吠吩吸吹吻吼呈呱味呵呻呼咀咆咐咬咳咽品哄哈哨哭哮哺唆唯唱唾啄啖啼喀喇喉喊喘喙喝喧嗅嗔嗜嗟嗣嗤嗽嗾嘲嘴嘶器噫嚆嚼因困固圃圄墅壑央子孑孔孜孟孤孩孺巴彪影忠思恩患悲愚承斐日旦早旱旺昆昊昌明易星映昧昨昭是昴晁晃晏晟晤晦晨景晴晶暄暇暑暖暗暝暴暹暾曙曜曝曦曰曲曳曷曼最果柴歇止此煦照田由甲申男町界畏畔畛略畦畸疋疏盟目眄眈眉眠眩眸眺眼睛睡督睦睫睹睿瞑瞬瞰瞳瞻瞿砦粲紫累翡肯胃胄背胥虎虐虔虞虹蚊蚌蚓蚣蛇蛋蛔蛙蛛蛟蛤蛭蛾蜂蜈蜘蜚蝎蝗蝴蝶螂螟螳螺蟠蟾裴足趺趾跋跌跏跛距跣跨路跳踊踏踞踵蹂蹄蹈蹉蹊蹴蹶躁躇迪逞遇遣遽邑鄂鄙里野量阮阿陋陌限陛陵隋隔雌雎非餐鼎',
    #口上
  'BB': '凹出回山屹岐岑岩岫岬岷岸峙峨峰峻崇崎崔崖崩嵋嵌嵩嵬嵯嶝巍巾帆帖帙帽幄幅幌幡幢炭皿罪置署罹蚩蜀阻陟隅隙',
    #山
  'BC': '丞劣囚四囹小少尖收水沓省肉阡阪陂附降除陶陷隆隍雀',
    #小
  'BD': '光函削卜圈堂墨常幽掌敞棠罔耀肖裳逍防陀院陪隘障隧骨骸髓黔默黜',
    #卜光-->光卜
    #『卜』繁简非平凡
    #   assert not '卜' in 只读囗平凡繁简囗共享汉字到笔顺码.keys()
    #   现:『光』比『卜』更优先
    #
  'CA': '乍乖乘乞先利刮制剩努包匍匐千升午印危告周和垂壬夙夭失女奴奸好如妃妊妓妖妙妨妹姆始姐姑姓委姚姨姻娃娘娜娟娠娥娩娼婉婚婢媒媚媛嫁嫂嫉嫌嫡嫦嫩嬉孀季帑年廷弩怒急恕愁憩我手拜敏昏智月朋服朕朦朱梨毋毓毛氏熏牛牝牡牧物牲特犁生甥用看矢知矩短矮禾秀私秉秋科秒秕秘租秤秧秩移稀程稍稔稗稚稠稷稻稼稽稿穆穗穰竹竺竿笏笑笙笛笞笠符第等筋筌筏筐筑筒答策筮筵箔箕算箝管箭箱箴箸篁篆篇簇簧簪簿籍絮繁纂缶缸缺罐肋肌肛肝股肢肥肪肱肺胎胚胛胞胱胴胸脂脆脯脾腋腑腔腕腥腰腱腹腺腿膀膈膊膜膝膣膨膳臆舌舞豚迭透造邸重雉雕香馥魏黍黎',
    #乞千牛
  'CB': '丘什仁仇仍仔仕他仗付仙仟代仰仲件价任伉伊伍伎伏伐休伯伴伶伸伺似伽佃但位低住佐佑何佚佛作佩佯佰佳佶使侃侈例侍侏侑供依侮侯侵便促俄俊俑俗俚保俟信修俯俳俸俺倍倒候倚借倡倦倨倪倬倭偃假偈偏偕做停健偶傀傅傍催傲像僖僚僧僭僻儒儡免兜兵加勉化卑句召向堡孕射岱岳川帛延恁息悠攸旨旬旭架段泉焦片版牌牒甸白的皇皎皓皮睾禹自臭臼臾舅色血袈袋象身躬迎迦迫追逸遑邀邱邵阜集鬼魁魃魄魅黛鼠鼻',
    #川化白
  'CC': '凰刎勿匈卯卿反后彷役彼往征待徇徊律後徐徒得徘徙御徨循微徽忽愆所斛斤斥欠欣殷爪爬犯狂狄狎狐狗狙狡狩狸狼猊猖猛猜猝猥猩猾猿獗瓜疑盾磐肄舟航舫般舵舶舷船艇蟹行衍街衙衡衢角解近返逅遁邂',
    #反
  'CD': '丸丹久乎乏乳人今介仝令企余俎兆入全八公兮冬凡凶刃分刈勺勾卵及受各合名含命咎坐夕外多奚妥孚孵希彩忍念忿怨悉愈拿斜斧桀欲灸炙然爰爵父爻瓮留番盆盈盒祭禽系翁翕肴胤舍舒舛舜衾谷豹豺貂貊貌逃途逢逾采釉金釜食',
    #人八
  'DA': '主亡亢交亥亦亨享京亭亮充六冠冶冷冽凄准凋凌凝刻剖劾卒卞吝咨哀唐商塾壅夜奕妄妾姿孰就市帝席庄庇床序底店庚府庠度座庭庵庶康庸廉廊廓廖廛弁彰忘恣意戮房扁扇扈扉摩放效敦敲文斌新方於施旁旅旋旌族旒旗朗望次毅母毫氓烹熟燮玄率瓣瓷畜疝疥疫疲疳疵疸疹疼疽疾痂病症痍痒痔痕痘痛痢痰痴痼瘟瘠瘢瘤癌癖盲磨立站竟章竣童竭端紊羸羽翊翌翠翩翼肇肩育脊腐膏膺良衣衰衷裔褒襄言豪辛辣辨遍遮郊部郭雇雍靖靡音韶高魔鹿麒麝麟麻麾',
    #亡
  'DB': '予冥初勇台怠柔熊甬矛矜社祀祁祈祉祖祗祚祝神祠祥祺福禧禳能衫衲衿袂袍袒袖被裕裙裨裸褐褓褥褪褶襁襟豫通',
    #祖
  'DC': '以允兼冗判券剃前剪半卷叛善塑奠姜尊州差幼弊弟恙慈拳料昶普曾朔永火灼炊炎炒炬炯炳炸烙烽焙煌煎煤煽熄熔燃燎燔燥燧爆牟猷甑癸登益眷瞥矣米粉粒粕粗粘粳粹精糊糖糟糠罕羊羌美羔羚羞羲羹翔迷送逆逡遂道遵酋首',
    #羊火
  'DD': '之割叉塞娑婆字宅宇守安宋完宏宕宗官宙定宛宜客宣室宥宦宰害宴宵家宸容宿寂寄寅密寇富寐寒寓寞察寡寤寥寨寮巡心必忖忙快怏怖怜怡性怪怯恂恃恍恢恤恨恪恬恰悌悍悔悖悚悛悟悴悸悼情惚惜惟惰惶惺愉愎愕愧慊慌慢慨慷憎憔憧憬憾懈懊懦斗染案桑梁汀汁汐汕汗汝江池汨汪汰汲汽汾沁沂沃沈沌沐沙沛沫沮河沸油治沼沽沾沿泄泊泌泓法泗泛泡波泣泥注泯泳洋洌洗洙洛洞津洪洲洵活洽派流浙浚浣浦浩浪浮浴海浸涅消涌涎涓涕涯液涵淀淅淆淇淋淑淘淙淞淡淫淮深淳混淹添渚渠渡渣渤渥渫渭港游渺湃湍湖湘湛湟湫湮源溜溟溢溥溪溯溶溺滂滋滑滓滔滴漂漆漏演漕漠漫漱潘潭潮潺潼澄澎澳澹激濂濠濡濯瀑瀚瀛灌牢畿穴究穹空穿突窄窈窒窕窘窟粱蚤蜜裟豁蹇邃酒'})
    #之叉江
    ###deprecated:[[1], [2], [3], [4]]#1_2_3_4__sp5
    ###deprecated:原1234次序: 二丁大至,口山小卜,乞川反人,亡祖羊之
    #[[1], [3], [4], [2]]#1_3_4_2__sp5
    #   调整次序，是因为 横『00』0，撇『左低右高』象征『01』1，捺『左高右低』象征『10』2，竖『11』3
    #
    #   注意:代表字的选择，应与14_23__sp5无交集！
    ###deprecated:改1342次序: 二大至丁,乞反人川,亡羊之祖,口小卜山
    #改1342次序: 二大至丁,乞反人川,亡羊之祖,口小光山
    #   改『卜』为『光』
,
]
笔画类分组囗前几笔囗前几笔笔顺大类码到汉字串囗囗摘选列表囗四比特八比特版 = 笔画类分组囗前几笔囗前几笔笔顺大类码到汉字串囗囗摘选列表
r'''奇怪，当下面的标识名改为上面的标识名，就会报错:

$ py script/repr_binary_by_hz_stroke_kind.py
  File "script/repr_binary_by_hz_stroke_kind.py", line 575
SyntaxError: Non-UTF-8 code starting with '\xe6' in file script/repr_binary_by_hz_stroke_kind.py on line 575, but no encoding declared; see http://python.org/dev/peps/pep-0263/ for details
#'''




























#[[1, 4], [2, 3]]#14_23__sp5
#羽立六井,太左共而,木手父介,仁少行血
stroke_kind_groups____14_23__sp5 = ((1,4), (2,3))
按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字 = '羽立六井太左共而木手父介仁少行血'
_16hzs___14_23__sp5 = frozenset(按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字)

#[[1], [3], [4], [2]]#1_3_4_2__sp5
#改1342次序: 二大至丁,乞反人川,亡羊之祖,口小光山
stroke_kind_groups____1_3_4_2__sp5 = ((1,), (3,), (4,), (2,),)
按横为零零撇为零一捺为一零竖为一一忽略折笔记为二进制数时前两笔的十六个代表字 = '二大至丁乞反人川亡羊之祖口小光山'
_16hzs___1_3_4_2__sp5 = frozenset(按横为零零撇为零一捺为一零竖为一一忽略折笔记为二进制数时前两笔的十六个代表字)


def _test_universal__4bit_8bit():
    #『仙』繁简非平凡
    from nn_ns.CJK.cjk_subsets.共享汉字集笔顺码 import 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码
    assert not '仙' in 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys()

    assert '血' in 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys()


    assert not (_16hzs___1_3_4_2__sp5 & _16hzs___14_23__sp5)
    assert len(_16hzs___1_3_4_2__sp5) == 16
    assert len(_16hzs___14_23__sp5) == 16

    #print(_16hzs___14_23__sp5 - 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys())
    #   仙
    assert _16hzs___14_23__sp5 <= 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys()

    #print(_16hzs___1_3_4_2__sp5 - 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys())
    #   卜
    assert _16hzs___1_3_4_2__sp5 <= 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys()


    from nn_ns.CJK.cjk_subsets.共享汉字集笔顺码 import 只读囗共享汉字到笔顺码, 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码, 只读囗初步缩减囗共享汉字到笔顺码, 只读囗平凡繁简囗共享汉字到笔顺码
    assert '仙' in 只读囗共享汉字到笔顺码.keys()
    assert '仙' in 只读囗初步缩减囗共享汉字到笔顺码.keys()
    assert not '仙' in 只读囗平凡繁简囗共享汉字到笔顺码.keys()
    assert not '仙' in 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys()

    assert '卜' in 只读囗共享汉字到笔顺码.keys()
    assert '卜' in 只读囗初步缩减囗共享汉字到笔顺码.keys()
    assert not '卜' in 只读囗平凡繁简囗共享汉字到笔顺码.keys()
    assert not '卜' in 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys()
if __name__ == "__main__":
    _test_universal__4bit_8bit()

def _():
    from nn_ns.CJK.cjk_subsets.共享汉字集笔顺码 import 只读囗共享汉字到笔顺码, 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码, 只读囗初步缩减囗共享汉字到笔顺码, 只读囗平凡繁简囗共享汉字到笔顺码
    from seed.mapping_tools.dict_op import subset_keys__immutable
    from nn_ns.CJK.cjk_subsets.hanzi import 平凡繁简囗初步缩减囗共享汉字字集, 初步缩减囗共享汉字字集, 平凡繁简囗共享汉字字集
    from nn_ns.CJK.cjk_subsets.hanzi import hz_sp_str2hz_set
    from seed.tiny import MapView

    def _tmp__subset_hz2xxx(hz_sp_str, /):
        return MapView(subset_keys__immutable(只读囗共享汉字到笔顺码, hz_sp_str2hz_set(hz_sp_str)))

def _search__6bit_7bit():
    argss__6bit_7bit = [
        (groups_list__1bit__90, [6, 7])
        ,(groups_list__2bit__15, [3])
        ]

    search_all_possible(verbose=False, argss=argss__6bit_7bit)
if 0:
    _search__6bit_7bit()
if 0:
    search_all_possible(verbose=True, argss=[
    ([[[1], [3, 4, 5]]
    , [[1, 2], [3, 4]]
    , [[1, 4], [2, 3]]
    , [[1, 5], [2, 3, 4]]], [6]
    )
    ,([[[2, 5], [3, 4]]], [7]
    )
    ,([[[1], [3], [4], [5]]], [3]
    )
    ])
r'''[[[see also:_search__4bit_8bit
_search__6bit_7bit()
    三笔方案只有：
        ([[1], [3], [4], [5]], 3)
    六笔方案摘选:
        ([[1], [3, 4, 5]], 6)
        ([[1, 2], [3, 4]], 6)
        ([[1, 4], [2, 3]], 6)
        ([[1, 5], [2, 3, 4]], 6)
    七笔方案摘选:
        ([[2, 5], [3, 4]], 7)
====
([[1], [2, 5]], 6)
([[1], [3, 4]], 6)
([[1], [3, 4, 5]], 6)
([[1], [3, 5]], 6)
([[1], [3, 5]], 7)
([[1], [4, 5]], 6)
([[1], [4, 5]], 7)
([[1, 2], [3, 4]], 6)
([[1, 2], [3, 4, 5]], 6)
([[1, 2], [3, 5]], 6)
([[1, 2, 3], [4, 5]], 6)
([[1, 2, 5], [3, 4]], 6)
([[1, 3], [2, 5]], 6)
([[1, 3], [4, 5]], 6)
([[1, 4], [2, 3]], 6)
([[1, 4], [3, 5]], 6)
([[1, 5], [2, 3, 4]], 6)
([[1, 5], [3, 4]], 6)
([[2, 3], [4, 5]], 6)
([[2, 4], [3, 5]], 6)
([[2, 5], [3, 4]], 6)
([[2, 5], [3, 4]], 7)
([[2, 5], [4]], 6)
([[1], [3], [4], [5]], 3)

#]]]'''




r'''[[[
search_all_possible(verbose=True, argss=[
    ([[[1], [3, 4, 5]]
    , [[1, 2], [3, 4]]
    , [[1, 4], [2, 3]]
    , [[1, 5], [2, 3, 4]]], [6]
    )
    ,([[[2, 5], [3, 4]]], [7]
    )
    ,([[[1], [3], [4], [5]]], [3]
    )
    ])

=====输出 见下面『笔画类分组囗前几笔囗前几笔笔顺大类码到汉字串囗囗摘选列表囗六比特七比特版』
#]]]'''
笔画类分组囗前几笔囗前几笔笔顺大类码到汉字串囗囗摘选列表囗六比特七比特版 = \
[
([[1], [3, 4, 5]],
 6,
 {'AAAAAA': '匪堪彗悲慧排揶斐珥琴琵琶瑟翡菲蜚裴非',
  'AAAAAB': '封拭持捧玩瑾',
  'AAAABA': '拮拷措撒珂球瑚瑛聘菁',
  'AAAABB': '其勘取基堵娶戡扶抹拱斟斯期某欺款武焉琢琥琳甚耽耿聆聊聚肆藉藕',
  'AAABAA': '垣域埴堰振捕捷掉描搏摸珠理瑁瑕',
  'AAABAB': '拒政斑玳琉瑞璃璋',
  'AAABBA': '匿坪塔墟奉奏契慝拓捺搭珀班琅瑜璞碧耕耘著蒜越趣',
  'AAABBB': '城批扼拔掩敖春栽毒泰熬玖玲珊珍珞瑙秦素纛耗菱菽蓍蠢表赳赴起超',
  'AABAAA': '勤坦埋堤戴捏提揖撮攫燕鞋',
  'AABAAB': '勒博垠挺捉散靴鞍鞠鞫鞭',
  'AABABA': '壕壤括捐据掠握搜操攘',
  'AABABB': '哉喜嘉坊坑垓培堀塘境彭抉抗拂拉拐捌掖掘接摘撞撤撰擅攻熹磬葫袁裁馨鼓',
  'AABBAA': '些堆幸截拌拍推替煮者逵都',
  'AABBAB': '哲垢埠壹惹懿抵拾挑揄摺擢柴砦藏誓逝',
  'AABBBA': '冀均埃巷抱拇拘招指挽播擒背莽蕨赫',
  'AABBBB': '劫叔坎坡形志恐恭戎戒扮投披拗拯按挫捻授探控揆援搬擦督紫耆茂葬赦雌魂',
  'ABAAAA': '戟甄直矗葺',
  'ABAAAB': '乾剽募墓幕惠慕斡暮朝瓢票翰莫薯',
  'ABAABA': '哥曹歌菖蔓蔬遭',
  'ABAABB': '唇妻惑或戚敷更栗茱莪萌葛蔑蜃蹙辰辱逋',
  'ABABAA': '事副萸董蓑蔗蔚覃逼',
  'ABABAB': '咸感故蒿辜',
  'ABABBA': '兢威熙粟胡茵菩薨薪要豆豌逗',
  'ABABBB': '夷戌救整求茨茯荒菰萃萎蒡蓄藜融覆逑速',
  'ABBAAA': '厘夏奎套枉柑桂棋棒椰椿楔榛榧歪硅臻蕉面',
  'ABBAAB': '匏厚奈奔奢桔械椒楮槿瓠砒砧硬磊致萍蒙蒲薄藤郁',
  'ABBABA': '奇枯柯桓梗梧棹植槽模硫碌碎碣磅臧茫茹葡薛藻虐遽',
  'ABBABB': '壑彪彬斫杖杯枇林枝柄柩栖桎梵森椅楚楠楷樗焚睿砂砥破硝硼碇碑碗磁磋礁禁范茶莎菌落蓼藩虎虔虞麓',
  'ABBBAA': '南原奄想愿杳杵柚柱株根梏棍楫榻橄相荀莞萄蓬酉酊酌配酎酢酩酪酬酵酷酸醇醉醋醍醒醯醴醵',
  'ABBBAB': '勃厥敬杞杭杷枋枚枳柬校核桐梅梓梳棘楞楸榜槁樟檀殖苞萱蕃薇警',
  'ABBBBA': '巫析柏柝栓桁桃棉棚椎椽槌槐樵樽檄殃殊翅茗菅菊菜蒸裂雁雅',
  'ABBBBB': '懋戍成攀杉杓杰松板枕枷枸柳格桶梢梭梯棕棺楹榕榴樊橘橙橡檎死殄殆殉灰烈爽皆盛粲索苑荻葵蓉蔡蔽豕述逐雄雨雪零雷雹需霆震霓霖霜霞霰露霹餐',
  'BAAAAA': '俳嘶旺晴最特畦睛睦睹罪趺趾躇',
  'BAAAAB': '具匙墅建敢昊昧是暑暴眄睫跋距跨蹶逞野',
  'BAAABA': '晤晨燮甥眠眩眼睡瞰瞳瞿言跌跣踞踵蹄蹴躁遐量鼎',
  'BAAABB': '乖乘俸傲凌剩助味哄哮嗜嘴嵌承昆晟果段畏畸眈眸眺瞑瞬瞻署舞跏跛路跳踊踏蹂蹈蹉蹊雎',
  'BAABAA': '借冒凄哺嗔嘲拜昌星昨晶暇曙曝牲缸置胃胄虹蚌蛙蝶',
  'BAABAB': '僖喇喊嗽嚆影愚映晦景暗暾曼牧疏罐蛭蝴造逮遇遣',
  'BAABBA': '君明晁晃暹曜曦畔盟看矩短缺群蚊蚓蛛蛟蛾蜈蜘蝎螺郡鄙',
  'BAABBB': '冕冽剔吠啄孺思我易昭昴晏智暄暖暝曷歇煦照物界畛略知矮累艮蚣蛇蛔蛤蜂蝗螂螟螳蟠蟾迪迭退陵雉',
  'BABAAA': '倬咀唾崖疆鄂重',
  'BABAAB': '便偃傅哭唱喝器圃尉展屠席度庶慰殿牒秉臀臾舅蚩衰遮隋鼠',
  'BABABA': '享做品嗣嗤圄塾孰居幅店敦熟襄郭',
  'BABABB': '京亭亮使咬咳咽哀啼喘嗾噫孜孩就屋庇床庵弼患愍憩摩敲毫烹磨膏衷豪隔靡高魔麻麾',
  'BABBAA': '佰侑倒准凋唐唯嗅嗟尾庚庭康庸廛斌新瓣疳疵病症痍痔痘盲眉站褒辛辣辨陌靖鹿麒麝麟',
  'BABBAB': '倚剖劈哈喉喙壁妾嬖孱崎巽府廓弦弱彰恩意擘改梨檗毅氓犀璧疝疥疫疲疸疹疼疽疾痂痒痕痛痢痰痴痼瘟瘠瘢瘤癌癖秕秤稽穗竟章竣童竭端竺竿笏笑笙笛笞笠符第等筋筌筏筐筑筒答策筮筵箔箕算箝管箭箱箴箸篁篆篇簇簧簪簿籍纂羸翊腐臂譬避部音韶',
  'BABBBA': '俺僭冶凝吝呼咆和咫哨喧奕妄季局屎底庠廉廊廖放敏施旅旋旌族旒旗望毓熏牌犁租秧秩程稷稿穰粥繁育胥蛋蜀袋陛香馥',
  'BABBBB': '交亥偕僚儒充冷刻劾卒吟吩吹吻呱咨唆商啖喀嚼壅夜委姿孤尿屑履帝序座弧忌忘忠恣愁效於旁次炭版率瓷畜秀私秋科秒秘移稀稍稔稗稚稠稻稼穆紊罹脊膺衣裔透郊陋雍魏黍黎黛',
  'BBAAAA': '俚健娃媒徘汪淇湛焦皇美肛肝膨臭街遑集',
  'BBAAAB': '信假善妹姜嬉射差待徒徙恃恙息情朦沫泄法洪浙淑添渚渫港澎睾羌羔羚羞羲羹翔肢肱肺胚脯腰膈膊膜膝豚身躬鼻',
  'BBAABA': '倡偶儡卑周姑姨娠嫩帽惜河沽沾浦涯渠湖湮溥漂漕漠漱潭潮瀚灌皎皓肥肪胛胴腋腑腥腱腹腿膀臆舍舒邀隅雕',
  'BBAABB': '余佚侏侵促俄保偈兜冠券卷叛堡妓孀峨帙幌怯恁拳斜朋服朕朗汰沌沐泉洌淅淋淞淹渣渤湘源漆濡的眷肋肌股胎胞胱胸脂脆脾腔腕腺膣膳良迫送途酒金限鬼魁魃魄魅',
  'BBABAA': '侯候倪兼前剪匍妊姐姓娜娥娼悼惰愈扉汨汽沮油注洗洙津浩浸涅混渭渺湃漫瀑煎盾逾遁阜',
  'BBABAB': '倨停匐命妃妖妨姻娟媚嫂嫉嫡岷嵩幄恕悚悟慌憾拿沃沸泓泣泥泯洞活流海涎涓液淳渡渥游湍湫溺滂滴漏潺潼濂濠瀛盒禹絮翕衙追逅',
  'BBABBA': '位俯倍僻姚娘婚婢嫌嵋幢戮房扁扈昏普染汝沂泊洋洽浪涵淆淮湟溢溯滋澹激濯粘粳精糊糟羽翌翠翩翼肇肩肴遍道陪障首',
  'BBABBB': '依侮倭傍兆函努危塑夙奠妙姆始娑娩婆婉媛嫁嫦尊巍帑弩彖怒恢悖悠慈懦扇料朔梁欣汐汲汾沁沈沙治沼沿泌泗泛泡波泳洛洲洵派浚浣浮浴消涌涕淀淘淙淡淫深溜溟溪溶滑滓滔演潘澄澳猷益粉粒粕粗粱粹糖糠耀裟近迷逃逆遂遵邸酋雇',
  'BBBAAA': '佯割塞墨害寒寨崔嵯往律得御性悍狂猜祺衢豁蹇逢隍黔默黜',
  'BBBAAB': '倦傀冥勇圈完宗定寂寇崩嵬急恨惺慢慨憬架殷熊猿疑矣禧肄能逍通除',
  'BBBABA': '宣宦宸寅富寞恬愎愕桀福罔袈',
  'BBBABB': '低偏免剃勉宋宏宕室宥家寄寡寮弟彷微徽快怏怠悉悔悴悸慷憧所獗番禽象迦逸釉隘隧',
  'BBBBAA': '俑俟催凰剿卿坐宙宜宴寓峰崇徊徐徨怪惟惶愆愧憔斛沓煤爰牢狎狙狸猖猥猩省祖祚神罕蚤蟹衍角解邂釜院陶隙雀食',
  'BBBBAB': '像宅官宰宿寐寤幡彩循恍恰愉慊敞柔炬炳然燎爬狡猊猛猝瓮磐祀祝祠禳舟航舫般舵舶舷船艇褥襟采降陷隆',
  'BBBBBA': '乳俎含咎堂孚安寥常徇怡恂悌掌曾案棠欲炸焙燥爆爵狼甑癸登盆盈祈祗祥空穿突窒胤衡衾袂袒袖裙裳裸褐褪襁谷骨骸髓',
  'BBBBBB': '伶侈俊俗修僧初卵受囹多奚妥孵宛客宵容密察峻嶝巡幽弊役彼後忍念忽忿怜怨恪悛惚憎懈懊斧昶桑灸灼炊炎炒炙炯烙烽煌煽熄熔燃燔燧狄狐狗狩猾留畿瞥矜祭究穹窄窈窕窘窟系翁舜蜜衫衲衿袍被裕裨褓褶豫豹豺貂貊貌迎返逡邃陀'})
,
([[1, 2], [3, 4]],
 6,
 {'AAAAAA': '乾事其冒副剽勒勘募勤匙匪卓博卦取呈呵呻咀品哄哥哺唱喇嗔嗣嗤嗽嘲嘴嘶固圃圄圭址坤坦垣埋域埴基堤堪堰堵塔墅墓娶孟封岫岬峙嵌巽帖帽幅幌幕彗悲惠愚慕慧戟戡戴抹押抽拈拙拭拮拱拷持捉捏捐捕捧捷掉排措描提揖揶搏搭摸撒撮撰操攫敢散斐斟斡斯旱旺昌昔昧是晤晴晶暇暑暮暴曙曝曹曼最朝期某栗欺款歌武焉熙燕玩珂珥球理琥琳琴琵琶瑁瑕瑚瑛瑞瑟瑾璞瓢甄甚町畦疆盂直眄眠眼睛睦睫睹瞰瞿矗票罪置署翡翰耳耶耽耿聆聊聘聚肯胃胄芋苒苗苛苦茉茴茸草莫菁菖菱菲菽萌著葛葫葺蒜蓍蔑蔓蔬薨薯藉藕蚩蜚裴覃趺趾跋跌跏跛距跣跨路跳踊踏踞踵蹂蹄蹈蹉蹊蹴蹶躁躇逞逼遇遣遭邯鄂鄙里野量陟隅非革靴鞋鞍鞠鞫鞭',
  'AAAAAB': '具典剿匿味哉哭哮喘喜喝嗜嘉器嚆垠墟寺建弄彭患慝扶技拐捌政敷昊映果栽熹琢甫畏畸磬粟肆芙芸芽英茵菰袁要覆走赳赴起超越趣逋遐隔馨鼎鼓',
  'AAAABA': '些兢堀契妻嵋惹拂拓振据掘握故斑晨柴毒玳珀珠琅琉瑙璃璋疏眩睡瞑瞳瞻砦碧素累纛胡若菌蔚藏虹蚌蚓蛔蛙蛭蜀蜈蝎蝴蝶螳螺辜雎',
  'AAAABB': '共剌叔咽坪城巷思恭惑或承抄抉拔拯捺掩敖整晃晟更束汞熬玖玲珊珍珞班瑜界畔畛略眈眸眺督瞬紫罹耕耗耘茂莽葬蒸蕨蚊蚣蛇蛛蛟蛤蛾蜂蜘蝗螂融螟蟠蟾表足迪速陵雌',
  'AAABAA': '冀冕喊埠壕壤壹孝岩岸崖影懿拍拘招括指挺挽掠搜擅攘敬明星昨昭景暝暾煦照煮盟者背苔苟茄茯茱茹荀荷莉莪萎萸葡董蒙蒿蓑薛藜藤警都',
  'AAABAB': '坊坑坡垓培堆塘境孺幄截抗披抵拇拉掖接推摘摺撞撤擢攻晦暗暹曜花芳茅茨荏荒菩萃蒡蓄蓼蔗蕉薪裁赤赦赫逮',
  'AAABBA': '刺南哨哲困圻均垢埃奉奏崎幸折拌拾挑揄春昴晁暄曦棘泰耆芹范茗茫茶莎莞菅萄萍萱落蒲蓬蔽薄薇藩藻蠢誓豆豌逗逝逵',
  'AAABBB': '剔吠啄喙坎志忠恐扮按挫捻授探控揆援搬播擒擦易晏暖曷歇炭秦芥芬芯苡荻菊菜葵蓉蔡蕃雨',
  'AABAAA': '刑咐唾嗅型峨嵩嵬弼眉虐虞郡酊配酎酵醋醍醒醴醵陌陛隋',
  'AABAAB': '勃喉崩巍帙群遽酌酢酩酪酬酷酸醇醉醯',
  'AABABA': '唯崔虔',
  'AABABB': '咬咳啼嗾噫壑孜孩幢形彪愍戒救求睿逑',
  'AABBAA': '哈喧嗟峰崇嵯彬想替杆李杏材村杜杳杷枉林枝枯枳柄柑柚柬柯栖根桂桐桓桔梗梧械梵棋棍棒森棹植椒椰椿楔楚楞楠楫楮榛榧榻槽槿模橄焚相禁胥蛋隙魂麓',
  'AABBAB': '恩朴杖杯枇柩桎梢椅椽楷樗索翅雅',
  'AABBBA': '呼幡懋杭杵枋枚枷枸柏柱校株核桶梅梏梓梳棉棚椎楸榜槁槌槐樟樵橘橡檀檄',
  'AABBBB': '呱唆啖喀嚼孤峻嶝巫攀杉杓杰松板析枕柝柳栓格桁桃梭梯棕棺楹榕榴樊樽橙檎粲述退餐',
  'ABAAAA': '到刷厘厚在夏孱居展戚殿砧硅硬碌碣耐臀臻蹙郁隍面髓',
  'ABAAAB': '咸尉屠感慰砂砒硝磊致附骸',
  'ABAABA': '劈壁嬖弱擘檗璧砥破硫硼碎碑磅礁臂譬避',
  'ABAABB': '唇斫碇碗磁磋蜃辰辱',
  'ABABAA': '否屋歪臧',
  'ABABAB': '威犀',
  'ABABBA': '函屑陪障',
  'ABABBB': '雪零雷雹需霆震霓霖霜霞霰露霹',
  'ABBAAA': '削原墨奄奇奈奎奔套奢愿敞殖沓皆肖逍除陶陷黔默黜',
  'ABBAAB': '匏咫圈殃烈瓠粥裂院',
  'ABBABA': '罔隆雁',
  'ABBABB': '尖耀隘隧',
  'ABBBAA': '厥堂屎常掌棠殆殉殊盛省裳',
  'ABBBAB': '履雀雄',
  'ABBBBA': '囹',
  'ABBBBB': '彖殄灰爽豕逐',
  'BAAAAA': '乖乘享伸佃但何佳佶侍供便促俚保俳借倡倬偃假做健偶傅傲僖儡凄刮制剩匍匐告周垂堡塾姐姑娃娟娼媒嫩嬉孰岳帛年敦敲朦熟燮牒牡特甥皇盲睾禹缸缺罐肛肝肺胛胴脯腥腰腱膈膊膜膨臭舅舞襄言造遑邱郭重阜雕高鼻',
  'BAAAAB': '京使俸偈兵凌勇妹射就息憩架段泉烹秉肢腿膝臾衰衷身躬通鼠',
  'BAAABA': '亭侃候催兜冥卑娜媚牧牲皎皓絮羸胚膏豪邀魄',
  'BAAABB': '亮休侵哀姨姻恕我朱毫熊物的肱胱能豚迫追鬼魁魃魅',
  'BAABAA': '佐佑佰侑侯倒倨僻冠娠岱拜朋牌看竹胎脂脾腹腺',
  'BAABAB': '僭儒孀悠攸肪脆腋腑膀臆袈黛',
  'BAABBA': '例俺倚偕冽利和季智朕朗梨熏犁知矩短秒秕租秤秧程稍稷稽穗膳袋香馥',
  'BAABBB': '伏修僚妙委嫦怠急愁版矮秀私秋科秘秩移稀稔稗稚稠稻稼稿穆穰胸腔腕膣象迭透逸雉魏黍黎',
  'BABAAA': '件任伯住作佩侏俄俑信倪停傀凋唐妊姓娥婚婢嫂席庄店度庶康庸廛恁扁扈扉望焦畜社祉祖神祠祺福禧翩翼肩育褒遍遮集鹿麒麝麟',
  'BABAAB': '佚倭像娘娩床庚摩柔磨祝豫靡魔麻麾',
  'BABABA': '侮偏准翌翠',
  'BABABB': '亦位依俯倍傍夜奕妖嫉嫡庵戮敏毓繁',
  'BABBAA': '伴佯俟倦僧凝剖吝嫌府庭廊廓彰意斌新施旋旗瓣疝疳疵疸疽病症痍痔痕痘痼瘟癌癖祚禳站竟章童竭端腐袒袖裙裸褐褪襁襟辛辣辨部靖音韶',
  'BABBAB': '商壅妾姚嫁底廖房扇放旅旌族旒毅率疥疫疲疹疼疾痂痒痛痢痰痴瘠瘢瘤祗竣竺竿笏笑笙笛笞笠符第等筋筌筏筐筑筒答策筮筵箔箕算箝管箭箱箴箸篁篆篇簇簧簪簿籍纂翊肇膺衲袂褥雇雍',
  'BABBBA': '价刻咨帝庠廉瓷祈祥紊袍被裔裨褓褶',
  'BABBBB': '交伶侈俊俗冷劾卒姿婉媛座怒恣效於旁矜脊衫衿裕郊',
  'BBAAAA': '企全兼凰前剪割命善塞姜宙宜宣宦害寂寅富寒寓寞寨征待徊律徒得徘徙微徽怯恃恙悍悚悟悼情惜惺愈愕慌慢憬桀汗江汨汪沛沫沮河油沽沾泄法洞津洪浙浦涅涓淇淑混渚渠渫渭港渺湍湖湛湮溥漂漕漠漫漱潭潮澎瀑瀚灌煎狂狎狙狸猖猛猜猥猿畿盈盒盾羊美羔羲羹舍舒蚤行街衙衢豁蹇逢逾遁',
  'BBAAAB': '余宗定宴差忖怏恨悖慨拿斛斜普沐浸淅淋淞添渣渤湘漆猩羌羚羞翔翕蟹解逅途邂酒金',
  'BBAABA': '判剃卿奠寇寐寤尊怖惰憾懦沸泗涯涵渥溺滑漏潺濡猷遵酋',
  'BBAABB': '券卷叛塑娑宋弊快恍恢拳料曾朔欣殷汰沙泥洌消淹源甑疑眷瞥矣米粉粒粕粗粘粳粹精糊糖糟糠肄裟近迷送逆',
  'BBABAA': '咎宕室宥宸寡希往徇御徨怡性怪恂恤恬悸惶愎愧染汽治沼沿泊注洗洙洵活浩浪涌涎淳湃湟湫溟激濠瀛爬猾肴衡道首',
  'BBABAB': '婆彷彼悔悴惟慷憔憧懊沃波泣流海液淮渡游滂滴潼澳澹濂濯',
  'BBABBA': '宵寄徐循恪恰悌愆愉慊憎懈所沂洋洛洽浣涕淀淆淘淙溢溯滋演益衍',
  'BBABBB': '家寮後怜悛惚慈梁汾沁泌泛泳洲派浚浮浴淡淫深溜溪溶滓滔潘澄獗粱逃遂',
  'BBBAAA': '昶案牢猊留盆罕',
  'BBBAAB': '宿悉桑狼番釉食',
  'BBBABA': '寥州',
  'BBBABB': '孵宰然狡猝磐禽航舫般舵舶舷船艇',
  'BBBBAA': '乳俎坐孚客彩欲炬炯炳煤燥爆爰爵狩癸登祭空穿窘谷采釜',
  'BBBBAB': '炒燎突窒窟翁衾',
  'BBBBBA': '奚妥炸焙煌煽熄窄',
  'BBBBBB': '受容密察念忽忿斧灸灼炊炎炙烙烽熔燃燔燧狄狐窈窕舜蜜豹豺貂貊貌逡邃'})
,
([[1, 4], [2, 3]],#14_23__sp5
 6,
 {'AAAAAA': '寥弱沁泣注津流浣浪浸淀淙渠溺滂滓滴演潼濯翌翠',
    #泣
  'AAAAAB': '凄割室宰害汗汪沫泌液淳添渡游溶濂濠濡瀛率豁',
    #汗
  'AAAABA': '密建戮朗江汰河治法泳洋洌洲浙浚浦涌涕涯深淹渚渤渥溟溢溥溯滋漏漕漱澎燮翼蜜言',
    #江
  'AAAABB': '塞宗寇寒寨桑沐沛沸沽泄泥洪淅淇淋淞淡渣渫港湖湘湛湮源漂漆漠潭潮潺澄瀚灌蹇酒',
    #洪
    #泣汗江洪
  'AAABAA': '奉奏宣宸寄寮彗慧新旁梁汨汽沮泛洙洽浮海涅涵淆淑淫混渺湃溪滔漫瀑瓣竣粱翊育臻辛辣辨靖',
    #浮奉
  'AAABAB': '冠冽凌到剖妾定宦寅富帝彰意春染毅汾沃油沾泰洗洛洞活浩浴消涓渭湫溜滑潘澹畜畿秦站竟章童竭端致蠢部音韶',
    #浴
  'AAABBA': '契妻娑婆宋宕宥寡巽沂沙沼沿泊泗波洵涎淘淮湍湟澳激耕耗耘裟魂',
    #沙
  'AAABBB': '商家寞派',
    #派
    #浮浴沙派
  'AABAAA': '亭冷宜察廊廖慨憧扇斌斑替望毒玩琅琉琴琵琶瑟璃璋疳病症痍痒痔痕痘痛痰瘠癖盲窒窘纛豪退雪零雷雹需霆震霓霖霜霞霰露霹',
    #廖-->廊
  'AABAAB': '亮唐宴寂寓庚康庸廓弄怪恨悴情慷懦房案毫牢珂珥班球琢琳瑕瑚瑛瑾疆疝疥疫疲疵疸疹疼疽疾痂痢痴痼瘟瘢瘤癌空穿突窈窟紊素膏衰逮邃',
    #唐
  'AABABA': '交享凋卒吝塾孰宙客容寐寤庄庠庵廉忖快怡怯恃恢悌悖悚悛悟惰愍慊憾效敦武烹熟玖玲珍珞珠理琥瑁瑜窄窕羸脊蚤襄郊郭',
    #廉
  'AABABB': '京哀宵就席床度庶怖惜慌憎摩敖敲熬玳珀珊瑙瑞璞碧磨粥表衷遮靡高魔麻麾',
    #床-->度
    #廖唐廉床-->廊唐廉度
  'AABBAA': '准凝底廛弼怜性恣恰悍悔惺愉慢憬扉於旒旗瓷群肩',
    #底
  'AABBAB': '刻劾匿咨姿宿店座庭怏恍恪恬悸悼愎愕慝扁扈放施旅旋旌族翩肇裔遍郡',
    #店
  'AABBBA': '亦壅夜奕府恂惟惶愧憔懈懊戒腐褒雇雍鹿麒麝麟',
    #府
  'AABBBB': '刑型形恤惚盂膺',
    #膺-->刑
    #底店府膺-->底店府刑
    #泣汗江洪,浮浴沙派,廊唐廉度,底店府刑
  'ABAAAA': '冥培境志怠慈拇拉捧捷接摘摺撞撤撰擢翅肆遐',
    #捧
  'ABAAAB': '事兼匏匪善坊坑坪垓垠塘壕壤壹奈屋差懿扶抗抹拭按掖掠控擅擦攘款瓠禳罕羊羌羚羞翔裁',
    #扶
  'ABAABA': '券卦卷唇圭垣埃域堰堵奇奎奔套奢姜寺封幸恙惑惠或技抉拌拔拮拳拷持振捕据捺探掩握搏救敷更殆求甫眷矣社祠祥福禧美羔羲羹蜃豆豌辰辱送逋逑逗通',
    #持
  'ABAABB': '判勇叛城埴堀堪塔尉慰拂拓拱掘措揆描揶搭摸撒栽殖熊祺索能',
    #描
    #捧扶持描
  'ABABAA': '前剪博喜嘉均坤坦埋堤奄彭恐抵押拾挑捏捻授排揄提揖援撮擒攫昶殊焉煎熹祖祗神逡逵鼓',
    #授
  'ABABAB': '副勃厥咫咸哉哥址墟威屎屠州感戴扮抽拈拐括挫挺捉捌捐掉播操攻政柬歌殃殄爽益磬祉祚祝臧融袁走赳赴起超越趣逼馨',
    #扮
  'ABABBA': '剌哲圻坎坡垢埠堆奠孝尊居展截抄折披拍拘招拯指挽推搜搬整料普曹束殉殿汞灰烈煮猷祈米粉粒粕粗粘粳粹精糊糖糟糠者臀裂誓迷逆逝速道遭遵都酋雄首',
    #折-->拍推抄
  'ABABBB': '剃塑拙朔耆赤赦赫遂',
    #拙
    #授扮折拙-->授扮拍拙
  'ABBAAA': '乾其劈勘取基壁夏娶嬖戟戡擘敢斟斡斯朝期杆杭杰枉枋某柱校核根桎梓械梳棒棕棺椿楔榕榛榜槁樗樟檀檗欺炬焙煽熔璧甚癸直矗硫碇碌碎碗磅翰耳耶耽耿聆聊聘聚臂芯芸范茫莎莞菩萍萱落蒙蒡蒲蓄蓼薄薪藉藕藩藻裙褪褶譬辜述避酊配酎酬酵酸醇醉醋醯雨',
    #茫
  'ABBAAB': '厘厚彬懋戚材村杖杜杯枇枕林枝枯柄柑柩柯栖桂桓桔桶梗梧梭梯梵棋森椅植椰椽楚楠楮楷榧槽槿模樽橄橘橙歪炎炳焚煤燎燧犀登砒硅硬磁磊磋禁芋芙芳茉茨荒菁菅萃蒜蒿蓉蓑蔗袂褥襁襟蹙邯郁酌酢酩酪酷醍醒醴醵麓',
    #芋
  'ABBABA': '兢共勒勤南否在孱巫巷恭想攀故散昔朴李杏杓杳杵杷松枚枳柚栓株格桃桐梅梏梢棍棚棹椒楫楸楹榴榻樊檎灼炸烙烽熙燃燔燕燥爆相砥砧硝硼碣胡苔苛苡莽菱著葬蓍蔚蕨藏衿袍袒袖裕裸褐革靴鞋鞍鞠鞫鞭',
    #苔
  'ABBABB': '屑惹斫杉板析枷枸柏柔柝柳桁棉椎楞槌槐樵橡檄炊炒炯煌熄盛砂破碑礁芽若苦茂茅茸葫葵蔽衫衲被裨褓',
    #茸
    #茫芋苔茸
  'ABBBAA': '剽募原墓幕愿慕暮栗棘瓢甄皆矜票粟茱茶草莫菖菜菲菽萌葛葺蓬蔓蔡藤',
    #草
  'ABBBAB': '刺曾甑芥芬苗英茗茵茹莉莪菊菰萎葡董蔬蕃藜要覃覆豫',
    #芥
  'ABBBBA': '弊彖敬瞥耐芹苒苟茄茯茴荀荷荻菌萄萸蒸蕉薛警豕逐雅面',
    #芹
  'ABBBBB': '刷履花荏蔑薇薨薯雁',
    #花
    #草芥芹花
    #捧扶持描,授扮拍拙,茫芋苔茸,草芥芹花
  'BAAAAA': '念怒急暄暗曜毓眠眩眼睛睫瞳祭翁腱膀臆',
    #暗曜暄-->膀
  'BAAAAB': '具啼喧噫娘嫁嫡影敏旱旺昊昧晏景晴暾眄眈眸睦睹瞑瞰繁肝肪腋腑腔腕腿膣衾逢院食鼎',
    #旱旺肝
  'BAAABA': '全匙呈咬喀壑姨婉嫉孀孺悲承斐是晤晨暇暑暝曦朕然眺睡睿瞬瞻瞿禽翡肛肢肱胎脯膈膊膨膳蜚裴逞量金陪障非',
    #是晤肛
  'BAAABB': '余剿味咳嗾妹娜孩斜晟暴最朦果炙秉肺胚腰膜膝舍舒豚途雎',
    #最暴膜
    #暗旱是最-->膀旱是最
  'BAABAA': '冒受吠哺嗟墅奚娃娠嫌愈拜昌明星晁晦晶暖曝朋爰盟矩短竺竿笏笑笙笛笞笠符第等筋筌筏筐筑筒答策筮筵箔箕算箝管箭箱箴箸篁篆篇簇簧簪簿籍纂翕胛腥迭逃逾里野',
    #昌明腥朋
  'BAABAB': '函呵命哮唆喇喊嗜嗽嫩嬉年彩拿映昨晃智桀甥盒知矮胱胴脆腹舜采雉',
    #晃昨胱
  'BAABBA': '乳冀冕叔哄啖嗔嘲嘶嚆妥姑媒孚愚昭暹曷朱歇灸煦照看督缸缺罐肴背胸脂脾腺遇',
    #曷-->昭腺歇冕
  'BAABBB': '制剔啄喙希易昴曙曼爵舞豹豺貂貊貌鄙',
    #易曙
    #昌晃曷易-->昌晃昭易
  'BABAAA': '卓咀姐忠忿思恕恩疏粲罔虐虔虹蚊蚌蚓蛇蛙蛟蛭蝴蝶螂螟迪鄂釜骸髓',
    #釜咀-->忿鄂思
  'BABAAB': '匍呻哈哭唱喝器嚼圃圈坐姓姚娼媛牡特町畏畔畦畸累絮蚣蛔蛛蛤蛾蜂蜈蜘蝎蝗螳螺蟠蟾遽重餐',
    #坐哈牡哭重累畸
  'BABABA': '些企俎匐告周呼咎咽品唾嘴圄堂墨妊妖姻娟娥婚嫦孜常患我掌柴棠欲熏牧牲界畛略砦紫耀肯胃胄胥虞蛋裳谷足趺趾跋跌跏跛距跣跨路跳踊踏踞踵蹂蹄蹈蹉蹊蹴蹶躁躇造遣陛陵隋隔隘雕黔默黜',
    #企品牲熏胃堂呼
  'BABABB': '哨嗣垂媚彪悉斧物番釉隧雌',
    #斧哨物垂
    #釜坐企斧-->忿坐企斧
  'BABBAA': '乖乘削剩呱唯嗅困固婢嫂孤愁眉私秋科秕秘秤稼稽稿穗穰肖逍陌',
    #肖唯乖私
  'BABBAB': '典利刮和咐喉喘嗤妙委娩季孵憩梨犁留秀秒租秧秩移稀程稍稔稗稚稠稷稻穆竹透香馥魏黍黎',
    #竹利秀
  'BABBBA': '孟敞盈',
    #敞
  'BABBBB': '盆',
    #盆
    #肖竹敞盆
    #膀旱是最,昌晃昭易,忿坐企斧,肖竹敞盆
  'BBAAAA': '侵信健囹崇息焦皇皎臭航舫舵舷袋迫追遑邀集鼠',
    #信
  'BBAAAB': '位住俸倍倒傍卿射幢段狩狼磐臾舅般舶船艇袈身躬阜除鼻',
    #位
  'BBAABA': '停傲儒兜卑尖嵩斛殷狂狡猜猝疑的皓肄隆鬼魁魃魅黛',
    #停
  'BBAABB': '依俯偏岱帛架泉牒蟹解邂隅魄',
    #俯-->偏
    #信位停俯-->信位停偏
  'BBABAA': '伏伴佯佳侍侯便俑俟倚倦偃假傅僚岸峙崎嵯幄沓近逅逸',
    #佳
  'BBABAB': '佐何佶使例俊俺倨僖僭兵岳峻崖幅炭猿獗蚩邱陟',
    #佐
  'BBABBA': '休佑佰侑供借做僻岩嵌嶝所版牌狄盾省禹遁雀',
    #佑-->供
  'BBABBB': '偕僧欣象',
    #欣-->僧
    #佳佐佑欣-->佳佐供僧
  'BBBAAA': '伶但侮俳凰峰往律忽愆狙罹衍隍',
    #伶
  'BBBAAB': '件伸佚侏俚保倡偈偶堡岬崩帙帽幌彷狎狸猖猩置署行陶',
    #件
  'BBBABA': '任佃作侈促俄俗候倬儡岫峨帖幡征待後徒恁爬猥猾罪街衙附隙',
    #俗任
  'BBBABB': '价佩侃倭嵋巍猛蜀',
    #价侃倭-->蜀
    #伶件俗价-->伶件俗蜀
  'BBBBAA': '伯倪傀崔嵬徐得徘御狐猊睾衢陷',
    #伯
  'BBBBAB': '修像徙悠攸',
    #修徙-->悠
  'BBBBBA': '彼徇徊徨循微徽衡',
    #循
  'BBBBBB': '催'})
    #催
    #伯修循催-->伯悠循催
    #信位停偏,佳佐供僧,伶件俗蜀,伯悠循催
    #
    #
    #廖唐廉床-->廊唐廉度
    #底店府膺-->底店府刑
    #授扮折拙-->授扮拍拙
    #暗旱是最-->膀旱是最
    #昌晃曷易-->昌晃昭易
    #釜坐企斧-->忿坐企斧
    #信位停俯-->信位停偏
    #佳佐佑欣-->佳佐供僧
    #伶件俗价-->伶件俗蜀
    #伯修循催-->伯悠循催
    #
    #[[1, 4], [2, 3]]#14_23__sp5
    #泣汗江洪,浮浴沙派,廊唐廉度,底店府刑
    #捧扶持描,授扮拍拙,茫芋苔茸,草芥芹花
    #膀旱是最,昌晃昭易,忿坐企斧,肖竹敞盆
    #信位停偏,佳佐供僧,伶件俗蜀,伯悠循催
    #
    #泣汗江洪,浮浴沙派,廊唐廉度,底店府刑;捧扶持描,授扮拍拙,茫芋苔茸,草芥芹花;膀旱是最,昌晃昭易,忿坐企斧,肖竹敞盆;信位停偏,佳佐供僧,伶件俗蜀,伯悠循催
    #泣汗江洪浮浴沙派廊唐廉度底店府刑捧扶持描授扮拍拙茫芋苔茸草芥芹花膀旱是最昌晃昭易忿坐企斧肖竹敞盆信位停偏佳佐供僧伶件俗蜀伯悠循催
    #
,
([[1, 5], [2, 3, 4]],
 6,
 {'AAAAAA': '巽',
  'AAAAAB': '建愍聿',
  'AAAABA': '妻弛疆',
  'AAAABB': '夷弼艮退',
  'AAABAA': '剿匡弦弱彗慧',
  'AAABAB': '契巡彖忌改那邦',
  'AAABBA': '君奉奏弧粥群逮郡',
  'AAABBB': '春泰秦耕耗耘蠢魂',
  'AABAAA': '毒玩琴琵琶瑕瑙瑟素纛遐',
  'AABAAB': '尉屋弄式慰敖熬珂珥球琢琳瑚瑛瑾畿',
  'AABABA': '到孱局屠斑武玖珊珞珠琅理琉琥瑁瑞璃璋至致臻表',
  'AABABB': '居屈展戎殿玲玳珀珍班瑜璞皆碧臀',
  'AABBAA': '劈壁嬖尾擘敢替檗璧臂譬避',
  'AABBAB': '刷匿尿慝戒盂迂迅邪',
  'AABBBA': '咫屎犀',
  'AABBBB': '刑型屑履形雅',
  'ABAAAA': '事垠妃姨娜惑或承拂拒捧捷撰肆限',
  'ABAAAB': '匣匪唇堀奸妹姆惠扶批抉抹拇拗拭据掘握敷更款甫蜃辰辱逋',
  'ABAABA': '副努劫卦吾哥圭地垣城域堰堵好妓威娃娠媚嫩嬉孀孺封弩戮扼技把抒拔拮拯拷持振捕搏摺擢歌磬羽翌翠翼臣臧融逼阮陛馨',
  'ABAABB': '剌吏坡坪埃埴堪塔始姑媒寺帑怒戌成披拓拙招拱捺掩措揆描揶搭摸撒整曹束栽盛豆豌逗速遭',
  'ABABAA': '再博吉咸哉喜嘉坊坤坦垓埋堤墟壹如妨姐姓姻娘娟娼婚孩彭恕感懿戴托抑投抱抵押抽拐捉捌捏捐排提揖撤撮操攫焉熹絮考袁西酉酊酌配酎酢酩酪酬酵酷酸醇醉醋醍醒醯醴醵阿隔鼓',
  'ABABAB': '址均坎坑培塘境壕壤妊妖娥娩嫉嫡孜孝孟志恐抗拈拉拘括指挺挽掉掖掠探接摘撞擅攘攻政桑殆殖汞疏翅裁走赳赴起超越趣陋陵隋',
  'ABABBA': '丞剽哲圻垢埠姚婉婢嫁嫂嫌孤幸扮折拌拍拾按挑控揄搜搬擦柔柬栗死殃殉殊煮瓢甄盈眉票粟老者耆要覃覆誓豫逝逵都陂陌',
  'ABABBB': '列刺堆妙媛嫦截抄挫捻授推援播擒棘殄烈矜胥蛋裂豕赤赦赫逐雄雨雪零雷雹需霆震霓霖霜霞霰露霹',
  'ABBAAA': '乾其勇勘匏厘厚取基夏娶戟戡斟斡斯有朝期架某欺熊瓠甚甬百直矗砒破硅硬碌磊索翰耳耶耽耿聆聊聘聚能芸藉藕通邯邵郁阻隅',
  'ABBAAB': '克兢勃奈怠戚故斫熙牟矣砂砥砧硝硫硼碇碎碑碗碣磁磅磋礁胡芋芙芽茉菁蒜蔚袈蹙辜迦防',
  'ABBABA': '勒勤匠在奇奎奔套奢存散昔燕芭苛茂茅茹菰菱著葬蒸蓍蓼蔬藏蚩降陟陶隆革靴鞋鞍鞠鞫鞭',
  'ABBABB': '共函南巷恭惹戍收救求而耐苔苡若苦茄茸莽葫葵蕨逑陪陷障面',
  'ABBBAA': '募原厥墓奄幕愿慕暮朽杆杞枇枉根桎械棒椽椿楔楷榛橄芒芟芳苗苞英茱茵草荒莫菖菲菽萌葛葡葺蒙蓄蔓藤蚤院除隍',
  'ABBBAB': '彬忍懋敬李材村杖杜杯杷林枝枯枷柄柑柩柯栖桂桓桔桶梗梧梭梵棋森椅植椰楚楠楮楹榧槽槿樗模橘橙歪焚禁芍芝芯苑苒苟茗茨茴荀荻莉莪菊菌菩萃萄萎董蒡蒿蓑蓬蔑蔗蔡薨薪薯藜警阪陀附隘隧麓',
  'ABBBBA': '否想机杏杓杭杳杵枋枕枚枳枸柚柱柳校株核格桐梅梏梓梳棍棚棹椒楞楫楸榜榴榻槁樟橡檀癸登相芬芹范茫茯茶荷莎莞菅萍萱萸落蒲蓉薄薛藩藻逡',
  'ABBBBB': '巫攀朴杉杰松板析柏柝栓桁桃梢梯棉棕棺椎榕槌槐樊樵樽檄檎灰爽芥花荏菜蔽蕃蕉薇述隙雁',
  'BAAAAA': '具凄助喙旱旺昆昊昧晴暇氓眄眠眸眼睛睦睫睹瞰肝腱腿鼎',
  'BAAAAB': '匙呈味急早昭是晟晤晨暑暴曜曳最服朗朦果照眈眩眺睡瞑瞬瞳瞻瞿秉肋肛肢肥肱肺胎胚脯腰膈膊膜膝膨良豚逞量雎',
  'BAAABA': '冒冕冠剔吐吼呵哮哺啄喇喊嗜嗽墅妄影悲愚敏斐昌明昏易星映昨昴晦景晶暗暝暾曙曝曷曼朋歇毓煦燮盟繁翡肌股肪胛胞胴胸脂脆腋腑腥腹膀臆蜚裴言遇邑邸里野非',
  'BAAABB': '吠哄唆嗔嗤嘲嘶嚆壅晁晃晏暄暖暹曦朕率畜胱脾腔腕腺膣膳鄙雍',
  'BAABAA': '串匍匐危吃同呻咀咆咳咽品哭唱喝嗣嗾器圃圄幽彪患拜望男町畏畦畸盲累羸色虎虐虔虞遽鄂',
  'BAABAB': '冀冽凌制吊吸吹吻周咬唾啼喘嘴噫夙年忘思扇甥界畔畛略缶缸缺罐胃胄背虹蚊蚌蚓蚣蛇蛔蛙蛛蛟蛤蛭蛾蜂蜈蜘蝎蝗蝴蝶螂螟螳螺蟠蟾足趺趾跋跌跏跛距跣跨路跳踊踏踞踵蹂蹄蹈蹉蹊蹴蹶躁躇迪遣雕骨骸髓',
  'BAABBA': '充典冶吩呱咐哈喀喉喧嗅嗟因固忠恩房扁扈扉放施旅旋旌族旒旗曲看矩短翩肇肩育胤迎遍',
  'BAABBB': '亥刻劾叔吟呼哨唯啖嚼困於昶智朱督知矮系舞迭雇雉',
  'BABAAA': '亨享冥卓卿唐回塾孰岷庚康庸敦斛旨旬旭烹熟蟹衰角解逢邂郭重',
  'BABAAB': '京亭亮免凋勉哀壑就幄庇廷怨我敲桀毫牡特狂猜甸疑睿肄膏舛衷襄象豪逸高',
  'BABABA': '些先凝告岐岸峙崖嵋幅庄序廖柴此牝牧物牲猛猿砦粲紫肯造雌餐',
  'BABABB': '咨垂姿岩峻崎嵌嶝席床度庵庶恣摩次炭熏獗瓷留磨衣裔遮靡魔鹿麒麝麟麻麾',
  'BABBAA': '乖乘凰刮剩各名圈妾屹岫岬崩帙帽幌底廊廛憩斌新狎狙狸狼猖猥猩猾瓣疲疳痂病症痍痔痕痘痛癖祀祠竣紊罕置署翊舌辛辣辨靖',
  'BABBAB': '剖匈卵墨多孵峨峰嵩巍帆帖幢店庭廓彰意毅然狗狡猝疝疥疫疵疸疹疼疽疾痒痢痰痴痼瘟瘠瘢瘤癌社祁祭祺福禧站竟章童竭端竹竺竿笏笑笙笛笞笠符第等筋筌筏筐筑筒答策筮筵箔箕算箝管箭箱箴箸篁篆篇簇簧簪簿籍纂罔罪罹蜀部音韶黔默黜',
  'BABBBA': '冷准初吝商囹夜委季崇嵬嵯帝府庠廉忽旁沓狐狩猊祉祖祗祚祝神禳秀私秕秤稽穗腐袂被裙褒褥褪褶襁襟透魏',
  'BABBBB': '交亦刎利卒和咎奕岑崔幡座愁效梨灸炙犁狄祈祥秋科秒秘租秧秩移稀程稍稔稗稚稠稷稻稼稿穆穰肉脊膺衫衲衿袍袒袖裕裨裸褐褓郊香馥黍黎',
  'BBAAAA': '健兼割害射息殷沸泓泯津浸渠溺皇自臭臼臾舅豁身躬追遑阜鼠鼻',
  'BBAAAB': '伊佛侵俸兜剃卑善塞宇完宗室寇寒寨差帛延弟慈段汗汪沌沫泉泥添渥漏潺牒的皎皓羊羌羚羞翔蹇迫邀鬼魁魃魄魅',
  'BBAABA': '伺侯倒倨假偕傲僭全姜字安宏定宣宦家宸寅富寐寤寥恙案汝江池沛河法洌浙浦涯渚湮溥漂漕漱潭澎濡濯禹美羔羲羹酒',
  'BBAABB': '伐余僻兆判券卷叛塑婆守宋宕宥寄寞寡寮岱所拳斜朔梁汰沐治沼沽泄波洪浚涌涵淅淇淋淞淹渣渤渫港湖湘湛源漆漠潮澄瀚灌版牌眷粱舍舒袋送逃逆途金黛',
  'BBABAA': '伍何佳使侍便偃傅前剪合后向命宅官宙宜宴寂寓愈拿染汨汽沮油泡注泳洙洞流浪海涅涓淑混渭游渺湃滑漫澹瀑瀛煎牢瓮盒翕逅逾邱',
  'BBABAB': '伎佐佶例僖儒兵奠宛客宰密察尊岳汐汕汲沁沃沈沾沿泌泗泣洗洛洵活浩液淘深淳渡湍湫溜溟滂滴潼濂濠猷磐翁舟航舫般舵舶舷船艇蜜遂遵酋',
  'BBABBA': '伽佑佰侑供俑俟倚借做宿希忿欣汾沂泊泛洋洽浣涎涕淀淆淙湟溢溯溶滋滓演澳激盆盾睾穹空穿突窈窒窘窟肴血近返遁道首',
  'BBABBB': '伏休似俊俺僚娑宵容料普沙洲派浮浴消淡淫淮溪滔潘益究窄窕米粉粒粕粗粘粳粹精糊糖糟糠裟迷邃',
  'BBBAAA': '伸但低侮俚保信俳倡偈偶堡律恨慨焦集食',
  'BBBAAB': '仰仲件佃住佚佩侃侏促候偏儡後快情行',
  'BBBABA': '任企伉作依俄倬停像光含征待徒念怪怯恁恃悚悟惰憾懦耀街衙衾',
  'BBBABB': '位侈俯倍倭傍催尖弊彼忖怖怡恢悉悖悛惜慌曾甑番瞥禽釉',
  'BBBBAA': '伯伴佯倦倪傀削奚彷役往得徘御忙怏性悍悔惺愕慢憬炬爰肖衢逍釜',
  'BBBBAB': '乳修劣坐堂妥孚常彩徇徊徙微徽恂恪恬悠悴悸悼惚愎慷憧懈掌攸敞棠炳煤燎爬衡裳豹豺貂貊貌采',
  'BBBBBA': '伶俎僧受徐徨循恤恰悌惶愆愉愧慊懊欲灼炊炯炸烙烽焙煽燃燥爆爵省舜衍谷',
  'BBBBBB': '价俗州怜恍惟憎憔斧炎炒煌熄熔燔燧雀'})
,
([[2, 5], [3, 4]],
 7,
 {'AAAAAAA': '副嗣嗤帽幅撰操曙曼熙甄疆矗置蔓薯覃躁躇鄂鄙隅鞋',
  'AAAAAAB': '剿勒勤嘲巽幌戴撮暇曝歌蔑薨蚩踏遣遭隔',
  'AAAAABA': '喘嵋嵌患攫燕累署葫蔬跏跛踊踞蹂逼靴鞠鞫鞭',
  'AAAAABB': '剽喇嗔嗽愚戟摸撒栗瑛瓢瞰票蒸遇陟鞍',
  'AAAABAA': '嚆墅捌瑙瑞蜀踵蹴野',
  'AAAABAB': '博喙喝嘴幄搏瞿菌葛跋跣路',
  'AAAABBA': '募墓幕慕暮暴粟罹翰菰菽融覆跨跳遐陋',
  'AAAABBB': '哭嘶器峻嶝散斡跌蹄蹈蹉蹊蹶',
  'AAABAAA': '兢墟嵩蚓蛔蝴蝶螺骨骸髓鼎',
  'AAABAAB': '峨嵬幽照茅蜈蝎陂',
  'AAABABA': '峰崔崩琥略蛭',
  'AAABABB': '巍忠思慧曜疏素蓼蔚螳袁',
  'AAABBAA': '刺剌哨喜嗜塔崇崎搭棘熹畸磬纛蓍藉藕蛾蝗螂螟隙馨鼓',
  'AAABBAB': '嘉惠敷聚蒜蛛蜂蟾逋',
  'AAABBBA': '匙岑嵯幡幢惑晃界菱蚣蛇蛤辜速陵',
  'AAABBBB': '唆彭愍整炭焉璞畛葵蚊蛟蜘蟠雨',
  'AABAAAA': '堀弼掘暾盟荷葡蒿醋醍醴',
  'AABAAAB': '冕喊影慝敬景暝煦瞑紫薛虞警醒醵',
  'AABAABA': '惹畿蓄蓑酵',
  'AABAABB': '喉嗅孺晟晦柴莪萸酸',
  'AABABAA': '昴砦聊苑茗荒萄藏酷醇降陶陷',
  'AABABAB': '彪暹翅蒙蓬蕉遽酌酩酪醯雌',
  'AABABBA': '剔摺擢曷歇莉菊萎葬蔡隆',
  'AABABBB': '咳啄嗾孩彖瑟瞻茯荻藜藤虔酬醉',
  'AABBAAA': '喧暄菅萱蒲蔽薄薇藻蛋趣',
  'AABBAAB': '勘戡晏蔗越',
  'AABBABA': '喀曦督莞超陀院雅',
  'AABBABB': '呱墨孤弧恭斟晁柬栽琳眺粥茨茶莎蓉裴除黔默黜',
  'AABBBAA': '函噫暗瞳菩蕨陪障',
  'AABBBAB': '囹恩欺款聆落蕃薪退逗隧',
  'AABBBBA': '啼嚼圈斯莽菜萍蒡豌逮隘',
  'AABBBBB': '咬啖揆暖熬瞬萃藩',
  'ABAAAAA': '冀刷壤孱屈擅攘',
  'ABAAAAB': '勃勇搜絮',
  'ABAAABA': '挽索通',
  'ABAAABB': '壹媒嫩嬉展懿掠架',
  'ABAABAA': '媚碧豫',
  'ABAABAB': '壕怠恕柔熊能迦',
  'ABAABBA': '群袈',
  'ABAABBB': '劈壁嬖擘檗殿煮璧矜臀臂譬避',
  'ABABAAA': '帑盈翼',
  'ABABAAB': '截撤',
  'ABABABA': '桑',
  'ABABABB': '粲餐',
  'ABABBAA': '屑琉',
  'ABABBAB': '尉怒恐慰探赫',
  'ABABBBA': '嫦臻',
  'ABABBBB': '壑戮犀琢睿翌翠赦',
  'ABBAAAA': '削塘婚嫂揄敞桐梧棹椰楞楫槽槿模瑜',
  'ABBAAAB': '娩棍楠榻橄蚤',
  'ABBAABA': '婢想栖椽逍魂',
  'ABBAABB': '咫娘娥孀枳柄根梗棋椒楔',
  'ABBABAA': '懋枷桶楮橘誓',
  'ABBABAB': '掖擦楷楹逝逵',
  'ABBABBA': '控梢森楚禁裁',
  'ABBABBB': '彬搬梭梵橙焚麓',
  'ABBBAAA': '堂嫌常掌摘撞枸梏棉棠槁槌橡檀璃璋裳',
  'ABBBAAB': '境梅械槐樗檄耀',
  'ABBBABA': '婉嫁履捻枕柩柳格棚椎榴樵雀',
  'ABBBABB': '姚屎忍播株核梳楸',
  'ABBBBAA': '嫡桁梯棕棺椅椿樽登',
  'ABBBBAB': '松板柝桃榕述逡',
  'ABBBBBA': '授援擒梓榛樟逑',
  'ABBBBBB': '媛嫉攀救杰校榜樊檎癸',
  'BAAAAAA': '偶儡匐敲牒罐腰舅襄郭高',
  'BAAAAAB': '假甥睾禹耐膈膜鼻',
  'BAAAABA': '偃傅催塾孰熟碣膊舞雕',
  'BAAAABB': '促保做僖堡敦泉烹硬碌缺膨',
  'BAAABAA': '侃勉憩破',
  'BAAABAB': '偈朦羸衷象迎追造逸遑',
  'BAAABBA': '硝鼠',
  'BAAABBB': '候傲冥就感砂腿',
  'BAABAAA': '俑倒倨岱畜皓神祠福禧胤膏',
  'BAABAAB': '侵僭僻兜牌砥碑磊祝祺鬼魁魃魄魅黛',
  'BAABABA': '亮偕毫硼礁豪',
  'BAABABB': '乘修剩哀急息硫系衰邀',
  'BAABBAA': '昶盛碇磁祗禳衲袒袖裸褐褪襁',
  'BAABBAB': '初壅戚熏版碗袂被裙褶襟蹙雍',
  'BAABBBA': '毓磋祈祥胱袋袍裨褓褥',
  'BAABBBB': '俊俟悠敏燮率皎碎磅繁膝衫衿裕雪零雷雹需霆震霓霖霜霞霰露霹',
  'BABAAAA': '佩扁扈猖猛猥翩腺臧遍',
  'BABAAAB': '像桀猾猿蟹解邂',
  'BABAABA': '倪停傀卿怨猩脾腹',
  'BABAABB': '侮俄儒斛殃烈裂集',
  'BABABAA': '例偏咎殆留脆',
  'BABABAB': '恁扇逢',
  'BABABBA': '侈倭胸',
  'BABABBB': '焦豚',
  'BABBAAA': '俺倚僧施梨殉狗程稷穗蜃',
  'BABBAAB': '卵孵旋旗犁狼猊秧馥',
  'BABBABA': '祭秕腋腕雄雇',
  'BABBABB': '依殊秒稍腔膣膳透魏',
  'BABBBAA': '俯倍刻狩稗稠稿穆穰肄腑臆',
  'BABBBAB': '伶凌劾忽旅旒狐疑秘移稚稽黎',
  'BABBBBA': '俗倦傍僚獗科秤稼肇膀黍',
  'BABBBBB': '愁於族殄灸炙然狄狡猝秋秩稀稔稻逐',
  'BBAAAAA': '剪割宦富寓寞席徊徽悟悼惜愕慢渭湮漂漕漫潭灌盒蠢衙衢麒麟',
  'BBAAAAB': '宴寅得徙微悚愈渫漠潮瀑瀚煎舒褒豁逾鹿麝',
  'BBAAABA': '剃寐寤惺慌慨憬混湍湖溥滑翕遁',
  'BBAAABB': '兼原塞寂寒寨廛弊後徒怏恨愿曾渠渺漱澎甑瞥蹇',
  'BBAABAA': '尊彼怡悖慈殷溺遵',
  'BBAABAB': '奠寥案猷逅',
  'BBAABBA': '塑宵普朔淑港湛逆',
  'BBAABBB': '庶康恍悛涵遮',
  'BBABAAA': '匏寇徇御徨怖恂恤恬惰惶憾涌渤漏潺爬盆衡',
  'BBABAAB': '婆寡役悔愎愧懊懦波浸瓮',
  'BBABABA': '宛客宿恪惟憔懈渥翁雁',
  'BBABABB': '夜家宸密察廖恙悸惚欣濯羲蜜',
  'BBABBAA': '咨善寄循恰悌愉慊慷憎消渣湘瓷穹穿窈粗粘粳精糊糟裔',
  'BBABBAB': '姿徐忿愆摩淋瓠磨窒窘窟返靡魔麻麾',
  'BBABBBA': '凝娑宰怜恣憧梁磐究窄粕舫般舶舷船艇迷逃途',
  'BBABBBB': '奕容寮恢悴料斜浚淅淞漆澄突窕粉粒粱粹糖糠羔羹航舵裟邃',
  'BBBAAAA': '剖廓智淳痼瘟癌部',
  'BBBAAAB': '彰斌涎溟瀛端韶',
  'BBBAABA': '廊意激濠疵竟竭紊腐道',
  'BBBAABB': '厥商染泳浪海澳濡病痍痕痘短食',
  'BBBABAA': '洌洛淘疲痂痛癖',
  'BBBABAB': '念溜翊翔膺',
  'BBBABBA': '流深游番衾釉',
  'BBBABBB': '悉新泌湫澹竣遂',
  'BBBBAAA': '乳帝庵廉涕淹渡源演炯煤燥爆爵益笛第筒策箝簧辣',
  'BBBBAAB': '奚欲淀淙溯滋炳疫等箕算篆纂',
  'BBBBABA': '旁浣液瘤笞筑箸簪雉',
  'BBBBABB': '彩毅添溶滓炒疼痢矮筮箱籍豹豺貂貊貌采釜',
  'BBBBBAA': '受淆滴潼煌熄禽符筋筏筵箴篁脊郊',
  'BBBBBAB': '叛洲派潘灼炊烙烽煽燃爰瘢笏篇簇舜送',
  'BBBBBBA': '座斧浮浴溢溪滂濂熔瓣疥痴筌答管箭簿羚',
  'BBBBBBB': '效淡淫滔炎焙燎燔燧爽疹痰瘠笑笠箔辨'})
,
([[1], [3], [4], [5]],#1_3_4_5__sp2
 3,
 #选用结构更复杂的代表字，以避免与其他方案产生交集
 {'AAA': '三其勘匡匪匿卦取圭址坪垣城域埴基堪堰堵塔墟奉奏契娶寺封巧弄式彗悲慝慧戡打扶批扼技抹拈拒拓拔拭拮拱拷持振捕捧捷捺掉排掩措描揶搏搭摸撒政敖斐斑斟斯春期某栽欺款正武毒泰焉熬玉王玖玩玲玳珀珂珊珍珞珠珥班球琅理琉琢琥琳琴琵琶瑁瑕瑙瑚瑛瑜瑞瑟瑾璃璋璞甘甚碧秦素纛翡耕耗耘耳耶耽耿聆聊聘聚肆芋芙芸茉茸菁菱菲菽著蒜蓍藉藕蜚蠢表裴走赳赴起超越趣邦邯非',
    #非王三
  'AAB': '井些元共冀刑北卉叔哲圻均坎型垢埠堆天夫孝巷形恐恭惹戎戒截托扮抄抑投折抱抵拍拘括拾指挑挫挺挽捻授推揄援搜搬播擒攻替未末柴此煮督砦示紫老考者耆背若茂莽葬蕨藏誓赤赦赫逝逵都雌',
    #型示天元井
  'AAC': '坊坑垓培塘境壕壤壹幸志懿抗拉拌按掖掠探接控摘撞撤擅擦攘裁迂',
    #拉
  'AAD': '世云功劫勒勤博去吉哉喜嘉地坡坤坦垠埃埋堀堤彭戴抉把抒披押抽拂拇拐拗拙招拯捉捌捏捐据掘揆提揖握摺撮撰操擢攫散昔汞熹燕盂磬肯芽苛苦葫袁革靴鞋鞍鞠鞫鞭馨魂鼓',
    #魂去云
    #非型拉魂
    ##示
  'ABA': '咸唇在威左感戌戚茯茱荷莉莪萎萸董藜蜃蹙辰辱',
    #辱辰左
  'ABB': '仄匠原愿花芹荏薇雁',
    #原仄
  'ABC': '丈不丕匏厥否大太奄奇奈奎奔套奢巫彬想懋戍攀木本札朴机朽杆杉李杏材村杓杖杜杞杭杯杰杳杵杷松板枇枉枋析枕林枚枝枯枳枷枸柄柏柑柚柝柩柯柱柳栓栖校株核根格桁桂桃桎桐桓桔桶梅梏梓梗梢梧梭梯械梳梵棉棋棍棒棕棚森棹棺椅植椎椒椰椽椿楔楚楞楠楫楮楷楸楹榕榛榜榧榴榻槁槌槐槽槿樊樗樟模樵樽橄橘橙橡檀檄檎歪灰焚爽犬瓠相禁艾芥芬茶菜蕃蕉述麓',
    #奇丈不大
  'ABD': '兀列匹厄厘厚友右夏存尤布戊成敬斫有死殃殄殆殉殊殖烈百盛石砂砒砥砧破硅硝硫硬硼碇碌碎碑碗碣磁磅磊磋礁粲而耐臧芍芟苑苞苟茗荀荻菊萄葡蓬蔡薛藤裂警豕逐郁雄面餐',
    #列死友厄
    #辱原奇列
    ##石
  'ACA': '救求芒芳茨荒菩萃蒡蒿蓄蓑蔗薪逑',
    #芳求
  'ACB': '平蔽',
    #蔽
  'ACC': '范茫莎莞菅萍萱落蒲蓉薄藩藻',
    #落范
  'ACD': '勃壑睿索芝芯蒙雪零雷雹需霆震霓霖霜霞霰露霹',
    #索
    #芳蔽落索
    ##求
  'ADA': '乾事五克兢再凸剌副剽募匣卓占古可吏吾哥墓夷妻巨幕惑惠慕或戟故整敷斡暮更曹朝束栗歌熙瓢甄甫直矗票粟翰胡臣芭苒苗英茵草莫菖菰萌葛葺蔑蔓蔚蔬薨薯融要覃覆豆豌辜逋逗速逼遭',
    #吾故五古
  'ADB': '万丙刺彪戈棘比牙皆茄茹菌虎虐虔虞西遽邪酉酊酌配酎酢酩酪酬酵酷酸醇醉醋醍醒醯醴醵雅',
    #邪牙
  'ADC': '到南支柬翅至致臻苔苡茅葵蓼雨',
    #致支到至
  'ADD': '互切屯瓦茴蒸',
    #互切瓦
    #吾邪致互
    ##牙
    ##示石求牙
  'BAA': '丘乍乖乘仁仕佳佶侍供俳俸借傲僖先兵制剩午告垂壬失岳年廷我手拜智朱段毛牛牝牡牧物牲特生甥看矢知矩短矮缶缸缺罐舞迭造邱雉',
    #知失先乍仁
  'BAB': '仗伏休佐佑佰例侑俺倚僚利升和夭委季愁梨犁禾秀私秋科秒秕秘租秤秧秩移稀程稍稔稗稚稠稷稻稼稽稿穆穗穰竹透香馥魏黍黎',
    #秀禾竹升
  'BAC': '付儒竺竿笏笑笙笛笞笠符第等筋筌筏筐筑筒答策筮筵箔箕算箝管箭箱箴箸篁篆篇簇簧簪簿籍纂',
    #笑付
  'BAD': '乞代伍伎伐何使便倒倬偃偕做傅僭刮岱延憩敏毓熏片版牌牒秉繁臼臾舅舌袋重黛鼠',
    #敏版片乞
    #知秀笑敏
    ##禾
  'BBA': '仟件任佚作侏侮俄倪倭后征待徒徘徙恁悠攸斤斥欣盾行街衙近逅遁',
    #任斤后
  'BBB': '役徇徐御徨循衡',
    #徐
  'BBC': '价伶俗彷往愆爪爬衍',
    #往俗
  'BBD': '仇仰伯低佩侈修傀像化反彼徊律後得微徽所殷瓜磐舟航舫般舵舶舷船艇衢返',
    #所船
    #任徐往所
    ##瓜
  'BCA': '仝企伉位住余依信俯倍停傍兆全兮合命尖希愈拿斜焦盒翕肴舍舒逃途逾金集',
    #全命金
  'BCB': '乎介伴佯俎倦僧劣坐少悉斧欲父爻番省谷釉釜雀',
    #谷乎介少父
  'BCC': '乳今令受含奚妥孚彩念爰爵禽舜衾豹豺貂貊貌采食',
    #念乳
  'BCD': '乏偏公凶分忿瓮盆翁',
    #翁公乏
    #全谷念翁
    ##金
  'BDA': '仔仲伊伸伺佃但佛侃侯侵促俚保候倡倨假偈健偶僻儡兜匍匐卑印危周堡夙射帛息昏月朋服朕朦氏泉用白的皇皎皓睾禹肋肌肛肝股肢肥肪肱肺胎胚胛胞胱胴胸脂脆脯脾腋腑腔腕腥腰腱腹腺腿膀膈膊膜膝膣膨膳臆自臭血豚身躬迫追遑邀邸阜雕鬼魁魃魄魅鼻',
    #朋
  'BDB': '仍伽催凰刎勿匈卯卿忽斛欠犯狂狄狎狐狗狙狡狩狸狼猊猖猛猜猝猥猩猾猿獗疑肄蟹角解邂',
    #狼犯忽勿欠角
  'BDC': '丸丹久似俊俑俟冬凡勺卵及各名咎夕外多孵怨桀灸炙然留祭舛逢',
    #留冬久凡勺夕
  'BDD': '他免勉勾包句向急旨旬旭甸系胤色象迎逸',
    #急勾包象免
    #朋狼留急
    ##色
    ##禾瓜金色
  'CAA': '主冽凄凌燮言',
    #凌
  'CAB': '亢交亦六冷准凋凝卒吝咨唐夜奕姿席庄庇床序底店庚府庠度座庭庵庶康庸廉廊廓廖廛恣摩效文斌次瓷疝疥疫疲疳疵疸疹疼疽疾痂病症痍痒痔痕痘痛痢痰痴痼瘟瘠瘢瘤癌癖磨紊脊腐膺衣裔褒遮郊靡魔鹿麒麝麟麻麾',
    #庄麻
  'CAC': '剖卞商妾帝彰意新旁毅瓣立站竟章竣童竭端翊辛辣辨部靖音韶',
    #童
  'CAD': '亡亥亨享京亭亮充冶刻劾哀塾壅妄孰就市忘放敦敲方於施旅旋旌族旒旗望毫氓烹熟玄率畜盲羸育膏衰衷襄豪郭雍高',
    #忘
    #凌庄童忘
    ##商
  'CBA': '光兼判券前剪半卷叛善塑奠姜尊差恙慈拳料普朔煎猷益眷米粉粒粕粗粘粳粹精糊糖糟糠羊羌美羔羚羞羲羹翔耀迷送逆遂道遵酋首',
    #益首
  'CBB': '火灼炊炎炒炬炯炳炸烙烽焙煌煤煽熄熔燃燎燔燥燧爆',
    #炒
  'CBC': '堂州常掌棠裳',
    #常
  'CBD': '剃削弊弟敞曾甑瞥肖逍',
    #弟
    #益炒常弟
    ##首
  'CCA': '娑婆忖怖怯恃恢悖悚悟悼情惜惰慌憾懦斗染梁汀汁汐汕汗汝江池汨汪汰汲汽汾沁沂沃沈沌沐沙沛沫沮河沸油治沼沽沾沿泄泊泌泓法泗泛泡波泣泥注泯泳洋洌洗洙洛洞津洪洲洵活洽派流浙浚浣浦浩浪浮浴海浸涅消涌涎涓涕涯液涵淀淅淆淇淋淑淘淙淞淡淫淮深淳混淹添渚渠渡渣渤渥渫渭港游渺湃湍湖湘湛湟湫湮源溜溟溢溥溪溯溶溺滂滋滑滓滔滴漂漆漏演漕漠漫漱潘潭潮潺潼澄澎澳澹激濂濠濡濯瀑瀚瀛灌粱裟酒',
    #江
  'CCB': '怜性恂恤恪恬恰悔悸惚惟惶愉愎愧憔懈懊',
    #性
  'CCC': '忙恍悌悴慊慷憎憧',
    #忙
  'CCD': '割塞字宅宇守安宋完宏宕宗官宙定宛宜客宣室宥宦宰害宴宵家宸容宿寂寄寅密寇富寐寒寓寞察寡寤寥寨寮快怏怡怪恨悍悛惺愕慢慨憬案牢穴究穹空穿突窄窈窒窕窘窟蜜豁蹇邃',
    #宗
    #江性忙宗
    ##安
  'CDA': '冠房扁扇扈扉朗翩肇肩良遍雇',
    #肩
  'CDB': '冗初罕衫衲衿袂袍袒袖被裕裙裨裸褐褓褥褪褶襁襟',
    #罕
  'CDC': '之心必社祀祁祈祉祖祗祚祝神祠祥祺福禧禳',
    #社
  'CDD': '冥昶永',
    #冥
    #肩罕社冥
    ##冠
    ##商首安冠
  'DAA': '丑且具典冒冕剔助匙吐君吠呈味呵哄哮哺啄喇喊嗔嗜嗽嘲嘴嘶嚆墅孺尹峙嵌建影思愚承敢日旦早旱旺昆昊昌明易星映昧昨昭是昴晁晃晏晟晤晦晨景晴晶暄暇暑暖暗暝暴暹暾曙曜曝曦曰曲曳曷曼最果歇煦照田由甲申男町界畏畔畛略畦畸疏盟目眄眈眠眩眸眺眼睛睡睦睫睹瞑瞬瞰瞳瞻瞿累罪置署群聿胃胄艮虹蚊蚌蚓蚣蛇蛔蛙蛛蛟蛤蛭蛾蜂蜈蜘蝎蝗蝴蝶螂螟螳螺蟠蟾足趺趾跋跌跏跛距跣跨路跳踊踏踞踵蹂蹄蹈蹉蹊蹴蹶躁躇迪退逞逮遇遐遣那郡鄙里野量阮陟陵雎鼎',
    #明
  'DAB': '兄刷劈只叭叱史吃吟吩吸吹吻呱呼咆咐咫哈唯唾喉嗅嚼因困壁央嬖孜孤孱尉尸尺尻尼尾尿局居屈屋屎屑展屠履岩岸崎崖恩慰擘檗殿炭犀璧疋眉胥臀臂蛋蜀譬避陌隋',
    #尾尸
  'DAC': '咬咳哨啖啼喀喧嗟嗾噫孩忠罹迅',
    #咬
  'DAD': '串叩叫司吊同吼呻咀咽品哭唆唱喘喙喝嗣嗤器固圃圄孔孟岐己已巳巴巽帖幅弓引弗弘弛弦弧弱弼忌患愍改民疆粥蚩邑鄂阿陋陛隔',
    #忌弓
    #明尾咬忌
    ##孔
  'DBA': '努女奴奸好如妃妊妓妖妙妨妹姆始姐姑姓姚姨姻娃娘娜娟娠娥娩娼婉婚婢媒媚媛嫁嫂嫉嫌嫡嫦嫩嬉孀屹峨巍帑帙弩怒恕收絮阡附',
    #附阡
  'DBB': '阪',
    #阪
    #   assert not '阪' in 只读囗初步缩减囗共享汉字到笔顺码
    #   assert not '阪' in 只读囗平凡繁简囗共享汉字到笔顺码
    # ==>> 取消 本方案1_3_4_5__sp2用于3笔6bit！！
  'DBC': '刃囚囹岑崔幡忍水沓肉除隙',
    #除囚肉
  'DBD': '加召四孕峰崩嵬帆架皮盈袈迦邵降陶陷隆隍',
    #陷召
    #附阪除陷
    ##召
  'DCA': '函嵩幢弁戮羽翌翠翼防陪障',
    #翼防
  'DCB': '以允圈墨嵯牟癸登矣罔逡隘隧黔默黜',
    #允以
  'DCC': '叉崇蚤陀院',
    #蚤
  'DCD': '予勇台怠柔桑熊甬矛矜能豫通',
    #桑
    #翼允蚤桑
    ##勇
  'DDA': '凹回岫岬岷嵋帽幄幌彖阻限隅',
    #阻回
  'DDB': '丞毋陂',
    #丞
  'DDC': '峻嶝幻幼幽母畿骨骸髓',
    #幼
  'DDD': '剿巡'})
    #剿
    #阻丞幼剿
    ##母
    ##孔召勇母
    #
    #！！！已取消1_3_4_5__sp2，见上面『阪』！！！
    #[[1], [3], [4], [5]]#1_3_4_5__sp2
    #非型拉魂,辱原奇列,芳蔽落索,吾邪致互
    #知秀笑敏,任徐往所,全谷念翁,朋狼留急
    #凌庄童忘,益炒常弟,江性忙宗,肩罕社冥
    #明尾咬忌,附阪除陷,翼允蚤桑,阻丞幼剿
    #
    #非型拉魂,辱原奇列,芳蔽落索,吾邪致互;知秀笑敏,任徐往所,全谷念翁,朋狼留急;凌庄童忘,益炒常弟,江性忙宗,肩罕社冥;明尾咬忌,附阪除陷,翼允蚤桑,阻丞幼剿
    #非型拉魂辱原奇列芳蔽落索吾邪致互知秀笑敏任徐往所全谷念翁朋狼留急凌庄童忘益炒常弟江性忙宗肩罕社冥明尾咬忌附阪除陷翼允蚤桑阻丞幼剿
    #
    #前两笔:
    ##示石求牙,禾瓜金色,商首安冠,孔召勇母
    ##示石求牙禾瓜金色商首安冠孔召勇母
,
]



r'''[[[
#！！！已取消1_3_4_5__sp2，见上面『阪』！！！

#[[1], [3], [4], [5]]#1_3_4_5__sp2
#非型拉魂,辱原奇列,芳蔽落索,吾邪致互;知秀笑敏,任徐往所,全谷念翁,朋狼留急;凌庄童忘,益炒常弟,江性忙宗,肩罕社冥;明尾咬忌,附阪除陷,翼允蚤桑,阻丞幼剿
stroke_kind_groups____1_3_4_5__sp2 = ((1,), (3,), (4,), (5,),)
按横为零零撇为零一捺为一零折为一一忽略竖笔记为二进制数时前三笔的六十四个代表字 = '非型拉魂辱原奇列芳蔽落索吾邪致互知秀笑敏任徐往所全谷念翁朋狼留急凌庄童忘益炒常弟江性忙宗肩罕社冥明尾咬忌附阪除陷翼允蚤桑阻丞幼剿'
_64hzs___1_3_4_5__sp2 = frozenset(按横为零零撇为零一捺为一零折为一一忽略竖笔记为二进制数时前三笔的六十四个代表字)


按横为零零撇为零一捺为一零折为一一忽略竖笔记为二进制数时前两笔的十六个代表字 = '示石求牙禾瓜金色商首安冠孔召勇母'
_16hzs___1_3_4_5__sp2 = frozenset(按横为零零撇为零一捺为一零折为一一忽略竖笔记为二进制数时前两笔的十六个代表字)

def _test_universal__6bit_7bit():
    #see:def _test_universal__4bit_8bit():
    from nn_ns.CJK.cjk_subsets.共享汉字集笔顺码 import 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码


    assert not (_64hzs___1_3_4_5__sp2 & _16hzs___14_23__sp5)
    assert not (_64hzs___1_3_4_5__sp2 & _16hzs___1_3_4_2__sp5)
    assert len(_64hzs___1_3_4_5__sp2) == 64

    assert not (_16hzs___1_3_4_5__sp2 & _16hzs___14_23__sp5)
    assert not (_16hzs___1_3_4_5__sp2 & _16hzs___1_3_4_2__sp5)
    assert not (_16hzs___1_3_4_5__sp2 & _64hzs___1_3_4_5__sp2)

    from nn_ns.CJK.cjk_subsets.共享汉字集笔顺码 import 只读囗共享汉字到笔顺码, 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码, 只读囗初步缩减囗共享汉字到笔顺码, 只读囗平凡繁简囗共享汉字到笔顺码
    assert not '阪' in 只读囗初步缩减囗共享汉字到笔顺码
    assert not '阪' in 只读囗平凡繁简囗共享汉字到笔顺码
    print(_64hzs___1_3_4_5__sp2 - 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys())
        # {'冥', '原', '留', '剿', '阪', '庄', '念', ' 凌', '丞', '陷', '致', '谷'}
    print(_64hzs___1_3_4_5__sp2 - 只读囗初步缩减囗共享汉字到笔顺码.keys())
        # {'冥', '阪', '丞'}
    print(_64hzs___1_3_4_5__sp2 - 只读囗平凡繁简囗共享汉字到笔顺码.keys())
        # {'原', '留', '剿', '阪', '庄', '念', '凌', ' 陷', '致', '谷'}
    print(_64hzs___1_3_4_5__sp2 - 只读囗共享汉字到笔顺码.keys())

    assert _64hzs___1_3_4_5__sp2 <= 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys()
    assert _16hzs___1_3_4_5__sp2 <= 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys()

if __name__ == "__main__":
    _test_universal__6bit_7bit()

#]]]'''




#[[1, 4], [2, 3]]#14_23__sp5
#泣汗江洪,浮浴沙派,廖唐廉床,底店府膺;捧扶持描,授扮折拙,茫芋苔茸,草芥芹花;暗旱是最,昌晃曷易,釜坐企斧,肖竹敞盆;信位停俯,佳佐佑欣,伶件俗价,伯修循催
stroke_kind_groups____14_23__sp5 #defined!
_按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字 = '泣汗江洪浮浴沙派廖唐廉床底店府膺捧扶持描授扮折拙茫芋苔茸草芥芹花暗旱是最昌晃曷易釜坐企斧肖竹敞盆信位停俯佳佐佑欣伶件俗价伯修循催'

__按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字 = (_按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字
    #.translate('廖膺曷釜', '廊刑昭忿')
    #.translate('床折暗俯佑欣价修', '度拍曜偏供僧侃徙')
    .translate(str.maketrans('廖膺曷釜' '床折暗俯佑欣价修', '廊刑昭忿' '度拍膀偏供僧蜀悠'))
)
#print(__按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字)
按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字 = '泣汗江洪浮浴沙派廊唐廉度底店府刑捧扶持描授扮拍拙茫芋苔茸草芥芹花膀旱是最昌晃昭易忿坐企斧肖竹敞盆信位停偏佳佐供僧伶件俗蜀伯悠循催'
assert 按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字 == __按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字
_64hzs___14_23__sp5 = frozenset(按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字)

def _test_universal__6bit_7bit():
    #see:def _test_universal__4bit_8bit():
    from nn_ns.CJK.cjk_subsets.共享汉字集笔顺码 import 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码


    assert not (_64hzs___14_23__sp5 & _16hzs___14_23__sp5)
    assert not (_64hzs___14_23__sp5 & _16hzs___1_3_4_2__sp5)
    assert len(_64hzs___14_23__sp5) == 64


    from nn_ns.CJK.cjk_subsets.共享汉字集笔顺码 import 只读囗共享汉字到笔顺码, 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码, 只读囗初步缩减囗共享汉字到笔顺码, 只读囗平凡繁简囗共享汉字到笔顺码
    #print(_64hzs___14_23__sp5 - 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys())
        # {'折', '曷', '价', '暗', '釜', '佑', '膺', '俯', '欣', '床', '廖', '修'}
    #print(_64hzs___14_23__sp5 - 只读囗初步缩减囗共享汉字到笔顺码.keys())
        # {'曷', '釜', '膺', '廖'}
        # {'咀'}
        # {'曜', '徙', '侃'}
        # {'暄', '倭'}
        # \<[曷釜膺廖]
    #廖-->廊
    #膺-->刑
    #曷-->昭
    #釜咀-->忿




    #print(_64hzs___14_23__sp5 - 只读囗平凡繁简囗共享汉字到笔顺码.keys())
        # {'折', '价', '暗', '佑', '俯', '欣', '床', '修'}
        # \<[折价暗佑俯欣床修]
    #床-->度
    #折-->拍推抄
    #暗曜暄-->膀
    #俯-->偏
    #佑-->供
    #欣-->僧
    #价侃倭-->蜀
    #修徙-->悠


        #
    #print(_64hzs___14_23__sp5 - 只读囗共享汉字到笔顺码.keys())

    assert _64hzs___14_23__sp5 <= 只读囗平凡繁简囗初步缩减囗共享汉字到笔顺码.keys()

if __name__ == "__main__":
    _test_universal__6bit_7bit()


