
##section##
##data##
r'''
py script/pre_hz_decomp.py -o ~/tmp/笔顺码分解.txt -f
    view /storage/emulated/0/0my_files/tmp/笔顺码分解.txt

py script/pre_hz_decomp.py --_tmp_call 1 -o ~/tmp/笔顺码分解_tmp_call.txt -f
    view /storage/emulated/0/0my_files/tmp/笔顺码分解_tmp_call.txt
      TODO 单字 代表 部件 以省略 【】〖〗
      康基、笔触 与 cjk字符 不同。vim 不能将他们的混合当作标识。
    py script/pre_hz_decomp.py --_tmp_call 2 > /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/output/pre_hz_decomp.py.out/部件的单字符代表.txt


view /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/RMQ/make_SA_LCP.py
view ../../python3_src/nn_ns/CJK/CJK_data/汉字繁简.py
view ../../python3_src/nn_ns/CJK/CJK_data/汉字笔顺.py
view ../../python3_src/nn_ns/CJK/CJK_data/output/handle_现代常用字部件表.py.out/现代常用字部件及部件名称规范_GF0014_2009_main_result.json.txt

def make_SA_LCP(array, *, alphabet_size=None, LCP=True
        , make_RMQ=None
        , table=None
        , handle_if_basic_case=None
        , compress=True
        , array_element_transform=None
        , array_slice_or_range=None
        ):
    :: [UInt] -> (SA, LCP)
    SA - suffix array of input
    LCP - lengths of longest common prefix of neighbor suffices in SA






===============
py script/pre_hz_decomp.py -o ~/tmp/笔顺码分解.txt -f
    42.4 MB

##part fmt regex##
    (汉字?/其他简繁字?/部件名?)

交 容 比
##snippet of output##
2:>,(//竖),(丨u4E28h//),(亅u4E85h//)=>
    =======

12:>,(丁u4E01h//丁),(//可字框),(十u5341h//十),(丅u4E05h//)=>
    ;1:>,(一u4E00h//横【一】)
    ;2:>,(//竖),(丨u4E28h//),(亅u4E85h//)
    =======

13:>,(厂u5382h/厰u53B0h庵u5EB5h廠u5EE0h/厂),(//夏字头),(//左字框),(丆u4E06h//),(uE816h//),(𠂇u20087h//)=>
    ;1:>,(一u4E00h//横【一】)
    ;3:>,(//撇),(丿u4E3Fh//)
    =======

15:>,(//号字底),(七u4E03h//七),(//区字框),(匚u531Ah//),(匸u5338h//),(丂u4E02h//)=>
    ;1:>,(一u4E00h//横【一】)
    ;5:>,(乙u4E59h//横折弯钩【乙】),(//横钩),(//横折),(//横钩),(//竖折),(//竖弯钩),(乛u4E5Bh//),(乚u4E5Ah//),(uE818h//),(uE819h//),(𠃊u200CAh//),(𠃋u200CBh//),(𠃌u200CCh//),(𠃍u200CDh//),(𠃑u200D1h//),(𠄌u2010Ch//),(𠄎u2010Eh//),(𡿨u21FE8h//)
    =======

34:>,(八u516Bh//八),(人u4EBAh//人),(入u5165h//入),(乂u4E42h//艾字底【乂】yi4),(㐅u3405h//),(𠆢u201A2h//)=>
    ;3:>,(//撇),(丿u4E3Fh//)
    ;4:>,(//点),(丶u4E36h//),(乁u4E41h//),(乀u4E40h//)
    =======

413434:>,(交u4EA4h//)=>
    ;1:>,(一u4E00h//横【一】)
    ;3:>,(//撇),(丿u4E3Fh//)
    ;4:>,(//点),(丶u4E36h//),(乁u4E41h//),(乀u4E40h//)
    ;13:>,(厂u5382h/厰u53B0h庵u5EB5h廠u5EE0h/厂),(//夏字头),(//左字框),(丆u4E06h//),(uE816h//),(𠂇u20087h//)
    ;34:>,(八u516Bh//八),(人u4EBAh//人),(入u5165h//入),(乂u4E42h//艾字底【乂】yi4),(㐅u3405h//),(𠆢u201A2h//)
    ;41:>,(//冰字旁【两点水】),(//玄字头),(冫u51ABh//),(亠u4EA0h//)
    ;43:>,(//倒八),(//刀中),(丷u4E37h//)
    ;134:>,(大u5927h//大),(//共字底),(丈u4E08h//丈)
    ;343:>,(乊u4E4Ah//)
    ;413:>,(广u5E7Fh/広u5E83h庵u5EB5h廣u5EE3h/广)
    ;434:>,(义u4E49h/義u7FA9h/义)
    ;3434:>,(父u7236h//父),(从u4ECEh/従u5F93h從u5F9Eh/),(爻u723Bh//),(仌u4ECCh//)
    ;4134:>,(六u516Dh//六),(//率字腰),(文u6587h//文)
    =======

4453434251:>,(容u5BB9h//)=>
    ;1:>,(一u4E00h//横【一】)
    ;2:>,(//竖),(丨u4E28h//),(亅u4E85h//)
    ;3:>,(//撇),(丿u4E3Fh//)
    ;4:>,(//点),(丶u4E36h//),(乁u4E41h//),(乀u4E40h//)
    ;5:>,(乙u4E59h//横折弯钩【乙】),(//横钩),(//横折),(//横折钩),(//竖折),(//竖弯钩),(乛u4E5Bh//),(乚u4E5Ah//),(uE818h//),(uE819h//),(𠃊u200CAh//),(𠃋u200CBh//),(𠃌u200CCh//),(𠃍u200CDh//),(𠃑u200D1h//),(𠄌u2010Ch//),(𠄎u2010Eh//),(𡿨u21FE8h//)
    ;25:>,(//同字框),(冂u5182h//)
    ;34:>,(八u516Bh//八),(人u4EBAh//人),(入u5165h//入),(乂u4E42h//艾字底【乂】yi4),(㐅u3405h//),(𠆢u201A2h//)
    ;43:>,(//倒八),(//刀中),(丷u4E37h//)
    ;44:>,(//冬字底【两点】)
    ;45:>,(//秃宝盖),(//言旁),(冖u5196h//),(讠u8BA0h/訁u8A01h/)
    ;51:>,(刁u5201h//刁)
    ;53:>,(刀u5200h//刀),(力u529Bh//力),(乃u4E43h/廼u5EFCh迺u8FFAh/乃)
    ;251:>,(口u53E3h//口),(囗u56D7h//围字框【囗】wei2)
    ;342:>,(个u4E2Ah/個u500Bh箇u7B87h/个),(𠆤u201A4h//)
    ;343:>,(乊u4E4Ah//)
    ;425:>,(门u95E8h/門u9580h/门)
    ;434:>,(义u4E49h/義u7FA9h/义)
    ;445:>,(//宝盖),(宀u5B80h//)
    ;534:>,(飞u98DEh/飛u98DBh/飞),(刃u5203h//刃),(//畏字底),(刄u5204h//),(乆u4E46h//)
    ;3434:>,(父u7236h//父),(从u4ECEh/従u5F93h從u5F9Eh/),(爻u723Bh//),(仌u4ECCh//)
    ;4251:>,(闩u95E9h/閂u9582h/)
    ;4534:>,(认u8BA4h/認u8A8Dh/),(㓁u34C1h//)
    ;34251:>,(㕣u3563h//)
    ;44534:>,(穴u7A74h//穴)
    ;3434251:>,(谷u8C37h/榖u6996h穀u7A40h/谷)
    =======

#######１４３
1535:>,(旡u65E1h//既字边【旡】ji4),(比u6BD4h//),(兂u5142h//)=>
    ;15:>,(//号字底),(七u4E03h//七),(//区字框),(匚u531Ah//),(匸u5338h//),(丂u4E02h//)
    ;35:>,(匕u5315h//匕),(//尔字头),(//风省),(几u51E0h/幾u5E7Eh/几),(九u4E5Dh//九),(//句字框),(儿u513Fh/兒u5152h/儿),(//负字头),(//周字框),(勹u52F9h//),(uE81Ch//),(𠂊u2008Ah//),(𠘨u20628h//),(𠤎u2090Eh//)
    ;53:>,(刀u5200h//刀),(力u529Bh//力),(乃u4E43h/廼u5EFCh迺u8FFAh/乃)
    ;153:>,(万u4E07h/萬u842Ch/万),(//尧字头)
    ;535:>,(劜u529Ch//)
    =======

#'''





##section##

from collections import defaultdict
from nn_ns.RMQ.make_SA_LCP import make_SA_LCP
from nn_ns.CJK.CJK_data.汉字繁简 import (
    简繁字对集
        ,繁体字到简体字串
        ,简体字到繁体字串
    )
from nn_ns.CJK.CJK_data.汉字笔顺 import 汉字到笔顺码

from nn_ns.CJK.CJK_data.现代常用字部件及部件名称规范_GF0014_2009 import(
        现代常用字部件及部件名称规范_GF0014_2009_部件完整属性列表
        ,现代常用字部件笔画序检索表_笔画数到部件名列表
        )

def mk_汉字到繁简字串(
        繁体字到简体字串
        =繁体字到简体字串
        ,简体字到繁体字串
        =简体字到繁体字串
        ):
    d = {**简体字到繁体字串}
    for 繁, 简体字串 in 繁体字到简体字串.items():
        m = d.get(繁, "")
        m += 简体字串
        d[繁] = m
    dd = {}
    for 字, 串 in d.items():
        s = set(串)
        s.discard(字)
        串 = ''.join(sorted(s))
        dd[字] = 串
    return dd
def mk_部件名到属性(
        属性列表 = 现代常用字部件及部件名称规范_GF0014_2009_部件完整属性列表
    ):
    d = {}
    for 属性 in 属性列表:
        部件名 = 属性["部件名"]
        d[部件名] = 属性
    assert len(属性列表) == len(d)
    return d
def mk_笔顺码到汉字或部件名列表(
        属性列表 = 现代常用字部件及部件名称规范_GF0014_2009_部件完整属性列表
    ):
    #bug:笔顺码到汉字或部件名列表
    #   汉字 /-\ 部件名 = {竖,撇,点}
    #   笔顺码到汉字或部件名列表带前缀
    #       h汉字, m部件名
    #d = {}
    d = defaultdict(list)
    def add(笔顺码, 汉字或部件名):
        #ls = d.setdefault(笔顺码, [])
        ls = d[笔顺码]
        ls.append(汉字或部件名)

    汉字到成字部件部件名 = {}
    for 属性 in 属性列表:
        部件名 = 属性["部件名"]
        笔顺码 = 属性["笔画顺序"]
        add(笔顺码, 部件名)

        may_hz = 属性["字"]
        if may_hz:
            汉字 = may_hz
            汉字到成字部件部件名[汉字] = 部件名
            m = 汉字到笔顺码.get(汉字)
            if m:
                assert m == 笔顺码

    for 汉字, 笔顺码 in 汉字到笔顺码.items():
        m = 汉字到成字部件部件名.get(汉字)
        if not m:
            add(笔顺码, 汉字)

    d = dict(d)
    return d


##section##

def 笔顺码排序(笔顺码列):
    return sorted(笔顺码列, key=lambda x: (len(x), x))


def 分解笔顺码2(笔顺码列):
    ps = []
    for ds in 笔顺码列:
        n = len(ds)
        ps.append((ds, ds))
        ds_ = ds+"6"
        for i in range(1,n):
            suffix_ = ds_[i:]
            assert len(suffix_) >= 2
            ps.append((suffix_, ds))
    ps.sort()
    d = defaultdict(set)
    for i, (ds_or_suffix_, ds) in enumerate(ps):
        if ds_or_suffix_ is ds:
            for j in range(i+1, len(ps)):
                (_suffix, _ds) = ps[j]
                if _suffix.startswith(ds):
                    d[_ds].add(ds)
                else:
                    break
    d = {ds: 笔顺码排序(dss) for ds, dss in d.items()}
    return d


def 笔顺码列字节串化(笔顺码列):
    return bytes(_笔顺码列字节串化(笔顺码列))
def _笔顺码列字节串化(笔顺码列):
    for 笔顺码 in 笔顺码列:
        yield 0
        yield from map(int, 笔顺码)


def 分解笔顺码1(笔顺码列字节串):
    raise bug - r"""
    solved: by 分解笔顺码2()
        #here!!! "6" let suffix_ must after (ds'==suffix_[:-1])
        n = len(ds)
        ps.append((ds, ds))
        ds_ = ds+"6"
        for i in range(1,n):
            suffix_ = ds_[i:]
            assert len(suffix_) >= 2
            ps.append((suffix_, ds
    why?
        ordered:
        [0]120150...
        [1]20150... #before 020
        [0]202...
12:(丁u4E01h//丁),(//可字框),(十u5341h//十),(丅u4E05h//)=>;1:(一u4E00h//横【一】)
13:(厂u5382h/厰u53B0h庵u5EB5h廠u5EE0h/厂),(//夏字头),(//左字框),(丆u4E06h//),(uE816h//),(𠂇u20087h//)=>;1:(一u4E00h//横【一】)
15:(//号字底),(七u4E03h//七),(//区字框),(匚u531Ah//),(匸u5338h//),(丂u4E02h//)=>;1:(一u4E00h//横【一】);5:(乙u4E59h//横折弯钩【乙】),(//横钩),(//横折),(//横折钩),(//竖折),(//竖弯钩),(乛u4E5Bh//),(乚u4E5Ah//),(uE818h//),(uE819h//),(𠃊u200CAh//),(𠃋u200CBh//),(𠃌u200CCh//),(𠃍u200CDh//),(𠃑u200D1h//),(𠄌u2010Ch//),(𠄎u2010Eh//),(𡿨u21FE8h//)
    #"""

    bs = 笔顺码列字节串
    (SA, LCP) = make_SA_LCP(bs, alphabet_size=6)
    ls = 笔顺码列表 = []
    bs_begins = [] # bs_begin <: isuffix <: bs_idx
    sa_idc__begin = []
    ls_rng_lcp_pairs = [] # ls_rng, ls_idx, [((0, 0), 0)]
    #ls_idx_sz_pairs__online = []
    #sz2ls_idc__online = {}
    ls_idc__online = []
        # ls[ls_idc__online[i]] is_prefix_of ls[ls_idc__online[i+1]]

    def update_ls_rng_lcp_pairs():
        if len(sa_idc__begin) >= 2:
            last_lcp = min(len(ls[-2]), min(LCP[sa_idx] for sa_idx in range(*sa_idc__begin[-2:])))
        else:
            assert sa_idc__begin
            assert len(ls) == 1
            last_lcp = 0
            ls_end = 0
            ls_rng_lcp_pairs.append(((None, ls_end), last_lcp))
            return

        assert ls_rng_lcp_pairs
        assert last_lcp == lcp_between_pre_bs_begin_and_curr_isuffix
        ls_end = len(ls) - 1
        ls_begin = ls_rng_lcp_pairs[-1][0][-1]
        assert ls_begin + 1 == ls_end

        while ls_rng_lcp_pairs:
            if ls_rng_lcp_pairs[-1][-1] < last_lcp:
                break
            ((ls_begin, _), _) = ls_rng_lcp_pairs.pop()
        ls_rng_lcp_pairs.append(((ls_begin, ls_end), last_lcp))

    lcp_between_pre_bs_begin_and_curr_isuffix = 0

    def isuffix2this_bs_begin(isuffix):
        bs_idx = isuffix
        while bs_idx and bs[bs_idx-1]:
            bs_idx -= 1
        this_bs_begin = bs_idx
        return this_bs_begin
    def isuffix2this_bs_end(isuffix):
        bs_idx = isuffix
        may_bs_end = bs.find(0, bs_idx)
        if may_bs_end < 0:
            bs_end = len(bs)
        else:
            bs_end = may_bs_end
        this_bs_end = bs_end
        return this_bs_end
    #bs_begin2ls_idc = {}
    bs_begin2ls_idc = defaultdict(set)
    def _adds(bs_begin, ls_idc):
        #s = bs_begin2ls_idc.setdefault(bs_begin, set())
        s = bs_begin2ls_idc[bs_begin]
        s.update(ls_idc)

    #for isuffix, lcp in zip(SA, LCP):
    for sa_idx, isuffix in enumerate(SA):
        assert len(ls) == len(bs_begins) == len(sa_idc__begin)
        if not bs[isuffix]: continue

        tail_bs_begin = isuffix
        bs_end = isuffix2this_bs_end(isuffix)
        tail_sz = bs_end - tail_bs_begin
        assert tail_sz > 0
        if lcp_between_pre_bs_begin_and_curr_isuffix == 0:
            pass
        else:
            assert sa_idx > 0
            lcp_between_pre_bs_begin_and_curr_isuffix = min(LCP[sa_idx-1], lcp_between_pre_bs_begin_and_curr_isuffix)
            while ls_idc__online:
                last_online_sz = len(ls[ls_idc__online[-1]])
                if last_online_sz > lcp_between_pre_bs_begin_and_curr_isuffix:
                    ls_idc__online.pop()
                else:
                    break

            this_bs_begin = isuffix2this_bs_begin(isuffix)

            _adds(this_bs_begin, ls_idc__online)

        if isuffix and not bs[isuffix-1]:
            #begin of 笔顺码
            bs_begin = tail_bs_begin
            sz = tail_sz
            assert sz > 0

            ls_idx = len(ls)
            ls.append(bs[bs_begin:bs_end])
            bs_begins.append(bs_begin)
            sa_idc__begin.append(sa_idx)

            update_ls_rng_lcp_pairs()
            #ls_idx_sz_pairs__online.append((ls_idx, sz))
            if ls_idc__online:
                assert ls[-1].startswith(ls[ls_idc__online[-1]])
            ls_idc__online.append(ls_idx)
            lcp_between_pre_bs_begin_and_curr_isuffix = sz

    def lift(us):
        z = ord('0')
        return ''.join(chr(z+i) for i in us)
    bs_begin2ls_idc = dict(bs_begin2ls_idc)
    bs
    ls
    笔顺码分解 = {}
    for bs_begin, ls_idc in bs_begin2ls_idc.items():
        bs_end = isuffix2this_bs_end(bs_begin)
        us = bs[bs_begin:bs_end]
        uss = (ls[ls_idx] for ls_idx in ls_idc)
        us = lift(us)
        uss = sorted(map(lift, uss))
        笔顺码分解[us] = uss
    return 笔顺码分解








##section##
d2D = "零一二三四五六七八九"
d2D = "⓿⓪⓵⓶❶➀➂➂❷❷➊➌➌㍘㍙㍚"
d2D = "㍘㍙㍚㍛㍜㍝㍞㍟㍠㍡"
#U+FF00 全角字符
d2D = "０１２３４５６７８９"
assert len(d2D) == 10
assert len(set(d2D)) == 10
def uint2序号(i):
    return "".join(d2D[int(d)] for d in str(i))

def _hz2s(字):
    return f"{字}u{ord(字):X}h"

class 显示笔顺码分解:
    __s = set("竖撇点")
    def __init__(sf, *, 部件名到属性, 笔顺码到汉字或部件名列表, fout, 汉字到繁简字串, head0, end0, neck1, sep1, neck2, sep2, 单笔部件:bool):
        if 1:
            s = {n for n,v in 部件名到属性.items() if len(n)==1==v["笔画顺序"]}
            if not s <= sf.__s:
                raise data-logic-error
        sf.部件名到属性=部件名到属性
        sf.笔顺码到汉字或部件名列表=笔顺码到汉字或部件名列表
        sf.fout=fout
        sf.汉字到繁简字串=汉字到繁简字串
        sf.head0=head0
        sf.end0=end0
        sf.neck1=neck1
        sf.sep1=sep1
        sf.neck2=neck2
        sf.sep2=sep2
        sf.单笔部件=bool(单笔部件)
    def _show(sf, x):
        #maybe None!! sf.fout.write(x)
        print(x, file=sf.fout, end='')

    def 显示笔顺码分解(sf, 已排序笔顺码列表, 笔顺码分解):
        for i, 笔顺码 in enumerate(已排序笔顺码列表):
            笔顺码列表 = 笔顺码分解.get(笔顺码, [])
            序号 = uint2序号(i)
            #####
            sf._show(sf.head0.format(序号=序号))
            sf.显示单个笔顺码分解(笔顺码, 笔顺码列表)
            sf._show(sf.end0)

    def 显示单个笔顺码分解(sf, 笔顺码, 笔顺码列):
        sf.显示笔顺码(笔顺码)
        sf._show(sf.neck1) #("=>")
        for _笔顺码 in 笔顺码列:
            if not sf.单笔部件 and len(_笔顺码) == 1:
                continue
            sf._show(sf.sep1) #(";")
            sf.显示笔顺码(_笔顺码)
    def 显示笔顺码(sf, 笔顺码):
        汉字或部件名列表 = sf.笔顺码到汉字或部件名列表[笔顺码]
        zs = set()

        sf._show(笔顺码)
        sf._show(sf.neck2) #(":>")
        for 汉字或部件名 in 汉字或部件名列表:
            if (len(汉字或部件名)==1
                and not (汉字或部件名 in sf.__s and len(笔顺码) == 1)
                ):
                #bug:笔顺码到汉字或部件名列表
                #   汉字 /-\ 部件名 = {竖,撇,点}
                字 = 汉字或部件名
                部件名 = ""
                assert len(字) == 1
            else:
                部件名 = 汉字或部件名
                may = sf.部件名到属性.get(部件名)
                if not may:
                    raise KeyError(f"未知部件名: {部件名!r} from 笔顺码={笔顺码!r}")
                属性 = may
                字 = 属性["字"] #may be ""
                assert len(字) <= 1
            assert len(字) <= 1
            if 字 and 字 in zs:
                continue


            繁简字串 = sf.汉字到繁简字串.get(字, "")
            z = _hz2s(字) if 字 else ""
            zs = ''.join(map(_hz2s, 繁简字串))
            s = f"({z}/{zs}/{部件名})"
            sf._show(sf.sep2) #(",")
            sf._show(s)









##section##

def _main(fout=None, head0="", end0="\n", neck1="=>", sep1=";", neck2=":>", sep2=",", 单笔部件=True, _tmp_call=False):
    部件名到属性 = mk_部件名到属性()
    笔顺码到汉字或部件名列表 = mk_笔顺码到汉字或部件名列表()
    已排序笔顺码列表 = 笔顺码排序(笔顺码到汉字或部件名列表)

    if 0:
        笔顺码列字节串 = 笔顺码列字节串化(已排序笔顺码列表)
        笔顺码分解 = 分解笔顺码1(笔顺码列字节串)
    elif not _tmp_call:
        笔顺码分解 = 分解笔顺码2(已排序笔顺码列表)
    else:
        笔顺码分解 = {}
        pass

    assert len(已排序笔顺码列表) >= len(笔顺码分解)

    汉字到繁简字串 = mk_汉字到繁简字串()
    kw = dict(部件名到属性=部件名到属性, 笔顺码到汉字或部件名列表=笔顺码到汉字或部件名列表, fout=fout, 汉字到繁简字串=汉字到繁简字串, head0=head0, end0=end0, neck1=neck1, sep1=sep1, neck2=neck2, sep2=sep2, 单笔部件=单笔部件)
    sf = 显示笔顺码分解(**kw)
    if not _tmp_call:
        sf.显示笔顺码分解(已排序笔顺码列表, 笔顺码分解)
    else:
        s = {属性["笔画顺序"] for 属性 in 部件名到属性.values()}
        for 笔顺码 in 笔顺码排序(s):
            sf.显示笔顺码(笔顺码)
            sf._show('\n')


def main(args=None):
    import argparse
    from seed.io.may_open import may_open_stdin, may_open_stdout

    def int_f(s):
        print(f"call int_f({s!r})")
        return f"xxx{s}"
    parser = argparse.ArgumentParser(
            description="pre_hz_decomp:笔顺码分解"
        , epilog=""
        , formatter_class=argparse.RawDescriptionHelpFormatter
        )
    r"""
    parser.add_argument('-i', '--input', type=str, default=None
                        , help='input file path')
    #"""
    parser.add_argument('-o', '--output', type=str, default=None
                        , help='output file path')
    parser.add_argument('-e', '--encoding', type=str
                        , default='utf8'
                        , help='input/output file encoding')
    parser.add_argument('-f', '--force', action='store_true'
                        , default = False
                        , help='open mode for output file')
    #parser.add_argument('--_tmp_call', action='store_true'
    #                    , default = False
    #                    , help='helper for find non-hz char to ref 部件')
    parser.add_argument('--_tmp_call'
                        #, type=int_f
                        , type=int
                        #, type=str
                        , choices=[0,1,2]
                        #, choices='012'
                        #, choices=list('012')
                        , default = 0
                        , help='0:default; 1:helper for find non-hz char to ref 部件; 2:show char=部件 after mannally editting')

    args = parser.parse_args(args)
    encoding = args.encoding
    omode = 'wt' if args.force else 'xt'

    r"""
    may_ifname = args.input
    with may_open_stdin(may_ifname, 'rt', encoding=encoding) as fin:
    #"""

    may_ofname = args.output
    with may_open_stdout(may_ofname, omode, encoding=encoding) as fout:
        if args._tmp_call == 2:
            _handle_cmpnt2char(_cmpnt2char, fout=fout)
        elif 0 <= args._tmp_call <= 1:
            _main(head0="#######{序号}\n", end0="\n    =======\n\n", sep1="\n    ;", sep2=",", 单笔部件=False
                    ,fout=fout
                    ,_tmp_call=args._tmp_call==1
                    )
        else:
            raise ValueError(f"_tmp_call={args._tmp_call!r}")






##section##
##data##
r"""
_cmpnt2char
  找出 部件 字符(cjk字符，但非成字、非康基、非笔触)
    ^\S.*\/[^/)]\+)
    grep '^\S.*\/[^/)]\+)'  /storage/emulated/0/0my_files/笔顺码分解/0000.txt
    grep -h '^\S.*\/[^/)]\+)'  -r /storage/emulated/0/0my_files/笔顺码分解/ > ~/tmp/cmpnt2char.txt

    e /storage/emulated/0/0my_files/tmp/cmpnt2char.txt
      (\/\/[^/)]\+)
      do==>> _cmpnt2char:
        成字部件 skip
        ^[^\%x00-\%xFF]\(u[0-9A-F]\+h\)\?=\S\+$
        ^[?]\S\+$
        ^[1-5]\S\+$
        ^xx .*$
      bug:
      212514444:>,(//点)=>
      225441431:>,(//竖)=>
        #######４２５０
        212514444:>,(点u70B9h/點u9EDEh/)=>
        #######４２５７
        225441431:>,(竖u7AD6h/竪u7AEAh豎u8C4Eh/)=>
        #######１５４２７
        12143252343134:>,(撇u6487h//)=>

#"""

##data##
_cmpnt2char = r"""
1:>,(一u4E00h//横【一】)=>
2:>,(//竖),(丨u4E28h//),(亅u4E85h//)=>
丨=竖
3:>,(//撇),(丿u4E3Fh//)=>
丿=撇
4:>,(//点),(丶u4E36h//),(乁u4E41h//),(乀u4E40h//)=>
丶=点
5:>,(乙u4E59h//横折弯钩【乙】),(//横钩),(//横折),(//横折钩),(//竖折),(//竖弯钩),(乛u4E5Bh//),(乚u4E5Ah//),(uE818h//),(uE819h//),(𠃊u200CAh//),(𠃋u200CBh//),(𠃌u200CCh//),(𠃍u200CDh//),(𠃑u200D1h//),(𠄌u2010Ch//),(𠄎u2010Eh//),(𡿨u21FE8h//)=>
乛u4E5Bh=横钩
𠃍u200CDh=横折
𠃌u200CCh=横折钩
𠃊u200CAh=竖折
乚u4E5Ah=竖弯钩
11:>,(二u4E8Ch//二)=>
12:>,(丁u4E01h//丁),(//可字框),(十u5341h//十),(丅u4E05h//)=>
?可字框
13:>,(厂u5382h/厰u53B0h庵u5EB5h廠u5EE0h/厂),(//夏字头),(//左字框),(丆u4E06h//),(uE816h//),(𠂇u20087h//)=>
丆=夏字头
𠂇u20087h=左字框
15:>,(//号字底),(七u4E03h//七),(//区字框),(匚u531Ah//),(匸u5338h//),(丂u4E02h//)=>
丂=号字底
匚=区字框
21:>,(//卢字头),(丄u4E04h//)=>
?卢字头
22:>,(//临字旁),(//立刀),(刂u5202h//)=>
刂=立刀
?临字旁
23:>,(//师字旁)=>
?师字旁
24:>,(卜u535Ch/蔔u8514h/卜)=>
25:>,(//同字框),(冂u5182h//)=>
冂=同字框
31:>,(//卧人),(uE817h//),(𠂉u20089h//)=>
𠂉u20089h=卧人
32:>,(//乔字底),(//单立人),(亻u4EBBh//)=>
亻u4EBBh=单立人
?乔字底
33:>,(//反字框),(uE815h//),(𠂆u20086h//)=>
𠂆u20086h=反字框
34:>,(八u516Bh//八),(人u4EBAh//人),(入u5165h//入),(乂u4E42h//艾字底【乂】yi4),(㐅u3405h//),(𠆢u201A2h//)=>
35:>,(匕u5315h//匕),(//尔字头),(//风省),(几u51E0h/幾u5E7Eh/几),(九u4E5Dh//九),(//句字框),(儿u513Fh/兒u5152h/儿),(//负字头),(//周字框),(勹u52F9h//),(uE81Ch//),(𠂊u2008Ah//),(𠘨u20628h//),(𠤎u2090Eh//)=>
?周字框
𠂊u2008Ah=负字头
勹u52F9h=句字框
𠘨u20628h=风省
?尔字头
41:>,(//冰字旁【两点水】),(//玄字头),(冫u51ABh//),(亠u4EA0h//)=>
亠=玄字头
冫=冰字旁【两点水】
43:>,(//倒八),(//刀中),(丷u4E37h//)=>
?刀中
丷=倒八
44:>,(//冬字底【两点】)=>
?冬字底【两点】
45:>,(//秃宝盖),(//言旁),(冖u5196h//),(讠u8BA0h/訁u8A01h/)=>
冖=秃宝盖
讠=言旁
51:>,(刁u5201h//刁)=>
52:>,(//画字框),(卩u5369h//单耳【卩】jie2),(//节字底),(丩u4E29h//纠字边【丩】jiu1),(了u4E86h/瞭u77ADh/了),(//双耳),(阝u961Dh//),(凵u51F5h//)=>
?节字底
凵=画字框
阝=双耳
53:>,(刀u5200h//刀),(力u529Bh//力),(乃u4E43h/廼u5EFCh迺u8FFAh/乃)=>
54:>,(//以字旁),(//建之),(厶u53B6h//私字边【厶】si1),(//勇字头),(又u53C8h//又),(廴u5EF4h//),(乄u4E44h//),(uE81Eh//)=>
廴=建之
?勇字头
?以字旁
55:>,(//仓字底),(乜u4E5Ch//),(巜u5DDCh//),(uE81Dh//),(㔾u353Eh//)=>
㔾=仓字底
111:>,(三u4E09h/叁u53C1h/三)=>
112:>,(干u5E72h/乾u4E7Eh幹u5E79h榦u69A6h/干),(//举字底),(于u4E8Eh/於u65BCh/于),(亍u4E8Dh//)=>
?举字底
121:>,(工u5DE5h//工),(士u58EBh//士),(//提手),(土u571Fh//土),(扌u624Ch//)=>
扌=提手
122:>,(//贲字腰),(//草字头),(艹u8279h/艸u8278h/),(卄u5344h//)=>
艹=草字头
卄=贲字腰
123:>,(才u624Dh/纔u7E94h/才)=>
124:>,(寸u5BF8h/吋u540Bh/寸),(下u4E0Bh//下)=>
132:>,(//鼻字底),(//弄字底),(丌u4E0Ch//),(廾u5EFEh//)=>
廾=弄字底
丌=鼻字底
134:>,(大u5927h//大),(//共字底),(丈u4E08h//丈)=>
?共字底
135:>,(//尴字框),(兀u5140h//兀),(尢u5C22h//),(兀uFA0Ch//),(𡯁u21BC1h//)=>
尢u5C22h=尴字框
151:>,(//虐字底),(与u4E0Eh/與u8207h/与)=>
?虐字底
152:>,(//降下角),(㐄u3404h//),(㔿u353Fh//)=>
㐄=降下角
153:>,(万u4E07h/萬u842Ch/万),(//尧字头)=>
?尧字头
154:>,(弋u5F0Bh//代字边【弋】yi4),(夨u5928h//),(𠫓u20AD3h//)=>
211:>,(//北字旁),(上u4E0Ah//上)=>
?北字旁
233:>,(//步字底)=>
?步字底
234:>,(小u5C0Fh//小)=>
243:>,(//尚字头),(uE822h//)=>
?尚字头
251:>,(口u53E3h//口),(囗u56D7h//围字框【囗】wei2)=>
252:>,(巾u5DFEh//巾),(山u5C71h//山)=>
312:>,(千u5343h/韆u97C6h/千)=>
314:>,(//临右角)=>
?临右角
315:>,(乇u4E47h//托字边【乇】tuo1),(乞u4E5Eh//)=>
322:>,(川u5DDDh//川)=>
325:>,(//荒字底),(亿u4EBFh/億u5104h/)=>
?荒字底
332:>,(//双立人),(彳u5F73h//)=>
彳=双立人
333:>,(彡u5F61h//彡)=>
342:>,(个u4E2Ah/個u500Bh箇u7B87h/个),(𠆤u201A4h//)=>
351:>,(//印字旁)=>
?印字旁
353:>,(//黎右角),(//反犬旁),(犭u72ADh/犬u72ACh/)=>
犭=反犬旁
?黎右角
354:>,(//冬字头),(凡u51E1h//凡),(及u53CAh//及),(久u4E45h//久),(么u4E48h/幺u5E7Ah麼u9EBCh麽u9EBDh/么),(勺u52FAh//勺),(丸u4E38h//丸),(夕u5915h//夕),(夂u5902h//),(夊u590Ah//)=>
夂u5902h=冬字头
355:>,(//食旁),(饣u9963h/飠u98E0h/),(㐇u3407h//)=>
饣=食旁
412:>,(//将字旁),(丬u4E2Ch/爿u723Fh/)=>
丬=将字旁
413:>,(广u5E7Fh/広u5E83h庵u5EB5h廣u5EE3h/广)=>
415:>,(亡u4EA1h//亡)=>
425:>,(门u95E8h/門u9580h/门)=>
431:>,(//前字头),(䒑u4491h//)=>
䒑=前字头
432:>,(丫u4E2Bh//丫)=>
434:>,(义u4E49h/義u7FA9h/义)=>
441:>,(//三点水),(氵u6C35h//)=>
氵=三点水
442:>,(//竖心),(忄u5FC4h//)=>
忄=竖心
443:>,(//学字头)=>
?学字头
445:>,(//宝盖),(宀u5B80h//)=>
宀=宝盖
454:>,(之u4E4Bh//之),(//走之),(辶u8FB6h//)=>
辶=走之
511:>,(//录字头),(//雪字底),(彐u5F50h//)=>
?录字头
彐=雪字底
512:>,(//讯字边),(卂u5342h//)=>
卂=讯字边
513:>,(尸u5C38h/屍u5C4Dh/尸)=>
515:>,(弓u5F13h//弓),(己u5DF1h//己),(已u5DF2h//已),(巳u5DF3h//巳)=>
521:>,(卫u536Bh/衛u885Bh衞u885Eh/卫),(子u5B50h//子),(孑u5B51h//),(孒u5B52h//)=>
525:>,(也u4E5Fh//也)=>
531:>,(女u5973h//女)=>
533:>,(//杨字边)=>
?杨字边
534:>,(飞u98DEh/飛u98DBh/飞),(刃u5203h//刃),(//畏字底),(刄u5204h//),(乆u4E46h//)=>
?畏字底
541:>,(习u4E60h/習u7FD2h/习)=>
544:>,(叉u53C9h//叉)=>
551:>,(//绞丝旁),(马u9A6Ch/馬u99ACh/马),(//彝字头),(纟u7E9Fh/糸u7CF8h糹u7CF9h/),(彑u5F51h//)=>
彑=彝字头
纟=绞丝旁
553:>,(乡u4E61h/鄉u9109h鄕u9115h/乡)=>
554:>,(幺u5E7Ah/么u4E48h/幼字旁【幺】yao1)=>
555:>,(//巡字心),(巛u5DDBh//)=>
巛=巡字心
1112:>,(丰u4E30h/豐u8C50h酆u9146h/丰)=>
1113:>,(//寿字头)=>
?寿字头
1121:>,(//青字头),(王u738Bh//王),(//斜玉),(uE82Bh//),(𤣩u248E9h//)=>
𤣩u248E9h=斜玉
?青字头
1132:>,(井u4E95h//井),(开u5F00h/開u958Bh/开),(亓u4E93h//)=>
1134:>,(夫u592Bh/伕u4F15h/夫),(天u5929h//天)=>
1135:>,(无u65E0h/無u7121h/无),(元u5143h//)=>
1152:>,(韦u97E6h/韋u97CBh/韦)=>
1154:>,(云u4E91h/雲u96F2h/云),(专u4E13h/専u5C02h專u5C08h耑u8011h/专),(弌u5F0Ch//)=>
1213:>,(//老省),(耂u8002h//)=>
耂=老省
1215:>,(丐u4E10h//丐),(扎u624Eh/札u672Dh紥u7D25h紮u7D2Eh/),(圠u5720h//),(㐊u340Ah//),(㐋u340Bh//)=>
1221:>,(廿u5EFFh//廿),(//昔字头),(uE82Ch//)=>
?昔字头
1222:>,(//带字头)=>
?带字头
1234:>,(木u6728h//木),(朩u6729h//),(𣎴u233B4h//)=>
1251:>,(五u4E94h//五)=>
1252:>,(巿u5DFFh//肺字边【巿】fu2),(帀u5E00h//),(邒u9092h//)=>
1324:>,(不u4E0Dh//不)=>
1344:>,(犬u72ACh/犭u72ADh/犬),(太u592Ah//太),(𠀋u2000Bh//)=>
1354:>,(歹u6B79h//歹),(尤u5C24h//尤),(友u53CBh//),(厷u53B7h//)=>
1512:>,(车u8F66h/車u8ECAh/车)=>
1515:>,(巨u5DE8h/鉅u9245h钜u949Ch/巨)=>
1523:>,(牙u7259h//牙)=>
1525:>,(屯u5C6Fh//屯)=>
1534:>,(戈u6208h//戈)=>
1535:>,(旡u65E1h//既字边【旡】ji4),(比u6BD4h//),(兂u5142h//)=>
1551:>,(互u4E92h//互)=>
1554:>,(瓦u74E6h//瓦)=>
2121:>,(止u6B62h//止),(卝u535Dh//)=>
2134:>,(//足字底)=>
?足字底
2154:>,(攴u6534h//敲字边【攴】pu1)=>
2343:>,(少u5C11h//少)=>
2444:>,(//恭字底)=>
?恭字底
2511:>,(//冒字头),(日u65E5h//日),(曰u66F0h//曰),(//衰字腰),(//青字底),(冃u5183h//),(冄u5184h//)=>
?衰字腰
?青字底
?冒字头
2512:>,(中u4E2Dh//中)=>
2521:>,(//临下角),(円u5186h/圆u5706h/)=>
?临下角
2534:>,(贝u8D1Dh/貝u8C9Dh/贝),(内u5185h/內u5167h/内),(水u6C34h//水),(冈u5188h/岡u5CA1h/),(內u5167h/内u5185h/),(罓u7F53h//),(𠔿u2053Fh//)=>
2535:>,(见u89C1h/見u898Bh/见),(𦉪u2626Ah//)=>
2554:>,(//离字底),(禸u79B8h//)=>
禸=离字底
3112:>,(牛u725Bh//牛),(手u624Bh//手),(午u5348h//午)=>
3115:>,(毛u6BDBh//毛),(气u6C14h/気u6C17h氣u6C23h/气)=>
3121:>,(//告字头),(壬u58ECh//壬),(牜u725Ch//),(uE830h//),(𡈼u2123Ch//)=>
?告字头
3132:>,(升u5347h/昇u6607h陞u965Eh/升)=>
3134:>,(//反文),(夭u592Dh/殀u6B80h/夭),(攵u6535h//)=>
攵=反文
3154:>,(长u957Fh/長u9577h/长)=>
3215:>,(片u7247h//片),(//延字心)=>
?延字心
3312:>,(斤u65A4h/觔u89D4h/斤)=>
3324:>,(爪u722Ah//爪)=>
3434:>,(父u7236h//父),(从u4ECEh/従u5F93h從u5F9Eh/),(爻u723Bh//),(仌u4ECCh//)=>
3435:>,(仑u4ED1h/侖u4F96h崙u5D19h/仑),(尣u5C23h//),(乥u4E65h//),(𡯂u21BC2h//)=>
3443:>,(//爪头),(爫u722Bh//)=>
爫=爪头
3445:>,(今u4ECAh//今)=>
3511:>,(月u6708h//月【肉月】),(勻u52FBh/匀u5300h/)=>
3515:>,(氏u6C0Fh//氏)=>
3523:>,(//姊字边),(𠂔u20094h//)=>
𠂔u20094h=姊字边
3533:>,(勿u52FFh//勿)=>
3534:>,(风u98CEh/風u98A8h/风),(//旅下角),(欠u6B20h//欠),(//衣省),(勽u52FDh//),(匁u5301h//),(𠘰u20630h//),(𧘇u27607h//)=>
𧘇u27607h=衣省
?旅下角
3541:>,(丹u4E39h//丹),(匀u5300h/勻u52FBh/)=>
3544:>,(//夜下角),(//然左角)=>
?然左角
?夜下角
3545:>,(//鸟省)=>
?鸟省
3551:>,(乌u4E4Ch/烏u70CFh/乌)=>
3552:>,(卬u536Ch//昂字底【卬】ang2),(䢳u48B3h//)=>
3554:>,(殳u6BB3h//设字边【殳】shu1),(勾u52FEh//),(凤u51E4h/鳯u9CEFh鳳u9CF3h鴌u9D0Ch/),(厹u53B9h//)=>
4134:>,(六u516Dh//六),(//率字腰),(文u6587h//文)=>
?率字腰
4153:>,(方u65B9h//方)=>
4334:>,(火u706Bh//火)=>
4354:>,(为u4E3Ah/為u70BAh爲u7232h/为)=>
4412:>,(斗u6597h/閗u9597h闘u95D8h鬥u9B25h鬦u9B26h鬪u9B2Ah鬬u9B2Ch鬭u9B2Dh/斗)=>
4444:>,(//横四点),(灬u706Ch//)=>
灬=横四点
4513:>,(户u6237h/戶u6236h/户)=>
4524:>,(//示旁),(讣u8BA3h/訃u8A03h/),(礻u793Bh//),(㓀u34C0h//)=>
礻=示旁
4535:>,(冘u5198h//枕字边【冘】yin2),(讥u8BA5h/譏u8B4Fh/),(冗u5197h//),(uE838h//)=>
4544:>,(心u5FC3h//心)=>
5112:>,(//唐字心),(肀u8080h//),(丮u4E2Eh//)=>
肀=唐字心
5113:>,(//那字旁),(尹u5C39h//尹)=>
?那字旁
5134:>,(尺u5C3Ah/呎u544Eh/尺),(夬u592Ch//决字边【夬】guai4)=>
5211:>,(丑u4E11h/醜u919Ch/丑)=>
5213:>,(//眉字框),(爿u723Fh/丬u4E2Ch/爿)=>
?眉字框
5215:>,(巴u5DF4h//巴),(孔u5B54h//)=>
5344:>,(办u529Eh/辦u8FA6h/办),(刅u5205h//)=>
5452:>,(予u4E88h//予),(邓u9093h/鄧u9127h/)=>
5521:>,(毌u6BCCh/毋u6BCBh/贯字头【毌】guan4)=>
5524:>,(书u4E66h/書u66F8h/书)=>
11112:>,(//拜字边)=>
?拜字边
11134:>,(//春字头),(uE831h//),(𡗗u215D7h//)=>
𡗗u215D7h=春字头
11214:>,(玉u7389h//玉),(玊u738Ah//)=>
11221:>,(//寒字腰)=>
?寒字腰
11234:>,(末u672Bh//末),(示u793Ah//示),(未u672Ah//未)=>
11252:>,(击u51FBh/擊u64CAh/击),(邗u9097h//),(邘u9098h//)=>
11534:>,(//钱字边),(戋u620Bh/戔u6214h/)=>
戋=钱字边
12121:>,(正u6B63h//正)=>
12154:>,(去u53BBh//去),(払u6255h/拂u62C2h/)=>
12211:>,(甘u7518h//甘)=>
12215:>,(世u4E16h//世),(䒓u4493h//)=>
12341:>,(本u672Ch//本)=>
12344:>,(术u672Fh/朮u672Eh術u8853h/术)=>
12431:>,(//丧字头)=>
?丧字头
12534:>,(丙u4E19h//丙)=>
13251:>,(石u77F3h//石),(右u53F3h//)=>
13443:>,(//尞字头)=>
?尞字头
13534:>,(龙u9F99h/竜u7ADCh龍u9F8Dh/龙),(戊u620Ah//戊)=>
14312:>,(平u5E73h//平)=>
15234:>,(东u4E1Ch/東u6771h/东)=>
15534:>,(//拣字边),(戉u6209h//越字心【戉】yue4)=>
?拣字边
21124:>,(卡u5361h//卡)=>
21251:>,(凸u51F8h//凸),(占u5360h/佔u4F54h/)=>
21354:>,(//餐左角),(歺u6B7Ah//)=>
歺=餐左角
22431:>,(业u4E1Ah/業u696Dh/业)=>
24134:>,(//水底),(氺u6C3Ah//)=>
氺=水底
25111:>,(目u76EEh//目),(且u4E14h//且),(旦u65E6h//)=>
25112:>,(甲u7532h//甲),(申u7533h//申),(叶u53F6h/葉u8449h/),(叮u53EEh//),(曱u66F1h//)=>
25115:>,(电u7535h/電u96FBh/电),(号u53F7h/號u865Fh/),(𠮟u20B9Fh//)=>
25121:>,(田u7530h//田),(由u7531h//由)=>
25122:>,(//扁字心),(//典字头)=>
?典字头
?扁字心
25134:>,(史u53F2h//史),(央u592Eh//央),(只u53EAh/祇u7947h祗u7957h衹u8879h隻u96BBh/),(叭u53EDh//),(叺u53FAh//),(㕥u3565h//)=>
25151:>,(//官字底),(叼u53FCh//),(㠯u382Fh//)=>
㠯=官字底
25211:>,(冉u5189h//冉),(甴u7534h//),(亗u4E97h//)=>
25221:>,(//罗字头),(皿u76BFh//皿),(罒u7F52h//),(冊u518Ah/册u518Ch/),(䍏u434Fh//)=>
罒=罗字头
25251:>,(凹u51F9h//凹),(冋u518Bh//)=>
25351:>,(四u56DBh//四)=>
25545:>,(//骨字头)=>
?骨字头
31115:>,(//金旁),(钅u9485h/釒u91D2h/)=>
钅=金旁
31121:>,(生u751Fh//生),(玍u738Dh//)=>
31134:>,(失u5931h//失),(矢u77E2h//矢)=>
31211:>,(乍u4E4Dh//乍)=>
31234:>,(禾u79BEh//禾),(尓u5C13h//)=>
32111:>,(//段字旁),(仨u4EE8h//)=>
?段字旁
32121:>,(丘u4E18h//丘),(仕u4ED5h//),(仜u4EDCh//)=>
32511:>,(白u767Dh//白)=>
33124:>,(斥u65A5h//斥)=>
33544:>,(瓜u74DCh//瓜)=>
34312:>,(乎u4E4Eh//乎)=>
35112:>,(用u7528h//用)=>
35115:>,(甩u7529h//甩),(肊u808Ah//)=>
35234:>,(乐u4E50h/楽u697Dh樂u6A02h/乐),(尔u5C14h/爾u723Eh/)=>
35334:>,(匆u5306h//匆)=>
35351:>,(册u518Ch/冊u518Ah/册)=>
35352:>,(卯u536Fh//卯)=>
35451:>,(鸟u9E1Fh/鳥u9CE5h/鸟)=>
35453:>,(//留字头),(务u52A1h/務u52D9h/)=>
?留字头
41121:>,(主u4E3Bh//主),(冮u51AEh//)=>
41341:>,(//病字框),(疒u7592h//)=>
疒=病字框
41431:>,(立u7ACBh//立)=>
43112:>,(半u534Ah//半)=>
43134:>,(//益字头)=>
?益字头
44134:>,(头u5934h/頭u982Dh/头),(汃u6C43h//),(汄u6C44h//),(㲼u3CBCh//),(𣱿u23C7Fh//)=>
44534:>,(穴u7A74h//穴)=>
45234:>,(//衣旁),(衤u8864h//)=>
衤=衣旁
45434:>,(必u5FC5h//必),(议u8BAEh/議u8B70h/)=>
45534:>,(永u6C38h//永),(讱u8BB1h/訒u8A12h/)=>
51134:>,(//庚字心)=>
?庚字心
51154:>,(//即字旁)=>
?即字旁
51251:>,(司u53F8h//司)=>
51515:>,(民u6C11h//民)=>
51523:>,(//弟省)=>
?弟省
51532:>,(弗u5F17h//弗)=>
52252:>,(出u51FAh/齣u9F63h/出)=>
53254:>,(皮u76AEh//皮)=>
53544:>,(发u53D1h/発u767Ah發u767Ch髮u9AEEh/发)=>
54121:>,(//轻字边),(圣u5723h/聖u8056h/)=>
?轻字边
54334:>,(//登字头),(癶u7676h//)=>
癶=登字头
54523:>,(矛u77DBh//矛)=>
55414:>,(母u6BCDh//母)=>
55551:>,(丝u4E1Dh/絲u7D72h/丝)=>
111234:>,(耒u8012h//耒)=>
112153:>,(//敖字旁),(玏u738Fh//)=>
?敖字旁
121335:>,(老u8001h//老)=>
122111:>,(耳u8033h//耳)=>
122431:>,(亚u4E9Ah/亜u4E9Ch亞u4E9Eh/亚)=>
125125:>,(臣u81E3h//臣),(㐓u3413h//),(𦣝u268DDh//)=>
125134:>,(吏u540Fh//吏)=>
125211:>,(再u518Dh//再)=>
125221:>,(//要字头),(襾u897Eh//),(覀u8980h//)=>
覀=要字头
125234:>,(朿u673Fh//刺字旁【朿】ci4)=>
125351:>,(西u897Fh//西)=>
131534:>,(戌u620Ch//戌)=>
132511:>,(百u767Eh//百),(有u6709h//)=>
132522:>,(而u800Ch//而)=>
132534:>,(页u9875h/頁u9801h/页)=>
143134:>,(夹u5939h/夾u593Eh挟u631Fh挾u633Eh裌u88CCh/夹)=>
151534:>,(夷u5937h//夷)=>
154121:>,(至u81F3h//至)=>
154444:>,(//焉字底)=>
?焉字底
215315:>,(//虎字头),(虍u864Dh//)=>
虍=虎字头
251153:>,(曳u66F3h//拽字边【曳】ye4),(旫u65EBh//),(㫑u3AD1h//)=>
251214:>,(虫u866Bh/虺u867Ah蟲u87F2h/虫)=>
251221:>,(曲u66F2h/粬u7CACh麯u9EAFh麴u9EB4h/曲)=>
253434:>,(肉u8089h//肉),(网u7F51h/網u7DB2h/),(氼u6C3Ch//)=>
311212:>,(年u5E74h//年)=>
311234:>,(朱u6731h/硃u7843h/朱)=>
311252:>,(缶u7F36h//缶),(//制字旁)=>
?制字旁
312251:>,(舌u820Ch//舌)=>
312312:>,(竹u7AF9h//竹)=>
314314:>,(//竹头),(uE836h//),(𥫗u25AD7h//)=>
𥫗u25AD7h=竹头
321213:>,(乒u4E52h//乒)=>
321214:>,(乓u4E53h//乓)=>
321511:>,(臼u81FCh//臼)=>
323334:>,(//聚字底),(乑u4E51h//)=>
乑=聚字底
325111:>,(自u81EAh//自)=>
325151:>,(//追字心),(𠂤u200A4h//)=>
𠂤u200A4h=追字心
325221:>,(血u8840h//血)=>
325251:>,(向u5411h/嚮u56AEh曏u66CFh/向)=>
325341:>,(囟u56DFh/顖u9856h/囟)=>
331251:>,(后u540Eh/後u5F8Ch/后)=>
335115:>,(//殷字旁),(㐆u3406h//)=>
㐆=殷字旁
335414:>,(舟u821Fh//舟)=>
341534:>,(兆u5146h//兆)=>
344312:>,(伞u4F1Eh/傘u5098h繖u7E56h/伞)=>
353334:>,(//豕省)=>
?豕省
355112:>,(争u4E89h/爭u722Dh/争)=>
355215:>,(色u8272h//色)=>
413234:>,(亦u4EA6h//亦)=>
413534:>,(衣u8863h//衣),(次u6B21h//)=>
414313:>,(产u4EA7h/產u7522h産u7523h/产)=>
414325:>,(//商字头)=>
?商字头
414345:>,(//帝字头)=>
?帝字头
415334:>,(亥u4EA5h//亥),(㫃u3AC3h//)=>
431112:>,(羊u7F8Ah//羊)=>
431121:>,(//美字头),(uE83Ah//),(𦍌u2634Ch//)=>
𦍌u2634Ch=美字头
431134:>,(//卷字头),(关u5173h/関u95A2h闗u95D7h關u95DCh/),(uE843h//)=>
?卷字头
431234:>,(米u7C73h//米)=>
431523:>,(屰u5C70h//逆字心【屰】ni4)=>
434242:>,(州u5DDEh//州)=>
453534:>,(农u519Ch/農u8FB2h辳u8FB3h/农),(讽u8BBDh/諷u8AF7h/)=>
511112:>,(聿u807Fh//律字边【聿】yu4)=>
511534:>,(艮u826Eh//根字边【艮】gen4)=>
525341:>,(丞u4E1Eh//丞)=>
554234:>,(//绞丝底),(糸u7CF8h/纟u7E9Fh/)=>
糸=绞丝底
1211154:>,(//肆字旁),(坛u575Bh/墰u58B0h壇u58C7h壜u58DCh罈u7F48h罎u7F4Eh/),(抟u629Fh/摶u6476h/),(抎u628Eh//),(镸u9578h//)=>
镸=肆字旁
1213234:>,(赤u8D64h//赤)=>
1224313:>,(严u4E25h/厳u53B3h嚴u56B4h/严)=>
1225125:>,(//颐字旁)=>
?颐字旁
1241344:>,(求u6C42h//求)=>
1251124:>,(甫u752Bh//甫)=>
1251134:>,(更u66F4h//更)=>
1251221:>,(//曹字头),(亜u4E9Ch/亚u4E9Ah/)=>
?曹字头
1251234:>,(束u675Fh//束)=>
1251245:>,(//囊字头)=>
?囊字头
1251431:>,(豆u8C46h/荳u8373h/豆)=>
1253434:>,(两u4E24h/兩u5169h/两)=>
1253511:>,(酉u9149h//酉)=>
1254254:>,(丽u4E3Dh/麗u9E97h/丽)=>
1311534:>,(辰u8FB0h//辰)=>
1353334:>,(豕u8C55h//豕),(尨u5C28h//)=>
1431234:>,(来u6765h/來u4F86h/来)=>
2125341:>,(卤u5364h/滷u6EF7h鹵u9E75h/卤)=>
2511211:>,(里u91CCh/裏u88CFh裡u88E1h/里),(囯u56EFh/国u56FDh/),(㫔u3AD4h//)=>
2512512:>,(串u4E32h//串)=>
3112121:>,(//卸字旁),(𦈢u26222h//)=>
𦈢u26222h=卸字旁
3121534:>,(我u6211h//我),(牣u7263h//)=>
3215112:>,(//叟字头)=>
?叟字头
3251113:>,(身u8EABh//身)=>
3253541:>,(囱u56F1h/囪u56EAh/囱)=>
3431234:>,(釆u91C6h//番字头【釆】bian4)=>
3434251:>,(谷u8C37h/榖u6996h穀u7A40h/谷)=>
3443533:>,(豸u8C78h//豹字旁【豸】zhi4)=>
3525115:>,(龟u9F9Fh/龜u9F9Ch/龟)=>
3525134:>,(奂u5942h/奐u5950h/奂)=>
3525135:>,(免u514Dh//免)=>
3535112:>,(角u89D2h//角)=>
3543524:>,(卵u5375h//卵)=>
4111251:>,(言u8A00h//言),(訁u8A01h/讠u8BA0h/)=>
4143112:>,(辛u8F9Bh//辛),(冸u51B8h//),(竍u7ACDh//)=>
4311134:>,(//养字头)=>
?养字头
4325234:>,(//敝字旁),(㡀u3840h//)=>
㡀=敝字旁
4351523:>,(弟u5F1Fh//弟)=>
12211134:>,(其u5176h//其)=>
12251111:>,(直u76F4h//直)=>
12511214:>,(//惠字头)=>
?惠字头
12515112:>,(事u4E8Bh//事)=>
12524444:>,(雨u96E8h//雨)=>
13533434:>,(//啄字边),(豖u8C56h//)=>
豖=啄字边
15112134:>,(疌u758Ch//捷字边【疌】jie2)=>
15112531:>,(妻u59BBh//妻)=>
21112111:>,(非u975Eh//非)=>
25111134:>,(具u5177h//具),(昊u660Ah//),(㫙u3AD9h//)=>
25111234:>,(果u679Ch/菓u83D3h/果),(味u5473h//),(杲u6772h//),(呩u5469h//)=>
31122221:>,(//舞字头)=>
?舞字头
31212211:>,(垂u5782h//垂)=>
31511234:>,(秉u79C9h//秉)=>
32411121:>,(隹u96B9h//锥字边【隹】zhui1)=>
32511312:>,(卑u5351h//卑)=>
34112431:>,(金u91D1h//金),(釒u91D2h/钅u9485h/)=>
35251211:>,(鱼u9C7Ch/魚u9B5Ah/鱼)=>
41251234:>,(京u4EACh//京)=>
43251112:>,(单u5355h/單u55AEh/单)=>
43252431:>,(//曾字头)=>
?曾字头
51123234:>,(肃u8083h/粛u7C9Bh肅u8085h/肃)=>
51124134:>,(隶u96B6h/隷u96B7h隸u96B8h/隶),(录u5F55h/彔u5F54h錄u9304h録u9332h/)=>
52111534:>,(承u627Fh//承)=>
122125112:>,(革u9769h//革)=>
122543112:>,(南u5357h//南)=>
125431234:>,(柬u67ECh//柬)=>
132522111:>,(面u9762h/靣u9763h麪u9EAAh麫u9EABh麵u9EB5h/面)=>
211121111:>,(韭u97EDh//韭)=>
xx 212514444:>,(//点)=>
xx 225441431:>,(//竖)=>
251125214:>,(禺u79BAh//愚字头【禺】yu2)=>
312511211:>,(重u91CDh//重)=>
325113554:>,(鬼u9B3Ch//鬼)=>
325125214:>,(禹u79B9h//禹)=>
325431234:>,(//奥字头)=>
?奥字头
344511534:>,(食u98DFh//食)=>
431325111:>,(首u9996h//首)=>
512115154:>,(叚u53DAh//假字边【叚】jia3)=>
1251254312:>,(鬲u9B32h//隔字边【鬲】li4)=>
4125125251:>,(高u9AD8h//高)=>
4315112234:>,(兼u517Ch//兼)=>
4532411121:>,(//鹤字旁),(谁u8C01h/誰u8AB0h/),(隺u96BAh//)=>
隺=鹤字旁
12212511121:>,(堇u5807h//谨字边【堇】jin3),(菫u83EBh//)=>
12212512134:>,(黄u9EC4h/黃u9EC3h/黄)=>
32511355135:>,(兜u515Ch//兜)=>
35251353334:>,(象u8C61h/像u50CFh/象)=>
41351125112:>,(庸u5EB8h//庸)=>
41352211535:>,(鹿u9E7Fh//鹿)=>
251115132125:>,(鼎u9F0Eh//鼎)=>
254312114444:>,(黑u9ED1h/黒u9ED2h/黑)=>
3215115445445:>,(鼠u9F20h/鼡u9F21h/鼠)=>
xx 12143252343134:>,(//撇)=>
31254312114444:>,(熏u718Fh/燻u71FBh薰u85B0h/熏)=>
#""" #_cmpnt2char

##data##
_handle_cmpnt2char_output = r"""
001 卬===昂字底【卬】ang2
002 凹===凹
003 ?敖字旁
004 ?奥字头
005 八===八
006 丷u4E37h=倒八
007 巴===巴
008 白===白
009 百===百
010 ?拜字边
011 办===办
012 半===半
013 宀u5B80h=宝盖
014 卑===卑
015 贝===贝
016 卄u5344h=贲字腰
017 本===本
018 丌u4E0Ch=鼻字底
019 匕===匕
020 ?北字旁
021 必===必
022 㡀u3840h=敝字旁
023 釆===番字头【釆】bian4
024 丙===丙
025 秉===秉
026 疒u7592h=病字框
027 卜===卜
028 ?卢字头
029 不===不
030 才===才
031 ?曹字头
032 艹u8279h=草字头
033 册===册
034 ?扁字心
035 ?典字头
036 ?曾字头
037 叉===叉
038 产===产
039 长===长
040 厂===厂
041 车===车
042 臣===臣
043 ?临字旁
044 辰===辰
045 丞===丞
046 承===承
047 尺===尺
048 斥===斥
049 赤===赤
050 虫===虫
051 丑===丑
052 出===出
053 川===川
054 ?荒字底
055 巛u5DDBh=巡字心
056 串===串
057 垂===垂
058 𡗗u215D7h=春字头
059 朿===刺字旁【朿】ci4
060 匆===匆
061 囱===囱
062 寸===寸
063 大===大
064 歹===歹
065 歺u6B7Ah=餐左角
066 ?带字头
067 丹===丹
068 单===单
069 刀===刀
070 ?刀中
071 ?黎右角
072 刂u5202h=立刀
073 癶u7676h=登字头
074 ?帝字头
075 弟===弟
076 ?弟省
077 丶u4E36h=点
078 电===电
079 刁===刁
080 丁===丁
081 鼎===鼎
082 夂u5902h=冬字头
083 东===东
084 兜===兜
085 斗===斗
086 豆===豆
087 ?段字旁
088 而===而
089 ?尔字头
090 耳===耳
091 二===二
092 发===发
093 凡===凡
094 𠂆u20086h=反字框
095 攵u6535h=反文
096 攴===敲字边【攴】pu1
097 方===方
098 飞===飞
099 非===非
100 丰===丰
101 ?寿字头
102 风===风
103 𠘨u20628h=风省
104 缶===缶
105 夫===夫
106 巿===肺字边【巿】fu2
107 弗===弗
108 甫===甫
109 父===父
110 丐===丐
111 干===干
112 尢u5C22h=尴字框
113 甘===甘
114 高===高
115 戈===戈
116 革===革
117 个===个
118 艮===根字边【艮】gen4
119 ?庚字心
120 更===更
121 工===工
122 弓===弓
123 ?骨字头
124 谷===谷
125 瓜===瓜
126 夬===决字边【夬】guai4
127 毌===贯字头【毌】guan4
128 广===广
129 龟===龟
130 鬼===鬼
131 果===果
132 亥===亥
133 ?寒字腰
134 丂u4E02h=号字底
135 禾===禾
136 隺u96BAh=鹤字旁
137 黑===黑
138 一===横【一】
139 乙===横折弯钩【乙】
140 乛u4E5Bh=横钩
141 𠃍u200CDh=横折
142 𠃌u200CCh=横折钩
143 后===后
144 乎===乎
145 虍u864Dh=虎字头
146 互===互
147 户===户
148 凵u51F5h=画字框
149 奂===奂
150 黄===黄
151 ?惠字头
152 火===火
153 灬u706Ch=横四点
154 击===击
155 及===及
156 ?即字旁
157 几===几
158 己===己
159 已===已
160 ?以字旁
161 巳===巳
162 旡===既字边【旡】ji4
163 夹===夹
164 甲===甲
165 叚===假字边【叚】jia3
166 兼===兼
167 柬===柬
168 ?拣字边
169 廴u5EF4h=建之
170 见===见
171 纟u7E9Fh=绞丝旁
172 糸u7CF8h=绞丝底
173 角===角
174 卩===单耳【卩】jie2
175 ?节字底
176 㔾u353Eh=仓字底
177 疌===捷字边【疌】jie2
178 巾===巾
179 斤===斤
180 今===今
181 金===金
182 钅u9485h=金旁
183 堇===谨字边【堇】jin3
184 京===京
185 井===井
186 丩===纠字边【丩】jiu1
187 九===九
188 久===久
189 韭===韭
190 臼===臼
191 ?举字底
192 勹u52F9h=句字框
193 巨===巨
194 乑u4E51h=聚字底
195 具===具
196 ?卷字头
197 卡===卡
198 开===开
199 ?可字框
200 口===口
201 来===来
202 老===老
203 耂u8002h=老省
204 乐===乐
205 耒===耒
206 禸u79B8h=离字底
207 里===里
208 力===力
209 立===立
210 吏===吏
211 丽===丽
212 隶===隶
213 鬲===隔字边【鬲】li4
214 冫u51ABh=冰字旁【两点水】
215 ?冬字底【两点】
216 两===两
217 ?尞字头
218 了===了
219 ?临右角
220 ?临下角
221 六===六
222 龙===龙
223 卤===卤
224 ?录字头
225 鹿===鹿
226 ?旅下角
227 卵===卵
228 仑===仑
229 罒u7F52h=罗字头
230 马===马
231 毛===毛
232 矛===矛
233 卯===卯
234 ?留字头
235 ?冒字头
236 么===么
237 ?眉字框
238 门===门
239 米===米
240 免===免
241 面===面
242 民===民
243 皿===皿
244 末===末
245 母===母
246 木===木
247 目===目
248 ?那字旁
249 乃===乃
250 南===南
251 ?囊字头
252 内===内
253 屰===逆字心【屰】ni4
254 年===年
255 廿===廿
256 鸟===鸟
257 ?鸟省
258 牛===牛
259 ?告字头
260 农===农
261 廾u5EFEh=弄字底
262 ?共字底
263 女===女
264 爿===爿
265 丬u4E2Ch=将字旁
266 皮===皮
267 片===片
268 丿u4E3Fh=撇
269 乒===乒
270 乓===乓
271 平===平
272 七===七
273 妻===妻
274 其===其
275 气===气
276 千===千
277 䒑u4491h=前字头
278 戋u620Bh=钱字边
279 欠===欠
280 ?乔字底
281 且===且
282 ?青字头
283 ?轻字边
284 丘===丘
285 求===求
286 匚u531Ah=区字框
287 曲===曲
288 去===去
289 犬===犬
290 犭u72ADh=反犬旁
291 冉===冉
292 人===人
293 亻u4EBBh=单立人
294 儿===儿
295 𠂊u2008Ah=负字头
296 𠂉u20089h=卧人
297 壬===壬
298 刃===刃
299 日===日
300 曰===曰
301 入===入
302 三===三
303 伞===伞
304 ?丧字头
305 色===色
306 山===山
307 彡===彡
308 ?商字头
309 上===上
310 勺===勺
311 少===少
312 舌===舌
313 申===申
314 身===身
315 升===升
316 生===生
317 尸===尸
318 失===失
319 十===十
320 石===石
321 食===食
322 饣u9963h=食旁
323 史===史
324 矢===矢
325 豕===豕
326 ?豕省
327 士===士
328 氏===氏
329 示===示
330 礻u793Bh=示旁
331 世===世
332 事===事
333 手===手
334 扌u624Ch=提手
335 首===首
336 殳===设字边【殳】shu1
337 书===书
338 鼠===鼠
339 丨u4E28h=竖
340 𠃊u200CAh=竖折
341 乚u4E5Ah=竖弯钩
342 术===术
343 束===束
344 ?衰字腰
345 甩===甩
346 ?率字腰
347 阝u961Dh=双耳
348 彳u5F73h=双立人
349 水===水
350 氵u6C35h=三点水
351 氺u6C3Ah=水底
352 ?益字头
353 厶===私字边【厶】si1
354 司===司
355 丝===丝
356 四===四
357 镸u9578h=肆字旁
358 ?叟字头
359 肃===肃
360 太===太
361 肀u8080h=唐字心
362 天===天
363 田===田
364 冂u5182h=同字框
365 头===头
366 冖u5196h=秃宝盖
367 凸===凸
368 土===土
369 屯===屯
370 乇===托字边【乇】tuo1
371 瓦===瓦
372 丸===丸
373 万===万
374 亡===亡
375 王===王
376 囗===围字框【囗】wei2
377 韦===韦
378 卫===卫
379 ?畏字底
380 为===为
381 未===未
382 文===文
383 我===我
384 乌===乌
385 无===无
386 五===五
387 午===午
388 ?舞字头
389 兀===兀
390 勿===勿
391 戊===戊
392 夕===夕
393 ?夜下角
394 ?昔字头
395 西===西
396 覀u8980h=要字头
397 习===习
398 丆u4E06h=夏字头
399 下===下
400 乡===乡
401 向===向
402 象===象
403 小===小
404 ?尚字头
405 𦈢u26222h=卸字旁
406 心===心
407 ?恭字底
408 忄u5FC4h=竖心
409 辛===辛
410 囟===囟
411 戌===戌
412 亠u4EA0h=玄字头
413 ?学字头
414 穴===穴
415 彐u5F50h=雪字底
416 ?虐字底
417 血===血
418 熏===熏
419 卂u5342h=讯字边
420 丫===丫
421 牙===牙
422 亚===亚
423 ?焉字底
424 ?延字心
425 严===严
426 言===言
427 讠u8BA0h=言旁
428 央===央
429 ?杨字边
430 羊===羊
431 𦍌u2634Ch=美字头
432 ?养字头
433 幺===幼字旁【幺】yao1
434 夭===夭
435 ?尧字头
436 也===也
437 业===业
438 页===页
439 曳===拽字边【曳】ye4
440 衣===衣
441 𧘇u27607h=衣省
442 衤u8864h=衣旁
443 彑u5F51h=彝字头
444 夷===夷
445 ?颐字旁
446 乂===艾字底【乂】yi4
447 弋===代字边【弋】yi4
448 义===义
449 亦===亦
450 㐆u3406h=殷字旁
451 冘===枕字边【冘】yin2
452 尹===尹
453 庸===庸
454 ?勇字头
455 永===永
456 用===用
457 尤===尤
458 由===由
459 酉===酉
460 又===又
461 于===于
462 鱼===鱼
463 禺===愚字头【禺】yu2
464 与===与
465 予===予
466 雨===雨
467 禹===禹
468 玉===玉
469 𤣩u248E9h=斜玉
470 聿===律字边【聿】yu4
471 月===月【肉月】
472 肉===肉
473 ?青字底
474 ?然左角
475 戉===越字心【戉】yue4
476 云===云
477 再===再
478 乍===乍
479 丈===丈
480 爪===爪
481 ?印字旁
482 爫u722Bh=爪头
483 兆===兆
484 争===争
485 正===正
486 之===之
487 直===直
488 止===止
489 㐄u3404h=降下角
490 ?足字底
491 ?步字底
492 至===至
493 ?制字旁
494 豸===豹字旁【豸】zhi4
495 中===中
496 重===重
497 ?周字框
498 舟===舟
499 州===州
500 朱===朱
501 竹===竹
502 𥫗u25AD7h=竹头
503 主===主
504 专===专
505 𠂤u200A4h=追字心
506 㠯u382Fh=官字底
507 ?师字旁
508 隹===锥字边【隹】zhui1
509 豖u8C56h=啄字边
510 子===子
511 𠂔u20094h=姊字边
512 自===自
513 辶u8FB6h=走之
514 𠂇u20087h=左字框
#""" #_handle_cmpnt2char_output





##section##
import re
def _handle_cmpnt2char(_cmpnt2char, *, fout):
    name2may_ch = _parse_cmpnt2char(_cmpnt2char)
    部件名到属性 = mk_部件名到属性()
    assert set(name2may_ch) <= set(部件名到属性)

    ls = []
    L = len(str(len(部件名到属性)))
    s0_fmt = f"{{idx:0>{L}}}"
    for name, attr_d in 部件名到属性.items():
        idx = attr_d["部件序号"]
        s0 = s0_fmt.format(idx=idx)
        may_hz = attr_d["字"]
        if may_hz:
            assert name not in name2may_ch
            hz = may_hz
            ch = hz
            may_ch = ch
            assert len(may_ch) == 1
            s1 = (f"{ch}==={name}")
        else:
            assert name in name2may_ch
            may_ch = name2may_ch[name]
            assert len(may_ch) <= 1
            if not may_ch:
                s1 = (f"?{name}")
            else:
                ch = may_ch
                s1 = (f"{_hz2s(ch)}={name}")
        assert len(may_ch) <= 1
        s = f"{s0} {s1}"
        ls.append((idx, s))

    ls.sort()
    _i = 0
    for idx, s in ls:
        assert _i+1 == idx
        _i = idx
        print(s, file=fout)

def _parse_cmpnt2char(_cmpnt2char):
    return dict(_iter_parse_cmpnt2char(_cmpnt2char))
def _iter_parse_cmpnt2char(_cmpnt2char):
    eq_rex = re.compile(r"^(?P<char>[^\0-\xff])(u[0-9A-F]+h)?=(?P<name>\S+)$")
    na_rex = re.compile(r"^[?](?P<name>\S+)$")
    data_rex = re.compile(r"^[1-5]\S+$")
    bug_rex = re.compile(r"^xx [1-5]\S+$")
    rs = [
        data_rex
        ,na_rex
        ,eq_rex
        ,bug_rex
        ]
    lines = _cmpnt2char.split("\n")
    for line in lines:
        line = line.strip()
        if not line or line=='#': continue
        for rex in rs:
            m = rex.fullmatch(line)
            if m: break
        else:
            print(f"{line!r}")
            raise data-error
        m = m.groupdict()
        may_name = m.get("name")
        if may_name:
            name = may_name
            may_ch = m.get("char", "")
            assert len(may_ch) <= 1
            yield name, may_ch





##section##

if 0 and __name__ == "__main__":
    _main(head0="", end0="\n    =======\n\n", sep1="\n    ;", sep2=",")
if __name__ == "__main__":
    if 1:
        main()
    else:
        _handle_cmpnt2char(_cmpnt2char, fout=None)



