#__all__:goto
r'''[[[
e script/列表冫统合码大块汉字分区.py
豈鶴区，很混乱，没有明显分区边界，而且是兼容区 => 排除冫豈鶴区
发现:[一-龥]是根据『康熙字典部首{追加简体部首}』来分区的
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/unicode_cjk_部件乊汉字区.py
    from nn_ns.CJK.CJK_data.unicode_cjk_部件乊汉字区 import 康熙字典部首牜部首区,康熙字典部首牜汉字区牜包含简体部首,康熙字典部首牜汉字区牜原定繁体部首,康熙字典部首牜汉字区牜额外简体部首
    from nn_ns.CJK.CJK_data.unicode_cjk_部件乊汉字区 import 列表纟统合码汉字分区纟基位面一龥区, 文本纟统合码汉字分区纟基位面一龥区
view ../lots/NOTE/unicode/cjk/汉字区分区表.txt


py -m script.列表冫统合码大块汉字分区
py -m nn_ns.app.debug_cmd   script.列表冫统合码大块汉字分区 -x # -off_defs
py -m nn_ns.app.doctest_cmd script.列表冫统合码大块汉字分区:__doc__ -ht # -ff -df

[[
列表冫统合码大块汉字分区(部首/拼音)
######################
[口-圞]:统合码口部区828字:
  # 52*16-4==828
######################
find ../lots/NOTE/ -name '*汉字区*'
view ../lots/NOTE/unicode/cjk/汉字区冫仿照utf16.txt
view ../lots/NOTE/unicode/cjk/汉字区.txt
  [一-龥][豈-鶴]


]]



[[
#show_chars5unicode_pt_rng__blk_(16, *'一龥')
py -m script.列表冫统合码大块汉字分区 :show_chars5unicode_pt_rng__blk_ > /sdcard/0my_files/tmp/0tmp
view /sdcard/0my_files/tmp/0tmp
人工定位各分区起点:here
一丨丶丿乙亅二亠人儿入八冂冖冫几凵刀力勹匕匚匸十卜卩厂厶又口囗土士夂夊夕大女子宀寸小尢尸屮山巛工己巾干幺广廴廾弋弓彐彡彳心戈戶手支攴文斗斤方无日曰月木欠止歹殳毋比毛氏气水火爪父爻爿片牙牛犬玄玉瓜瓦甘生用田疋疒癶白皮皿目矛矢石示禸禾穴立竹米糸纟缶网羊羽老而耒耳聿肉臣自至臼舌舛舟艮色艸虍虫血行衣襾見见角言讠谷豆豕豸貝贝赤走足身車车辛辰辵邑酉釆里金钅長长門门阜隶隹雨靑非面革韋韦韭音頁页風风飛飞食饣首香馬马骨高髟鬥鬯鬲鬼魚鱼鳥鸟鹵鹿麥麻黃黍黑黹黽鼎鼓鼠鼻齊齐齒齿龍龙龜龟龠
    #二版#比『康熙字典部首』多了20个:纟见讠贝车钅长门韦页风飞饣马鱼鸟齐齿龙龟
    #214+20==234

<<==:
初版:一丨丶丿乙亅二亠人儿入八冂冖冫几凵刀力勹匕匚匸十卜卩厂厶又口土士夂夕大女子宀寸小尢尸屮山巛工己巾干幺广廴廾弋弓彐彡彳心戈戶手支攴文斗斤方无日曰月木欠止歹殳毋比毛氏气水火爪父爻爿片牙牛犬玄玉瓜瓦甘生用田疋疒癶白皮皿目矛矢石示禸禾穴立竹米糸纟缶网羊羽老而耒耳聿肉臣自至臼舌舛舟艮色艸虍虫血行衣襾見见角言讠谷豆豐豕豸貝贝赤走足身車车辛辰辵邑酉釆里金钅長长門门阜隶隹雨靑非面革韋韦韭音頁页風风飛飞食饣首香馬马骨高髟鬥鬯鬲鬼魚鱼鳥鸟鹵鹾鹿麥麻黃黍黑黹黽鼎鼓鼠鼻齊齐齒齿龍龙龜龟龠
    初版发现异常:
        口圞:... ...,囖囗
        夂夔:変夊
        (152, '豆豏', '豐豔')
    ++再对比Kangxi_Radicals:决定排除『鹾』
        ==>>二版:增加『囗』『夊』，删除『豐』『鹾』,234+2-2-->234

#######
view ../../python3_src/nn_ns/CJK/CJK_data/raw/unicode_cjk_部件_笔画.py
# (214, [(0x2F00, 0x2FD6)])
Kangxi_Radicals = '⼀⼁⼂⼃⼄⼅⼆⼇⼈⼉⼊⼋⼌⼍⼎⼏⼐⼑⼒⼓⼔⼕⼖⼗⼘⼙⼚⼛⼜⼝⼞⼟⼠⼡⼢⼣⼤⼥⼦⼧⼨⼩⼪⼫⼬⼭⼮⼯⼰⼱⼲⼳⼴⼵⼶⼷⼸⼹⼺⼻⼼⼽⼾⼿⽀⽁⽂⽃⽄⽅⽆⽇⽈⽉⽊⽋⽌⽍⽎⽏⽐⽑⽒⽓⽔⽕⽖⽗⽘⽙⽚⽛⽜⽝⽞⽟⽠⽡⽢⽣⽤⽥⽦⽧⽨⽩⽪⽫⽬⽭⽮⽯⽰⽱⽲⽳⽴⽵⽶⽷⽸⽹⽺⽻⽼⽽⽾⽿⾀⾁⾂⾃⾄⾅⾆⾇⾈⾉⾊⾋⾌⾍⾎⾏⾐⾑⾒⾓⾔⾕⾖⾗⾘⾙⾚⾛⾜⾝⾞⾟⾠⾡⾢⾣⾤⾥⾦⾧⾨⾩⾪⾫⾬⾭⾮⾯⾰⾱⾲⾳⾴⾵⾶⾷⾸⾹⾺⾻⾼⾽⾾⾿⿀⿁⿂⿃⿄⿅⿆⿇⿈⿉⿊⿋⿌⿍⿎⿏⿐⿑⿒⿓⿔⿕'



#康熙字典部首:汉字区vs部首区:
    #汉字区:在排除了20个简体部首后:纟见讠贝车钅长门韦页风飞饣马鱼鸟齐齿龙龟
一丨丶丿乙亅二亠人儿入八冂冖冫几
⼀⼁⼂⼃⼄⼅⼆⼇⼈⼉⼊⼋⼌⼍⼎⼏

凵刀力勹匕匚匸十卜卩厂厶又口囗土
⼐⼑⼒⼓⼔⼕⼖⼗⼘⼙⼚⼛⼜⼝⼞⼟

士夂夊夕大女子宀寸小尢尸屮山巛工
⼠⼡⼢⼣⼤⼥⼦⼧⼨⼩⼪⼫⼬⼭⼮⼯

己巾干幺广廴廾弋弓彐彡彳心戈戶手
⼰⼱⼲⼳⼴⼵⼶⼷⼸⼹⼺⼻⼼⼽⼾⼿

支攴文斗斤方无日曰月木欠止歹殳毋
⽀⽁⽂⽃⽄⽅⽆⽇⽈⽉⽊⽋⽌⽍⽎⽏

比毛氏气水火爪父爻爿片牙牛犬玄玉
⽐⽑⽒⽓⽔⽕⽖⽗⽘⽙⽚⽛⽜⽝⽞⽟

瓜瓦甘生用田疋疒癶白皮皿目矛矢石
⽠⽡⽢⽣⽤⽥⽦⽧⽨⽩⽪⽫⽬⽭⽮⽯

示禸禾穴立竹米糸缶网羊羽老而耒耳
⽰⽱⽲⽳⽴⽵⽶⽷⽸⽹⽺⽻⽼⽽⽾⽿

聿肉臣自至臼舌舛舟艮色艸虍虫血行
⾀⾁⾂⾃⾄⾅⾆⾇⾈⾉⾊⾋⾌⾍⾎⾏

衣襾見角言谷豆豕豸貝赤走足身車辛
⾐⾑⾒⾓⾔⾕⾖⾗⾘⾙⾚⾛⾜⾝⾞⾟

辰辵邑酉釆里金長門阜隶隹雨靑非面
⾠⾡⾢⾣⾤⾥⾦⾧⾨⾩⾪⾫⾬⾭⾮⾯

革韋韭音頁風飛食首香馬骨高髟鬥鬯
⾰⾱⾲⾳⾴⾵⾶⾷⾸⾹⾺⾻⾼⾽⾾⾿

鬲鬼魚鳥鹵鹿麥麻黃黍黑黹黽鼎鼓鼠
⿀⿁⿂⿃⿄⿅⿆⿇⿈⿉⿊⿋⿌⿍⿎⿏

鼻齊齒龍龜龠
⿐⿑⿒⿓⿔⿕

copy to:
view ../../python3_src/nn_ns/CJK/CJK_data/raw/unicode_cjk_部件乊汉字区.py
from nn_ns.CJK.CJK_data.raw.unicode_cjk_部件乊汉字区 import 康熙字典部首牜部首区,康熙字典部首牜汉字区牜包含简体部首,康熙字典部首牜汉字区牜原定繁体部首,康熙字典部首牜汉字区牜额外简体部首
康熙字典部首牜汉字区牜包含简体部首==二版-人工定位各分区起点
]]



[[
#打印冫各分区首末巛各分区起点扌('一龥', 人工定位各分区起点)
py -m script.列表冫统合码大块汉字分区 :打印冫各分区首末巛各分区起点扌 > /sdcard/0my_files/tmp/1tmp
view /sdcard/0my_files/tmp/1tmp
    # fmt:(idx,sz,'{first}{last}')
统合码大块汉字分区:here
000:0040:一丧
001:0014:丨丵
002:0009:丶举
003:0026:丿乘
004:0044:乙亄
005:0007:亅事
006:0020:二亟
007:0026:亠亹
008:0645:人儾
009:0038:儿兤
010:0006:入兪
011:0023:八冁
012:0020:冂冕
013:0021:冖冪
014:0053:冫凟
015:0021:几凴
016:0011:凵凿
017:0155:刀劚
018:0094:力勸
019:0028:勹匔
020:0005:匕匙
021:0030:匚匷
022:0009:匸區
023:0027:十卛
024:0013:卜卨
025:0025:卩厁
026:0052:厂厵
027:0018:厶叇
028:0027:又叢
029:0756:口囖
030:0072:囗圞
031:0460:土壪
032:0023:士夁
033:0008:夂変
034:0011:夊夔
035:0018:夕夦
036:0076:大奲
037:0477:女孏
038:0048:子孿
039:0120:宀寷
040:0023:寸導
041:0019:小尡
042:0022:尢尷
043:0054:尸屭
044:0003:屮屰
045:0362:山巚
046:0010:巛巤
047:0012:工巰
048:0013:己巽
049:0116:巾幱
050:0008:干幹
051:0005:幺幾
052:0117:广廳
053:0010:廴廽
054:0013:廾弊
055:0008:弋弒
056:0061:弓彏
057:0017:彐彠
058:0018:彡彲
059:0080:彳忂
060:0581:心戇
061:0046:戈戵
062:0021:戶扊
063:0740:手攮
064:0005:支攳
065:0083:攴斆
066:0016:文斖
067:0013:斗斣
068:0021:斤斸
069:0039:方旟
070:0005:无旤
071:0267:日曯
072:0024:曰朇
073:0032:月朧
074:1016:木欟
075:0066:欠歡
076:0023:止歸
077:0058:歹殲
078:0024:殳毊
079:0009:毋毓
080:0007:比毚
081:0052:毛氎
082:0005:氏氓
083:0032:气氳
084:1079:水灪
085:0447:火爩
086:0012:爪爵
087:0005:父爺
088:0004:爻爾
089:0008:爿牆
090:0018:片牘
091:0002:牙牚
092:0081:牛犫
093:0216:犬玃
094:0005:玄玈
095:0339:玉瓛
096:0010:瓜瓥
097:0050:瓦甗
098:0007:甘甞
099:0009:生甧
100:0008:用甯
101:0091:田疊
102:0007:疋疑
103:0228:疒癵
104:0007:癶發
105:0049:白皭
106:0017:皮皾
107:0047:皿盭
108:0237:目矚
109:0007:矛矡
110:0017:矢矲
111:0327:石礹
112:0126:示禷
113:0006:禸禽
114:0182:禾穳
115:0087:穴竊
116:0046:立竸
117:0378:竹籲
118:0133:米糷
119:0423:糸纞
120:0151:纟缵
121:0027:缶罐
122:0057:网羉
123:0051:羊羼
124:0068:羽耀
125:0011:老耋
126:0006:而耑
127:0033:耒耲
128:0076:耳聾
129:0010:聿肈
130:0346:肉臢
131:0007:臣臩
132:0009:自臲
133:0009:至臻
134:0016:臼舋
135:0015:舌舚
136:0004:舛舞
137:0079:舟艭
138:0004:艮艱
139:0006:色艷
140:0981:艸虌
141:0030:虍虪
142:0469:虫蠿
143:0012:血衋
144:0023:行衢
145:0283:衣襽
146:0013:襾覊
147:0054:見觀
148:0017:见觑
149:0046:角觿
150:0416:言讟
151:0151:讠谶
152:0015:谷豅
153:0015:豆豔
154:0035:豕豷
155:0037:豸貜
156:0128:貝贜
157:0071:贝赣
158:0012:赤赯
159:0067:走趲
160:0248:足躪
161:0031:身軉
162:0156:車轥
163:0053:车辚
164:0021:辛辯
165:0005:辰辴
166:0220:辵邐
167:0184:邑酈
168:0125:酉釅
169:0006:釆釋
170:0005:里釐
171:0692:金钄
172:0242:钅镶
173:0008:長镾
174:0001:长长
175:0104:門闧
176:0052:门阛
177:0154:阜隵
178:0003:隶隸
179:0047:隹雧
180:0105:雨靐
181:0013:靑靝
182:0004:非靡
183:0007:面靨
184:0098:革韊
185:0027:韋韥
186:0007:韦韬
187:0006:韭韲
188:0014:音頀
189:0116:頁顴
190:0051:页颧
191:0038:風飍
192:0013:风飚
193:0003:飛飝
194:0001:飞飞
195:0132:食饢
196:0051:饣馕
197:0003:首馘
198:0019:香馫
199:0192:馬驫
200:0060:马骧
201:0048:骨髗
202:0007:高髞
203:0070:髟鬤
204:0010:鬥鬮
205:0003:鬯鬱
206:0010:鬲鬻
207:0030:鬼魙
208:0290:魚鱻
209:0105:鱼鳤
210:0314:鳥鸞
211:0086:鸟鹴
212:0010:鹵鹾
213:0038:鹿麤
214:0022:麥麺
215:0008:麻黂
216:0010:黃黌
217:0004:黍黐
218:0040:黑黸
219:0004:黹黼
220:0017:黽鼍
221:0005:鼎鼒
222:0013:鼓鼟
223:0027:鼠鼺
224:0015:鼻齉
225:0006:齊齏
226:0002:齐齑
227:0045:齒齾
228:0014:齿龌
229:0012:龍龘
230:0003:龙龛
231:0003:龜龞
232:0001:龟龟
233:0006:龠龥


]]




[[
#显示异常乊校验冫笔划数于区内递增于区际递减扌(统合码大块汉字分区)
py -m script.列表冫统合码大块汉字分区 :显示异常乊校验冫笔划数于区内递增于区际递减扌 > /sdcard/0my_files/tmp/2tmp
view /sdcard/0my_files/tmp/2tmp
    初版发现异常:
        口圞:... ...,囖囗
        夂夔:変夊
        (152, '豆豏', '豐豔')
    现在是 二版{人工定位各分区起点}:
/[囗夊豐鹾]
不规则排列:here
一丧:不与
丿乘:乎乏
乙亄:乫乬
二亟:些亜
人儾:令以,仹仺,伊伋,伻似,佌位,佡佢,佣佤,侸侹,信俢,偋偌,偕偖,偤健,偨偩,傆傇,傝傞,傥傦,傱傲,僂僃,僅僆,僊僋,僎像,僘僙,僶僷,儀儁,儅儆,儘儙,儢儣,優儫,儯儰,儱儲,儴儵,儻儼
儿兤:兔兕
冂冕:再冎
刀劚:剅剆,剩剪,剭剮,割剳,創剶
力勸:勅勆,勘務,勥勦,勰勱,勴勵
勹匔:匑匒
匸區:匾匿
十卛:卋卌卍,协卐
卩厁:卸卹,卾卿
厂厵:厨厩,厪厫,厮厯,厱厲
又叢:叞叟
口囖:吷吸,呰呱,呲味,咒咓,咝咞,咻咼,响哎,哩哪,唋唌,唳唴,啉啊,啙啚,啣啤,喍喎,單喯,喴喵,嗎嗏,嗑嗒,嗕嗖,嗝嗞,嗡嗢,嗳嗴,嗻嗼,嘄嘅,嘞嘟,嘠嘡,嘨嘩,嘯嘰,嘴嘵,噈噉,噐噑,噟噠,噡噢,噦噧,噳噴,嚂嚃,嚅嚆,嚜嚝,嚭嚮,嚳嚴,嚻嚼,囅囆,囇囈,囍囎,囑囒,囔囕
土壪:圽圾,垸垹,埄埅,埍城,埨埩,堜堝,報堲,場堵,堽堾,塉塊,塓塔,塞塟,塥塦,塬塭,塲塳,塺塻,墀墁,墍墎,墒墓,增墟,墫墬,墳墴,墶墷,壑壒,壘壙,壜壝
士夁:壽壾,壿夀
大奲:奅奆,奊奋,奓奔,奡奢,奫奬
女孏:姁姂,姈姉,姑姒,姕姖,姬姭,娌娍,娖娗,娛娜,娪娫,娬娭,娯娰,娾娿,婘婙,婣婤,婱婲,婻婼,媋媌,媍媎,媐媑,媕媖,媦媧,媵媶,媾媿,嫁嫂,嫄嫅,嫎嫏,嫞嫟,嫪嫫,嫮嫯,嫶嫷,嫸嫹,嬄嬅,嬗嬘,嬝嬞,嬧嬨,嬲嬳,嬹嬺,孈孉,孎孏
子孿:孱孲,孵孶
宀寷:宧宨,寫寬
寸導:尅将
尢尷:尦尧,尩尪,尲尳
尸屭:屟屠
山巚:岊岋,岟岠,峪峫,峷峸,崊崋,嵊嵋,嵪嵫,嵮嵯,嵲嵳,嵹嵺,嶄嶅,嶏嶐,嶝嶞,嶮嶯,嶰嶱,嶳嶴,嶻嶼,巀巁,巋巌,巎巏,巙巚
巛巤:巛巜,巠巡
工巰:巧巨,巩巪
己巽:巸巹
巾幱:席帮,帽帾,幔幕,幘幙,幢幣,幨幩,幮幯
广廳:庛府,庬庭,庯庰,庽庾,廅廆,廉廊,廏廐,廑廒,廔廕,廛廜,廢廣
弓彏:弬弭,彇彈彉
彳忂:従徔,徚徛,御徢,徲徳,徵徶
心戇:心忄,必忆,忈忉,忎忏,忒忓,忘忙,忞忟,忠忡,忢忣,忥忦,忩忪,念忶,忽忾,忿怀,怂怃,怎怏,怒怓,怘怙,思怞,怠怡,急怦,怨怩,怱怲,怹怺,怼怽,恁恂,恋恌,恐恑,恖恗,恚恛,恝恞,恣恤,恥恦,恧恨,恩恪,恭恮,息恰,恷恸,恿悀,悆悇,悊悋,悐悑,悘悙,悡悢,悥悦,您悩,悬悭,悳悴,悶悷,悹悺,惁惂,惄情,惉惊,惌惍,惎惏,惒惓,惖惗,惣惤,惥惦,惫惬,想惴,惷惸,愂愃,愆愇,愈愉,愍愎,意愐,愗愘,愛愜,感愠,愤愥,愨愩,愬愭,愱愲,愳愴,愸愹愺,愻愼,愿慀,慂慃,慄慅,慇慈,態慌,慐慑,慓慔,慗慘,慙慚,慜慝,慟慠,慤慥,慧慨,慫慬,慮慯,慰慱,慶慷,慹慺,慼慽,慿憀,憅憆,憇憈,憊憋,憌憍,憎憏,憑憒,憗憘,憙憚,憛憜,憝憞,憠憡,憥憦,憩憪,憲憳,憵憶,憼憽,懁懂,懃懄,懇懈,應懊,懋懌,懎懏,懑懒,懖懗,懘懙,懛懜,懝懞,懟懠,懣懤,懬懭,懯懰懱,懲懳,懺懻,懼懽,戁戂
戈戵:戡戢,戳戴
手攮:手扌,扰扱,承技,抷抸,拏拐,拑拒,拜拝,拞拟,拳拴,拿挀,挈按,挐挑,挛挜,挩挪,挲挳,挶挷,挹挺,捒捓,捚捛,掌掍,掔掕,掣掤,掱掲,掾掿,揅揆,揎描,揣揤,揧揨,揫揬,揱揲,援揵,搐搑,搒搓,搛搜,搤搥,搫搬搭,搯搰,搴搵,搻搼搽,搿摀,摑摒,摘摙,摚摛,摠摡,摩摪,摰摱,摷摸,摾摿,撀撁,撃撄,撆撇,撉撊,撕撖,撥撦,撮撯,撰撱,撵撶,撽撾,擅擆,擊擋,擎擏,擐擑,擔擕,擘擙,據擛,擥擦,擪擫,擬擭,擲擳,擾擿,攀攁,攂攃,攙攚,攠攡,攣攤,攥攦
攴斆:敕敖,敜敝,敡敢,敫敬,整敵敶
文斖:斌斍
斤斸:新斱
方旟:旉旊,旓旔,旝旞
日曯:昄昅,昚昛,晞晟,晸晹,暍暎,暐暑,暚暛,暭暮,暰暱,暸暹,暻暼,曁曂,曃曄,曎曏,曓曔,曘曙,曝曞,曟曠,曭曮
曰朇:曹曺
月朧:朖朗
木欟:枀极,枽枾,柈柉,柛柜,柡柢,柴柵,柸柹,桎桏,桑桒,桝桞,梂梃,梅梆,梚梛,梜條,梟梠,梳梴,棥棦,棩棪,棺棻,椗椘,椚椛,椯椰,楆楇,楈楉,楕楖,楚楛,楦楧,業楮,楯楰,楴極,榓榔,榗榘,榲榳,榴榵,榽榾,槅槆,構槌,槍槎,槏槐,様槙,槣槤,槧槨槩,槯槰,樂樃,樅樆,樊樋,樠模,樣樤,樨権,樭樮,樹樺,橃橄,橖橗,橚橛,橠橡,橤橥,檂檃,檆檇,檍檎,檕檖,檘檙,檚檛,檜檝,檟檠,檣檤,檦檧,檫檬,檳檴,櫅櫆,櫍櫎,櫑櫒,櫓櫔,櫖櫗,櫘櫙,櫚櫛,櫠櫡,櫢櫣,櫪櫫,櫬櫭,櫱櫲,櫴櫵,櫷櫸,櫼櫽,櫾櫿,欁欂,欉權,欋欌,欔欕,欖欗,欜欝
欠歡:欣欤,欫欬,欳欴,歃歄,歗歘,歞歟
止歸:歪歫,歰歱
歹殲:殊残,殞殟
殳毊:殹殺
毛氎:毼毽,氀氁
水灪:水氵,氽氾,求汃,汆汇,汖汗,汞江,汬汭,汱汲,汶汷,沀沁,沊沋,沓沔,沗沘,沝沞,沯沰,泉泊,泏泐,泚泛,泣泤,泰泱泲,泶泷,洍洎,洖洗,洜洝,洯洰,流浂,浄浅,浆浇,涍涎,淒淓,淵淶,淼淽,淾淿,渙渚,渟渠,渥渦,渭渮,渴渵,湔湕,湬湭,湳湴,溙溚,溝溞,溟溠,溫溬,溱溲,溽溾,滀滁,滊滋,滎滏,滐滑,滕滖,滝滞,滬滭,滵滶,漀漁,漐漑,漒漓,漟漠,漢漣,漦漧漨,漬漭,漶漷,漽漾,漿潀,潁潂潃,潑潒,潚潛,潞潟,潡潢,潨潩,潲潳,澀澁,澃澄,澈澉,澔澕,澙澚,澩澪澫,澲澳,澺澻,澽澾,濃濄,濅濆,濇濈,濌濍,濏濐,濕濖,濚濛,濧濨,濬濭,濳濴,濷濸,濺濻,濾濿,瀀瀁,瀃瀄,瀆瀇,瀍瀎,瀝瀞,瀠瀡,瀥瀦,瀪瀫,瀲瀳,灅灆,灋灌,灎灏,灓灔灕,灠灡,灥灦
火爩:炫炬,烍烎,烴烵,烺烻,焑焒,焪焫,煏煐,煙煚,煛煜,煠煡,煭煮,煰煱,煹煺,熌熍,熡熢,熤熥,熫熬,熻熼,熽熾熿,燀燁,燣燤,燦燧,燩燪,燴燵,爂爃,爆爇,爋爌,爐爑,爔爕,爖爗,爜爝,爞爟
牛犫:犀犁,犌犍
犬玃:犬犭,状犷,狀狁,狊狋,狾狿,猆猇,猌猍,猏猐,猒猓,猦猧,猩猪,献猯,猷猸,猽猾,猿獀,獄獅,獆獇,獋獌,獎獏,獒獓,獘獙,獣獤,獥獦,獱獲,獳獴,獶獷
玉瓛:玊王,玺玻,玼玽,珀珁,珷珸珹,珼珽,琉琊,琞琟,琣琤,琧琨,琶琷,瑗瑘,瑚瑛,瑤瑥,瑩瑪,瑬瑭,瑮瑯,瑲瑳,瑴瑵,瑿璀,璂璃,璇璈,璌璍,璐璑,璒璓,璕璖,璗璘,璛璜,璠璡,璧璨,璬璭,璱璲,璷璸,璺璻,璽璾,瓀瓁,瓉瓊,瓌瓍,瓕瓖,瓗瓘
瓦甗:甌甍
田疊:画甼,畡畢,畯異
疒癵:疵疶,疹疺,痽痾,瘎瘏,瘓瘔,瘞瘟,瘢瘣,瘤瘥,瘨瘩,瘻瘼,療癃,癉癊,癗癘,癣癤,癭癮
白皭:皉皊,皌皍,皢皣
皿盭:盚盛
目矚:眦眧眨,眾眿,睯睰,睶睷,睸睹,瞃瞄,瞌瞍,瞘瞙,瞜瞝,瞡瞢,瞤瞥,瞯瞰瞱,矅矆,矍矎,矑矒,矘矙
石礹:砏砐,砦砧,砬砭,硞硟,硬硭,硿碀,碡碢,碣碤,碯碰,碿磀,磅磆,磇磈,磊磋,磒磓,磖磗,磜磝,磣磤,磱磲,磹磺,礆礇,礌礍,礙礚,礛礜,礝礞,礟礠,礥礦,礩礪
示禷:示礻,祀祁,祘祙,祟祠,祡祢,祦祧,票祩,祭祮,禁禂,禌禍,禜禝,禦禧,禨禩,禬禭
禾穳:秫秬,稅稆,稴稵,穀穁,穉穊,穤穥,穪穫
穴竊:窅窆,窙窚,窨窩,窾窿
立竸:竪竫
竹籲:笇笈,笪笫,筆筇,筤筥,筫筬,筲筳,筴筵,箷箸,箿節,築篊,篧篨,篲篳,篶篷,篸篹,篽篾,簈簉,簐簑,簦簧,簬簭,簵簶,簺簻,籄籅,籇籈,籔籕,籞籟,籦籧,籫籬
米糷:粓粔,粢粣,粿糀,糓糔,糡糢,糱糲,糳糴
糸纞:紙級,紫紬,絼絽,綀綁,綍綎,綕綖,綣綤,緡緢,緹緺,緻緼,縊縋,縍縎,縑縒,縘縙,縩縪,縬縭,縷縸,縹縺,繡繢,繣繤,繬繭,繰繱,繷繸,繽繾,纃纄,纉纊
纟缵:缌缍
网羉:网罒罓,罔罕,罘罙,罱署,罻罼,羀羁
羊羼:羋羌,羕羖羗,羝羞
羽耀:翳翴,翻翼
老耋:老耂,耄者,耆耇,耈耉
耒耲:耞耟
耳聾:聟聠,聬聭,聰聱,聻聼
聿肈:聿肀,肂肃
肉臢:肉肊,肏肐,胎胏,胔胕,胬胭,胾胿,脈脉,脔脕,脟脠,脨脩,腐腑,腠腡,腰腱,腳腴,膃膄,膆膇,膐膑,膕膖,膙膚,膛膜,膥膦,膴膵,膶膷,膻膼,臆臇,臋臌,臑臒,臖臗,臞臟,臡臢
臼舋:舀舁,舆與
舟艭:艆艇,艕艖,艗艘,艤艥,艦艧
艸虌:艸艹,芈芉,芔芕,芜芝,芧芨,芻芼,苠苡,苢苣,茈茉,茍茎,茙茚,茝茞,茣茤,茻茼,茽茾,荾荿,莑莒,莙莚,菂菃,菐菑,菥菦,菮華,萴萵,萷萸,葖著,蒀蒁,蒡蒢,蒪蒫,蒽蒾,蓂蓃,蓆蓇蓈,蓙蓚,蓭蓮,蓰蓱,蓹蓺,蓼蓽,蓿蔀,蔃蔄,蔆蔇,蔛蔜,蔬蔭,蔮蔯,蔰蔱,蕎蕏,蕕蕖,蕗蕘,蕭蕮蕯,蕷蕸,蕹蕺,薀薁,薋薌,薕薖,薗薘,薠薡,薲薳,薼薽,藆藇,藖藗,藠藡,藫藬,藮藯,藰藱,藶藷,蘌蘍,蘞蘟,蘡蘢,蘦蘧,蘬蘭,蘱蘲蘳,蘵蘶,蘹蘺,虂虃,虆虇,虋虌
虍虪:虜虝,虠虡
虫蠿:蚣蚤,蚫蚬,蚶蚷,蛖蛗,蜐蜑,蜢蜣,蜵蜶,蜸蜹,蝅蝆,蝌蝍,蝔蝕,蝦蝧,蝪蝫,蝷蝸,螁螂,螅螆,螊螋,螕螖,螜螝,螬螭,螮螯,螳螴,螵螶,蟅蟆,蟑蟒,蟕蟖,蟜蟝,蟤蟥,蟰蟱,蟻蟼,蠀蠁,蠃蠄,蠅蠆,蠍蠎,蠒蠓,蠕蠖,蠝蠞,蠢蠣,蠨蠩,蠪蠫,蠳蠴,蠷蠸
衣襽:衣衤,衮衯,衰衱,衷衸,衺衻,衾衿,袁袂,袃袄,袅袆,袈袉,袌袍,袞袟,袠袡,袤袥,袭袮,袲袳,裂裃,装裆,裊裋,裏裐,裔裕,裘裙,裛補,裝裞,裠裡,裦裧,裫裬,裵裶,裹裺,裻裼,製裾,褀褁,褒褓,褙褚,褜褝,褠褡,褧褨,褩褪,褮褯,褱褲,褽褾,襁襂,襄襅,襏襐,襑襒,襓襔,襙襚,襞襟,襩襪,襵襶,襹襺,襻襼
見觀:覕視,覨覩,覶覷
角觿:觘觙,觜觝,觸觹,觻觼
言讟:訮訯,訿詀,詍詎,誓誔,誟誠,諌諍,諢諣,諨諩,諷諸,諽諾,謈謉,謍謎,謓謔,謦謧,謯謰,謶謷,謽謾,謿譀譁,譂譃,譅譆譇,譍譎,譡譢,譥警,譩譪,譳譴,譶護,譼譽,讀讁,讈讉,讓讔,讘讙,讚讛,讜讝
豕豷:豠象,豰豱
豸貜:貒貓,貗貘
貝贜:貲貳,貵貶,贄贅,贍贎
赤赯:赬赭
走趲:走赱
足躪:趾趿,跐跑,跜距,跴践,踬踭,踶踷,踹踺,蹂蹃,蹈蹉,蹔蹕,蹤蹥,蹨蹩,蹿躀,躁躂,躆躇,躈躉,躐躑,躙躚,躟躠,躣躤,躨躩躪
車轥:軭軮,轊轋,轜轝
辵邐:辵辶,逼逽,遍過,遙遚,遧遨,遲遳,邀邁,邃還,邅邆
邑酈:邑邒,邕邖,邫邬,邶邷,郌郍,郒郓,郗郘,郰郱,郶郷,郺郻,郼都,郿鄀,鄙鄚,鄨鄩,酁酂
酉釅:醎醏,醘醙,醧醨,釁釂
金钄:鈑鈒,鈭鈮,鉄鉅,鉮鉯,銎銏,銯銰,鋀鋁,鋊鋋,鋢鋣,鋨鋩,鋭鋮,錑錒,錙錚,錴錵,錹錺,鍇鍈,鍊鍋,鍢鍣,鍨鍩,鍴鍵,鍹鍺,鎀鎁,鎙鎚,鎜鎝,鎠鎡,鎩鎪,鎮鎯,鎸鎹,鎽鎾,鏄鏅,鏇鏈,鏉鏊,鏋鏌,鏍鏎,鏟鏠,鏴鏵,鏽鏾,鐃鐄,鐉鐊,鐋鐌,鐪鐫,鐬鐭,鐮鐯,鐶鐷,鐸鐹,鐻鐼,鑈鑉,鑒鑓,鑕鑖,鑚鑛,鑜鑝,鑦鑧,鑭鑮,鑴鑵,钃钄
钅镶:锲锳
長镾:長镸
門闧:閬閭,閯閰,闀闁,闌闍,闤闥
(175, '长长', '門闧')
阜隵:阜阝,陚陛,陻陼,隖隗,隝隞,隦隧,險隫
隹雧:雊雋,雌雍,雗雘,雙雚,雡離
雨靐:雬雭,霅霆,霘霙,霦霧,霨霩,露霳,霾霿,靅靆
面靨:面靣
革韊:靷靸,鞖鞗,鞫鞬,鞲鞳,鞽鞾,韂韃,韇韈
韋韥:韝韞
音頀:韹韺
頁顴:頥頦,頱頲,頿顀,顜顝,顬顭,顳顴
風飍:颻颼,颽颾
食饢:食飠,飡飢,飬飭,飮飯,飱飲,飸飹,飺飻,餈餉,餋餌,餍餎,餐餑,餜餝,餥餦,餮餯,餳餴,餼餽,餾餿,饁饂,饅饆,饇饈,饕饖饗,饘饙
(195, '飞飞', '食饢')
香馫:馦馧
馬驫:馹馺,駎駏,騜騝,騦騧,騬騭,騱騲,騶騷,騿驀,驅驆,驈驉驊,驌驍,驙驚,驤驥,驨驩
骨髗:骴骵,骾骿,髉髊,髑髒
髟鬤:髭髮,鬆鬇
鬥鬮:鬬鬭
鬼魙:魒魓,魕魖
魚鱻:魤魥,鮆鮇,鮓鮔,鮢鮣,鮹鮺,鯄鯅,鯇鯈,鯍鯎,鯖鯗,鯹鯺,鯼鯽,鰍鰎,鰘鰙,鰟鰠,鰥鰦,鰯鰰,鰶鰷,鰿鱀,鱂鱃,鱊鱋,鱐鱑,鱛鱜,鱨鱩鱪,鱭鱮,鱳鱴,鱵鱶
鳥鸞:鳫鳬,鴊鴋,鴓鴔,鴜鴝,鴰鴱,鵡鵢,鵦鵧,鶒鶓,鶛鶜,鶦鶧,鶺鶻,鶾鶿,鷓鷔,鷜鷝,鷧鷨,鷫鷬,鷴鷵,鷺鷻,鸋鸌,鸎鸏,鸑鸒
鹵鹾:鹽鹾
麥麺:麥麦,麷麸
黃黌:黃黄
黑黸:黑黒,默黙
黽鼍:黽黾,鼊鼋
鼓鼟:鼘鼙,鼝鼞
鼠鼺:鼠鼡
齒齾:齜齝,齡齢,齸齹
(231, '龙龛', '龜龞')
(233, '龟龟', '龠龥')


]]


[[
#部首表讠简体部首表扌(人工定位各分区起点)
py -m script.列表冫统合码大块汉字分区 :部首表讠简体部首表扌
    部首表牜非平凡简化:goto
    部首表牜非平凡简化牜排除已知二十个:goto
==>>:
    第二次使用:输出{show_chars5unicode_pt_rng__blk_}
    先搜索:[{人工定位各分区起点}]
    再分区:%s//\r+\0/g
    而后搜索:[庵乾庵户丬犭匹艹虺青斗卤麦黄黾]
    一一检查，发现没有分新区的必要
]]


[[
排除冫豈鶴区
<<==:
py -m script.列表冫统合码大块汉字分区 :show_chars5unicode_pt_rng__blk_ '豈鶴' > /sdcard/0my_files/tmp/0tmp
view /sdcard/0my_files/tmp/0tmp
豈鶴区，很混乱，没有明显分区边界，而且是兼容区 => 排除冫豈鶴区
  一龥:归并区
  豈鶴:兼容区
]]




py_adhoc_call   script.列表冫统合码大块汉字分区   @f
from script.列表冫统合码大块汉字分区 import *
]]]'''#'''
__all__ = r'''
'''.split()#'''
__all__
___begin_mark_of_excluded_global_names__0___ = ...
from seed.text.join_between import join_between, join_between_ex
from seed.iters.pairwise_ import pairwise_, pairwise__head_, pairwise__tail_, pairwise_chain_, pairwise_chains_
from itertools import pairwise
___end_mark_of_excluded_global_names__0___ = ...

if __name__ == "__main__":
    import sys
    [_, nm4main, *_tmp] = sys.argv
    if not _tmp:
        _tmp = ['一龥']
    [hzhz] = _tmp
    assert len(hzhz) == 2, hzhz
        #'一龥'
        #'豈鶴'
    print(nm4main, hzhz, file=sys.stderr)

def j5or_char_(j_or_ch, /):
    j = ord(j_or_ch) if not type(j_or_ch) is int else j_or_ch
    return j
def show_chars5unicode_pt_rng__blk_(sz4blk, begin, end, /):
    assert sz4blk > 0
    begin = j5or_char_(begin)
    end = j5or_char_(end)
    for i in range(begin, end, sz4blk):
        j = min(end, i+sz4blk)
        print(''.join(map(chr, range(i,j))))
if __name__ == "__main__":
    if nm4main==':show_chars5unicode_pt_rng__blk_':show_chars5unicode_pt_rng__blk_(16, *hzhz)

def 枚举冫各分区首末巛各分区起点扌(全区首末, 各分区起点, /):
    A,Z = 全区首末
    assert 各分区起点[0] == A
    assert 各分区起点[-1] <= Z
    _Z = chr(ord(Z)+1)
    assert 各分区起点[-1] < _Z

    j1 = len(各分区起点)-1
    for j, (c0,_c1) in enumerate(pairwise__tail_(_Z, 各分区起点)):
        assert c0 < _c1
        c1 = chr(ord(_c1)-1)
        assert c0 <= c1
        sz = ord(_c1) -ord(c0)
        yield (j, sz, c0+c1)
def 打印冫各分区首末巛各分区起点扌(全区首末, 各分区起点, /):
    for j, sz, cc in 枚举冫各分区首末巛各分区起点扌(全区首末, 各分区起点):
        print(f'{j:0>3}:{sz:0>4}:{cc!s}')

def __(__doc__):
    ss = __doc__.split('\n')
    i = ss.index('人工定位各分区起点:here')
    s = ss[i+1]
    assert len(s) == 234
    return s
人工定位各分区起点 = __(__doc__)

if __name__ == "__main__":
    if nm4main==':打印冫各分区首末巛各分区起点扌':打印冫各分区首末巛各分区起点扌('一龥', 人工定位各分区起点)




def 显示异常乊校验冫笔划数于区内递增于区际递减扌(汉字分区, /):
    from nn_ns.CJK.CJK_data.汉字笔顺 import 汉字到笔顺码 as hz2js
    def hz2len_js_(hz, /):
        return len(hz2js[hz])
    def put(badss, ci, ck, /):
        if badss:
            bads = badss[-1]
            if bads[-1] == ci:
                bads[-1] = ck
                return
        bads = [ci,ck]
        badss.append(bads)
        return
    def show(c01, badss, /):
        css = []
        for c0, c1 in badss:
            cs = join_between(c0, c1)
            css.append(cs)
        s = ','.join(css)
        print(f'{c01}:{s}')
    for _idx, c01 in enumerate(汉字分区):
        c0, c1 = c01
        ((j0, j1), cs) = join_between_ex(c0, c1)
        if _idx:
            assert j0 == prev_j1+1
        assert j0 <= j1
        ns = tuple(map(hz2len_js_, cs))
        badss = []
        for (ci,ni),(ck,nk) in pairwise(zip(cs,ns)):
            #区内递增
            if not ni <= nk:
                put(badss, ci, ck)
        if badss:
            show(c01, badss)
        #######
        n0 = ns[0]
        n1 = ns[-1]
        if _idx:
            assert j0 == prev_j1+1
            #区际递减
            if not prev_n1 >= n0:
                print((_idx, prev_c01, c01))
        #######
        prev_j1 = j1
        prev_n1 = n1
        prev_c01 = c01
        #######

def __(__doc__):
    ss = __doc__.split('\n')
    i = ss.index('统合码大块汉字分区:here')
    j = ss.index('', i+1)
    ls = ss[i+1:j]
    assert len(ls) == 234
    ls = [s.split(':')[-1] for s in ls]
    return ls
统合码大块汉字分区 = __(__doc__)

if __name__ == "__main__":
    if nm4main==':显示异常乊校验冫笔划数于区内递增于区际递减扌':显示异常乊校验冫笔划数于区内递增于区际递减扌(统合码大块汉字分区)



def 部首表讠简体部首表扌(部首表, /):
    from nn_ns.CJK.CJK_data.汉字繁简 import 繁体字到简体字串
    g = 繁体字到简体字串.get
    def f(hz, /):
        s = g(hz, '')
        if s == hz:
            s = ''
        if s:
            s = f'{hz}:{s}'
        return s
    return ','.join(filter(None, map(f, 部首表)))
if __name__ == "__main__":
    if nm4main==':部首表讠简体部首表扌':print(部首表讠简体部首表扌(人工定位各分区起点))
部首表牜非平凡简化 = '厂:厂庵,干:乾干,广:广庵,戶:户,爿:丬爿,犬:犬犭,疋:匹疋,糸:糸纟,艸:艸艹,虫:虫虺,見:见,貝:贝,車:车,長:长,門:门,靑:靑青,韋:韦,頁:页,風:风,飛:飞,馬:马,鬥:斗,魚:鱼,鳥:鸟,鹵:卤,麥:麦,黃:黄,黽:黾,齊:齐,齒:齿,龍:龙,龜:龟'
    #vs:纟见讠贝车钅长门韦页风飞饣马鱼鸟齐齿龙龟
部首表牜非平凡简化牜排除已知二十个 = '厂:厂庵,干:乾干,广:广庵,戶:户,爿:丬爿,犬:犬犭,疋:匹疋,艸:艸艹,虫:虫虺,靑:靑青,鬥:斗,鹵:卤,麥:麦,黃:黄,黽:黾'
    #[庵乾庵户丬犭匹艹虺青斗卤麦黄黾]



__all__
from script.列表冫统合码大块汉字分区 import *
