#__all__:goto
#订正版冫汉字行每频数:goto
#订正版冫前二六一九汉字乊频数不小于七十:goto
#   assert 订正版冫前二六一九汉字乊频数不小于七十 == ''.join(订正版冫汉字行每频数.split()[:614])
#
r'''[[[
e script/字频统计冫词汇纟汉语大辞典.py
[[
严重失误！
    失误版-->订正版
$ du -h /sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典-词汇繁简对照-补空.txt
    4.3M
    完整版:即简繁一致的词汇只保留一半
$ du -h /sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典-词汇繁简对照.txt
    3.2M
    阉割版:即只保留简繁不一致的词汇
==>>:
7z a script/汉语大辞典-词汇繁简对照-补空.txt.7z  /sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典-词汇繁简对照-补空.txt
7z t script/汉语大辞典-词汇繁简对照-补空.txt.7z
du -h script/汉语大辞典-词汇繁简对照-补空.txt.7z
    1.4M
]]


py -m script.字频统计冫词汇纟汉语大辞典
py -m nn_ns.app.debug_cmd   script.字频统计冫词汇纟汉语大辞典 -x
py -m nn_ns.app.doctest_cmd script.字频统计冫词汇纟汉语大辞典:__doc__ -ht



[[
view /sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典-词汇繁简对照-补空.txt
view /sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典-词汇繁简对照.txt
!du -h /sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典-词汇繁简对照-补空.txt
    4.2M
]]



[[
以2112为界:
    订正版:(96, 15, 2120, '伴債堆幻敲槃浩浸渴股腿衷逝邀鬻')
        #注意:『标点符号』:(577, 2, 200, '關，')
    失误版:(55, 31, 2112, '仰喚夕妖孝嶮廁廠戾摶煞燄璫畝眷磚祠署耗聾萊藻蝕詘跼躁陀隻雛鞋餓')
===
订正版:[频数>=70]=>前2620字符=>前2619汉字(已排除『，』):
订正版冫前二六一九汉字乊频数不小于七十:goto
]]

[[[
...=>path1#订正版
    #注意:『标点符号』:(577, 2, 200, '關，')
    # [^()0-9, ':一-龥] => 5个[，；、AＱ]
    #   后4个频数只为{2,1}
===
py_adhoc_call   script.字频统计冫词汇纟汉语大辞典   ,字频统计冫词汇纟汉语大辞典扌 =... -traditional_vs_simplified  --may_num4most_common=2112 >  /sdcard/0my_files/tmp/0tmp
view /sdcard/0my_files/tmp/0tmp
    字数: 13857
    总计数: 786013
    ('子', 4030)
    ('不', 3579)
    ('人', 2850)
    ('一', 2612)
    ('大', 2225)
    ('頭', 2204)
    ...
    ('腿', 96)
    ('浩', 96)
    ('槃', 96)

py_adhoc_call   script.字频统计冫词汇纟汉语大辞典   ,字频统计冫词汇纟汉语大辞典扌 =... -traditional_vs_simplified  --may_num4most_common=None >  /sdcard/0my_files/tmp/1tmp
view /sdcard/0my_files/tmp/1tmp
    同上，除尾部
du -h /sdcard/0my_files/tmp/1tmp
    160K

[[
订正版冫汉字行每频数:goto
py_adhoc_call   script.字频统计冫词汇纟汉语大辞典   ,字频统计冫词汇纟汉语大辞典扌 =... -traditional_vs_simplified  --may_num4most_common=None +pairs_vs_grouped >  /sdcard/0my_files/tmp/0tmp
    (count, num_hzs, acc, hzs)
字数: 13857
总计数: 786013
(4030, 1, 1, '子')
(3579, 1, 2, '不')
(2850, 1, 3, '人')
(2612, 1, 4, '一')
(2225, 1, 5, '大')
(2204, 1, 6, '頭')
(2142, 1, 7, '心')
(2081, 1, 8, '風')
(2009, 1, 9, '天')
(1832, 1, 10, '三')
(1802, 1, 11, '無')
(1783, 1, 12, '行')
(1759, 1, 13, '生')
(1750, 1, 14, '金')
(1687, 1, 15, '山')
(1683, 1, 16, '馬')
(1667, 1, 17, '水')
(1627, 1, 18, '花')
(1548, 1, 19, '白')
(1494, 1, 20, '文')
(1423, 1, 21, '門')
(1391, 1, 22, '玉')
(1385, 1, 23, '道')
(1352, 1, 24, '地')
(1351, 1, 25, '小')
(1331, 1, 26, '家')
(1327, 1, 27, '中')
(1300, 1, 28, '兒')
(1277, 1, 29, '氣')
(1240, 1, 30, '相')
(1226, 1, 31, '雲')
(1216, 1, 32, '龍')
(1203, 1, 33, '黃')
(1193, 1, 34, '言')
(1192, 1, 35, '石')
(1180, 1, 36, '日')
(1162, 1, 37, '神')
(1161, 1, 38, '長')
(1153, 1, 39, '青')
(1150, 1, 40, '火')
(1146, 1, 41, '書')
(1136, 1, 42, '事')
(1129, 1, 43, '之')
(1124, 1, 44, '口')
(1122, 1, 45, '下')
(1098, 1, 46, '上')
(1093, 1, 47, '老')
(1073, 1, 48, '公')
(1061, 1, 49, '清')
(1055, 1, 50, '手')
(1044, 1, 51, '車')
(1029, 1, 52, '官')
(1028, 1, 53, '五')
(1020, 1, 54, '明')
(1002, 1, 55, '然')
(994, 2, 57, '流魚')
(989, 1, 58, '高')
(985, 1, 59, '重')
(962, 1, 60, '出')
(960, 1, 61, '酒')
(940, 1, 62, '月')
(936, 1, 63, '眼')
(933, 1, 64, '通')
(910, 1, 65, '分')
(909, 1, 66, '國')
(904, 1, 67, '衣')
(901, 1, 68, '木')
(900, 1, 69, '節')
(892, 2, 71, '意正')
(883, 1, 72, '時')
(878, 1, 73, '法')
(871, 1, 74, '遺')
(858, 1, 75, '面')
(857, 1, 76, '香')
(855, 1, 77, '學')
(848, 1, 78, '名')
(837, 1, 79, '情')
(832, 2, 81, '成食')
(829, 1, 82, '發')
(827, 1, 83, '世')
(825, 2, 85, '合連')
(822, 1, 86, '有')
(818, 1, 87, '方')
(814, 1, 88, '百')
(811, 1, 89, '打')
(808, 1, 90, '自')
(806, 1, 91, '二')
(805, 1, 92, '聲')
(800, 1, 93, '身')
(790, 1, 94, '光')
(785, 1, 95, '海')
(783, 1, 96, '草')
(779, 1, 97, '土')
(776, 1, 98, '兵')
(767, 1, 99, '目')
(766, 1, 100, '平')
(763, 1, 101, '八')
(761, 2, 103, '命東')
(758, 1, 104, '物')
(757, 1, 105, '作')
(743, 1, 106, '四')
(742, 1, 107, '年')
(741, 2, 109, '會語')
(735, 1, 110, '本')
(733, 1, 111, '主')
(730, 1, 112, '靈')
(726, 1, 113, '九')
(725, 2, 115, '解開')
(721, 1, 116, '見')
(716, 1, 117, '民')
(715, 1, 118, '色')
(714, 1, 119, '王')
(710, 2, 121, '曲路')
(707, 2, 123, '同飛')
(703, 1, 124, '客')
(698, 1, 125, '骨')
(696, 1, 126, '交')
(694, 1, 127, '和')
(693, 1, 128, '軍')
(691, 1, 129, '服')
(690, 1, 130, '過')
(689, 2, 132, '士理')
(687, 2, 134, '女錢')
(686, 1, 135, '進')
(685, 2, 137, '落說')
(677, 2, 139, '如樂')
(676, 1, 140, '直')
(670, 1, 141, '陽')
(668, 1, 142, '十')
(667, 1, 143, '空')
(662, 2, 145, '化外')
(658, 1, 146, '春')
(656, 1, 147, '義')
(653, 1, 148, '宮')
(651, 1, 149, '體')
(649, 1, 150, '星')
(645, 1, 151, '調')
(644, 2, 153, '田竹')
(640, 1, 154, '力')
(637, 1, 155, '寒')
(636, 2, 157, '六紅')
(634, 2, 159, '陰鼓')
(632, 1, 160, '死')
(631, 1, 161, '鳳')
(630, 1, 162, '德')
(627, 1, 163, '斷')
(626, 1, 164, '遠')
(623, 1, 165, '當')
(620, 1, 166, '雨')
(617, 1, 167, '鬼')
(613, 2, 169, '機虎')
(612, 1, 170, '夫')
(610, 1, 171, '腳')
(608, 2, 173, '內筆')
(603, 1, 174, '華')
(602, 2, 176, '角起')
(593, 2, 178, '畫素')
(591, 1, 179, '論')
(587, 1, 180, '首')
(586, 2, 182, '實望')
(584, 1, 183, '後')
(583, 3, 186, '千朝黑')
(582, 4, 190, '利詞足辭')
(581, 2, 192, '知經')
(580, 1, 193, '煙')
(579, 3, 196, '工得絕')
(578, 2, 198, '臺輕')
(577, 2, 200, '關，')
(576, 1, 201, '私')
(572, 1, 202, '窮')
(568, 1, 203, '來')
(564, 1, 204, '安')
(563, 1, 205, '離')
(562, 1, 206, '西')
(558, 2, 208, '字散')
(554, 1, 209, '牛')
(553, 2, 211, '動積')
(552, 1, 212, '師')
(549, 1, 213, '古')
(548, 2, 215, '邊餘')
(546, 1, 216, '養')
(544, 2, 218, '思羅')
(543, 1, 219, '惡')
(540, 1, 220, '玄')
(539, 1, 221, '亂')
(538, 1, 222, '坐')
(536, 2, 224, '精轉')
(534, 1, 225, '仙')
(533, 2, 227, '新音')
(532, 2, 229, '戶虛')
(531, 1, 230, '放')
(529, 2, 232, '堂禮')
(525, 1, 233, '定')
(524, 1, 234, '南')
(522, 1, 235, '指')
(521, 1, 236, '信')
(520, 1, 237, '毛')
(519, 1, 238, '鐵')
(518, 1, 239, '詩')
(515, 2, 241, '沒野')
(513, 2, 243, '使城')
(512, 1, 244, '傳')
(510, 4, 248, '好引真破')
(509, 1, 249, '兩')
(508, 1, 250, '珠')
(507, 1, 251, '赤')
(506, 2, 253, '七回')
(505, 1, 254, '前')
(503, 1, 255, '步')
(502, 1, 256, '計')
(501, 1, 257, '盤')
(499, 1, 258, '林')
(498, 2, 260, '寶業')
(496, 2, 262, '失歌')
(494, 2, 264, '從親')
(493, 1, 265, '教')
(491, 1, 266, '入')
(490, 1, 267, '市')
(489, 3, 270, '制志橫')
(488, 1, 271, '立')
(487, 2, 273, '功皮')
(486, 2, 275, '令戰')
(485, 2, 277, '室結')
(484, 3, 280, '牙簡鶴')
(483, 3, 283, '楚沙禁')
(482, 1, 284, '度')
(481, 1, 285, '布')
(480, 1, 286, '極')
(479, 3, 289, '為閒雪')
(478, 2, 291, '居秋')
(477, 3, 294, '俗歸河')
(475, 1, 295, '用')
(474, 2, 297, '可才')
(473, 1, 298, '鄉')
(472, 3, 301, '刀沈耳')
(471, 2, 303, '元變')
(470, 1, 304, '幽')
(468, 1, 305, '深')
(467, 2, 307, '樹鳥')
(466, 1, 308, '病')
(465, 1, 309, '燕')
(464, 3, 312, '折隱難')
(463, 1, 313, '雞')
(462, 2, 315, '房武')
(461, 1, 316, '點')
(460, 1, 317, '露')
(459, 2, 319, '孤甲')
(458, 1, 320, '取')
(457, 1, 321, '懷')
(456, 1, 322, '器')
(455, 1, 323, '胡')
(454, 4, 327, '倒容封負')
(453, 4, 331, '夜守疾運')
(452, 1, 332, '戲')
(451, 2, 334, '絲走')
(449, 3, 337, '觀遊達')
(448, 2, 339, '塵驚')
(445, 1, 340, '微')
(443, 1, 341, '形')
(442, 2, 343, '格治')
(441, 1, 344, '善')
(440, 1, 345, '常')
(438, 1, 346, '性')
(436, 2, 348, '根眾')
(435, 2, 350, '伏章')
(434, 1, 351, '營')
(433, 2, 353, '問密')
(432, 3, 356, '對板質')
(431, 3, 359, '笑表逸')
(430, 2, 361, '丹舉')
(429, 1, 362, '鴻')
(428, 1, 363, '政')
(426, 1, 364, '管')
(424, 3, 367, '修數霜')
(423, 1, 368, '異')
(422, 4, 372, '別條皇順')
(421, 2, 374, '乾急')
(420, 3, 377, '先將疏')
(419, 2, 379, '游要')
(417, 1, 380, '影')
(416, 4, 384, '帶景薄象')
(415, 2, 386, '朱話')
(412, 1, 387, '視')
(411, 2, 389, '末陵')
(410, 1, 390, '司')
(409, 2, 392, '江科')
(408, 1, 393, '退')
(405, 3, 396, '宿而電')
(404, 3, 399, '浮識銀')
(403, 1, 400, '阿')
(402, 2, 402, '反里')
(401, 2, 404, '號齊')
(400, 1, 405, '圖')
(399, 1, 406, '君')
(397, 3, 409, '支貴都')
(396, 1, 410, '冰')
(395, 2, 412, '處血')
(394, 2, 414, '參息')
(392, 1, 415, '收')
(390, 2, 417, '油還')
(389, 2, 419, '母省')
(388, 2, 421, '索飯')
(387, 1, 422, '麗')
(386, 2, 424, '報美')
(385, 2, 426, '周雜')
(383, 1, 427, '附')
(382, 1, 428, '賢')
(381, 3, 431, '故樓背')
(379, 3, 434, '品場張')
(378, 2, 436, '殺班')
(377, 1, 437, '刻')
(376, 1, 438, '短')
(375, 1, 439, '紙')
(373, 1, 440, '柳')
(372, 3, 443, '冠聖議')
(371, 3, 446, '暴波眉')
(370, 2, 448, '追雅')
(369, 1, 449, '歲')
(368, 2, 451, '切漢')
(367, 2, 453, '賣麻')
(366, 2, 455, '宗席')
(365, 3, 458, '典熱造')
(364, 1, 459, '奇')
(363, 1, 460, '逆')
(361, 5, 465, '以墨夷蟲陳')
(360, 3, 468, '半燈騰')
(358, 5, 473, '塞應枝權謝')
(357, 5, 478, '北尾興舍飲')
(355, 5, 483, '所揚選郎錦')
(354, 5, 488, '推烏肉舌齒')
(353, 1, 489, '弄')
(352, 2, 491, '任祖')
(351, 2, 493, '勞鳴')
(350, 4, 497, '比脫臣資')
(349, 4, 501, '狗蛇賞迷')
(348, 5, 506, '擊稱綠萬采')
(347, 3, 509, '勢覆貞')
(346, 4, 513, '懸登藏輪')
(345, 1, 514, '嘴')
(344, 2, 516, '嚴貨')
(343, 2, 518, '丁豐')
(342, 4, 522, '局獨留雄')
(341, 5, 527, '桃活英談謀')
(340, 1, 528, '至')
(339, 1, 529, '葉')
(338, 1, 530, '顧')
(337, 2, 532, '決靜')
(336, 3, 535, '移銅髮')
(335, 3, 538, '刑單照')
(334, 3, 541, '假傷棄')
(333, 5, 546, '儀御易苦集')
(332, 2, 548, '府裏')
(331, 4, 552, '井端舞邪')
(330, 4, 556, '商太越遷')
(329, 4, 560, '印屬律除')
(328, 2, 562, '句愛')
(327, 4, 566, '強昏期松')
(326, 1, 567, '非')
(325, 3, 570, '次秀職')
(324, 3, 573, '策籍聽')
(323, 8, 581, '列刺吏多榮淫磨約')
(322, 2, 583, '拔毒')
(321, 4, 587, '博告狂迴')
(320, 2, 589, '族果')
(319, 4, 593, '斗梅鬥鼎')
(318, 1, 594, '能')
(317, 8, 602, '泥浪的罪臨荒錯頓')
(316, 2, 604, '怨拜')
(315, 3, 607, '保婦送')
(314, 3, 610, '投求量')
(313, 3, 613, '案碧豪')
(312, 6, 619, '危厲執是羽賊')
(311, 3, 622, '巴枯避')
(310, 1, 623, '船')
(309, 1, 624, '鹽')
(308, 4, 628, '亡威蕩護')
(307, 2, 630, '溜鸞')
(306, 1, 631, '位')
(305, 2, 633, '履鼠')
(304, 1, 634, '聞')
(303, 3, 637, '乘旗雷')
(302, 4, 641, '偏材鉤館')
(301, 2, 643, '代原')
(300, 3, 646, '全恩腦')
(299, 4, 650, '佛村符部')
(298, 4, 654, '吃尊種良')
(297, 4, 658, '濟累群若')
(296, 5, 663, '史帳洋近降')
(295, 2, 665, '環考')
(294, 5, 670, '少差敗辟鬱')
(293, 2, 672, '梁滿')
(292, 4, 676, '委復感頂')
(291, 3, 679, '夢徒黨')
(290, 7, 686, '伯受舊規軒險魂')
(289, 6, 692, '休凶干校福類')
(288, 4, 696, '帝率略顏')
(287, 4, 700, '社紫藥補')
(286, 8, 708, '勝喪底憂拉款殘革')
(285, 2, 710, '察禍')
(284, 5, 715, '柔裝蹟顯飾')
(283, 7, 722, '屋智消澤防院龜')
(282, 4, 726, '改煩盡致')
(281, 2, 728, '試責')
(280, 5, 733, '具池泉翠膽')
(279, 5, 738, '劍囊排術鏡')
(278, 2, 740, '納講')
(277, 2, 742, '寄標')
(276, 2, 744, '亭檢')
(275, 6, 750, '射淵溫爭羊閣')
(274, 4, 754, '屈熟訓貫')
(273, 4, 758, '便傾圓宣')
(272, 1, 759, '習')
(271, 3, 762, '杖殿領')
(270, 5, 767, '包含床線討')
(269, 5, 772, '冥監米貪鹿')
(268, 5, 777, '奉父設課醉')
(267, 5, 782, '尺巧庭疑駕')
(266, 3, 785, '承洞等')
(265, 5, 790, '冷壁延着算')
(264, 7, 797, '持料暗潛產者鼻')
(263, 3, 800, '備呼妙')
(262, 2, 802, '招間')
(261, 1, 803, '在')
(260, 3, 806, '粉財雕')
(259, 4, 810, '幹施桑犯')
(258, 7, 817, '念束注程菜賤霞')
(257, 5, 822, '塗壽待愁貧')
(256, 4, 826, '接闕隨題')
(255, 5, 831, '垂富慮童鮮')
(254, 5, 836, '嘉害盜農逼')
(253, 4, 840, '哀役蓋記')
(252, 4, 844, '務弱蘭詭')
(251, 9, 853, '就怪扇細聚茶警買逐')
(250, 3, 856, '操止韻')
(249, 6, 862, '候卷歷湯灰騎')
(248, 4, 866, '漏腸臉違')
(247, 2, 868, '抱牌')
(246, 2, 870, '優枕')
(245, 4, 874, '烈肆谷靡')
(244, 1, 875, '盛')
(243, 6, 881, '其姦弓賓跡軟')
(242, 4, 885, '帖痛適銷')
(241, 3, 888, '劇吹更')
(240, 3, 891, '著踏錄')
(239, 5, 896, '夏披歡界翼')
(238, 5, 901, '侯提狀謹辯')
(237, 4, 905, '做克翻跳')
(236, 2, 907, '敵衛')
(235, 3, 910, '瓜瓦蒙')
(234, 7, 917, '何奪序滅看請顛')
(233, 6, 923, '了味廣彈練遐')
(232, 5, 928, '喜奏戒豆鱗')
(231, 7, 935, '友孫氏祭託鋪驕')
(230, 5, 940, '廢繁肥腹陣')
(229, 8, 948, '丘唱寵悲愚毀爛衡')
(228, 3, 951, '旁炎誠')
(227, 5, 956, '厚寢想腰蠻')
(226, 2, 958, '特衰')
(225, 2, 960, '斂漫')
(224, 1, 961, '存')
(223, 5, 966, '則園壯左戎')
(222, 3, 969, '征載鬧')
(221, 9, 978, '冒劫州徵滯狼獻辨雀')
(220, 1, 979, '剌')
(219, 5, 984, '亮仁審巾緣')
(218, 9, 993, '升去娘把晚賦輿鄙銜')
(217, 8, 1001, '團奴搭稅突證豔馳')
(216, 8, 1009, '介凡吟屯救裁詳費')
(215, 11, 1020, '儒宇快撲敬橋洗祿箭隆齋')
(214, 6, 1026, '削向寡甘迎頑')
(213, 5, 1031, '員彩焦籠雙')
(212, 5, 1036, '卒吉婆置響')
(211, 6, 1042, '忽慢掌淺舟賜')
(210, 4, 1046, '樣瑤總諸')
(209, 2, 1048, '李釋')
(208, 7, 1055, '凌式怒旋曠片牽')
(207, 3, 1058, '乳探答')
(206, 2, 1060, '庸被')
(205, 7, 1067, '屏忠拘玩珍膏驅')
(204, 7, 1074, '剛廉津禪縱繩配')
(203, 10, 1084, '啟專旅槍激爵獄階霧魄')
(202, 4, 1088, '價宴寸陶')
(201, 7, 1095, '依固寬往整杯桂')
(200, 6, 1101, '吐查潤琴矜穀')
(199, 3, 1104, '停縣針')
(198, 10, 1114, '借初契川弟紀統翁脩贊')
(197, 4, 1118, '觸詐邑陸')
(196, 4, 1122, '姑燭票衝')
(195, 5, 1127, '峻殊肩讓速')
(194, 3, 1130, '災申穴')
(193, 3, 1133, '弊架邦')
(192, 9, 1142, '共剝吳困孔廟曹陋雁')
(191, 3, 1145, '寫汗聯')
(190, 6, 1151, '京僧巖芳額麥')
(189, 8, 1159, '弦撫朗獸瓊秦第篤')
(188, 9, 1168, '勁尚染柱泰涼潔牆默')
(187, 8, 1176, '凝寧崇惠敦昭爾矢')
(186, 4, 1180, '函扶毫窩')
(185, 9, 1189, '尋派版狐番網蜂趣那')
(184, 5, 1194, '巡攻爽祝纖')
(183, 12, 1206, '今匠奔幕托穢蟻街辱郊阻鞭')
(182, 5, 1211, '俊勇勤恨源')
(181, 8, 1219, '乖慘慶滑燒脈軌震')
(180, 8, 1227, '區幸掩許鋒鐘飄駭')
(179, 4, 1231, '耕蠶貢遮')
(178, 5, 1236, '渾璧畏終譽')
(177, 9, 1245, '仗侍加占撥旨莊蓮貼')
(176, 6, 1251, '徑昌洪缺超鍾')
(175, 3, 1254, '戾杜遇')
(174, 6, 1260, '壓憲摩研編裂')
(173, 6, 1266, '充厭授曆沖穿')
(172, 5, 1271, '展忌暮枉遁')
(171, 9, 1280, '倚冤及攝榜牢由誅趨')
(170, 4, 1284, '搖未零魁')
(169, 11, 1295, '供嬌惑憤損昧曉禽糧酸醜')
(168, 7, 1302, '旦欲淡混祥逃鎮')
(167, 7, 1309, '到宅犀繫肅訪賈')
(166, 9, 1318, '免境壤導己忘棘楊淹')
(165, 4, 1322, '低媚縮途')
(164, 10, 1332, '割建挂撒男碎薦詔輔輸')
(163, 7, 1339, '兼抵掃棲給諫辰')
(162, 8, 1347, '久換據牧籌膠衍貌')
(161, 7, 1354, '側兔堅完庶謬隔')
(160, 9, 1363, '仰巨帽座擾旌淨莫鵲')
(159, 5, 1368, '奧臥茂蘇襲')
(158, 9, 1377, '僻弔拳灶爐翰返鎖隊')
(157, 6, 1383, '侵像冬演瑞遲')
(156, 10, 1393, '右寺抗斥暢栗羞蒲遣閉')
(155, 8, 1401, '例夕態拙構汙盈蹇')
(154, 11, 1412, '偽勾卑套攢於漁纏與限鵝')
(153, 6, 1418, '冊助夾孝尸耗')
(152, 12, 1430, '慎戈戴洽犬碑綿緒胎藝豫障')
(151, 12, 1442, '宰效焚疊癡益眷祠訊遙驗魯')
(150, 10, 1452, '卻因壇徹暖朽維羈蔽闇')
(149, 12, 1464, '卜按樸歎殷篇育荊賴釣願麤')
(148, 12, 1476, '伐侈叢壺晦植泛湖溪硬祕須')
(147, 8, 1484, '兆抑敘瑣肝諧隙驛')
(146, 10, 1494, '健姿患慕札盟究繡罷誣')
(145, 9, 1503, '乞倉悍祀蓬蠹覽述駁')
(144, 9, 1512, '勒庫慧截沮澄薪辦鄰')
(143, 12, 1524, '判勸吞始幣早畜窗署訟鑽頹')
(142, 8, 1532, '倫崩忍核溢繼豁麟')
(141, 11, 1543, '奮妖孽憑振捕敏盧秩蹈遞')
(140, 5, 1548, '圍基稽誘陷')
(139, 6, 1554, '竊粟紛罰腐蠟')
(138, 8, 1562, '丸佩偃捷析梨模淚')
(137, 7, 1569, '層挑攘淪竄蒼襟')
(136, 13, 1582, '促悟抹押攀森潑炮矯稟茅豎迹')
(135, 12, 1594, '于匡妻峰抽椒示竿級臂藻蹙')
(134, 9, 1603, '偶創慈猛獲耀蟬誦餐')
(133, 9, 1612, '丈填悶拂敝斜柴鑿鵠')
(132, 9, 1621, '僕擁擔準現綺裘隸麵')
(131, 14, 1635, '儲冗括朋漿潮罵荷藉評豬躁遂錫')
(130, 7, 1642, '匿唐徽悅範邁閃')
(129, 11, 1653, '儉坊宏巷循採瞻謙郵闊鴉')
(128, 7, 1660, '協濫瘦羹認醫黎')
(127, 17, 1677, '住卿呵宵屠恤拍擺斑朴滴融贈跌銳霄魔')
(126, 10, 1687, '冶宜寇必怯絃苗躍軸逞')
(125, 13, 1700, '乎午叫婚季岳悔減簿袍讒鈔鞋')
(124, 11, 1711, '岸廬斧梵棋誤謗賀跑鑑餅')
(123, 9, 1720, '偷援梯樞渠續袖踐遼')
(122, 12, 1732, '墮壘尖峭捐欽藍貳赫踵透逢')
(121, 16, 1748, '傲允嗣墜壞巢帷康忿擬斬柏粧緩芒鈍')
(120, 19, 1767, '妄妝敷歇濁猜球篆褒覺諭謁贍蹤迫郭閑飽黜')
(119, 13, 1780, '再姓撓播煞獵睡窺筋訛貝際駢')
(118, 17, 1797, '佐垢扎批梗梢永爪綱翦脂艾藩虐虞誓閱')
(117, 7, 1804, '匹敕泣翔詰霸鷹')
(116, 16, 1820, '享刷台囂忙摧斯椎沉潰熊筵縷賭赴鴨')
(115, 18, 1838, '仇佳個傍副夭戚技撞穩耍胸觴詠讀趙髻鬢')
(114, 14, 1852, '凍幾欺涉溝瑕盆租芝趁蹄較輝逾')
(113, 9, 1861, '唇寓挺槐沸牒窟譯轡')
(112, 14, 1875, '咎喬恭戀扣替梟棗漆狡肚膚蜜鈴')
(111, 14, 1889, '券劣崖彫掠擇映督簪緊蕃製豹預')
(110, 15, 1904, '伊偉傅兄刮塔戟洛爺糾訴趕轍頌鶯')
(109, 20, 1924, '卓即墓悠惜扯暑滾狎疆筒組纓翳聳苑螺遭雉鴛')
(108, 15, 1939, '並刃嗟坑域帥憐棒紗郡鍋閭韜駿鳩')
(107, 15, 1954, '圈楞淑淳畢競簾胥裙譜貶跨躬釁鬚')
(106, 14, 1968, '串刊愧曜測灼筍箱諱酬釐鑒駐驢')
(105, 13, 1981, '倡呆妍嶺彌拿搜漂績罔蒸蛋鈞')
(104, 13, 1994, '兜剪叉店愆脅舒蜀裹譏迂醇餉')
(103, 13, 2007, '宦暈皂盲禾粗綴蝶讎酌隅雋飢')
(102, 11, 2018, '似啞拾泄紋逋閨韶項馭馮')
(101, 20, 2038, '伍剋喝墳帛并廝廷溺滋灑碌秉織蝦裳賽輩駝騷')
(100, 14, 2052, '乏僭召惶捉晨榆砂稚竭絡膳鏤飆')
(99, 12, 2064, '且佚叔徼液炭瘡稀系緝蟠訾')
(98, 20, 2084, '傑后均媒希幫慰此沐澀疲純蔭諷貸輦辣遵鄭酷')
(97, 21, 2105, '凄勳哲囚垣妃弛懼攬晝氛猥硯臘艷莽蘆虧誇販釘')
(96, 15, 2120, '伴債堆幻敲槃浩浸渴股腿衷逝邀鬻')
(95, 22, 2142, '呈婉怠我抄拒掉沾牲眩竅羸腔艱葬袋詆贅酣鞠頤飭')
(94, 6, 2148, '柄澆穆鉛饑饒')
(93, 17, 2165, '卵哥埋寂屑拖揭沓洲煎狹綵翹膝蕭蹶邃')
(92, 21, 2186, '伎倍哄壑娥廩戍戮握旱晶柯桐檀濕灌眇箕縫般輯')
(91, 22, 2208, '佞侶倦哭嚼圭奸已恆濡眠箋築絮繆蛾衙該賬銘鍊陌')
(90, 16, 2224, '亢姻廚摘普曳檐燎甚稻穎衫複迭鋼闌')
(89, 26, 2250, '丟互僚咽嫌弩彝徙慚插揮擢斤湊熙牋矩膺虹蟹衢誨遏陀饗駒')
(88, 16, 2266, '孟尉帆拱摸澹焰皋虜蠅訂謫距阜鳧黍')
(87, 11, 2277, '兇剖宸曼榻炙瓶葛躡邏鬆')
(86, 16, 2293, '劈叟吾坎幡暉杏棍穹竦耆褐褲貂迸韓')
(85, 17, 2310, '侮催呂弘擲曾桀泊瑟痕稿糖綸虯謾鯨麼')
(84, 19, 2329, '亞剔匪哨喇嘯姬悖挽朔棚畔皓糊膩誕軫釵騁')
(83, 12, 2341, '他付仲劑娛彊概欣漸猴貲隘')
(82, 20, 2361, '值剽劉厄嘆奠尤尼撮欄湛甕確磕禿籬蟾誼讌鹵')
(81, 17, 2378, '兀几卹吸增慌歪污瘠聘訶諂諾謠跋邈黠')
(80, 18, 2396, '咨喻嘲嚮夙宋巫恣措棹牘犁疵碩脊豕遜饌')
(79, 20, 2416, '什係否喧廳惟懦涵漠瀆瑰盼脯蠲裔謨譎銓閎靖')
(78, 17, 2433, '塊墊奢幼恐晴氈淋淘渡爨甸笛綜蠱軼轟')
(77, 23, 2456, '刁哈宛屍恬悽晏樵檻盪睿粥絳繭脣芽苟蓄贓跟轅鉅饋')
(76, 19, 2475, '凋嘗塌悴慝懶棧瀝窠綏聰覈轂邸醋鑄闈靠魏')
(75, 28, 2503, '件伸俯俸控搆搶棉榷殼添烹甜瞎窘粹緯縛繞羨翫航蠢軋迅閫靴黏')
(74, 24, 2527, '冕准各寮徐恥拏昆橈涌溷漕煤猾甄砲籤蚤辛陂隕雍髓黛')
(73, 23, 2550, '企勘匱妾宕幅懇拐樽渚煉狠琅疇祈祗稍纂芻苛誥軀韋')
(72, 25, 2575, '俏勃叱坡塘墟嫁孩幃悚擦欠毬浦縈蛟訐訕譴貓貽醒驥髯鱉')
(71, 20, 2595, '僮勵卦夸嬉岑怕拓楮橐段湘潭熏禱稜簇蕪隴鷙')
(70, 25, 2620, '啼噴妓宥悉捨捲撰攤械梳棟浴渥磬簫糟翅菊衿踢雌馴麾黷')
(69, 23, 2643, '傭奶悼懿拆揣攪暇汲沃泡涕猿礙糜絜缽耐衾釜陛顫騙')
(68, 8, 2651, '倖扃搏犢猶臭蔥賄')
(67, 31, 2682, '估叛唾恢惹慄掇擅攜旆杳槁汰況溶炊瓢祚簽絹綽耽肺胄蔚薰醬驟鵬鶻齡')
(66, 27, 2709, '乙俠壹屨徇戢敢槽橘沿涎淒溟滌灘燥苞萌詬誑賁贏趾鐫餌鬟黯')
(65, 30, 2739, '俎匣只嬰岐弁抓拋捏昵株櫛殖烘煥瑩畿盘篋蔓螭輅迥逮遒邱郢酥釀駑')
(64, 27, 2766, '也伶冢圃壅妆庇廊扭拊拗挨晷棠槎猷綬蜚袂裕譁逕這銖阮頃鯁')
(63, 17, 2783, '些咬喉婿帚揆斲澗濃炳煖諛諠讙賑錐頸')
(62, 28, 2811, '丕億吻妒幄廓怡挫撇撐昇梓梭棺盞窯笙紆臆董藤誚醴鉗駟騶鴟麋')
(61, 28, 2839, '刪剎咸奚婢惕惰扁掖殃沫淩濯瘁脆臧茫茵蛙袞褻訣謔谿逗霽驪骸')
(60, 21, 2860, '云仕喘噬尹峙廂扈扳桶棱渺牖珮癖砥簷醮鑠髦齧')
(59, 29, 2889, '乃仄勉叨幢庚憚抖摹歐汩瞞聒腴茸萍褊詢諦譬讞赦跂踞郁閤鞍驩鴦')
(58, 24, 2913, '予嘔奈寥惱挾揖撩晃朵毳濤烝砌穨穰笠肌舄薀贖遽鄧頰')
(57, 30, 2943, '伙伽儔叩吝咒央寖島嶽懲懽攔敖旄榛濛炫熬窳翕蒿衲豚鈿陟隳餓驂麴')
(56, 26, 2969, '僵噎噪圜崑廠慣旬昔晉殄浹潦瀉熾稔竇篷緘茹轎鋤鎗闢闥靄')
(55, 27, 2996, '历唯喚嗔堤嶮廁弭恕掣摶煦燄爆牓璫畝磚聾腥萊蝕詘跼隻雛騃')
(54, 24, 3020, '募妥弧愉憎或撤撻构桌殫燿珪症簸繪罄荡萃蕊蚊衒諮邇')
(53, 33, 3053, '么亨僑劃吒吠坦奄妹寅愴掙敞氓涯潘璽癢祇秘稷稼站紹繇繹舅藪袒購輟阪驁')
(52, 24, 3077, '卡卯叹忤憨懋杵洒涸琢碼秤竟笏糞綃舛蘿蝸貺錮鑼闡騖')
(51, 46, 3123, '伺兌匯岡巍庾怖惋抉抬捻擠既樊毅毋汁涂湍滄瀾烽燔爍牡狄瞽祉箸籙紳緇芥葵蚩詣詮讚蹴鑾閔陞頒頗鷺齎')
(50, 38, 3161, '丐喙夥孰庖廕恚擿楫櫃毗沽洩焉獅療瞪礦窄笞絨翮耦診謳貿蹊蹲輓轄迦醪鑪閻闔霍鞫驍')
(49, 30, 3191, '丞俚厥嗇嫚孱屐彎悵悸搗桓檄浣璇瘴矛箴籥粒縟耿舂芬謊賂鄂闲餞饥')
(48, 27, 3218, '傻咕啜型塹摯摺斃棕歧渙湮禦筭箇絆繒繳胤腕蛤蜃蠡賠鐸鬯鼇')
(47, 38, 3256, '卉吁呀售坤媽嫉嬖寨弋憫扉挈捶旃昂梧楹槌漲燋犧甫疫瘋盃繃脾腮艳菌蟄襯辜鑣顓鬣龕')
(46, 39, 3295, '倩傘兢勿匝吼嘿堵娃婁孜岫强径悄揉攏攙椅殞瀛炬畦睛硃礪簧籃腫茗葦蒜蔬蚌覷蹕隧饞馱')
(45, 43, 3338, '凜厝哺啦嘶垛堪壟姨嫩孚彰很恪懾扒扞拽掛曙最欢燧爬獷瓠眸睨磔筠糕紐缸荼虔蝨蟆覓諄赭騫鯉龐')
(44, 32, 3370, '佯俱凱嚇帑幌彥惻戇拈旛栽浚淤漬瞑碗祐籟肘肯膜蕉裾觥賚週阨颺鴈鶉黼')
(43, 42, 3412, '丫劾囉埃奩嫡弗彤愿憊憶摽杆杠柘樁汾淮湫漚煮牟珥疚瘞瞀矚禹笄繕翎肴胃衽讖蹬鐙霓頻颯鹹麝')
(42, 36, 3448, '份儆償儷凰吊哩囿帙幔弼悒抃撈攫枷柵狙睦磊窅罕羲耄聊萎萼葩詈譚躅遑鄣鈐餒駮')
(41, 45, 3493, '併佻倨偵嘈夔寤峨崗怛愨懈挹杓枚沛泯洶溲潢炸稠窈簟粱綢膊臼芸苔藹蛩蛻訥跪遍鉏陬隄霑餼驄鵷鸚黔')
(40, 45, 3538, '伉俞冀刳剿勻唧嗚噓埽墩嶠幟彪戛掘搔搬擋攣楷榴沴涓港漱灣燃璞甿盒盾笨筐縑罩肇舫蔑虺誰贄踴髡鮑')
(39, 41, 3579, '仆俘偪嗜嚷堡屁屎彭愍愕慾擯斫洄滂滓癩穗窒笺絞纍翟菲菽螢裒裸襦觜諒譟豈貍踰蹻躐鉞錚鵰')
(38, 59, 3638, '亙仔佇僉剩卸吭呱咄嗤巒徂忮忻憾捧掾描晤楓楯汪漾澈瀨燠狷畸眄眺睇礱窶笥粲絀縞罐耶肖莖蒐襪觚譖踊躋躓錘鏘鑰閟需霏靨頷鬨鷗黝')
(37, 45, 3683, '仿僇僦嘻姊姝寐峽嵐忒恃扼擘旒椽淅淥渝湧漉漭炒痾眊矇碁碓碰篡翥胞膾芋葆藜虀襄覃註貯踣鍛霆鬍魅')
(36, 42, 3725, '侑冽噤圮堯姜嶂悃愎揀擒斛杪棼煌煽熒燦牝盂眥砧秧稗緡罽脖臚舶葫蕙蜩賃賒赞跛遘鏗鐺阡顙鬲')
(35, 56, 3781, '乍佑僂吵咀咳哉唆喳圉坼堙复嫂嫗孕孳孺恍拷掀晌曝檔櫝殲泠渟澡炕皆盥睽祅箔紈肢臠艇薩誡諍諜豺蹺躲迤遶酪閏霖靚飧飫餳鶚')
(34, 42, 3823, '仍劄勺匏圻墻媮寰尿嵩彼恰愜慨扮斡杭歆歉殯汛炼燼琱癘眚祲筩筮筴箠綾縕脛艦褥諳譙邛鍼閥鞅')
(33, 63, 3886, '俟俳們剡啖坯垠塋塚墾姐嬴嵬廛廡彙惺慵揜攛暝杞柝桿椿榦榭毆泓洿淖濬玷珂瑜疋瘢睫瞬磴礫禳窪笳緗緬縠縹耘蓉誹讋賸跱鋸鎔閘閽闖隋雇靶駔')
(32, 51, 3937, '佃佗咂哇啄喑嗓嘰堠姆姣孑徭惛愈慟攄旭昊橛歹汽泝涅猩琳疼皺竺翩苴茲荫蕤藕蛆裱褫諢赬蹀蹌闐霾风餽馨鮓鮫鰥鷁')
(31, 52, 3989, '倅偈凹刈噫墀奕尪岔崎彘慴斟曦朦杼殆殉沼泮渭滔滲炉狩狸獠獰璣甌疹礬糠繚纚翊胖臻舖覲訖謎貉趺踔迍醢閡駛駱騾髭')
(30, 66, 4055, '傖刓劬卮发另呴咯哆唬啾嘎嚕嚙媼嬪幘庠愣憩憸懊懣懵懺戳扢捍捱攷旺椰櫓每漣澇瓷痿禊篾紊緻縵纈纛羔羡臍芙芹蒂覘豸賻蹦軿逵郤醅閹閼阱靳鞮髫魘')
(29, 59, 4114, '丰儇儕凳咋囑姪媵它屣嵌帕恫悛捫捽擣曬桴欹歿殽漓犒琛瓮睜瞿矮禺篁紱綦緹縻纊罍羌胙腊臊菱螫詒謂賺跣躄遯酋醞鎧鏃闚霤顆馥鳶麒')
(28, 49, 4163, '偎僊叭吱址坌塾墉怵愬擎旂昨柑柿梆楸汝炤爻璃疽皎瞋磧禋秣穠箏簌糴耨菑菩蔡蚓蛛蝎褭襖謇賾踩銃闉隤餔騂黥')
(27, 67, 4230, '俛倪匾厖呢喫嘩垓埒培堰塢娉媟巉忝扬拯挖撅撚撾斐晞晻暄暫杉栖淬渤湔澌灸猗獺甍疙痞瘧盎瞥碣祓祟窖絺締繢腎舵茬菹藿詹趫蹋轢逍霉韞頁髀鱠鶩黻鼉')
(26, 61, 4291, '僨儻勦噥娟媛媳嶄嶔幰怙扆拭拼搨擂斝槧橡櫂櫱欒沁溥犖璜瓏甑瘟睹砰磐穡絢罟羶脹臬舸范莎葺薇薑藐裨訇詛謚蹂蹐蹠躔轆遴隈雰頡顰驤鯤')
(25, 78, 4369, '丙佈侃倔冉凈凸匕卞卬吮呶咿喊嗥噩噱囷圪壩姚姱娑娶娼媿嬾崛巘巽帔廄廈怔怳憒枳柰樗溉漪濆玳珊瞳砭窆筏箝篠簞罅膀苫茨蜺蠆裊詖詼謄豢賕跗踦迓迪鄒酉酲醵錠鍵鏟鐐閩闃鱸')
(24, 77, 4446, '丑个亦余你侄俄傀剸咧哽嚎嚚嚶塑嫠崒崿嶷忱恁愷慳慼摭擷攸欻歊汀濱瀁炯焱煇甥痊痼瘖瘵祁祧秕窕窾粵糲紕紡絛緞纘肱腋葭葷蓐蓼薙蜒蜡蠖謐貊踅迕迢酎酤闓雩饕驳髹鷲鹺麈')
(23, 93, 4539, '佬倣偕僥儂儈兕咭嗒埶堊堞壙岩崔弈怎悰憯懌扛抒拶捺掎摟撿擄擗擱擴敺旰昃暍暱曩楂槊櫻毓泐泗渣澒猋猱獃甃癰瞢磁礎祔篦篩紇綻罌肄肋腑舋苓苕荔菁蒞虱蝗褶襜觕詫詶諺踧軺軾輒逶鉴鍔閬霹韁韭顱駘驀鰍鴆龢')
(22, 79, 4618, '佹儘劌叡吧咍喏嗽噦埴塍墅墙嬗拄挪搉撝撟曇杌枸柬櫟殂氐气汞泱渦瀟燙獐痹癆皴瞭碾磯祛秫箍籜粘紵綰縐腆莢菀菅蓊蓍虓蜮蝟螟螳褂觔詗誆諏贐蹉蹝輜逴遨邵鏈鑊门陡霣顒饔鴿黮')
(21, 104, 4722, '亟亥佼冲劘唄啷嚬圩夯姥婪屹崙嶢异彀恧悌懃戕找捩揄揪摳旻暌曛枋柞柩桷楔楛橙檠櫜櫬歛毖涔淆濩瀦琶畎疥痰瘤癃癱皦盭睢瞠瞰磣穫窣笮筌篙篝繖纜翣耋聵膈茄萱蓑蜿螞螻衄襠覬詡誌譾贗跖邅邯醑醲鋩针闍雒雹霈鞘鞞飣騏鵡鷂鸛黽黿鼙')
(20, 91, 4813, '丱乂亶俵刨剉吶咻哪哼唳嘍坻埏壼奎岱幬庳庵徠恙愾慊慑憋拌捎掐斁晰曖杷枵槿檣殤沱洊煒煜煢熛熨玲玻瓣甓甯畋疣痘眈眙砑磷礧窥簋絰綆縶耑聱舜芊芟茀菴蔕螽蠕褚覿觝諉豗貙貰赧趲踠輻逛酢隍隗顥颓鼾齏')
(19, 99, 4912, '但侔俐俶倭傴儗儡儺儼划又叮呻咈哮啣嘟嘵噶坳媢孀孃宙屢峒巇庥徊忖恇慍懍懒拇挐搊搐搓摔暘杈桁椓榔欖氅氳沆淙渫滃潁潯瀧畬痒癲砦确笆籀籮綁缶缾膘膿茭菟菰萄蘋螘蟒褡襴觳訝賙賡跧輈輳鄲銛鎬鐶閶闒阬雝韉颼馘鴞鷰麓')
(18, 99, 5011, '伕佔倏剃匙匭呷咫咶唼喣嗛嗷噭囀坰埠壚壬夠娜孛崟嵎廨忡惸愒懟扑掂搦撙撼旐枲榼槨歙泳湃湎滷潏澍瀑瀰炰燮爇琪瑋畤瘕癭皛砍礡禎窨笈篽紺絓縢纇罣聆胔胚胝臟萋薨蘄蜑蜻蝴誖諤貤踹轔辮釅鑱隩霰靂颸飼饘馈騮驱鴇鶬齕齪')
(17, 120, 5131, '仞僝儳厎咚啁喋嗑嘮噉嚅嚥塼头嬭屆嶼巔幙忭怍惘揩搒搥搪摻撏旟晬曀曶朧柁某栲棣楗榱橦櫳毯沍涇渰溼溽澎瀠灝焊焙焜煨煬熠犴猖甩畚瘩癟癥眯眴矗磽筦簍糗紘紬綈緋緦縗罡罹羯翬脰茁萁葡蓽蔗蕈蚑蜉蜋蜎蜓袁袷讜豨豳趄踡軛軨軻輾轝鄴酹銑鐮陪頎须颿马鬐鬒鬩鮒鮭鰲黧')
(16, 110, 5241, '佷剟匆唶喃嚲堿塉妨姍嫮宁寞屧屩岷崤嶒帨恓悁懂懞捋掊搢摛攖机柙棰楣榨橑檯欷殢氂澣濊瀏猒獘琵瑁痍痔癸皁盱眨砸磋秸签篳糅紮紼繻耎胯腺膛臞荐蒨蔞薈薛蚁衎袪訃詁詵誾賅赩跕跚蹩轓轘逖逡遄酆鈇鋌鏢鑷铺閾陔雖靦鞚韝颭飴餧饟駃鬃鶱麇黌鼯龔')
(15, 137, 5378, '傚儋儐儵冪剜努匽哂嗢噠嚨囁囈囤圄埳堇婬嫋嫣嫺尨尻屼岌崽嶙幛怫恒悱慓懨戧搠撕旍晡曄朘朮枘柢栝桄樛欬殮沌泆滉澱濞濮炷燁爚爹猝獪畯疢皤盍盹瞧碴磅磈祼禘竽箬籲糝紉紓絫纁罝罾羝翾聿肫胾膂艙蓁蓺蔫藂蘧虻蛀蟊蠔蠣衔袤袱裀襞覯誶諼踽躑躒輶辉郛酡醨醯醺釭鈕鉦銚鎛鏝鏹鐃闞隼霎頦饜驃魆鴳鶡鷸鸕齠')
(14, 129, 5507, '乜侏倆倌刖勛匈呿咱咷喁喟嗆嘁嘬噗奐奼妣媧孥嶪帟弇彆慷憀掬攒无昕昴暾曚柈棨楨歠沂沚洑浼淄漩漳澳濾灩烜猻獧獮琯瑚璘疤瘍癉癬盔瞅矻硎碟祫穟窊笻筑筲糶紲纔羆羼耇膴膻舡芘芷苧荑莠萸蓴蔔虢蚍袟褌褓襁襚誄諡謅讕赳趷趼跎踖踳躉迮遗酗鉉鉸錙錶陲靸鞬鞶鞿颩饁饉馹騑骰鱣鵜鵩鷓鷦齁')
(13, 175, 5682, '佉侗侻傒僱儹勋厘哏唏啪啮喈嘏噹嚓坏垤壕娣婷媲嬈嬛嬸尽岨崢嵇庋廋弢彴徉徨忪怏恉惝憍憧懆拚掄揎搴撢撦攮斿暵朕枌框梃梏楠樾檜櫥櫨櫪櫺毿泌泚泫洌浡浥溘溯滕漰潼濘濠瀹熇爰牂猊玃玦玫琝瑛瑱甖畀疐痢痺瘼癇矞砢硝碕秏箐箑簏粽糈綣縲罏耒腯臝舁艮芭莧葅蔀蔌薆薉薤蘚虫蚖蛺蝤蝮螂裼褰觿訌詎謷譔豭賧賵贔趟跽踆踶蹡躂躇连遝邕酖酺醁釧鉥鋏鎩鏑閈闤陝隰靛鞦韡餚餡驎骼髽鯢鴣黲黴鼕齔')
(12, 154, 5836, '亳价伞倜僄儜叵吆唁唔啗喀嗄嗡嗶嘖嘹嚌埆埤壖奓姒娩婭媾孅宓寘巀帘彔徯怗恂惙愊憬戊戡抨抶掏斌斸暨杅杙柅栱桉楦槮樟沕洳淼渲湩濺瀋灕熯燾猢珧琤琦琮琰瑑璋畛畹瘳睞睬瞵矍矰磑祆祜稈篚籩緌縴繙耙肐肪腌膨臛臾艘苒苾茱荅荏荻葸蒻蓂蕞蕨薊薌薜藎虣蛭蜍蜣蜷蝝螾蟣蠃裯謏讟踝踱蹓蹭輀转遛酵醆醳鈸鍬鎚鏜鑲钥雺鞏飂餑馗鬮鮐鰓鱟鱷鴃鶿鷇齦')
(11, 159, 5995, '乐书乩亹仡俑偟僅冏劖劭勗呦咆咢哗哧啃啐噀噲囓坪埭堀嫷寀寠屜峴巳帢幨廥廱弒弥彯憺抿挼捃掯搘搧摐摑敧昱枰枹枻栓桎棐棵楬槓橄歔殍殛殳汶沄洹洼湓滸漻澥灵烙焯熔熸燀爓犍狃狖狴狶玎珀瑯璀甦町疸痴瘃瘥皞睒瞶矣硌碇禰稊篲簣粢絁綍繈罘羿脡舐苏苡荃蒯蓆蔟蔣蕖薅薯蚪蚰蟫蟺蠐衊褙訿貣趯趴輞輥车遫錨鍥鎪鏖鐍闋霅韃頞頫飞餗騄骫鬈鬋鬘魃鯰鯽鵑麑黕')
(10, 214, 6209, '体佪倘勩哦啅喔嗌嗦嚏嚘圯坵堝塏声妮嬋嬤实崆巋当彗彷悢悻惓惚惷愀愫慆憃挲捆捣掞揲搤撂撣擫旮旯昒朏杻枇枒栩桔棓椑榖檟檮櫑歈毦泔洸淌淜湿滫漶潸潺澮濇瀅烟焮熅熹燐燬牸牾狉珓琉琖琨瑪璺瓤甬疝疳痂痤痧癮皈盻眵睚睠瞌砉砖硠碭禬穾窬笱篛篸簑簦籽粳糒糯紞緱繐结罨耜肸胛脞舲艫芍芰苶茆荀荄莓莘莞菇菖葑蒱薺薾藷虖虚虡蚨蚶蛉蜨蝌蝠蝥螯裛褕褪襆觖觱訏訑訞諕謼证谹豉貔趔趿跐跬蹜躞躥躪軷輮輴轤进迻逭醟醼釂銹鍠鍤闟阤阼陴隃飪餕餫騅骾鬄鯗鯫鰭鳌鴝鵒鶼鹼麛黭鼷龙')
(9, 223, 6432, '仃优佾倀偢傔僿刲剴剷勖匜卤呃嗉嘛嘽噂囔坍坱坷墯壒壝奰姁娓娭娵婞嫖嫵嫻嵂廿忉愯憖戔扦拴挏搽擭敛斠斮曨曷朒柂柸栘梱棖棬椏椷椹槥槳橇欑欸歃殣殭毁氤汊汜洫浙涴淇淟溏滬滮漵漼潝澨瀕瀣灺牯狽獼獾环珞瑳瑾璨痌痗痟痡痱睟睪矬碨磳磻礁礨禜禡禧禫积稂窿笤筊箾篪簉糰紒紜紿絇絣絪綹縝繅纆红罋罛翌翱耬耰聃肓胊胰胳脬膋臀臑艸苹茇茈莩蔻蕘蚋蚱蛐蝣蠋蠓衖袢褎褵襤襻証詀諶譫词賨賮跏跺踒蹅蹍蹼軹輤輵轀邐邴酇酴醃釃銼鋟鍧鎊鎌鏊鏽鐲鑕鑞长阽陘隮雚霙霿韍頊飩餈餛饅馺魴鴒鷃鸿麂鼪鼬鼽齾')
(8, 256, 6688, '传佽侉侖俾倕傜傢僈儤刎劓勍勷匐吽呫咐咮哢唅唉唰唵啻喤嗝嗾噆噷嚦囡圊坨埜堨墆奡妳娖嬲岏崚崧嶇幪廖开彬忔忳忸怀惆惎惏惵憔憝戌戏战戺戽扠拑捂据掗掰揃揫擰敻斕晢曈柎柚桅桮梔楙樑樺檳欿歍残殪毼氄汋泬洏洮涘湄溔潞澂濼瀚瀲瀸灞点熀熄熚燖牴牷狨猳獦珩琬璅璠瓔瓚瓴痏痙瘙瘝皖皸皿盯眢睆睖睩瞚碪碻祏禖秒穌穸窌竁竣笔箄簠簳籯紂綷縋繽罂翛胼膰臕臿舠舷芮苻茜菠蒔蒺蓀蕾薏薔藟藺蘑蘢蛑蜘蝘蝙蟉蟟蟧蟯裌覦觫諝譊譸谾貜贛赏趍趑跤跫踟躊軏輷轑轻远迺迾逅逑邗邢郇鄶醄醍鈹鏇鏞鏦鏵钁铁闠阯隐雊靺韌韙餱饎駏騞騧騭髼鬅魋魍魑鯊鯷鰻鱼鶂鶖鷩鷯鷿鸂鸝黤齗齬齰')
(7, 293, 6981, '万仵佣佶倬偲僰僽僾儃儌党凊击剮听吷呾哎啍啑啕喭嗅嘓嘸嚄囮圇圞垸埵堁墁墝夤奫妊妲媺嬙嬿宄屙屮岠岧岬崦崱嵯嶝嶧嶭嶰庀廒廞彖徘忐忑恟恶惨惴扔抎抏抔捄揵搞搯摒撬擻攉攩敉旎旝昈暐曏曒曰朓朣杇极枑棽榾槭樝樴檗欐毚氾汍汭沅沔泙洟洧涆涫淈渀湑湟湲滎澠澧澶瀯瀵灂烤熲牣犄狺猓猘猲獝獯玀玅玼琚琥琫琭琲瑽璁璆瓿甔痝痲瘌瘏瘐皚皰盩瞟瞷硉硪硼碉磝礿祺秬穵窞筇筳筷箘箙篔篰簀簰粼糙紝絻綀綖緄縉縰纕绝罗翐聶胏胜胠胭艓莒菶菸萑营蕎薶蘤虼蚳蛹蜆蜇蜴蝚蝡蝯螗蟈蟶蠪衕袀裴褸襂襹訹詅詿諟諵謖謻说谥豤赸趠趹跰踉踘蹣蹧蹯躕躺輇轇轖迵遹邂邋邙邠酊酏酩醊醰醽鉚鉻鋅錁鎢靮鞁韔顶餬餾饈饐駙駴駻駼騣髒鬙鮆鯖鰈鰾鱔鲠鴰鵓鷖鸇麩麰黦黶齍齶齷')
(6, 380, 7361, '为丽乒乱亲仟伢伾侜俜俴俺倥傎傯傱僬儥兮凤剁劻匍华卲呰呲呸咥咪唈唲唷啊啵喂喒嗃嗎嗐嗖嗹嘀嘂嘄嘐嘒噢噣噯噸嚾囫囹圬坫垃垮堮墐备妗姘娠婘媕媻嫕嫪嬥孌孖学寱层屭岁岪嵲嶚巑幗庬廑廧张彄徜忧恌惊惦愔慇懅戤扺抆拮挍揶搕搰摋摎摴擩攲旖时昶晜晾朅杂杝栭梲椗楝楩楶榕榪榫榰槱橚檛檥歕歜汇汔汧沬泅洱洴浓浞涪涷涿淀淰湣溈滀滇滈滭漦潗潟潬澔瀍炱烋烯烺焌焞煟熳燉燴爌爝爿牿犵獗玕璈璐疔疻瘀瘛瘺皙盬睎矱矹砆砟砮硗硩磞离秪稞穷窀窐窱窴笪笭笴筤筥筰箜篴簭簹粑粻絏絿綌綮緲縊縚繰纸罥罦罫罳罻罼羃羇耷耾肭胲脽腓腠腷腾臏臡臲艿芾荈莛莨获萐葳蒟蒹蓱蕆蕕蕝薹蘅蘗蘺虒蚜蛣蛬蛸蜊蜞蜥蜼蝀蝍螓螿蟀蟜蟥蠁蠯衩裡襮覂覡见觭觶訬詄謣謦讔谼豌豻賝赮跇跙踼蹎躚躩輠輣輬轠辞迒遰邳郅郝鄱酃酈釦釽鈆鈚鉶銕銬錡鍪鎦鎰鏐鏨鐏鐻销锤閜陊隒雎霪靃靷鞈鞨韺颶飀飥餖餺餿饰馞駸騍驊驒驫骭髇髏鬌魈鱍鱘鱧鴠鵔鵽鶹鷟鸐鸡鸾麃黄黐黟黳鼲鼴齲齿')
(5, 498, 7859, '举乓从仳伋伭伻佌佝侁俉倛偫偭傺傽僛僩僪儅儓儽关别剄剚剞剺勣匼启吰咇哫哳唃唌唪唸啎啥喌喲噁噞嚜嚵团囪圣坩埸埻堲塈塕塙墬夬妞娙婀婺媌媯嫫嫽孋孬孵宬尬屝屺岕峋峗崍崴嵁嵺嶁嶸帡庉庨廌弸彉归彧忷怊怩恝恲悆悷惔惼愓愶慁慅慫慺憛憭憮懘懩懮懹戥扫扱拫捔捭掤掫揅搡搿摵撋擽攆攓攦斒昫昳晼杰杲柷柺栳桹椌榑樅樏樿橢橿檉櫚欃欘欨殀氧氯汃汐汕汨沺泃泧浯涒涬淢渹湜湢湱溓漎漘潒潚潠澉澓澴濈濔瀇瀎瀜瀼灊灟灤灭灯烔烞烰焄焠煔爟爣牏牵犗犛犨狋狌猺獉獍獒獫獬玖玢玭珌琇瑀瑙瑶璉甒甗画畽痎痠瘈瘣癌皪皭盝盦眑眒眕眶眹睍睥矉矓砯硐硜硱硿碔磉磎礓礜祊禔禠禨秈稌穇穭窵笓笵筅筧箛箯篌篣篹簜簬籔籛籸粞糨紃紩紾絖綑綪緆緪緺縭繂繾纑纤纵绁绦缿罈羖翡翿耏肛肜肠胗脤腧膃臢艄艎艣艨节芔芡芨芯芴苨茯茴荂荇荳荽莪菔菘菫萆萹蒍蓯蓰蓲蔘蔦蕣藭蘙蘠蘸虙虴蚴蚺蚼蛅蛔蛨蜢蜪蜱蝭蝹螄螈螣螬蟋蠉蠛蠵衚补衵袨裎褧褳襏襘襢襼观规觟誂誻諑諞諴謞譆譣议记诗语诵貆贉负贪趵跦跲踪蹔蹚蹸躟軔軥軬輊輘辙迄迆迨逜遢邰郗酳釉釤釱鈀鈒鈷鉈鋃鋈鋋錕錣鍍鍘鎳鏌鑌钓钻铜铲閌闑闛陆靉鞔鞙韅韸頀頏顣顴顾颮颻颾飉飘餃餟餤餪餮馽駉駓騸骋骴骹髧髲髾鬖鬷魎鮀鮪鯈鲜鵁鵂鵪鵯鶌鶺鷕鸑黂鼐鼖鼛鼩齇齘齟齮齴齵龠')
(4, 616, 8475, '丝习争仂伤佁佺侲俅俇俍俔俭倓倳偊傛傞傮僔僶儠儴儸儿兹养内凘刌则剕劊劗劙匟卍卖厤厹参号吩呥咡咺咼哃哅哱唚啀喓嗈嗊嗙嗯嘌噌噰嚀嚫嚭囅囌囝囟图圌圾坚垆垝堋堶塺墦墼壎奊妁姌姏姤娀娌婑婓婕婥嫢嫦嫿嬝孿宠宾寋寔尘尷屌属屴岈岊岝岣岵峉峿崝崥嵒嵫嵽嵾嶊嶓嶕嶞嶟嶬嶱嶲巹帊幦庌廙徦忞忺怓怜怦怮恛悐悗悾惄愻慉慥慱懫懻戃戩扜抪抰拟拲挻捅捘捥捵掍揠揥搣搵摁摓摜摝摞撘擐擸敔敪敹斨断旳昝晟晱暀暠暹曭杕杬杴枓枙柜柟柲栟桯桼梂梜梠梪梴棡棫椋椸楄楖楟榠榣榥榧槷樔樨橉橹檎檖檬檽櫞欂欋欱歟殑殕殗毧毨毹毽氍汏汴沇泂泖洵浟浰涀涊涗涮涽淞淴渊渢湉溰溱滞滹滻漈漯潇潎潾澦澼濂濦瀢炅炘熂燹爞爸牚犆犋犓狒狟狪独狻猙猰猵獶珈珣珫珽琁瑒璵甂甪甽畇畈疰痀痑痣瘉瘊瘓瘯瘲癤皜眐睊睕睭瞍矲矸砒硊硤硫硾碘碡碳磍磢磥礉礐礽祴祸禕秭稑窙竫竻笊笘笫筈简篘篥篨簁簨籓籧籪糱紖綟綯繄繯繶经绒绩缩罃羉羚羧羵耡耤肕胴胹脚腒腜腱臌舀舑舔艛艟艴艼芩芼苣茷药荴菆菵菼萇萦葯葶蒢蓇蓓蕁蕢蕷蕺藨蘦蘼虩虭蚘蚡蚣蚯蚵蚹蚿蛄蛚蛞蛦蛮蜰蜾蝒蝓蝻螃螇螉蟛蟞蟨蟷蠙蠦蠩蠮蠰蠽衱袅袭裉褷褾襌襐襫襳覗覜覶视览觡触觺訢詍詨詻諆諈諓謍譐譺计论诚调谨谽豲贞账贼趓趧跅跮踮踸蹛蹢躠躨軠軵輂輗輛轞迁过迋还逄逤逿遳邾郟郿酘醛醥醱釬鈣鉀銡銻鋁鋐鋘錛錞錧錳鍉鍰鎂鎞鎡鎯鏚鏬鐀鐎鐔鑐鑢鑤银闆问隑难雘雯靘靼靽靿鞹鞻韆韱頇頍頖頩顎顩顽餰饙饮駪騕騤驌驏驔骿髁髕髟髺鬁鬺鬿魌魷鮞鰉鰩鰱鱭鳦鳱鳲鳷鳻鴶鴾鵃鵊鵙鵹鶄鶊鶋鶒鶘鶪鶵鷞鸃鸓鸠鸣鹊鹤麀黈黰黵黹鼘鼜齃齆齱')
(3, 1008, 9483, '丏业东乇买仑伀伈众会伝伪佖佟佤佰侒侘侹俁俋俙倗倠倾偆偓偞偠偨傂僁僎僓僠僸儚儢儦儱兟兴冓冔冘冱决减凭刚刜剭劀劁劂办勀匊卼叼吇吤吪咖咠咩哞哤啡啶啽啿喥喨嗋嗨嗲嗺嘜嘺噙噳噾嚃嚍嚗嚳囋园国圂圢坲坶垽埂埮埲堄堍堕堛堥堧塒塝塤墈墋墔墫墱墺壏处夹奭妐妤妯妺姞姼姽娴娸婐婗婧媄媞媦媰媱媸嫇嫈嫜嫟嫥嫭嫶嬃嬬孢孲孷宧宫宽导尰岋岟岢岭峞崣崷崹嵑嵞嵥嵼嶈嶜巆帤幀幍幎幓幝幭幮庂庆庛庪庰廇廔廗弚弮弰徬徻徾忕忣怞怢怭怲悇悊您悹惇惉愲慞慪慲憓憢憴憿懁懤懱戁戄户扐扤护报抮抻挃挡捊捖捗捯捼掁掜掝掮掱揘揙搳摇摦撠擖擛攎攕数旓旧旼旽昄昉昡昢昤昺晁晒晛暋暡朹权来枅枍枎枺柊柍柭柮柶标栯栺桋桫桲梐梡梦检棌棷棻椇椐椔椴楅楢楺槔槢槲樀樕樘樠横樲橤橧橪檁檃檡櫌櫐櫧櫫櫯櫹櫼欀欏欓欞欯歁殈殟殠殰毣毰毸氀氁氃氉氋氨氫氮氿汒汤汦汯沋沭泏泞泵洁洎洙洚洬浅济浑浘浤涑淠淲渧温湁湅湝湴溞溹滒滵滽漇漊漍漙潐潜澐澫濎濏濜濧濿瀄瀌瀘瀤炟烧烻烿焕煠煲煻燂爁爊爢爱牄牉犘犦犪犮狁狆狑狫狿猁猇猞猦猧猼獊獌獑獙獟獢玆玈玗玟玠珇珙琄琊琺瑗瑲瑵瑿璚璱璲璸璿瓝瓞瓬瓻甀甏甹畾疕痯痷瘑瘜瘨瘭瘰瘱瘸癈癐癜皒皵皻盉眽睄睏睔睮瞙瞡瞲瞼矊矎矐矘矙矼砎砝硞碄碅碆碏碙碚碞碫磏磡磿礛礝礥礩祡禗种秞秽稃稘稙稛稯穄穊穜穬窔窸竘竷笯笸筱箅箊箵篿簂籉籊籦粅粕粮緙緛緟緶緷縏縒縓縩縺縿繜繠繣繲纳纷线组绳绿缚网罢罭罶罿羁翂翏翞翢翯翴翽耞联聬胶脘脢脱腃腄腇腩腲腶膇膌膍膕膢膬膱膹臃臷舕舢舳艑艒艗艤芃芎芑芚芫芵苙苜茙茳茺荓莆莚莤莮菂菉菎菢菤菨菪萉萓萯萷葖葙葚葠葥葧葰葹蒘蒛蒡蓏蓩蓿蔈蔉蔎蔪蔰蔾蕀蕄蕡蕫蕶薁薎薝薟薠薡薢薧薷薿藋藘藸蘀蘌蘘蘛蘩蘪虆虋虤虬虰蚕蚗蚧蚷蚻蚾蛁蛈蛓蛖蜈蜛蜲蝂蝃蝑蝩螑螖螪螲螵螹螼蟂蟃蟅蟢蟪蟭蟴蠀蠍蠑蠥蠳蠸蠼衃衋衯袈袗袚袹袼袽裟裧裰裲裶裷褘褞褢褦褯襉襋襒襬襶覤覮觠觲觾訒訧訰詷誒誙諗諰諲謈謑謘謜謰譝譨譻讆讨试诡谈豅豇豏豖豜豩豱豵貅貑贙贵赐赠趌趪趭跆跘跜跢践跾踃踑踕踜踤踥踾蹁蹗蹥蹪躗躝躣躦軉軑軯輁輆輖輚輲轒轕轗轣轮辅辑边迣逌逯邆邍郙郜郫鄔鄠鄨鄹酓酨醐醓醝醠醧醭醹醾釕釗釿鈉鈑鈜鈲鉍鉠鉧鉿銊銋銍銗鋀鋄鋇鋗鋙鋞鋦錍錥錪鍖鍚鍭鎝鏙鏧鐩钂锻閂閛闹阢阳阹陜陼陾隉隹雱霂霩霫霮靇靬靰鞀鞡鞣鞳韐韕韗韘韣韥韰韹韽頲题颜颬颱颲颽飋飶餂餩餲餵饃饡饭馝馡駍駖駧駬駰駶駷駹駾騉騊騋騝騠騬驉驐驻骯骳骷髑髖髣髳髶鬎鬑鬾魛魧魱鮥鮯鮹鯞鯪鯬鯸鰷鰼鱐鱖鳿鴕鴘鴯鵀鵌鵖鵫鵳鵻鶆鶗鶝鶠鶤鷅鷈鷘鷚鷥鷫鷮鷽鷾鸁鸅鸆鸟麆麊麌麚麡黓黖鼊鼚鼱齉齙齝齞齣齯')
(2, 1497, 10980, '丌丧丳义乔亄亍仚仪伄伅佒佘佢佧侂侅侷俷倇倰倱偁偅偌偩偯偺傋傝傣僆僖僗僤儩儭兗兰册凉凛刉创剑剒剬劋动励劼勰勼匉匎匷卣厉厊厏厔厗厙双变吨呡呤呬呺咏唑唦啈啤喍喎喢喱喿嗍嗏嗕嗩嗼嘕嘧嘳噅噈噘噮嚁嚂嚆嚐嚧囃围圔圚圛圠坋坒坢坭坽垌垞垟埌埔埡埢堈堌堑堣堽塓塥塯塽塿墠墣墽壈壛夗奋奘她妇妘妠妢妦妴姅姈姎姮姷姺娇娗娱婇婊婟婠婩婼媃媐媥媬媶嫄嫘嫛嫳嬡嬽孓宝审宨寍寎寝寪寿尃尒尝尥屖岉岍岒岥岮岯岰峇峈峊峎峓峘峚峛峪峬峮崋崌崨崮崺嵃嵅嵊嵋嵧嵱嵷嶀嶉嶗嶡嶨嶴嶵巂巟巿帄帗帣帩帴幏幧幩幵广庄应废庢庹廎廲弃弝弶弹彋录彳彸彽彿忀忨恋恞恿悈悜惀惈惧惮惾愄愅愖愝愤慏慬慹憪憰憳憵懥懭懰戉戙戠戫戭扂扲抚抭抯抳抾拎择拸挌挎挓挟挴挶捀捇捌捰掑掔揊揍揓揰揱搋搌搎搛摆摙摡摨摫摰摲撜撽擉擨攇攗攡攥攳敁敓敜敶斄斖斪旴昲晅晲曘曣曮朁朄朊朐朢朳朾杍杗杚枃枪枮柀柃柉柣柧栒栜栫栮栴样栻桢桭桵桸桻桾梀梋梖梩梬梮棂棆棎棜棝棦棪棳棴棶椄椊椥椪椳楈楉楎楑楘楜楥楻楼榍榎榐榞榹榽槂槤槶槻槼槾樻樼橀橆橏橭橾檇檑檕檦檨檷檸櫏櫡櫰櫸欙欭歅歋歑歞歭歾殥殦殶毄毇毈毌毐毘毞毢毤毲毷毻氆氌氟汉汸汹沏沰沶泒泪泭泲洀洇洝洰浏浢浧浬浵浶浺浻浽浿涍涳淔淛淦淭渃渜渮渱渼湀湠湨湳湸溛溦溧溳溴滊滍滏滖满漃漷潡潫潲潷澋澖澯濌濭濴瀔瀖瀡瀩瀪瀱瀴瀷灃灄灖灗灡灢灦灨灪炔炖炡炾烊烑烓烛烴烷焍焐焥焺煁煣熁熉熐熝熿燅燤爂爔牁牦牼犅犎犝犞犣犤犩犰犺犿狔狘狚狤狳猎猭獀獛獩獳玁玒玓珖珶珸琀琩琼瑄瑊瑢璗璟璯瓁瓃瓅瓋瓖瓾甐畅畣畷疿痁痄痦痶痻瘚瘽癒癗癙癠癹皕皯皾盅盏盐监盖盷眃眅眝眳睅睋睯睾瞁瞂瞄瞇瞈瞉瞗瞛瞜矂矔矕矧砅砏砐砠砡砣砨砪砫砬砱砵硍硥硨硰碖碢碥碬碱磃磄磛磟磠磩磪磲磾礒礞礣礤礵礼祋祑祩禀禂禓禴秎秝秠称秷稄稕稫稰穈穮窇窋窏窫窲竑笒笢笲笼筀筣筶箎箖篕篱簃簐簙簩籐籗籹籺粔粖粣粪粺糌糔糢紟紧紽絅絎絘絧絭絯綅綎綝綧緁緉緎緧緰縃縎縡縸縼繀繘繨繵繷繸纡细绛续维绵综编缧缹罚罜罬羑羜羠羢羬羭羰羾翀翍翲耔耛耩耴耵耸聐聝聤聹肣肮肵胂胅胆胇胈胉胍胑胕胦胱胵脀脝脟脥腞腤膆膙膟膫膵臄臅臇臒舝舨舴舽艅艋艏艚艞艩艭艽芀芄芅芏芞芠芣芧苤苯苲茉茖茠茢茤茩茪茻茼茿荋荍荎荣荵荸荾莁莃莉莌莏莐莕莗莝莲菄菈菗菙菛菡菣菥菧菾萏萧萭萰萴萵萿葀葄葇葎葐葒葨葽蒝蒠蒩蒬蒴蒶蓎蓒蓖蓝蓪蓫蓶蓹蔂蔍蔏蔙蔝蔠蔤蔧蔯蔱蕍蕑蕓蕗蕠蕧蕬蕮蕵蕹蕻薃薍薐薕薚薣薱薴薵薸藇藈藑藒藙藞藦藯藰藶藾蘞蘟蘡蘬蘮蘵蘹虈虑虥虮虾蚅蚆蚎蚙蚚蚝蚞蚥蚸蛂蛃蛌蛗蛘蛜蛢蛵蛷蜁蜄蜅蜠蜤蜦蜧蜳蜵蜸蝏蝐蝛蝜蝞蝢蝪蝫蝬蝳蝷蝺螐螔螛螝螰螴蟑蟓蟗蟝蟤蟦蟳蟼蟿蠈蠊蠌蠗蠜蠝蠠蠨蠾蠿衁衈衧袃袎袓袘袙袛袡袬袶袺袾裋裮裺裻褉褑褟褣褼襓襗襛襭襺覭觞觤觩觰觼詑詙詺誋誺諀諔諯謋謥謧謯謱謵譂譅譇譑譒譓譕譭讄讅讘订让访识诈译询详诬请课谋谏谗谻豃豍豦豰豶豷豽貁貏貐貒貕貘貚賌賏賗賟賰賱賹贕责贤质贯资赆赈赋赡赶赽趋趎趡趬趮跓跠跩跻踀踄踇踛踿躆躈躘躤躽軓軘軜軝軞軦軩軮軱軶輋輐輑輹轈轙轚轨轩轿输辔辴达迈迉运迖这迟迡迿选遻邥邶郈郖郲鄋鄏鄗鄘鄞鄢鄦鄩鄯鄳酕酚酮醂醏醚醡醷释釪釳鈌鈭鈾鉆鉋鉎鉒鉔鉬銆銔銙銪銮鋂鋊鋕鋧鋺錆錋錏錔錤鍇鍐鍑鍒鍜鍞鍡鍱鎏鎒鎕鏂鏄鏏鏒鏕鐇鐖鐱鐳鑉鑴鑵鑸钟钩钱钵铳锄锅锈锋错锦镂镇镺镼閍閵閷间阁阅队阴陑陓险陫陭隿雓雟雥雿霘霝霟霢霦靆靪靻鞂鞃鞄鞗鞜鞪鞷韄韇韏韟頄頜頠頨頯頵顄顉顊顐顑顜顝顢顳项颁领颖飁飌飒飙饬饷馑馣馧馰馲馵駗駜駣駤駥駽騛騢騩騱騵驆驖驙驞驦驾骇骈验骑骱髂髊髷鬊鬕鬞鬤鬵魖魨魶魻魽鮚鮛鮦鮸鯀鯆鯇鯔鯕鯚鯠鯧鰅鰋鰒鰝鰤鰨鰴鰶鰹鰽鱊鱎鱙鱨鱮鱳鱴鱺鲁鳞鳪鳭鳺鳼鴅鴐鴔鴢鴥鴮鴽鵏鵗鵚鵱鵴鵵鵸鶀鶅鶔鶙鶜鶞鶟鶢鶣鶨鶶鶷鷊鷋鷎鷏鷐鷑鷒鷛鷜鷡鷢鷤鷬鷳鷴鷵鷷鸀鸋鸒鹇麙麮麷黀鼏鼢鼫鼵齂齌齐齖齛齜齤齫齹齻龄龤；')
(1, 2877, 13857, 'A、与丛两丮临丼乌乿亃亏亓亵亸亿仈仉仜仝仨仩仱仴伂伒伓伔伟伬伳伿佡佫佮佴佸侀侇侐侕侚侞侠侥侬侳侺俀俓俖俬倎倞倢倧倯倵倷偀偋偍偑偗偛偝偡偣偤偮偰偳偻傃傇傌傕傰傶傸傿僋僣僯僳儊儑儮儰兙兛兝兞兡兣兽冇冈冑军冞况冹冻冼冾净凅凎凐凔凗凞凵刍刐刞刡刱刵剆剢剥剫剻剼劝劦劮劲劳勂勓勫勯勱勴匋匑匒匚匢匰匴医卄卅卌协单卧卫厂厅压厒厕厜厞厧厬厴叙叻吋吘吙吜吥吴呁呅呇呎呏呔呗呠呣呧呯咁咑咘咤咦咰咾响哑哖哠哷哸哻哿唊唋唎唒唗唭唴唹唻啋啒啢喕喡喦喵嗀嗂嗧嗿嘝嘪嘱嘾噊噚噿嚝嚪嚽囆囍囗囥囧圁圳圴圹场坁坅坉坛坟坴垀垏垔垕垗垘垙垚垥垦垵垶垹垺垼垿埁埇埐埕埙埣埥埧埩埬埰埱埼堉堎堐堔堜堩堬堭堳堷堸堹堻塎塛塣塨塭塱塴塶塻墂墇墎墏墑墘墡墥墿壂壆壉壔壢壣壧壨壴壾壿夃夆夌夎夒夼奀奁奅奜奱奲奷奻奾奿妀妅妎妏妡妧妱妵妶妼妽姀姃姇姖姛姠姡姩姭姲姳姴姵姶姾娊娏娕娞娮娳娷娹娾婂婃婄婈婌婍婒婖婛婜婝婤婰婸婻婽媊媋媎媏媓媔媗媜媝媩媴媷媹嫀嫆嫊嫍嫙嫝嫞嫨嫬嫴嫸嫹嬁嬂嬅嬇嬏嬐嬓嬔嬚嬞嬠嬣嬦嬧嬨嬮嬯嬼孇孈孍孎孙孮孻宎宒宭寁寊寑寙寣寯寲对寻将尌尐尔尕尟尢尳屄屇屔屘屪屳屻屾岆岓岤岦岶峆峌峏峐峔峖峟峱峷峸峹崀崁崏崞崠崰崲崳崵崶崸崼嵀嵉嵕嵙嵢嵣嵨嵹嵿嶆嶍嶩嶯巃巏巕巠巰币师帎帐帠带帮帾幁幊幋幜幠幯庈庍庐庙庣庤庮庱庲庴廅廆廘廜廦廮廯廾弅弣弤弨弳彃彏彶彾徆徖徛徟徥徫徲徶徿忁忆忏忥忯忴忾态怆怉怋怌怐怑怚怤怬怴怷怹总恀恄恅恔恘恦恮恸恻悀悎悕悝悦悬悺悿惁惃惌惍惢惤惩惲惿愃愋愐愘愩愮慀慒慔慖慛慡慦憉憌憟憡憱憼懔懖懠懧懪戆戣扊扙扚扡扥执扪扰扴扷扻扽抁抇抈抌抩抴抸拥拰拵拹拺拻挀挋挔挕挠挩挬挭挳挸捁捈捑捙捚换捸掅掟掭掽揂揇揈揋揌揕揗揝揟揤揧揨揯揳揹搚搟搫搮搷搹搾摀摃摄摍摠摥摬摮摷摿撉撊撌撖撗撱撳撷擃擏擙擤擳擼攁攃攌攍攐攠攭攽敃敆敊敤敥敨敯敳敼敿斀斋斔斞斢斳斶斻旚旞旡旲旵旷昀昅昋昍昐昑昜昦昮昹昼显晇晊晑晓晙晥晪晸晹暆暊暔暕暙暟暩暪暯暰暲暷暸暺暻暽曊曋曌曞曤曫朠朡朸朻朼朿杀杋条杶杸杹杺杽枆枔枟枣枴柆柋柌柒柛柤柦柪柫柼栈栋栏树栔栚栠栥栦栨栵桍桏桡桥桱桽梇梉梊梌梑梒梛梣梤梫棇棈棑棔棞棤棩棯棸椆椈椕椯椲椵椻椼楀楁楋楌楏楒楪楰楱楴榃榓榗榙榚榡榤榩榬榯榳榵榶榿槄槆槉槏槙槦槫槬槴槸樄樆樇樈樉樍樖樥樦樧樱橁橍橎橔橕橖橝橞橠橨橩橯橶檅檌檍檒檓檚檞檤檭檴檶檹檺櫅櫆櫇櫋櫍櫙櫠櫮欈欉欗欚欥欧欳欴欶欼歂歖歶殌殎殏殔殙殧毃毉毊毕毠毾氕氖氘氙氚氝氠氡氥氦氪氬氰氶氻汆汌汎汥汫汱汳汻沀沊沎沘沜沝没沦沷泀泇泍泑泜泩泹洃洈洉洍洐洖洘洠洢洨洭洯洷洺浀浂浊测浠浨浭浾涃涄涋涐涛涝涤润涧涺涻涾淂淉淊淍淏淐淓淕淗淝淣淯淶淽渐渔渗渨渳渵渶渻渽渿湆湇湋湒湕湚湞湡湤湥湦湷湹溍溎溒溗溙溠溡溣溤溮溾溿滁滆滐滘滚滜滥滩滱滶滼漀漅漒漜漞漟漡漥漧漮漹漺潀潃潓潕潣潧潩潪潳潶潻潽潿澅澕澜澞澢澩澪澬澭澰澲澸澺澽澿濄濉濋濍濒濝濢濣濨濰濲濷濻瀀瀊瀗瀙瀫瀳瀺瀻瀿灀灁灅灆灈灉灒灚灛灠灥灱灴灾炂炃炄炆炑炓炚炩炴炵烁烂烅烆烇烍烎烒烗烚烠烡烢烦烳烶烸烼焀焂焆焋焎焓焗焛焟焢焣焨焲煂煃煄煆煋煍煐煓煘煚煝煡煪煰煸熆熗熜熞熡熤熥熧熩熪熰熵熼熽燆燇燊燏燘燚燛燜燡燢燨燰燱燲燸燻燽爃爅爙爦爧爩爷牊牞牠牪牬牮牰牳牶牻犈犉犌犐犑犕犚犡犥犷犹犽狅狈狊狜狣狦狮狾猀猈猌猏猑猣猫献獂獎獚獞獡獥獭獽獿玂玊玑玔玝玡玤玥玨玬玴玵玶玸玹玾玿珃珅珆珋珐珒珔珛珜珰珴珵珺珼珿琈琋琌琍琠琡琣琿瑂瑆瑍瑎瑏瑐瑔瑧瑭瑮瑹瑼璊璒璔璕璡璥璦璩璪璭璶璷璻璾瓀瓂瓕瓗瓘瓙瓛瓡瓥瓨瓩瓽甇甈甋甝甭甮电甾畟疀疄疌疗疘疧疪疶疺痋痐痚痭痳痵痸痽瘔癓癚癪癵癿皉皊皏皝皫皽盄盓盗盚盰盳盵盺眓眛眣眧眭眱眲眻睌睙睧睼瞃瞏瞕瞝瞣瞨瞩瞫瞱瞴瞺矄矌矏矠矨矷矺矽砃砓砩砳砷硅硈硒硢硭硹硻碀碃碠碤碲磌磭磹磺磼礂礄礅礌礑礔礗礭礯礸礹祂祄祌祒祣祤祪祰祳祹祽禄禈禐禒禚禛禢禤禭禲禶禷禸秅秖秜秮秶秺税稐稒稓稢稦稨稹穋穔穖穘穚穛穧穱穻窉窝窢窷竀竖竞竤竮笀笁笅笉笎笐笚笝笣笰筄筎筘筡筸箂箈箌箤箫箷箹篊篎篜篞篟篢篧篫篻簅簆簊簎簝簢簥簻簼籅籇籈籚籣籫籵籿粀粁粄粈粊粌粍粡粨粯粴粿糋糎糐糑糪糬糮糷糸糽紁紌紎紏紑紨紶紸紻絊絑絒絔絟絩絼絽綄綒綔綞綡綩綼緀緂緅緮緳縌縍縔縖縜縤縥縪縯縳繉繌繑繓繗繟繴繺纀纋纗纙纠纥纫纯纺练织绊绍绎绕绘给统绣绥绪绮绷缀缉缋缔缤缨缭缮缰罊罞罠罧罺羋羍羒羕羛羥羦羱羳羷羺羻翃翇翉翋翑翗翜翨翪翭翵翷翸耖耟耪耹聇聈职聏聑聜聧聸肂肊肏肒肙肾胁胐胘胣胧胺胻脁脏脑脕脙脧脭脺腍腏腛腡腢膉膗膞膣膦膧膮膲膷膼臐臗臙臦臩臮臸臹舆舥舯舺舼舿艀艂艉艐艕艖艜艡艬艰艵艺芐芓芗芛芢芤芶芺苀苂苃苖苠苪苬苭苰苳苵苺茌茍茛茞茥茦茧荁荌荖荚荧荶荺荿莇莈莋莍莔莙莣莥莦莯莰莺莿菃菋菏菕菝菞菬菮菳菺菻菿萒萛萝萣萩萫萲萳萶萺萻葂葃葋葌葍葔葝葞葟葮葴葾蒆蒋蒎蒏蒑蒗蒚蒤蒧蒪蒫蒮蒰蓅蓌蓔蓗蓛蓦蓧蓨蓳蓷蓻蓾蔆蔇蔊蔋蔒蔖蔜蔨蔩蔮蕅蕇蕔蕛蕥蕦蕱蕸蕼薂薋薖薘薞薳薽藀藃藄藅藆藗藚藡藢藣藫藬藱藲藽蘁蘉蘊蘜蘣蘥蘱蘲蘳蘴蘶蘻蘾虃虇虌虍虏虨虪虳虷蚇蚐蚔蚢蚽蛝蛪蛫蛶蜌蜗蜙蜬蜭蝁蝆蝇蝉蝔蝖蝧蝵蝼螁螅螏螒螚螜螤螮螶螷螸蟌蟔蟘蟙蟡蠂蠤蠫蠬蠷衅衪衭衴衶衼袄袉袌袑袕袧袲袸裍裐裖裗裚裞裫裬褁褅褆褋褔褖褗褩褬褮褱褽襑襙襝襡襣襩襱襾覅覕覛覝覞覟覢覣覹覾觉觊觎觐觓觙觛觢觨觬觷觻訄詊詌詏詟詴誁誃誉誏誧誫誸誽諃諅諘諙諨諻諿謆謒謓謕謢謤謪謮謶謺謽譀譈譋譗譠譥譧譪譹譿讂讈认讥讦训讲讷许讹讽设评诊诋诒诘话诞诧诩诱诳谆谇谒谢谮豂豊豋豝豟豥豯貀貄貗貥貵貹貾賥賳贀贂贆贇贡败货贩贫贬贴贷费贺贻赉赒赓赖赙赛赨赯赲赹赻趀趉趏趐趒趖趛趜趥趶跁跈跍跞跴跿踂踍踓踗踙踚踫蹑蹖蹞蹳躌躎躖躯軂軗軡軧軴輍輎轃轋轏轐轛软轸轹较辄辿迗违迠迩迶迼适递逦逻逽遉遧遾邔邘邞邟邡邧邲邽邿郃郋郔郕郘郚郠郣郥郩郪郬郯郰郱郳郴郹郺郻郼郾鄀鄁鄃鄄鄅鄆鄇鄈鄍鄎鄐鄑鄖鄚鄛鄜鄝鄟鄡鄤鄪鄫鄬鄮鄵鄸鄺鄻鄾鄿酀酁酄酅酐酟酠酯酰酿醀醙醣釆釓釔釙釚釢釨釩釫釮釴釷釸釹鈁鈂鈃鈄鈅鈊鈏鈖鈗鈙鈤鈥鈦鈧鈮鈰鈱鈳鈶鈺鈽鉊鉌鉐鉑鉓鉖鉡鉣鉭鉯鉰鉲鉹鉺鉼鉽鉾銂銇銈銌銎銝銠銢銣銤銥銦銧銨銩銫銲銴銵銶鋆鋉鋍鋎鋑鋓鋝鋠鋡鋨鋮鋯鋰鋱鋷鋹鋻鋾鋿錀錂錈錉錌錎錒錓錖錝錟錩錭錴錵錸錹錼鍆鍌鍎鍏鍕鍗鍙鍣鍶鍷鍹鍺鍻鎀鎃鎈鎉鎍鎎鎑鎘鎙鎟鎣鎤鎥鎨鎱鎲鎴鎵鎷鏀鏍鏎鏔鏣鏮鏶鏷鏸鏺鏻鏼鏾鏿鐆鐉鐊鐋鐌鐑鐒鐓鐕鐠鐨鐪鐬鐰鐷鐹鐼鐽鐿鑀鑅鑆鑇鑈鑋鑏鑗鑝鑨鑩鑫鑭鑮鑯鑳鑶钀钃钉钝钢钦钧钳铄铍铎铭锁锲锵锼镋镌镕镜镠镳镵镻镽閆閐閞閮閰閺閿闀闅闣闭闳闺闻阋阖阘阙阞阠阣阭阰阶阺陃陈陎陏陯陱隀隇随隓隞隡隢隬隽雂雃雈雔雗雡雵雸雽雾霋霐霒霠霥霨霬霯霵霺靋靓靲靾鞊鞎鞝鞢鞤鞥韎韖韦韬韾頛頝頧顁顃顅顈顗顟顠顤顪顲顺颂预颈颔颤颳飨飹飺餀餇餥餭餯饇饓饖饛饱饿馁馔馜馦馫馯馻駂駇駋駌駎駩駺騆騇騔騚騜騥騪騲騴騹騺騽騿驈驓驠驧驨驰驼驿骀骄骖骻髆髍髐髜髬髱鬗鬠鬫鬳魊魒魕魙魟魠魡魤魦魬魰魵魺魼魾鮂鮅鮇鮈鮕鮠鮡鮢鮤鮨鮵鮶鮽鮿鯃鯄鯓鯙鯛鯜鯡鯥鯦鰆鰇鰎鰔鰗鰜鰡鰣鰫鰬鰳鰿鱀鱁鱄鱆鱈鱋鱌鱒鱕鱞鱢鱦鱱鱵鱹鲊鲲鳖鳵鳹鳽鴀鴄鴗鴙鴩鴭鴱鴷鴸鵅鵋鵘鵛鵟鵧鵨鵿鶁鶇鶈鶐鶛鶦鶧鶭鶲鶳鶸鶾鷌鷍鷝鷣鷨鷭鷶鷻鸄鸉鸍鸏鸔鸗鸙鸦鹏鹘鹢鹫麉麍麎麔麜麠麧麭麶黚黫黺鼀鼁鼆鼒鼞鼣鼤鼥鼨鼭鼮鼰鼳鼶鼸齀齈齥齸齺龑龒龘龟Ｑ')
]]
]]]


[[[
None=>path2#失误版#见上面:『严重失误』
===
py_adhoc_call   script.字频统计冫词汇纟汉语大辞典   ,字频统计冫词汇纟汉语大辞典扌 =None -traditional_vs_simplified  --may_num4most_common=2112 >  /sdcard/0my_files/tmp/0tmp
view /sdcard/0my_files/tmp/0tmp

py_adhoc_call   script.字频统计冫词汇纟汉语大辞典   ,字频统计冫词汇纟汉语大辞典扌 =None -traditional_vs_simplified  --may_num4most_common=None >  /sdcard/0my_files/tmp/1tmp
view /sdcard/0my_files/tmp/1tmp
    8632字
du -h /sdcard/0my_files/tmp/1tmp
    100K

[[
py_adhoc_call   script.字频统计冫词汇纟汉语大辞典   ,字频统计冫词汇纟汉语大辞典扌 =None -traditional_vs_simplified  --may_num4most_common=None +pairs_vs_grouped >  /sdcard/0my_files/tmp/0tmp
    (count, num_hzs, acc, hzs)
字数: 8632
总计数: 480652
(2177, 1, 1, '頭')
(2067, 1, 2, '風')
(1961, 1, 3, '子')
(1877, 1, 4, '不')
(1754, 1, 5, '無')
(1668, 1, 6, '馬')
(1408, 1, 7, '門')
(1322, 1, 8, '一')
(1301, 1, 9, '人')
(1291, 1, 10, '兒')
(1275, 1, 11, '氣')
(1223, 1, 12, '雲')
(1213, 1, 13, '龍')
(1199, 1, 14, '黃')
(1151, 1, 15, '長')
(1144, 1, 16, '書')
(1069, 1, 17, '心')
(1042, 1, 18, '車')
(1038, 1, 19, '大')
(992, 1, 20, '金')
(981, 1, 21, '魚')
(960, 1, 22, '天')
(906, 1, 23, '國')
(897, 1, 24, '節')
(871, 1, 25, '遺')
(870, 2, 27, '時生')
(855, 1, 28, '學')
(828, 1, 29, '三')
(826, 1, 30, '發')
(824, 2, 32, '行連')
(812, 1, 33, '花')
(798, 1, 34, '聲')
(755, 1, 35, '水')
(751, 1, 36, '山')
(748, 1, 37, '文')
(744, 1, 38, '東')
(741, 2, 40, '白語')
(739, 1, 41, '會')
(730, 1, 42, '靈')
(722, 1, 43, '開')
(706, 1, 44, '飛')
(689, 1, 45, '見')
(687, 1, 46, '過')
(686, 1, 47, '軍')
(683, 1, 48, '進')
(681, 1, 49, '錢')
(676, 1, 50, '樂')
(671, 1, 51, '說')
(670, 2, 53, '之陽')
(665, 1, 54, '地')
(660, 1, 55, '家')
(656, 1, 56, '義')
(652, 1, 57, '宮')
(650, 1, 58, '體')
(644, 1, 59, '調')
(638, 1, 60, '玉')
(633, 1, 61, '陰')
(631, 2, 63, '紅鳳')
(630, 1, 64, '道')
(624, 1, 65, '斷')
(622, 1, 66, '言')
(620, 1, 67, '遠')
(612, 1, 68, '機')
(608, 1, 69, '筆')
(607, 1, 70, '當')
(606, 1, 71, '內')
(603, 1, 72, '腳')
(602, 1, 73, '華')
(591, 1, 74, '論')
(587, 2, 76, '中畫')
(584, 1, 77, '實')
(582, 1, 78, '詞')
(580, 2, 80, '煙辭')
(579, 2, 82, '口絕')
(578, 1, 83, '臺')
(576, 3, 86, '相經輕')
(573, 1, 87, '小')
(570, 1, 88, '窮')
(569, 1, 89, '關')
(564, 1, 90, '後')
(563, 1, 91, '離')
(552, 1, 92, '事')
(548, 2, 94, '動師')
(546, 1, 95, '積')
(544, 1, 96, '羅')
(543, 1, 97, '餘')
(542, 1, 98, '邊')
(539, 2, 100, '亂惡')
(538, 1, 101, '來')
(537, 1, 102, '神')
(536, 1, 103, '日')
(535, 1, 104, '養')
(534, 1, 105, '轉')
(533, 1, 106, '火')
(532, 1, 107, '老')
(531, 1, 108, '虛')
(529, 3, 111, '戶手青')
(527, 1, 112, '禮')
(518, 1, 113, '詩')
(515, 1, 114, '鐵')
(514, 1, 115, '石')
(511, 1, 116, '傳')
(509, 1, 117, '沒')
(500, 1, 118, '盤')
(499, 1, 119, '兩')
(497, 1, 120, '業')
(496, 1, 121, '寶')
(493, 1, 122, '計')
(492, 2, 124, '下親')
(485, 2, 126, '從結')
(484, 4, 130, '戰橫簡鶴')
(483, 1, 131, '重')
(480, 1, 132, '極')
(479, 1, 133, '閒')
(478, 1, 134, '官')
(476, 2, 136, '公歸')
(472, 1, 137, '鄉')
(470, 1, 138, '變')
(464, 1, 139, '隱')
(463, 1, 140, '鳥')
(459, 1, 141, '高')
(458, 4, 145, '明樹雞點')
(456, 1, 146, '流')
(454, 1, 147, '負')
(452, 2, 149, '懷戲')
(451, 2, 151, '絲運')
(450, 1, 152, '出')
(449, 2, 154, '遊達')
(448, 2, 156, '塵驚')
(444, 2, 158, '為觀')
(440, 2, 160, '五面')
(438, 1, 161, '通')
(437, 2, 163, '上清')
(436, 2, 165, '眾難')
(434, 1, 166, '營')
(433, 1, 167, '問')
(432, 2, 169, '對質')
(430, 2, 171, '名衣')
(429, 2, 173, '舉鴻')
(427, 1, 174, '眼')
(423, 1, 175, '異')
(421, 1, 176, '條')
(420, 1, 177, '數')
(418, 1, 178, '乾')
(416, 2, 180, '別帶')
(413, 2, 182, '情順')
(410, 1, 183, '有')
(409, 1, 184, '視')
(408, 2, 186, '世目')
(407, 2, 188, '月話')
(405, 2, 190, '百電')
(403, 2, 192, '識銀')
(401, 3, 195, '將打號')
(400, 2, 197, '酒齊')
(399, 1, 198, '圖')
(397, 1, 199, '貴')
(393, 2, 201, '參法')
(391, 1, 202, '分')
(388, 1, 203, '意')
(387, 1, 204, '麗')
(386, 2, 206, '處還')
(385, 2, 208, '正雜')
(384, 2, 210, '身飯')
(382, 2, 212, '報賢')
(381, 1, 213, '樓')
(378, 3, 216, '合場香')
(377, 2, 218, '張殺')
(376, 1, 219, '雨')
(375, 1, 220, '紙')
(374, 1, 221, '兵')
(373, 1, 222, '成')
(372, 3, 225, '聖自議')
(367, 2, 227, '歲漢')
(366, 1, 228, '主')
(365, 1, 229, '賣')
(364, 2, 231, '作熱')
(362, 2, 233, '同物')
(361, 1, 234, '八')
(360, 1, 235, '騰')
(359, 2, 237, '光燈')
(358, 2, 239, '謝陳')
(357, 2, 241, '權蟲')
(356, 1, 242, '應')
(355, 2, 244, '錦飲')
(354, 4, 248, '揚興選齒')
(353, 1, 249, '烏')
(352, 1, 250, '草')
(350, 3, 253, '勞資鳴')
(349, 3, 256, '木脫食')
(347, 3, 259, '勢擊貞')
(346, 6, 265, '命如稱綠賞輪')
(345, 1, 266, '懸')
(344, 1, 267, '嚴')
(343, 2, 269, '豐貨')
(341, 2, 271, '獨談')
(340, 3, 274, '方海萬')
(338, 3, 277, '年謀顧')
(337, 2, 279, '交決')
(336, 2, 281, '靜髮')
(335, 1, 282, '銅')
(334, 3, 285, '單棄葉')
(333, 2, 287, '儀虎')
(331, 2, 289, '傷理')
(330, 2, 291, '四遷')
(329, 1, 292, '屬')
(327, 2, 294, '強本')
(326, 2, 296, '愛然')
(325, 1, 297, '職')
(323, 3, 300, '榮約裏')
(321, 1, 301, '迴')
(319, 1, 302, '色')
(318, 4, 306, '士民骨鬥')
(317, 4, 310, '二王路頓')
(316, 3, 313, '臨解錯')
(315, 1, 314, '平')
(314, 3, 317, '九土婦')
(313, 3, 320, '化聽西')
(312, 3, 323, '厲執空')
(311, 1, 324, '賊')
(310, 1, 325, '和')
(308, 2, 327, '蕩鹽')
(307, 3, 330, '千客鸞')
(306, 1, 331, '護')
(302, 1, 332, '館')
(300, 4, 336, '直聞腦鉤')
(299, 1, 337, '女')
(296, 3, 340, '帳星濟')
(295, 2, 342, '力環')
(294, 1, 343, '鬱')
(293, 1, 344, '十')
(292, 2, 346, '春頂')
(291, 4, 350, '夢復種黨')
(290, 4, 354, '滿規軒險')
(289, 2, 356, '舊類')
(288, 1, 357, '顏')
(287, 4, 361, '敗藥補鼓')
(286, 5, 366, '喪憂曲殘鬼')
(285, 1, 367, '字')
(284, 2, 369, '蹟飾')
(283, 2, 371, '外龜')
(282, 3, 374, '勝澤裝')
(281, 3, 377, '煩試顯')
(280, 1, 378, '責')
(279, 5, 383, '服禍膽術鏡')
(278, 1, 384, '講')
(277, 1, 385, '標')
(276, 2, 387, '檢納')
(275, 5, 392, '新死溫盡閣')
(273, 6, 398, '傾利圓爭訓貫')
(272, 3, 401, '劍淵習')
(271, 3, 404, '六角領')
(270, 1, 405, '討')
(269, 3, 408, '監線貪')
(268, 2, 410, '設課')
(267, 2, 412, '知駕')
(266, 1, 413, '散')
(264, 2, 415, '潛產')
(262, 1, 416, '素')
(261, 1, 417, '間')
(260, 1, 418, '起')
(259, 3, 421, '備財足')
(258, 5, 426, '寒幹竹落賤')
(257, 5, 431, '俗壽工德貧')
(256, 3, 434, '塗破題')
(255, 2, 436, '使思')
(254, 4, 440, '前安盜農')
(253, 7, 447, '毛牛私蓋闕隨鮮')
(252, 4, 451, '務望記詭')
(251, 1, 452, '古')
(250, 4, 456, '慮細買韻')
(249, 5, 461, '指歷湯蘭騎')
(248, 2, 463, '腸臉')
(247, 2, 465, '七音')
(246, 3, 468, '優皮違')
(245, 1, 469, '可')
(244, 2, 471, '得首')
(243, 4, 475, '引賓跡軟')
(242, 2, 477, '適銷')
(241, 2, 479, '劇姦')
(240, 1, 480, '錄')
(239, 2, 482, '刀歡')
(238, 6, 488, '夫定歌狀謹辯')
(236, 1, 489, '衛')
(234, 4, 493, '坐奪放顛')
(233, 6, 499, '彈形朝練請黑')
(232, 4, 503, '廣珠精鱗')
(231, 7, 510, '孫步河滅託鋪驕')
(230, 3, 513, '敵走陣')
(229, 4, 517, '城寵廢毀')
(228, 2, 519, '信雪')
(227, 4, 523, '寢而蠻誠')
(226, 2, 525, '沙燕')
(225, 2, 527, '斂爛')
(224, 3, 530, '倒功著')
(223, 1, 531, '失')
(222, 3, 534, '壯真鬧')
(221, 7, 541, '制園好徵滯獻載')
(220, 2, 543, '南林')
(219, 5, 548, '以用立緣耳')
(218, 5, 553, '入田賦輿銜')
(217, 7, 560, '團審短稅證豔馳')
(216, 4, 564, '仙善管詳')
(215, 4, 568, '才撲橋齋')
(214, 2, 570, '祿頑')
(213, 3, 573, '員籠費')
(212, 3, 576, '笑雙響')
(211, 3, 579, '取武賜')
(210, 4, 583, '樣淺瑤總')
(209, 4, 587, '回楚諸釋')
(208, 5, 592, '影志曠牙牽')
(207, 2, 594, '根赤')
(206, 2, 596, '封病')
(204, 4, 600, '剛性治禪')
(203, 9, 609, '啟專常獄繩附階霧驅')
(202, 3, 612, '價孤教')
(201, 3, 615, '先寬縱')
(200, 3, 618, '則槍深')
(199, 4, 622, '元玄縣表')
(198, 7, 629, '反潤紀統脩舌贊')
(197, 7, 636, '堂度房觸詐逸陸')
(196, 4, 640, '市燭衝針')
(195, 6, 646, '司容政朱眉禁')
(194, 3, 649, '居災露')
(193, 4, 653, '令器尾讓')
(192, 4, 657, '廟所穀章')
(191, 4, 661, '剝吳板聯')
(190, 3, 664, '寫巖額')
(189, 6, 670, '折撫獸瓊篤退')
(188, 3, 673, '勁潔秋')
(187, 3, 676, '爾狗麥')
(186, 2, 678, '涼窩')
(185, 2, 680, '沈浮')
(184, 3, 683, '尋枝纖')
(183, 6, 689, '夜密寧格牆穢')
(182, 4, 693, '室網蟻象')
(181, 3, 696, '微慘脈')
(180, 9, 705, '慶收柳疾胡血軌飄駭')
(179, 5, 710, '區蠶貢鋒鐘')
(178, 5, 715, '渾要許譽野')
(177, 4, 719, '撥甲省蓮')
(176, 6, 725, '冰品徑薄貼鍾')
(175, 4, 729, '伏浪燒科')
(174, 6, 735, '布憲波編莊追')
(173, 4, 739, '奇曆沖終')
(172, 3, 742, '壓蛇集')
(171, 4, 746, '丹厭攝趨')
(170, 3, 749, '幽搖景')
(169, 6, 755, '嬌憤曉油誅醜')
(168, 5, 760, '急損背鎮陵')
(167, 8, 768, '冠江糧索繫肅訪賈')
(166, 2, 770, '導楊')
(165, 2, 772, '嘴縮')
(164, 4, 776, '疏薦詔輔')
(163, 7, 783, '多棲比給諫輸魂')
(162, 8, 791, '守掃換據班籌美膠')
(161, 4, 795, '堅肉都里')
(160, 5, 800, '擾故活淨鵲')
(159, 3, 803, '側奧襲')
(158, 11, 814, '修弔支爐舞船藏送鎖阿隊')
(157, 4, 818, '乘策蘇謬')
(156, 4, 822, '任暢造遲')
(155, 7, 829, '典態構汙閉雅非')
(154, 6, 835, '偽息攢纏臥鵝')
(153, 6, 841, '冊句夾漁皇至')
(152, 6, 847, '切登綿緒藝霜')
(151, 6, 853, '博疊癡訊郎驗')
(150, 9, 862, '卻壁壇御維羈與避魯')
(149, 9, 871, '墨徹於暴樸歎的賴遙')
(148, 8, 879, '壺席投末求祕荊願')
(147, 8, 887, '推敘母游瑣能諧驛')
(146, 6, 893, '告繡罷覆誣須')
(145, 6, 899, '叢吃宿覽釣駁')
(144, 6, 905, '刻局紫鄰量麻')
(143, 8, 913, '勸幣庫照移訟迷頹')
(142, 4, 917, '倫周繼鑽')
(141, 10, 927, '倉半奮校案盧臣遞雄鼠')
(140, 7, 934, '圍磨羊英誘辦院')
(139, 7, 941, '假君恩紛罰羽蠟')
(138, 6, 947, '刺包太憑淚群')
(137, 5, 952, '受淪竄竊蒼')
(136, 7, 959, '丁易期留矯舍苦')
(135, 7, 966, '史商層履排略稟')
(134, 11, 977, '井創危弄拔泥潑獲累誦逆')
(133, 13, 990, '囊庭悶拜梅祖算籍級罪若鑿鵠')
(132, 15, 1005, '僕塞威富察底擁松準綺聚蟬隸雷麵')
(131, 9, 1014, '儲印款漿現評豎越錫')
(130, 14, 1028, '代具北屋怨悅擔符範罵豬邪采閃')
(129, 8, 1036, '儉少採邁郵闊鴉鼎')
(128, 11, 1047, '保全協夷是柔洋濫良認謙')
(127, 5, 1052, '刑擺桃致銳')
(126, 8, 1060, '去府熟絃翠躍軸醫')
(125, 7, 1067, '律旗材消減秀考')
(124, 16, 1083, '宗床廬徒改梁殿池社謗讒賀贈鈔鑑餅')
(123, 5, 1088, '端荒誤踐遼')
(122, 14, 1102, '偏墮壘尊差扇果欽疑續藍貳近逐')
(121, 8, 1110, '吹墜壞擬樞緩鈍鹿')
(120, 18, 1128, '列妝寄念愁承斬智束濁狂碧覺諭謁贍蹤閑')
(119, 16, 1144, '亡佛其吏怪披撓獵窺粧訛豪貝霞飽駢')
(118, 6, 1150, '接着綱部閱際')
(117, 7, 1157, '委射巧巴族詰鷹')
(116, 8, 1165, '做哀囂村縷菜賭鴨')
(115, 12, 1177, '位含招次毒潰福觴詠讀趙鬢')
(114, 8, 1185, '凍帝幾溝較輝除革')
(113, 5, 1190, '個斗譯轡降')
(112, 10, 1200, '亭吐喬梟棗穩翼腹膚鈴')
(111, 15, 1215, '了嘉就彫待感戀擇枕淫緊製警雀預')
(110, 16, 1231, '偉卷呼唱州拉施爺犯痛糾訴轍雕頌鶯')
(109, 15, 1246, '冷帖延往持料杖滾等粉組繁纓聳鴛')
(108, 15, 1261, '並帥彩憐枯泉米紗茶趕鍋閭韜駿鳩')
(107, 16, 1277, '候奏昏漏牌率畢看競簾譜貶跳醉釁鬚')
(106, 10, 1287, '凶垂害想提測筍諱鑒駐')
(105, 12, 1299, '劫奉妙屈嶺彌桑績置衡防驢')
(104, 9, 1308, '原尺干盛脅譏鈞餉鼻')
(103, 6, 1314, '存抱注綴雋靡')
(102, 12, 1326, '克吟啞寸左童紋腰讎閨馭馮')
(101, 15, 1341, '休剋墳宣序征旋暈灑程織蝦賽輩駝')
(100, 10, 1351, '洞烈片絡谷辟鏤飆飢騷')
(99, 12, 1363, '仁役旁瘡緝者肝舟辨雁項魄')
(98, 17, 1380, '傑屏巾戒救止澀特答純蜂諷貸踏輦鄭釐')
(97, 20, 1400, '侯勳友奴廝懼攬晝父狼硯票翻肩臘艷蔭誇販逼')
(96, 13, 1413, '伯便厚固寡幫扶探操氏蘆虧被')
(95, 15, 1428, '共悲搭敬查槃溜炎珍竅艱詆贅頤飭')
(94, 8, 1436, '債弓怒澆瓦釘鉛饒')
(93, 9, 1445, '依冒屯派狹綵翹肥裁')
(92, 5, 1450, '喜娘廩漫輯')
(91, 18, 1468, '何侶恆暗濕犬箋築縫繆蒙蕭該賬迎銘鍊饑')
(90, 12, 1480, '借廉廚更灰玩瓜穎複那鋼闌')
(89, 13, 1493, '宴拘揮湊爵牋琴窗誨豆鞭饗駒')
(88, 11, 1504, '味戎激甘穿蠅訂謫速遐鳧')
(87, 13, 1517, '丟兇式慚把架璧虜趣躡辱邏鬆')
(86, 8, 1525, '到攻暉枉界穴肆褲')
(85, 11, 1536, '亮停卒呂快擲洗虯謾鯨麼')
(84, 9, 1545, '亞在綸膩誕軫釵韓騁')
(83, 15, 1560, '久仗充劑嘯娛弱彊慢掌染漸秦貲阻')
(82, 18, 1578, '劉占嘆奔整杜欄津甕矜確禿籬芳誼讌震鹵')
(81, 8, 1586, '凌勤卹突街訶諂謠')
(80, 11, 1597, '凡向嚮宇展忘摩牘碩遜默')
(79, 18, 1615, '係吞婆幕廳忠挂柱泰瀆畏耕膏謨譎銓閎饌')
(78, 18, 1633, '今供倚加助塊墊撒李模氈申究箭綜蠱軼轟')
(77, 21, 1654, '儒吉困屍弊悽旅檻源版盪絳繭脣諾贓超轅鄙鉅饋')
(76, 16, 1670, '凝嘗懶汗瀝祝禽篇綏衰覈轂遇鑄闈隔')
(75, 21, 1691, '丘冤勇夏巡帽惠授搆搶杯殼盈研祭緯繞羨翁軋閫')
(74, 16, 1707, '冥己恥恨棧橈殊混焦矢砲碑籤返遮隕')
(73, 20, 1727, '乖侍函匱因始尚懇戈掩煉疇縛缺聰芻誥軀韋麟')
(72, 19, 1746, '介升寺幃弟欲毬爽縈訐訕譴貓貽述配隙驥鱉')
(71, 14, 1760, '判勵匠崇川晚洪瑞禱稜蕪途陷隴')
(70, 17, 1777, '京及噴境媚庸抵抹捨捲攤敦棟盟簫馴黷')
(69, 21, 1798, '傭兔初割契忌抗按攪效益礙簿粟缽蓬豫貌邦顫騙')
(68, 19, 1817, '乳倖僧削峻弦愚慕捕旨暮曹滑蔥裂賄逃陋鷙')
(67, 24, 1841, '匹惑慄攜梨棘榜況淹湖演犢碎第簽絹綽薰遁醬驟鵬鶻齡')
(66, 26, 1867, '俠僻兼勾屨巢建抽振淒滌灘灶男瞻硬羞臂薪詬誑賁贏鐫限隆')
(65, 26, 1893, '例像免孔座托拋斑斥朗核櫛泛煥猶瑩番篋肚跑輅遣邑釀餌駑')
(64, 18, 1911, '俊嬰完患撞晦毫焚綬衍譁逕這酸銖陶頃鯁')
(63, 22, 1933, '兆右姿巷幸批拙捐攘昭朋澗濃煖爪羹諛賑赴蹈頸餐')
(62, 17, 1950, '億剌套妄慎撐植沮盞窯紆耍誚鉗錐騶鴟')
(61, 25, 1975, '伐低侈侵冗刪巨戴攀敏旦昇淩狐由竿翰蟠袞褻訣謔谿霽驪')
(60, 26, 2001, '基填宏峰廂悟截挑旌未札朽析桂殷淡犀珮督簷褒踵蹇鑠駟齧')
(59, 17, 2018, '丸乞佩壤悍憚技歐示祥茂裹詢諦讞閤鴦')
(58, 17, 2035, '勒嘔姑忽惱挾澄濤砂穨篆胎蠹贖鄧頰魁')
(57, 20, 2055, '儔卑島嶽忍怯懲懽拳攔濛瞞育袍辰遭鈿零驂麴')
(56, 26, 2081, '于券匡婚寇崑循慣昌昧晉沉浹溢瀉熾矩竇筋緘翔莫轎闢闥靄')
(55, 31, 2112, '仰喚夕妖孝嶮廁廠戾摶煞燄璫畝眷磚祠署耗聾萊藻蝕詘跼躁陀隻雛鞋餓')
(54, 21, 2133, '冬匿呵妻尸捷播撻斜殫燿猛繪腐藉袖諮逞逢邇鋤')
(53, 22, 2155, '僑冶副劃卜吒愴扣押掙棋永璽癢租紹繹藪蝶購輟驁')
(52, 25, 2180, '偶呆圈崩抑棒渴熊牢碼糞綃茅荷蒲蘿蝸裙貺趁蹄郊錮闡騖')
(51, 40, 2220, '健兌兜匯坊宅岡恤括擠映栗椎滄滴瀾爍球筵箱籙紳耀膝融襟詣詮讚透酬鑾閔陞頒頗髻鷺麤齎')
(50, 31, 2251, '偷垢夥宜寓帷廕扯拍敕椒櫃洛洩洽療礦絨舒裘診謳貿輓轄鑪闔障霄驍黜')
(49, 29, 2280, '乎仇住嗇屠彎徽悵揭搗敝替泣潮猜稽簪籥緇縟胸脂藩謊豁賂蹙閻餞')
(48, 26, 2306, '佳呈堆季岸拂摯摺斃柏淳渙獅畜禦秩箇絆繒繳賠跌郭鐸鑼鼇')
(47, 30, 2336, '串卓叫咎塹媽忿惜憫拖掉握梯森歇漲炮犧瘋盃繃蟄襯豹距跨逋鑣顓龕')
(46, 29, 2365, '促傍傘召嚼垣婁慈扎掠攏攙欺殞漆牒瘦硃礪竭籃翦腫蛋覷蹕饞馱鬻')
(45, 27, 2392, '再凜卿唐均壟愆慰懾斧斯梢獷皂盲秉窟紐葛葦蝨誓遂霸騫鯉龐')
(44, 42, 2434, '佐凱唇嚇墓孽帛康必恭悔惻愧慧戇拿掛搜摧敷斤暖柯槐涉漬狎祀祐筒籟般蒸虞螺袋賚週逾闇颺鶉')
(43, 34, 2468, '傅午嗣嘲囉壑夭奩尖崖帆廷彥忙憊憶晶朴柴樁沐漚牧瘞睡矚繕讖遵鐙頻颯魔鹹')
(42, 28, 2496, '乏偃償儷允塔妍宵幻戚戟抄撈柵沸渠溪漂瓢瓶粗覓譚郡鈐雉餒駮')
(41, 36, 2532, '伍併倡偵催傲剪劣卵叉哄嗟姓媒宰崗弛愨拏捉援梗梵洶狡綢腿藹蛻訥諄邀霑驄鵷鸚')
(40, 40, 2572, '伊侮俸值凰刊剔勻哭嗚噓宦嶠幟庶悠惶挺攣敲杏此灣灼炭猴縑膳膺苗蜀蜜贄踴遏醇隄韶餼鮑')
(39, 40, 2612, '付伴佚倦刃劈喝囚姻孟岳幡弩慾拒拾擋擯早暑曳棍污瑕瑟癩絞絮纍苑螢衫誰諒譟貍鉞錚鬟黎')
(38, 39, 2651, '亙似佇僉哥啼埋巒希店拐控插楓瀨甚眩礱窶絀縞艾芒莖蒐蔽襪譖跋躋躓逝酣鏘鑰靨頷鬨鷗')
(37, 31, 2682, '互什俏坑婉峽嵐幅徙措氛淥添湧灌瑰矇稀稚糖蓄蛾註貂貯赫躬酌釜鍛鬍')
(36, 38, 2720, '亢佞咨唯域堯屑峭慌我戮揀摘曜棉棚概淑炙熒燦眥箕緡膾臚虐豈豕賃賒迫錘鏗鐺隅鞍顙')
(35, 48, 2768, '丈伎僂刁喧嫌嫗宸怠曼械楞檐櫝殲溷牖狠猥猾畔皓盆稿糊紈纂罔股胥腔臠莽葫葬蕃薩訾誡諍諜諠蹺醋閏靚飫餳')
(34, 38, 2806, '僭刮劄否增墻妃媮幄愜曾桐樵殯沾浦燼牲疲癘瞎碌箠綾縕脛艦芝虹蛟蟆裳諳譙踢鍼閥髓')
(33, 54, 2860, '企倍們刷匣喉塋塚墾廡彙彝悉抓掣摸攛旱柄桿榦欣毆泊浩浸滋漕濬猿疆瘠礫窪笙緗緬縹翳耆衙誹讋賸跟鋸鎔閘閽闖陌鞠駔鶚')
(32, 44, 2904, '些件僚嘰奠孩徼恐恢悖慟扃擢攄晨普榷泡涸渡溺澹濡盼磕禾簸粥羸航茲螭諢赬蹌迸邃闐髯魏鮓鮫鰥鷁')
(31, 47, 2951, '勘吾咒哲圭奸娥宛尤巫廊悼慝慴拱挽擅梭梳楮榻液滲獰璣甌皋皺礬稔笛系繚臭舄舖蟹蟾覲訖謎閡餽駛駱騾黠')
(30, 53, 3004, '且傖兄剽嚕嚙奢妾婿媼嬪宋寂幘幼怕恬懣懺抖攷晏暇桀桶櫓段沓漣澇焰睿穆糟緻縵纈翥臍臧苛蔚藤裕覘讙賻郤醒鎗閹閼魘')
(29, 52, 3056, '仕他儕叟叩哨囑壹姪姬尉已庾弘懦戍扭挫捫撮擣橐歪歿犁痕祈窠紱緹纊翫茵蠲衢衾袂詒謂賺蹶辛迂醞鎧鏃闚霤顆驩鳶黏')
(28, 58, 3114, '凋几剎勃即各吝坎夙尼岑峙帚恣惟惹扁扈挨捏旂朔杳檀殃泄洲涌淘炤燎燥琅甄疵症磧祚稍稼穠穹箏糴絜耽聘脊苟蜚褐襖賾酷銃騂騃黍')
(27, 49, 3163, '丕予僮凄台叱后咽哈喫嘩坡塢奈妓妥嫁扳撚暫曬榆欠湘炊炳烘煤熙獺瘧眇睜笠篷締繢腎腥衷趾踞轢雌韞頁鱠鶩鼉')
(26, 62, 3225, '享伺俯俱僨儻兢勉勦哩喻噥嬉嶄嶔徐怡拆拗揆撰撾敢晴朵棺槧櫂欒淋渚烹犖瓏甜磐磬稻穡穰站竦絢羶翮胄脹舛薑詛謚蹠轆迅隳靖靴頡顰驤鯤麾')
(25, 66, 3291, '佈准卦叛嘶壅壩妒嬾岐帙廄廈弋惕憒拓撤枚棹橘殖毗沿溶漠潘烽煎燋爨瘴癖眠砌篠簇簞糜罄翅肺苞蚊蠢衿裊詈詖詼謄譬賕逮邸鄒酥錠鍵鏟鐐閩闃陂鱸黛')
(24, 55, 3346, '冕厄吸噬嚶圜夸婢屐庇悄悚愷慳慼憨揖搏擷擿棠槽殄涎涵渺潭濱焉煇璇睛砥窘粵粹糲紕紡絛緞纘脯萃葷蛙謐迦迭逍闓靠髦鷲鹺')
(23, 80, 3426, '乙也伸倣僥儂儈剖吠吼唾嘿圃型堊塘壙并徇悸懌抉抬捻掇掖描揣摟撇撩撿擄擱擴昆暱棱楫楹樽檔櫻汰渥湛獃珂癰碗祗篩紇綻罌耐聊芽菊萍董蒞蠆裔詫諺軺軾輒鍔閬陛隘雍韁顱駘驀鰍鴆')
(22, 63, 3489, '么估儘兀劌叨售喘喙噎噦媳悴惋懿拊掘撟昂晷曇株椅槁檄櫟渦瀟炒煽燙牓癆磯秘秤筭籜紵綰縐縻腮莢萌蔓蝟詗誆諏贐赦踰輜辣迥逗遒鏈鑊顒鴈鴿')
(21, 88, 3577, '亨仲俎傻冢剩募卯卸吻咬唄坤娃嫉嫩寅崙嶢徂懋挈摳斲旛桌桓梓槌樊櫬汲汾沃沽浴瀦煮爆牡猷珥癱盒眺瞽磣礎秣穫笞筐箔箴簧繖纜罕聵肯菩蒜蕉蕙蛩螞襠覬詡誌譾豚贗蹲邈鋩闍鞫飣騏鬣鵡鷂鸛麋黯黽黿')
(20, 63, 3640, '俘俚厥只嘍垛埃墟墩壼央屁岫幬廓弁徠悒愾敞昵曖最檣歛殤淮渭炫炸煒煢熏甯疋祉笥粒絰綆縶耑耿聒脆芥菴虀蚤螻襦覿觝諉貰趲軿輻阜阪霏顥齏')
(19, 84, 3724, '伶傴儆儺儼匪咸啣喇嘈嘵孃宥寐寖屢幌幢彰怖慍懍戢捶揉摹攫敺暘杆棕楯欖毅氳湮潁潯瀧瘁癲睦碁竟籮綁縠翕肢胤脖膿茫茹萼葵蕊薀蘋蚌蜃螘衲襴觜觥訝賙賡跂輈輳郁鄲銛鎬鐶閶闒阬霍韉颼鴞')
(18, 74, 3798, '仔伕佔佯俳匭卡哺噤囀坰塌壚夠嫚宕寥寨嶂巍弭很懟或斫曙杓枷柘栽槨汝淤溟滷潦瀰琢瑋甿疼癭禎穗笏糕紺繇纇脾臟茸蘄衽踣轔辮邯釅鑱阨阮霆霹靂颸飼騮骸鵰鶬鷰齕齪')
(17, 120, 3918, '丐丞丫伙伽倩吊嘮噪嚥坦堤堵塼奚嬭孱尹屆崎嶼巔帑弗弧彤惰愎愿憎扮拈摻撏敖旬昔曝朧杠椽櫳歧毳汁沍涇涕涯溼滓濯瀠灝煬熬爬犒狙珊琱璞甍癟癥盂睨磽禹稠笨筴簍紘綈緋緦縗缸罐翎翬胃胖膜臆舵舶菌葩蒿蓽虔襄讜跪跱踡躅軛軻輾遍遘邛邱鄴醪醮銑鐮陟鞅頎飧鬩鮒鮭鰲鴇')
(16, 87, 4005, '仄仆偎劾厝叔吁呢咕啄啜喑嚲址坯堿姍孰幔忤怙恃恕懞扉扒扞抃拷挹攖旺杵棼橛檯汽洒港瀏瀛煦牝珪琛璃畿睽瞪碣碰篳紮紼翊肌肘腕艇芬芸蔞蔬薈蠡裒訃詁詵賅蹊躲遶遽郢鋌鏢鑷閟閾靦韝颭飴黌黼龔')
(15, 109, 4114, '乍侑傚儐冪叮嗜噠嚨嚷囁囈埽堙堡堪姝婬嫋嫺嬴寤寮尿帕庖忻恚恫愉憾懊懨戧拽捧掾搬旄旆曄杼楷榛槎殮氓沛洿滔澱煌燁獪疽盾瞬碓窄窒篾籲糝紉紓罩羲耦耶肇胞腴舸艙荼菱蠔蠣衒袒裾覯誶諼赭躑躒辜醯醴鈕鉏鉦銚鎛鏝鏹鐃闞靶頦饜驃髭鬯鶡鸕麝齠')
(14, 103, 4217, '仍份伉倆凈剿勛匝咀唆嗆囿圉圮塾奄奐奶媧嫠嫡庚彆愍捱擒擘擦斡晃晤杞梧楨榭歆歹毋沫沴沼浚涓渟湍濾灩燃燔獮琯疚疥疫痾瘍癉癬眄眸箍箸粱糶紲絺纚罽羆翟翩臻舫苧蓴蔑蔔蛛褌褥誄諡諤謅讕蹦躉躐迍鄣鉉鉸錙錶饁饉馹鱣鵜鷓鷦鷸麒')
(13, 138, 4355, '佻倨偈偪僦僱儹冀刈刓勿吵呀呱唬嗔噫噹妹媟嬈嬸孚崢幰弼徭怎悃悛愕慨慵懈戛戳掄搔搨摭摽撅斝旃杭榴檜櫥櫨櫪櫺殉毿氂汀泯涂淅淬潢濘烝燠燧牟狄猻玷瓷甑甖甸畦疙痺癇睇睫矛磴祇稗箝篡粲紊綣綦縲罏臼舅苔苫莧菽萎葆蘚蚓蛺褫褶觚訌詎賧賵贔跛踔踩蹴蹻躂遝遴釧鋏鎩鏑閈闤阡陝霉鞦餚餡馥馨鯢鴣黝黲黴鼕齔')
(12, 120, 4475, '亦仿佃僊冽凹刳劬勺哪唳啗啦嗓嗶嘖嘻噱嚌埶墀夔姆娉娑婭嬖屎怛找抒拼挖擂斁晌枘柝栖槊橡每渝湫漉濺瀋灕炬燾狷猗玲琳璜瓠甩畸疣疹瘟睞睹瞀瞭瞿磑祅稈竺笄筠筩篦簌籩縴繙罣羡耨肴舂苕茬蒂蓉薊薌薙藎藕虱蛆蟣褊觔踊迤遑鈸鍬鎚鏜鑲雇雖霓鞏鞘餑鬮魅鮐鰓鱟鱷鶿黔齦')
(11, 104, 4579, '乃佑侄俟倅剸劘勗匾厖呴咳唧嘎噩噲孑孜屜峴庠忒忝悰愬扢拄捍捩摑撼擗既暝杪柑榱槓殽汩洄溲滸澌炕焊爻猋瑜瑯瓮甦痞皆盭瞑瞥矮砍磁磔禰禺篁篝繈羔肄脰舜蓆蔣蕤蛤螳蠐衊裸覃趺踅蹐輞輥迢逛遯鄂酎醅錨鍥鎪闋隧需韃頫髫鯰鯽鵑鵩龢')
(10, 146, 4725, '俵俶偕僅僇凳勩咄啖嗤噶培堝堠塍塏墉姊娟娶娼嬋嬤寰屣嵩巋怵恪懵扼拇拌拯挪捎掀撣攸斛晞暄曩杈杉栲楣橄檟檮殢毖汞泐浣淖漪漭漾澈澮瀅灸燐燬爇玻琶瑪甥甫痍瘤癮眚瞰砑砭碭磊祟稷窳竽筮篛簑簣籀糠緱胙艫芙茗葺蓼蕈薺藜蜩袁裱褡襆觕訏詶謇讟豢豺踦踽蹬躥躪轤逴逵酆酪醢醼鈇鉥銹鍠鍤隗霖霣鞮飪餕饕饟騅骾鯗鯫鰭鴝鵒鶼鹼')
(9, 172, 4897, '丱佬侃俞倀傀僵剴剷匏卉叭吭呶咫咯哆啷喣嗽嘽嚅坼姜姱媛媿嫣嫵嫻孕岔岱峨巽彼忮悌愈愣憖憯懃戔揜撝旒昊暌曨朦柞梱棖棬椏楸榔槳樗橙欑歉歊汪沁泮涅渣滬漵瀕狽猢獼玳琪瘖瘢瘵癃皴盎盔盥眈砸确碾祧窅窾笮糰紜紿絓縝縢繅繻纛缶罋罍罟羌耘耬肋臾舋艸茭菁蓍蓐蔡蕘薇虺蛀蜺蝗蝴蠖裨褂襤証諶譫豸貊賮跧蹂蹝軨軹轀邐酉酋酢醃釃銼鋟鎊鏽鐲鑕鑞阱陘陬雩雹靳鞞韍頊颿飩餛饅馘髀魴鴒鶱')
(8, 189, 5086, '云佉你佹侖倔傢儋冉剉剜匙卞卮又叵咋咍哇哉哢喳嘟嚦囷坌垓埒墅姚姨媵嫂孺屧岩崔嵌嶇巘帨廥弈彘彪彭忱恍恙悱愒憸掗揪搐撙擰斐斕旍昨曦杷枲枳柩桴梆梔椿楔槿樑樺橦檳殂毓沌泗浥溉漱澂濼瀲焱燮牴猱獠瓔瓚畎痊痙痼瘩皁皸瞢矗祁祲禋禳秧穌窖笆笈笳篽簋糅紂紬絫綹縋繽缾耄腌膊膛舡芋苓茨菲菹萱蒔蓀薔藺蘢蚩蜑蜡蟒蟯裌覦訇諝譸貤贛跗跣踳蹀躊迪迺鄶醵鈹鏇鏞鏵钁闠阯隼雒霾韌韙餔餱饔騄騭髡鬲鯊鯷鰻鶖鷇鷯鸝黥黻齗齬')
(7, 218, 5304, '丰乩佗倪僝儇儡划剃剡匕另呻咻咿哏喊嘸噉囤圇圩圪垠堞墝夯奼姣嬗嬙它宙尪屩崛嶧巇巉帔幙庥庳廛彀徊忡忭怍怏恁恰惛憩戕扆扛捺掂搠搥摛撕擻攩斟旭昴曀曏枵柁柙柿栝桄椓椰楛槥欹歙氤氾泚泠洊淆渫溥滎澠炯煨熛熲爹猩獐玀玦瑚甃甓畋疤痹痿瘕皎皚皰眴睚瞋瞠瞳砧磷礡祓禊秕窆窈筦簀糗紝緄縉罅罡聱聶肖胚腆腊腑膀膈臊芹苴莎菅菟菸萄蓁蓺蔕蕎蕞虻蜆蜎蝎蟈蟶袷褚褸襚襞詿謖跖跚蹋蹣躄躕輇轓轝迮逖逶邅酤醲釭鉻鋅錁鎢鐍隋雰霈鞚鞶餾饈駙騣驎骰髒鬐鬒鯖鰈鰾鱔鴃鴰鴳鵓鷖鸇麩黶鼙齶齷')
(6, 225, 5529, '乂亶仞但佼侔俐倏倭傯凸剮努卬叡吶咚咧唁啁喏喒喟嗎嗥噯噸嚎嚚圞坏坳坵坻埳埴壕娜娣婪孌孛孳尻屭崽嵬幗异怫恂恇惸慇憋抨抶掎掰搊搒摐摔撢撦斌斿晰朕杌桷梃榪樟殆毯氅汛沱泓泝洳渤湣溈溏漓潟澎焯煜熔熠燉燴爿犴狩狸猒琵瑁畚疐痴瘺眊眙眯睢瞌瞧瞵碟禘秏筌簹籽粘糈絏綌緲縊縚繰纔罹聆聿胔胝腋膨膻臏臛臬芊芍荅荻菑葡葭蓂蓊蔫蕆蕕薛薜薨藿蘺虖蚑蜣螫螿蠕袟袤裡覡觶訞詹誖諕謏豗豳踹蹓躔躚輬輶轘逡遨酈釦鉶銕銬錡鎌鎦鎰鏊鏐鏨闉霎鞿颶飀飥餖餧餫餺餿馗駸騍騑驊驫髏髹髽鬃鱘鱧鶹麈麓黧鼯鼴齲')
(5, 300, 5829, '亟佷侏侻俄俛俾倌倜僄僿儅儥兕凊剄勣匈匽厎吮呦咂咷哂哼唸啃啾喃喋喲嗐嗛嗡嗹噁嚏囪囫囮坱垤堀堰奰婷媢媯孀尨崍崒崟嵇嶁嶸帢幛庵廋廒彯徨徯恧悁惎惓愊慫憮拭拴挍挐捆捋掊掐揄搉搘搢搧擎攆旻晬朘朮柬柺栱框桉棨榼樅橢檉檠櫚欷殍殛殳毦沆泆泳浡淙渰湃滕澡濊濔濠濩濮瀁灤烙焜熄熨熯熳犛獫玫珓瑛瑾璉璐瓣痔痘痠痰瘃皦矓砰硜碇碕碴碻磅祛祼秈穭穾窕窬笱筊筑筧篙篚篪篲簏簦籯絪綍綑緌縭繾罈罝羝翣耋耎耙肫脞腯膃臢舲艘艣芘芭芷范菀蓯蔦薯虓虢蚖蚱蜉蜋蜒蜓蜨蜮蝤螂螄衚袪裀裛褭褰褳襏襜襻觱諑諞諟譆谹豉貉貙賝趫跎跕踱蹉蹩躇軔輀輊輣輤輮輴轖迆迓迕迻遛邕郇酗酡酲酵醑醺釤鈀鈒鈷鉈鉚鋃錕鍍鍘鎳鏌鑌閌阼陔隍隤霰靉韡頏顴颮颻餃騸鬘魎鮪鵂鵪鵯鶺鷿麇麰齇齟')
(4, 387, 6216, '丑亥侗傒傔僽儗儳儸刎刖刨劊劖勍厤吧吱吷呫呷咐咼哮哽唏唚啐啕喈嗅嗊嗑嗦嗷嘏嘬噣噭嚀囅囌圯圻坨坪垮埏埜埠埤塉壎壒壝壬奕妣妨姐姥嫮嫷嫿嬝嬲孿宄宓寘寠尷屙峒崤崧崿嵎嶒巹庋廞廨弢彖彬彴怔怳恉惺愀慊慓慷憀憧懂懆戡戩扑抔拚捃捽掞掬揲搓搦摒摜撂撬攉攮旐昃晻暨暾曷朒枋枸枹柢柰栓桁桎棓棵棽椑楂楗楝楬榨樛樾橑檗櫜櫞櫱欻歟歠毧氐汶沂泱洏涒淄淇渢渲湔溘溽滃滻漦漩潼澍澒澦濇瀑瀣瀸灺炷燀牯狃猙獘玎珀珧琇琖琚琝琨琰瑒瑙瑱璋璠璵畛疳疸瘉瘓癤皤眨瞅瞟瞶矍矻砢硎硝硤祆祔禕秒秫稊穵窊窨笤筏箐篔篸簟簠籪糒糯紖綖綯繐繯纁纆罨罾羼翾耇耡肭胊胯胰腺膋膘膴臕臿舁舠舷艓苡苹苻茁茄茆荏荔莛菔菠菰萇萋萸葅葯蒯蒱蒺蕁蕢蕷薅薏藐蘧虡蚋蚍蚰蚶蛹蜻蜿螟螽蟊蟫衄衎衕袱覂覜訢訿謷謻譔豨貣赧赩趟踆踟踠踧踶躺軷輛轑遄遫邵郟酖酹醱釬鈣鉀銻鋁錛錳鍰鎂鎡鏖鏚鐔鑤闆闑阤陡隈隩雝靛靮韆韭頇顎飂餤駃駴騤騧驌驏髕鬁鬅鬈魍魷鮞鰉鰩鰱鱭鳲鵃鶊鶘鷃黦鼪齁')
(3, 428, 6644, '丙仳价侉侜俁儜党兮剁劓勖匆吆呃呸呾呿咇咈咭咮咱咶唉唔唲唵啎啥喀喁喂嗄嗌嗒嗝嗢嘀嘁嘛嘜噀噷嚘嚬嚳囓坩埆埵塑塒塤墁墆墐墯奎妊妮妳姁娩媲嫖嫪孅孥宁尬屝岨岷嶷帟幀廿弇彗徬忖恒恓悢惏惘惴惷愯愻慪憍戺戽扔捭掏揃揫搕搴摁擫敉敻斠斸旟旰晾暍曛曰杻枻柂某栘栩桅桮梏棐棣椷楙楦榕榖榥榰槮檁檖檛櫧櫫欏欞欬歜毼氫汍汧沅泌泔浙浼涴涷淈淰滫漊漳漶潏潸澳濜瀘瀚瀹灞烜烤焙焠焮熸熹燖爓爚爝爰牾狖猊猓猖猝猲獍玅玆珞琉琥琦琮琺瑑瑲璀璁璅璿瓿町畀畤痂痡痢痤痧瘌瘥盩盱盻睏睖睠瞷瞼矣矰砦硐硫碪磈礁礽秸稞穟窣窵窿笊篴簉簰粻紒紾絁絣絻緙緶纕罛罻羃翱翽耒耜耰耾肱肸胠胲脡脬腠膕臝舐艤艮芯苾茀茈茱荂荐荑莞莩萑葠蒨蓑蓲蔀蔌蕣薉薟薶蘀虣蚨蚪蛔蛭蜍蜘蜷蝍蝝蝡蝥蟥蠃蠍蠑袢褓褘襁襼覶觖觳觿訒詅誒諈諗謼讔豻賨趠趴跬跲跺跽踉踝蹅蹔蹡蹧躦躩軑軠輵逤逭邗邠邳邴郝鄔鄱酃酺醆醍醽釂釕釗鈆鈉鈑鉍鉿銍鋇鋘鋙鋦鍉鍚鎯鏦鐻鑐钂閂闟隉雊雚雺靷靸鞀鞁頩頲顩颩颱餵饃饘馽駏駰骫髖髺髼髾鬄魆魛鮆鯪鰷鰼鱖鴕鴯鵔鶤鷚鷟鷥鷫麂黂黕鼖鼬鼷鼾齙齣齰')
(2, 690, 7334, '丏亳亹仂仡仵伢伻佘余佝佪佰侷倘倛倥倬偠偢偫偭偺傎傜儌儤儵兗冏剺劭劻勷匐匜厘厙吪咆唃唅唌唪唰啅啍啪啽喤嗃嗉嗨嗩嗲嗾嘒嘹噂噅噙嚐囟圄圊圌坍坫垸埡堇堍堶夤夬奓妲姘姽娓娭娵娸婘婞婺媕媾嫕嬛嬡嬥嬿孬寀寞寱岠岣岪峿崚崝嵁嶗嶚嶨嶲嶴巀巳帘帡幮庌庪庬庰廎弒彉彔彿徉徜忉忔忪忳怗恌恟悆悗悷悻惆惇惙惵愫愲慅憿懅戤扠扦抆抻拑拶挏挻挼捂捅捯掜揎揠揩搞搤搪搽摞摴摵撋撘擽攦攲敧斒斮旓旝旮旯昕昫晜暐暵暹曈曚朓朣杅杬杲构枌枰柅柈柎栟栳桫桲桹棫棰棶椐椹楩楶榣榫槼樔樕檥檸櫑櫸櫼欂欃欿歃歈歍殟殣殪殭毹氌氧氯汋汔汜汭沕沚泅洌洑洧洫洮洹浯涔淀淌淞淟湑湢溔溯溳滂滉滮滹潷澥澴濆濎瀍瀯瀵灃灄烴烻焞煠煲熀熇熚牏牣牷牸犍犨犵狴狶猳猵獝獧獯獾玖玭珌珩琫璈璨璺瓞甔甗畬畹疔疕疝疢疻痀痌痎痏痗痝痟痱瘏瘙瘝瘳癒癜癸皈皛皞盉盍盦盬盹眵眶睆睬矞矱砉砝硨硾碳磋磝磞礩祫禖禡禨禬稛穬穸窌窔窞笯笴笵笸笻筰筲筷箄箑箜箬箯篌篰篹簂簜簨簬籐籓籔籦粞粢粳糢紃紞絇絎絿綟綪縒縰繠缿罳羇羉羢羯羿翛耞耷聹肐肛肪胏胗胛胳胹胾脤膂膰臀臃臌臑臒臷舳艎艨芟芩芰芼苒苶茜荀荃荄荇莓莘莠莨菇菖萁萵葒葳蒟蒹蔗蔻蕓蕝蕨薆薤薧藂藶蘑蘙蘞虒虫蚘蚜蚴蚺蚿蛉蛐蛑蛓蛬蜰蝌蝙蝠蝣蝮螈螬螯螾蟀蟂蟉蠁蠉蠋蠓蠥蠨蠪蠵衖衩袨裲裴褎褕褪褵褾襂襐襘襫覗訑訬訹詀詄誾諵謣譊譭讅豌豭豶貆貔贉赳趓趷跇跏跐踒踕踘蹁蹚蹜蹭蹯蹸軏軥軬輁輠輲轇轠迵迾邾郗郙郿鄘酇酊酏酩醄醟醨醳釉釽鈚鈜鈲鈾鉆鉋鉧鉬銡銪鋂鋈錆錏錣錥鍇鍧鎝鐏鐳鑢闛阢陊陜陪陲隒隮雎雯霙霿靆靘靬靼靽靿鞙鞬頖頜顢顣顳颽颾饎饐饙饡駓駷騬驔驦骭骯骷骹髇髑髲鬋鬎鬙魋魑魨鮚鮦鮹鯀鯇鯔鯕鯧鯸鰒鰨鰹鱐鱨鱺鴘鴠鵁鵊鵹鵽鶄鶌鶵鷅鷊鷞鷳鷴鷾鸆鸑黈黐黤黮鼐鼚齜齞齮齯齴龠')
(1, 1298, 8632, '、万丳乒乜亄仚仟伀伄伋伭佢佣佺佽佾俑俴俺倇倓倕倠倰偯傂傛僈僎僖僛僩僪僬僰儃儓儩冓刌刲剕剚剞剟劀劗劙勀勰勱匍匎匷匼卣厴厹吰呡呰咡咢咥咺哃哅哎哤哦哧哱哳唈唦唼啊啑啡啢啵啶喔喥喦喨喭嗙嘂嘄嘐嘓噌噗噢噾嚂嚜嚫嚵囋囔囡圛圬坋坒坢坭坶垵垽埌埔埭埰埸堁堥堲塈塙塽墋墠墼壖壢夗奊奡奫她妞姅姌姏姒姤娀娌娖娠婐婑婟婥媃媄媌媐媰媺媻嫇嫈嫟嫦嫫嬽孖宧寍寔尰屌屮屹屺屼岈岍岏岵峗峘峪崆崠崥崦崳嵂嵅嵒嵞嵥嵫嵲嵼嶕嶙嶭嶰巆巑巰帄帊帣帤帩帴幎幓幦幧幨幪幭庀廑廔廖廙廧廱弳弶彄彧彷徘徦忷忸怊怢怦恝恲恿惀惝惦惲惼愅慁慆慉慱慺憔憝憢憬憭憺懘懫懰戁戄戊戌戙戥戭扐扜扡扺抏抪抰抾抿拮拸挌挲捄捔捗捥据捵掁掤掯揅揓揘揱揵揹搎搯搰搳搵搾摋摎摙摝摰撳擐擖擩擭擼攎攥敹旎旖昲昳昶昺晛晟晡晱晼暋暡曶朅朏朐朢朹机朾杇杕杙杰杴枅枇枍枑枒枓枙枴枺柊柚栫桔桯桼梀梂梐梠梪梬梲棷棻椋椗椥椳椴楖榑榧榾榿槭槱槲槶樏樨樲樴樿橇橉橪橿檎檡檬檽櫌櫐欀欐欘欨欱欸歁歔歭殀殕殠毉毻毽氄氆氍氨氬氮氿汎汨汴泫泭泵洇浬浰浿涊涗涘涪涫涬涮涳淛淜淢淶淼渀渧渮渱湀湄湅湎湓湞湩湸溧溮溴滇滊滭漈漰漻漼潒潞潠潬潺潿澣澧澩澶濂濈濞濰濴濿瀎瀜瀤灂灊灦炰炱焄焌焍焐焺煆煟煣熁熅熉熗熝燂燜燹燻爂爢爣牂牿犄犅犆犗犞犪犿狁狉狌狟狨狺猁猇猘猞猦猧猭猺獊獎獗獛獦獶玕玢玨玼珇珈珖珶琁琊琍琬琲琿璆璘璡璦璲璸瓤甀甂甒甬畈畟畣畯畽疰痑痒痣痲痶痻瘀瘈瘊瘐瘑瘛瘨瘭瘱瘼癌癙癠皙皜皪皯皵盯盷眐眳眹睄睒睟睥睩瞂瞄瞈瞍瞚瞛矉矊矐矔矕矘矙矼矽砅砒砪砮砱砵硍硞硠硥硪硼硿碆碉碘碙碨碫磃磉磛磡磢磲磳磻礄礉礐礓礛礜礤礧礨祏祜祴祺禜禠禧禫秎秝秪秭稃稑稕稘稙窱窴窸竁竑竘竣笓笘筇筤筥筱筳筶箎箘箙箛篥篱簁簃簳籛籸粑粖粽糙糨糱糸紟紩絅絧絭綞綷緁緟緧緺縎縏縓縯縸縺繀繂繄繜繣繨繶繷繸纑罘罜罥罫罭罶罿羋羚羥翀翍翡翿耏耵聃肕肜肣肮胈胕胴胼脽腃腓腡腤腲腶膢膫膱膵膹臇臞舝艄艑艚艛艟艩艼芄芅芑芔芞芨芫芮芴苜苣苤苨茖茳荍荳荸荽莃莆莚菂菄菆菘菨萉萐萭萯萿葑葙葥葧葶蒍蒩蒻蓇蓧蓰蓹蓿蔆蔏蔘蔟蔤蕀蕑蕖蕡蕬蕮蕵蕻薁薘薝薣薴薷薸薹薾藒藟藦藭藰藷蘅蘊蘗蘠蘤蘩蘪蘸蘼虆虋虙虥蚗蚙蚝蚡蚯蚳蚾蛃蛄蛅蛖蛣蛦蛨蛸蜁蜊蜞蜥蝀蝂蝒蝘蝚蝩蝺蝻螃螑螖螗螲螹蟅蟋蟞蟟蟦蟨蟺蠛蠜蠝蠠蠩蠮蠯蠰蠳蠸蠼衋衧袀袓袹裯裰裼褙褣褧褯褷襝襬觟觡觫觭觾詑詙詨誂誺諆諔諯諲謞謦謰謵譅譑譒譣譺讄谾豇豏豜豤豱豲豵貅貑貕賟贇赮趄趍趎趑趧趯趹趼跅跢跤跫跰踀踖踛踤踮踸踾踿蹛蹥蹼躆躗躝躞躟躽軘軞軦軮軵輂輐輑輖輗輘輚輹轈轒轕轗轙轞轣迒逄逅逌逑逜遢遹遻邂邆邋邍邙邢邰邶郃郅郛郫鄆鄋鄏鄖鄗鄦鄨鄹鄺酓酨酮酳酴醁醊醐醥醧醰釓釔釙釩釪釱釷釹釿鈁鈃鈄鈅鈌鈥鈦鈧鈮鈰鈳鈺鈽鉎鉑鉭鉲鉺銔銗銙銠銣銥銦銨銩銫銲鋀鋄鋋鋕鋝鋧鋨鋮鋯鋰鋱鋻錈錒錔錟錤錧錩錸錼鍆鍒鍜鍞鍭鍶鍺鎒鎕鎘鎞鎣鎲鎵鏄鏍鏕鏙鏷鐇鐋鐎鐒鐓鐖鐠鐨鐩鐱鐿鑉鑭鑴镼閆閜閵閿陑陓陫陴陼隃隰霅霩霪霫靪靺鞨鞳韄韅韐韣韥頄頍頞頠頨顉顊顑颳飁飉飌飶餈餗餬餮餰馰馲馵馺駍駥駧駬駶駹駼騋騕騢騵驆驐驒驖骱骴骼骿髶鬊鬌鬖鬷鬾魌魧魱魺魻魽鮀鮛鮶鯆鯈鯛鯞鯡鯬鰅鰜鰝鰣鰤鰳鰴鰶鰽鱈鱎鱒鱙鳦鳭鳱鳷鴐鴢鴥鴶鴽鵀鵙鵚鵻鶂鶆鶇鶋鶗鶜鶟鶠鶣鶪鶲鷋鷏鷐鷑鷒鷕鷩鷬鷮鷽鸁鸏鸓麃麆麑麛麷黭黰黳黹鼊鼘鼛鼩齆齍齘齛齱齵齾龤')
]]
]]]



from script.字频统计冫词汇纟汉语大辞典 import *
#]]]'''
__all__ = r'''
'''.split()#'''
__all__
___begin_mark_of_excluded_global_names__0___ = ...
from collections import Counter
from seed.mapping_tools.dict_op import inv__k2v_to_v2ks# inv__k2v_to_v2k, inv__k2vs_to_v2k, inv__k2vs_to_v2ks

___end_mark_of_excluded_global_names__0___ = ...


class _G:
    path1 = r'/sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典-词汇繁简对照-补空.txt'
    path2 = r'/sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典-词汇繁简对照.txt'

bad_lines = ['背光性:背旋光性', '本州:本州岛', '大九州:大九州岛', '電腦:计算机', '番茄:西红柿', '福馬林:福尔马林', '公車:公交车', '公車上書:公交车上书', '公車司馬令:公交车司马令', '公車司馬門:公交车司马门', '獲雋公車:获隽公交车', '雞公車:鸡公交车', '捷徑:快捷方式', '九州:九州岛', '九州璜:九州岛璜', '九州四海:九州岛四海', '看板:广告牌', '看板娘:广告牌娘', '呂公車:吕公交车', '馬克沁:马克西姆', '四海九州:四海九州岛', '旋光性:旋旋光性', '影本:复印件', '章滿公車:章满公交车', '終南捷徑:终南快捷方式']
def 字频统计冫词汇纟汉语大辞典扌(path=None, /, *, traditional_vs_simplified, may_num4most_common, pairs_vs_grouped=False, to_show_both=False):
    if path is ...:
        path = _G.path1
    if path is None:
        path = _G.path2
    with open(path, 'rt', encoding='u8') as fin:
        txt = fin.read()
    txt
    txt = txt.replace('， ', '，')
    assert not ' ' in txt
    assert all('一' <= ch <= '龥' or ch in '，；、AＱ\n:' for ch in txt)
    d4T = Counter()
    d4S = Counter()
    #bad_lines = []
    for line in txt.split():
        try:
            t, s = line.split(':')
        except ValueError:
            raise Exception(line)#含空格: '， '
        #t繁，s简
        if not s:
            s = t
        assert t, line
        assert s, line
        assert len(t) == len(s) or line in bad_lines, line
        #if not len(t) == len(s): bad_lines.append(line)
        d4T.update(t)
        d4S.update(s)
    if to_show_both:
        ps4T = d4T.most_common(may_num4most_common)
        ps4S = d4S.most_common(may_num4most_common)
        print(ps4T)
        print(ps4S)
    #print(bad_lines)
    #ps = (ps4T if not traditional_vs_simplified else ps4S)
    d = (d4T if not traditional_vs_simplified else d4S)
    return _f(d, may_num4most_common, pairs_vs_grouped)

def _f(d, may_num4most_common, pairs_vs_grouped, /):
    d = +d
    print('字数:', len(d))
    print('总计数:', d.total())
    ps = d.most_common(may_num4most_common)
    if not pairs_vs_grouped:
        return ps

    #qs = sorted(ps, key=lambda hz_n:hz_n[::-1])
    n2hzs = inv__k2v_to_v2ks(d)
    n_hzs_pairs = sorted(n2hzs.items(), reverse=True)
    def __():
        acc = 0
        for n, hzs in n_hzs_pairs:
            hzs = ''.join(sorted(hzs))
            sz = len(hzs)
            acc += sz
            yield (n, sz, acc, hzs)
    return list(__())


订正版冫汉字行每频数 = r'''
子
不
人
一
大
頭
心
風
天
三
無
行
生
金
山
馬
水
花
白
文
門
玉
道
地
小
家
中
兒
氣
相
雲
龍
黃
言
石
日
神
長
青
火
書
事
之
口
下
上
老
公
清
手
車
官
五
明
然
流魚
高
重
出
酒
月
眼
通
分
國
衣
木
節
意正
時
法
遺
面
香
學
名
情
成食
發
世
合連
有
方
百
打
自
二
聲
身
光
海
草
土
兵
目
平
八
命東
物
作
四
年
會語
本
主
靈
九
解開
見
民
色
王
曲路
同飛
客
骨
交
和
軍
服
過
士理
女錢
進
落說
如樂
直
陽
十
空
化外
春
義
宮
體
星
調
田竹
力
寒
六紅
陰鼓
死
鳳
德
斷
遠
當
雨
鬼
機虎
夫
腳
內筆
華
角起
畫素
論
首
實望
後
千朝黑
利詞足辭
知經
煙
工得絕
臺輕
關
私
窮
來
安
離
西
字散
牛
動積
師
古
邊餘
養
思羅
惡
玄
亂
坐
精轉
仙
新音
戶虛
放
堂禮
定
南
指
信
毛
鐵
詩
沒野
使城
傳
好引真破
兩
珠
赤
七回
前
步
計
盤
林
寶業
失歌
從親
教
入
市
制志橫
立
功皮
令戰
室結
牙簡鶴
楚沙禁
度
布
極
為閒雪
居秋
俗歸河
用
可才
鄉
刀沈耳
元變
幽
深
樹鳥
病
燕
折隱難
雞
房武
點
露
孤甲
取
懷
器
胡
倒容封負
夜守疾運
戲
絲走
觀遊達
塵驚
微
形
格治
善
常
性
根眾
伏章
營
問密
對板質
笑表逸
丹舉
鴻
政
管
修數霜
異
別條皇順
乾急
先將疏
游要
影
帶景薄象
朱話
視
末陵
司
江科
退
宿而電
浮識銀
阿
反里
號齊
圖
君
支貴都
冰
處血
參息
收
油還
母省
索飯
麗
報美
周雜
附
賢
故樓背
品場張
殺班
刻
短
紙
柳
冠聖議
暴波眉
追雅
歲
切漢
賣麻
宗席
典熱造
奇
逆
以墨夷蟲陳
半燈騰
塞應枝權謝
北尾興舍飲
所揚選郎錦
推烏肉舌齒
弄
任祖
勞鳴
比脫臣資
狗蛇賞迷
擊稱綠萬采
勢覆貞
懸登藏輪
嘴
嚴貨
丁豐
局獨留雄
桃活英談謀
至
葉
顧
決靜
移銅髮
刑單照
假傷棄
儀御易苦集
府裏
井端舞邪
商太越遷
印屬律除
句愛
強昏期松
非
次秀職
策籍聽
列刺吏多榮淫磨約
拔毒
博告狂迴
族果
斗梅鬥鼎
能
泥浪的罪臨荒錯頓
怨拜
保婦送
投求量
案碧豪
危厲執是羽賊
巴枯避
船
鹽
亡威蕩護
溜鸞
位
履鼠
聞
乘旗雷
偏材鉤館
代原
全恩腦
佛村符部
吃尊種良
濟累群若
史帳洋近降
環考
少差敗辟鬱
梁滿
委復感頂
夢徒黨
伯受舊規軒險魂
休凶干校福類
帝率略顏
社紫藥補
勝喪底憂拉款殘革
察禍
柔裝蹟顯飾
屋智消澤防院龜
改煩盡致
試責
具池泉翠膽
劍囊排術鏡
納講
寄標
亭檢
射淵溫爭羊閣
屈熟訓貫
便傾圓宣
習
杖殿領
包含床線討
冥監米貪鹿
奉父設課醉
尺巧庭疑駕
承洞等
冷壁延着算
持料暗潛產者鼻
備呼妙
招間
在
粉財雕
幹施桑犯
念束注程菜賤霞
塗壽待愁貧
接闕隨題
垂富慮童鮮
嘉害盜農逼
哀役蓋記
務弱蘭詭
就怪扇細聚茶警買逐
操止韻
候卷歷湯灰騎
漏腸臉違
抱牌
優枕
烈肆谷靡
盛
其姦弓賓跡軟
帖痛適銷
劇吹更
著踏錄
夏披歡界翼
侯提狀謹辯
做克翻跳
敵衛
瓜瓦蒙
何奪序滅看請顛
了味廣彈練遐
喜奏戒豆鱗
友孫氏祭託鋪驕
廢繁肥腹陣
丘唱寵悲愚毀爛衡
旁炎誠
厚寢想腰蠻
特衰
斂漫
存
則園壯左戎
征載鬧
冒劫州徵滯狼獻辨雀
剌
亮仁審巾緣
升去娘把晚賦輿鄙銜
團奴搭稅突證豔馳
介凡吟屯救裁詳費
儒宇快撲敬橋洗祿箭隆齋
削向寡甘迎頑
員彩焦籠雙
卒吉婆置響
忽慢掌淺舟賜
樣瑤總諸
李釋
凌式怒旋曠片牽
乳探答
庸被
屏忠拘玩珍膏驅
剛廉津禪縱繩配
啟專旅槍激爵獄階霧魄
價宴寸陶
依固寬往整杯桂
吐查潤琴矜穀
停縣針
借初契川弟紀統翁脩贊
觸詐邑陸
姑燭票衝
峻殊肩讓速
災申穴
弊架邦
共剝吳困孔廟曹陋雁
寫汗聯
京僧巖芳額麥
弦撫朗獸瓊秦第篤
勁尚染柱泰涼潔牆默
凝寧崇惠敦昭爾矢
函扶毫窩
尋派版狐番網蜂趣那
巡攻爽祝纖
今匠奔幕托穢蟻街辱郊阻鞭
俊勇勤恨源
乖慘慶滑燒脈軌震
區幸掩許鋒鐘飄駭
耕蠶貢遮
渾璧畏終譽
仗侍加占撥旨莊蓮貼
徑昌洪缺超鍾
戾杜遇
壓憲摩研編裂
充厭授曆沖穿
展忌暮枉遁
倚冤及攝榜牢由誅趨
搖未零魁
供嬌惑憤損昧曉禽糧酸醜
旦欲淡混祥逃鎮
到宅犀繫肅訪賈
免境壤導己忘棘楊淹
低媚縮途
割建挂撒男碎薦詔輔輸
兼抵掃棲給諫辰
久換據牧籌膠衍貌
側兔堅完庶謬隔
仰巨帽座擾旌淨莫鵲
奧臥茂蘇襲
僻弔拳灶爐翰返鎖隊
侵像冬演瑞遲
右寺抗斥暢栗羞蒲遣閉
例夕態拙構汙盈蹇
偽勾卑套攢於漁纏與限鵝
冊助夾孝尸耗
慎戈戴洽犬碑綿緒胎藝豫障
宰效焚疊癡益眷祠訊遙驗魯
卻因壇徹暖朽維羈蔽闇
卜按樸歎殷篇育荊賴釣願麤
伐侈叢壺晦植泛湖溪硬祕須
兆抑敘瑣肝諧隙驛
健姿患慕札盟究繡罷誣
乞倉悍祀蓬蠹覽述駁
勒庫慧截沮澄薪辦鄰
判勸吞始幣早畜窗署訟鑽頹
倫崩忍核溢繼豁麟
奮妖孽憑振捕敏盧秩蹈遞
圍基稽誘陷
竊粟紛罰腐蠟
丸佩偃捷析梨模淚
層挑攘淪竄蒼襟
促悟抹押攀森潑炮矯稟茅豎迹
于匡妻峰抽椒示竿級臂藻蹙
偶創慈猛獲耀蟬誦餐
丈填悶拂敝斜柴鑿鵠
僕擁擔準現綺裘隸麵
儲冗括朋漿潮罵荷藉評豬躁遂錫
匿唐徽悅範邁閃
儉坊宏巷循採瞻謙郵闊鴉
協濫瘦羹認醫黎
住卿呵宵屠恤拍擺斑朴滴融贈跌銳霄魔
冶宜寇必怯絃苗躍軸逞
乎午叫婚季岳悔減簿袍讒鈔鞋
岸廬斧梵棋誤謗賀跑鑑餅
偷援梯樞渠續袖踐遼
墮壘尖峭捐欽藍貳赫踵透逢
傲允嗣墜壞巢帷康忿擬斬柏粧緩芒鈍
妄妝敷歇濁猜球篆褒覺諭謁贍蹤迫郭閑飽黜
再姓撓播煞獵睡窺筋訛貝際駢
佐垢扎批梗梢永爪綱翦脂艾藩虐虞誓閱
匹敕泣翔詰霸鷹
享刷台囂忙摧斯椎沉潰熊筵縷賭赴鴨
仇佳個傍副夭戚技撞穩耍胸觴詠讀趙髻鬢
凍幾欺涉溝瑕盆租芝趁蹄較輝逾
唇寓挺槐沸牒窟譯轡
咎喬恭戀扣替梟棗漆狡肚膚蜜鈴
券劣崖彫掠擇映督簪緊蕃製豹預
伊偉傅兄刮塔戟洛爺糾訴趕轍頌鶯
卓即墓悠惜扯暑滾狎疆筒組纓翳聳苑螺遭雉鴛
並刃嗟坑域帥憐棒紗郡鍋閭韜駿鳩
圈楞淑淳畢競簾胥裙譜貶跨躬釁鬚
串刊愧曜測灼筍箱諱酬釐鑒駐驢
倡呆妍嶺彌拿搜漂績罔蒸蛋鈞
兜剪叉店愆脅舒蜀裹譏迂醇餉
宦暈皂盲禾粗綴蝶讎酌隅雋飢
似啞拾泄紋逋閨韶項馭馮
伍剋喝墳帛并廝廷溺滋灑碌秉織蝦裳賽輩駝騷
乏僭召惶捉晨榆砂稚竭絡膳鏤飆
且佚叔徼液炭瘡稀系緝蟠訾
傑后均媒希幫慰此沐澀疲純蔭諷貸輦辣遵鄭酷
凄勳哲囚垣妃弛懼攬晝氛猥硯臘艷莽蘆虧誇販釘
伴債堆幻敲槃浩浸渴股腿衷逝邀鬻
呈婉怠我抄拒掉沾牲眩竅羸腔艱葬袋詆贅酣鞠頤飭
柄澆穆鉛饑饒
卵哥埋寂屑拖揭沓洲煎狹綵翹膝蕭蹶邃
伎倍哄壑娥廩戍戮握旱晶柯桐檀濕灌眇箕縫般輯
佞侶倦哭嚼圭奸已恆濡眠箋築絮繆蛾衙該賬銘鍊陌
亢姻廚摘普曳檐燎甚稻穎衫複迭鋼闌
丟互僚咽嫌弩彝徙慚插揮擢斤湊熙牋矩膺虹蟹衢誨遏陀饗駒
孟尉帆拱摸澹焰皋虜蠅訂謫距阜鳧黍
兇剖宸曼榻炙瓶葛躡邏鬆
劈叟吾坎幡暉杏棍穹竦耆褐褲貂迸韓
侮催呂弘擲曾桀泊瑟痕稿糖綸虯謾鯨麼
亞剔匪哨喇嘯姬悖挽朔棚畔皓糊膩誕軫釵騁
他付仲劑娛彊概欣漸猴貲隘
值剽劉厄嘆奠尤尼撮欄湛甕確磕禿籬蟾誼讌鹵
兀几卹吸增慌歪污瘠聘訶諂諾謠跋邈黠
咨喻嘲嚮夙宋巫恣措棹牘犁疵碩脊豕遜饌
什係否喧廳惟懦涵漠瀆瑰盼脯蠲裔謨譎銓閎靖
塊墊奢幼恐晴氈淋淘渡爨甸笛綜蠱軼轟
刁哈宛屍恬悽晏樵檻盪睿粥絳繭脣芽苟蓄贓跟轅鉅饋
凋嘗塌悴慝懶棧瀝窠綏聰覈轂邸醋鑄闈靠魏
件伸俯俸控搆搶棉榷殼添烹甜瞎窘粹緯縛繞羨翫航蠢軋迅閫靴黏
冕准各寮徐恥拏昆橈涌溷漕煤猾甄砲籤蚤辛陂隕雍髓黛
企勘匱妾宕幅懇拐樽渚煉狠琅疇祈祗稍纂芻苛誥軀韋
俏勃叱坡塘墟嫁孩幃悚擦欠毬浦縈蛟訐訕譴貓貽醒驥髯鱉
僮勵卦夸嬉岑怕拓楮橐段湘潭熏禱稜簇蕪隴鷙
啼噴妓宥悉捨捲撰攤械梳棟浴渥磬簫糟翅菊衿踢雌馴麾黷
傭奶悼懿拆揣攪暇汲沃泡涕猿礙糜絜缽耐衾釜陛顫騙
倖扃搏犢猶臭蔥賄
估叛唾恢惹慄掇擅攜旆杳槁汰況溶炊瓢祚簽絹綽耽肺胄蔚薰醬驟鵬鶻齡
乙俠壹屨徇戢敢槽橘沿涎淒溟滌灘燥苞萌詬誑賁贏趾鐫餌鬟黯
俎匣只嬰岐弁抓拋捏昵株櫛殖烘煥瑩畿盘篋蔓螭輅迥逮遒邱郢酥釀駑
也伶冢圃壅妆庇廊扭拊拗挨晷棠槎猷綬蜚袂裕譁逕這銖阮頃鯁
些咬喉婿帚揆斲澗濃炳煖諛諠讙賑錐頸
丕億吻妒幄廓怡挫撇撐昇梓梭棺盞窯笙紆臆董藤誚醴鉗駟騶鴟麋
刪剎咸奚婢惕惰扁掖殃沫淩濯瘁脆臧茫茵蛙袞褻訣謔谿逗霽驪骸
云仕喘噬尹峙廂扈扳桶棱渺牖珮癖砥簷醮鑠髦齧
乃仄勉叨幢庚憚抖摹歐汩瞞聒腴茸萍褊詢諦譬讞赦跂踞郁閤鞍驩鴦
予嘔奈寥惱挾揖撩晃朵毳濤烝砌穨穰笠肌舄薀贖遽鄧頰
伙伽儔叩吝咒央寖島嶽懲懽攔敖旄榛濛炫熬窳翕蒿衲豚鈿陟隳餓驂麴
僵噎噪圜崑廠慣旬昔晉殄浹潦瀉熾稔竇篷緘茹轎鋤鎗闢闥靄
历唯喚嗔堤嶮廁弭恕掣摶煦燄爆牓璫畝磚聾腥萊蝕詘跼隻雛騃
募妥弧愉憎或撤撻构桌殫燿珪症簸繪罄荡萃蕊蚊衒諮邇
么亨僑劃吒吠坦奄妹寅愴掙敞氓涯潘璽癢祇秘稷稼站紹繇繹舅藪袒購輟阪驁
卡卯叹忤憨懋杵洒涸琢碼秤竟笏糞綃舛蘿蝸貺錮鑼闡騖
伺兌匯岡巍庾怖惋抉抬捻擠既樊毅毋汁涂湍滄瀾烽燔爍牡狄瞽祉箸籙紳緇芥葵蚩詣詮讚蹴鑾閔陞頒頗鷺齎
丐喙夥孰庖廕恚擿楫櫃毗沽洩焉獅療瞪礦窄笞絨翮耦診謳貿蹊蹲輓轄迦醪鑪閻闔霍鞫驍
丞俚厥嗇嫚孱屐彎悵悸搗桓檄浣璇瘴矛箴籥粒縟耿舂芬謊賂鄂闲餞饥
傻咕啜型塹摯摺斃棕歧渙湮禦筭箇絆繒繳胤腕蛤蜃蠡賠鐸鬯鼇
卉吁呀售坤媽嫉嬖寨弋憫扉挈捶旃昂梧楹槌漲燋犧甫疫瘋盃繃脾腮艳菌蟄襯辜鑣顓鬣龕
倩傘兢勿匝吼嘿堵娃婁孜岫强径悄揉攏攙椅殞瀛炬畦睛硃礪簧籃腫茗葦蒜蔬蚌覷蹕隧饞馱
凜厝哺啦嘶垛堪壟姨嫩孚彰很恪懾扒扞拽掛曙最欢燧爬獷瓠眸睨磔筠糕紐缸荼虔蝨蟆覓諄赭騫鯉龐
佯俱凱嚇帑幌彥惻戇拈旛栽浚淤漬瞑碗祐籟肘肯膜蕉裾觥賚週阨颺鴈鶉黼
丫劾囉埃奩嫡弗彤愿憊憶摽杆杠柘樁汾淮湫漚煮牟珥疚瘞瞀矚禹笄繕翎肴胃衽讖蹬鐙霓頻颯鹹麝
份儆償儷凰吊哩囿帙幔弼悒抃撈攫枷柵狙睦磊窅罕羲耄聊萎萼葩詈譚躅遑鄣鈐餒駮
併佻倨偵嘈夔寤峨崗怛愨懈挹杓枚沛泯洶溲潢炸稠窈簟粱綢膊臼芸苔藹蛩蛻訥跪遍鉏陬隄霑餼驄鵷鸚黔
伉俞冀刳剿勻唧嗚噓埽墩嶠幟彪戛掘搔搬擋攣楷榴沴涓港漱灣燃璞甿盒盾笨筐縑罩肇舫蔑虺誰贄踴髡鮑
仆俘偪嗜嚷堡屁屎彭愍愕慾擯斫洄滂滓癩穗窒笺絞纍翟菲菽螢裒裸襦觜諒譟豈貍踰蹻躐鉞錚鵰
亙仔佇僉剩卸吭呱咄嗤巒徂忮忻憾捧掾描晤楓楯汪漾澈瀨燠狷畸眄眺睇礱窶笥粲絀縞罐耶肖莖蒐襪觚譖踊躋躓錘鏘鑰閟需霏靨頷鬨鷗黝
仿僇僦嘻姊姝寐峽嵐忒恃扼擘旒椽淅淥渝湧漉漭炒痾眊矇碁碓碰篡翥胞膾芋葆藜虀襄覃註貯踣鍛霆鬍魅
侑冽噤圮堯姜嶂悃愎揀擒斛杪棼煌煽熒燦牝盂眥砧秧稗緡罽脖臚舶葫蕙蜩賃賒赞跛遘鏗鐺阡顙鬲
乍佑僂吵咀咳哉唆喳圉坼堙复嫂嫗孕孳孺恍拷掀晌曝檔櫝殲泠渟澡炕皆盥睽祅箔紈肢臠艇薩誡諍諜豺蹺躲迤遶酪閏霖靚飧飫餳鶚
仍劄勺匏圻墻媮寰尿嵩彼恰愜慨扮斡杭歆歉殯汛炼燼琱癘眚祲筩筮筴箠綾縕脛艦褥諳譙邛鍼閥鞅
俟俳們剡啖坯垠塋塚墾姐嬴嵬廛廡彙惺慵揜攛暝杞柝桿椿榦榭毆泓洿淖濬玷珂瑜疋瘢睫瞬磴礫禳窪笳緗緬縠縹耘蓉誹讋賸跱鋸鎔閘閽闖隋雇靶駔
佃佗咂哇啄喑嗓嘰堠姆姣孑徭惛愈慟攄旭昊橛歹汽泝涅猩琳疼皺竺翩苴茲荫蕤藕蛆裱褫諢赬蹀蹌闐霾风餽馨鮓鮫鰥鷁
倅偈凹刈噫墀奕尪岔崎彘慴斟曦朦杼殆殉沼泮渭滔滲炉狩狸獠獰璣甌疹礬糠繚纚翊胖臻舖覲訖謎貉趺踔迍醢閡駛駱騾髭
傖刓劬卮发另呴咯哆唬啾嘎嚕嚙媼嬪幘庠愣憩憸懊懣懵懺戳扢捍捱攷旺椰櫓每漣澇瓷痿禊篾紊緻縵纈纛羔羡臍芙芹蒂覘豸賻蹦軿逵郤醅閹閼阱靳鞮髫魘
丰儇儕凳咋囑姪媵它屣嵌帕恫悛捫捽擣曬桴欹歿殽漓犒琛瓮睜瞿矮禺篁紱綦緹縻纊罍羌胙腊臊菱螫詒謂賺跣躄遯酋醞鎧鏃闚霤顆馥鳶麒
偎僊叭吱址坌塾墉怵愬擎旂昨柑柿梆楸汝炤爻璃疽皎瞋磧禋秣穠箏簌糴耨菑菩蔡蚓蛛蝎褭襖謇賾踩銃闉隤餔騂黥
俛倪匾厖呢喫嘩垓埒培堰塢娉媟巉忝扬拯挖撅撚撾斐晞晻暄暫杉栖淬渤湔澌灸猗獺甍疙痞瘧盎瞥碣祓祟窖絺締繢腎舵茬菹藿詹趫蹋轢逍霉韞頁髀鱠鶩黻鼉
僨儻勦噥娟媛媳嶄嶔幰怙扆拭拼搨擂斝槧橡櫂櫱欒沁溥犖璜瓏甑瘟睹砰磐穡絢罟羶脹臬舸范莎葺薇薑藐裨訇詛謚蹂蹐蹠躔轆遴隈雰頡顰驤鯤
丙佈侃倔冉凈凸匕卞卬吮呶咿喊嗥噩噱囷圪壩姚姱娑娶娼媿嬾崛巘巽帔廄廈怔怳憒枳柰樗溉漪濆玳珊瞳砭窆筏箝篠簞罅膀苫茨蜺蠆裊詖詼謄豢賕跗踦迓迪鄒酉酲醵錠鍵鏟鐐閩闃鱸
丑个亦余你侄俄傀剸咧哽嚎嚚嚶塑嫠崒崿嶷忱恁愷慳慼摭擷攸欻歊汀濱瀁炯焱煇甥痊痼瘖瘵祁祧秕窕窾粵糲紕紡絛緞纘肱腋葭葷蓐蓼薙蜒蜡蠖謐貊踅迕迢酎酤闓雩饕驳髹鷲鹺麈
佬倣偕僥儂儈兕咭嗒埶堊堞壙岩崔弈怎悰憯懌扛抒拶捺掎摟撿擄擗擱擴敺旰昃暍暱曩楂槊櫻毓泐泗渣澒猋猱獃甃癰瞢磁礎祔篦篩紇綻罌肄肋腑舋苓苕荔菁蒞虱蝗褶襜觕詫詶諺踧軺軾輒逶鉴鍔閬霹韁韭顱駘驀鰍鴆龢
佹儘劌叡吧咍喏嗽噦埴塍墅墙嬗拄挪搉撝撟曇杌枸柬櫟殂氐气汞泱渦瀟燙獐痹癆皴瞭碾磯祛秫箍籜粘紵綰縐腆莢菀菅蓊蓍虓蜮蝟螟螳褂觔詗誆諏贐蹉蹝輜逴遨邵鏈鑊门陡霣顒饔鴿黮
亟亥佼冲劘唄啷嚬圩夯姥婪屹崙嶢异彀恧悌懃戕找捩揄揪摳旻暌曛枋柞柩桷楔楛橙檠櫜櫬歛毖涔淆濩瀦琶畎疥痰瘤癃癱皦盭睢瞠瞰磣穫窣笮筌篙篝繖纜翣耋聵膈茄萱蓑蜿螞螻衄襠覬詡誌譾贗跖邅邯醑醲鋩针闍雒雹霈鞘鞞飣騏鵡鷂鸛黽黿鼙
丱乂亶俵刨剉吶咻哪哼唳嘍坻埏壼奎岱幬庳庵徠恙愾慊慑憋拌捎掐斁晰曖杷枵槿檣殤沱洊煒煜煢熛熨玲玻瓣甓甯畋疣痘眈眙砑磷礧窥簋絰綆縶耑聱舜芊芟茀菴蔕螽蠕褚覿觝諉豗貙貰赧趲踠輻逛酢隍隗顥颓鼾齏
但侔俐俶倭傴儗儡儺儼划又叮呻咈哮啣嘟嘵噶坳媢孀孃宙屢峒巇庥徊忖恇慍懍懒拇挐搊搐搓摔暘杈桁椓榔欖氅氳沆淙渫滃潁潯瀧畬痒癲砦确笆籀籮綁缶缾膘膿茭菟菰萄蘋螘蟒褡襴觳訝賙賡跧輈輳鄲銛鎬鐶閶闒阬雝韉颼馘鴞鷰麓
伕佔倏剃匙匭呷咫咶唼喣嗛嗷噭囀坰埠壚壬夠娜孛崟嵎廨忡惸愒懟扑掂搦撙撼旐枲榼槨歙泳湃湎滷潏澍瀑瀰炰燮爇琪瑋畤瘕癭皛砍礡禎窨笈篽紺絓縢纇罣聆胔胚胝臟萋薨蘄蜑蜻蝴誖諤貤踹轔辮釅鑱隩霰靂颸飼饘馈騮驱鴇鶬齕齪
仞僝儳厎咚啁喋嗑嘮噉嚅嚥塼头嬭屆嶼巔幙忭怍惘揩搒搥搪摻撏旟晬曀曶朧柁某栲棣楗榱橦櫳毯沍涇渰溼溽澎瀠灝焊焙焜煨煬熠犴猖甩畚瘩癟癥眯眴矗磽筦簍糗紘紬綈緋緦縗罡罹羯翬脰茁萁葡蓽蔗蕈蚑蜉蜋蜎蜓袁袷讜豨豳趄踡軛軨軻輾轝鄴酹銑鐮陪頎须颿马鬐鬒鬩鮒鮭鰲黧
佷剟匆唶喃嚲堿塉妨姍嫮宁寞屧屩岷崤嶒帨恓悁懂懞捋掊搢摛攖机柙棰楣榨橑檯欷殢氂澣濊瀏猒獘琵瑁痍痔癸皁盱眨砸磋秸签篳糅紮紼繻耎胯腺膛臞荐蒨蔞薈薛蚁衎袪訃詁詵誾賅赩跕跚蹩轓轘逖逡遄酆鈇鋌鏢鑷铺閾陔雖靦鞚韝颭飴餧饟駃鬃鶱麇黌鼯龔
傚儋儐儵冪剜努匽哂嗢噠嚨囁囈囤圄埳堇婬嫋嫣嫺尨尻屼岌崽嶙幛怫恒悱慓懨戧搠撕旍晡曄朘朮枘柢栝桄樛欬殮沌泆滉澱濞濮炷燁爚爹猝獪畯疢皤盍盹瞧碴磅磈祼禘竽箬籲糝紉紓絫纁罝罾羝翾聿肫胾膂艙蓁蓺蔫藂蘧虻蛀蟊蠔蠣衔袤袱裀襞覯誶諼踽躑躒輶辉郛酡醨醯醺釭鈕鉦銚鎛鏝鏹鐃闞隼霎頦饜驃魆鴳鶡鷸鸕齠
乜侏倆倌刖勛匈呿咱咷喁喟嗆嘁嘬噗奐奼妣媧孥嶪帟弇彆慷憀掬攒无昕昴暾曚柈棨楨歠沂沚洑浼淄漩漳澳濾灩烜猻獧獮琯瑚璘疤瘍癉癬盔瞅矻硎碟祫穟窊笻筑筲糶紲纔羆羼耇膴膻舡芘芷苧荑莠萸蓴蔔虢蚍袟褌褓襁襚誄諡謅讕赳趷趼跎踖踳躉迮遗酗鉉鉸錙錶陲靸鞬鞶鞿颩饁饉馹騑骰鱣鵜鵩鷓鷦齁
佉侗侻傒僱儹勋厘哏唏啪啮喈嘏噹嚓坏垤壕娣婷媲嬈嬛嬸尽岨崢嵇庋廋弢彴徉徨忪怏恉惝憍憧懆拚掄揎搴撢撦攮斿暵朕枌框梃梏楠樾檜櫥櫨櫪櫺毿泌泚泫洌浡浥溘溯滕漰潼濘濠瀹熇爰牂猊玃玦玫琝瑛瑱甖畀疐痢痺瘼癇矞砢硝碕秏箐箑簏粽糈綣縲罏耒腯臝舁艮芭莧葅蔀蔌薆薉薤蘚虫蚖蛺蝤蝮螂裼褰觿訌詎謷譔豭賧賵贔趟跽踆踶蹡躂躇连遝邕酖酺醁釧鉥鋏鎩鏑閈闤陝隰靛鞦韡餚餡驎骼髽鯢鴣黲黴鼕齔
亳价伞倜僄儜叵吆唁唔啗喀嗄嗡嗶嘖嘹嚌埆埤壖奓姒娩婭媾孅宓寘巀帘彔徯怗恂惙愊憬戊戡抨抶掏斌斸暨杅杙柅栱桉楦槮樟沕洳淼渲湩濺瀋灕熯燾猢珧琤琦琮琰瑑璋畛畹瘳睞睬瞵矍矰磑祆祜稈篚籩緌縴繙耙肐肪腌膨臛臾艘苒苾茱荅荏荻葸蒻蓂蕞蕨薊薌薜藎虣蛭蜍蜣蜷蝝螾蟣蠃裯謏讟踝踱蹓蹭輀转遛酵醆醳鈸鍬鎚鏜鑲钥雺鞏飂餑馗鬮鮐鰓鱟鱷鴃鶿鷇齦
乐书乩亹仡俑偟僅冏劖劭勗呦咆咢哗哧啃啐噀噲囓坪埭堀嫷寀寠屜峴巳帢幨廥廱弒弥彯憺抿挼捃掯搘搧摐摑敧昱枰枹枻栓桎棐棵楬槓橄歔殍殛殳汶沄洹洼湓滸漻澥灵烙焯熔熸燀爓犍狃狖狴狶玎珀瑯璀甦町疸痴瘃瘥皞睒瞶矣硌碇禰稊篲簣粢絁綍繈罘羿脡舐苏苡荃蒯蓆蔟蔣蕖薅薯蚪蚰蟫蟺蠐衊褙訿貣趯趴輞輥车遫錨鍥鎪鏖鐍闋霅韃頞頫飞餗騄骫鬈鬋鬘魃鯰鯽鵑麑黕
体佪倘勩哦啅喔嗌嗦嚏嚘圯坵堝塏声妮嬋嬤实崆巋当彗彷悢悻惓惚惷愀愫慆憃挲捆捣掞揲搤撂撣擫旮旯昒朏杻枇枒栩桔棓椑榖檟檮櫑歈毦泔洸淌淜湿滫漶潸潺澮濇瀅烟焮熅熹燐燬牸牾狉珓琉琖琨瑪璺瓤甬疝疳痂痤痧癮皈盻眵睚睠瞌砉砖硠碭禬穾窬笱篛篸簑簦籽粳糒糯紞緱繐结罨耜肸胛脞舲艫芍芰苶茆荀荄莓莘莞菇菖葑蒱薺薾藷虖虚虡蚨蚶蛉蜨蝌蝠蝥螯裛褕褪襆觖觱訏訑訞諕謼证谹豉貔趔趿跐跬蹜躞躥躪軷輮輴轤进迻逭醟醼釂銹鍠鍤闟阤阼陴隃飪餕餫騅骾鬄鯗鯫鰭鳌鴝鵒鶼鹼麛黭鼷龙
仃优佾倀偢傔僿刲剴剷勖匜卤呃嗉嘛嘽噂囔坍坱坷墯壒壝奰姁娓娭娵婞嫖嫵嫻嵂廿忉愯憖戔扦拴挏搽擭敛斠斮曨曷朒柂柸栘梱棖棬椏椷椹槥槳橇欑欸歃殣殭毁氤汊汜洫浙涴淇淟溏滬滮漵漼潝澨瀕瀣灺牯狽獼獾环珞瑳瑾璨痌痗痟痡痱睟睪矬碨磳磻礁礨禜禡禧禫积稂窿笤筊箾篪簉糰紒紜紿絇絣絪綹縝繅纆红罋罛翌翱耬耰聃肓胊胰胳脬膋臀臑艸苹茇茈莩蔻蕘蚋蚱蛐蝣蠋蠓衖袢褎褵襤襻証詀諶譫词賨賮跏跺踒蹅蹍蹼軹輤輵轀邐邴酇酴醃釃銼鋟鍧鎊鎌鏊鏽鐲鑕鑞长阽陘隮雚霙霿韍頊飩餈餛饅馺魴鴒鷃鸿麂鼪鼬鼽齾
传佽侉侖俾倕傜傢僈儤刎劓勍勷匐吽呫咐咮哢唅唉唰唵啻喤嗝嗾噆噷嚦囡圊坨埜堨墆奡妳娖嬲岏崚崧嶇幪廖开彬忔忳忸怀惆惎惏惵憔憝戌戏战戺戽扠拑捂据掗掰揃揫擰敻斕晢曈柎柚桅桮梔楙樑樺檳欿歍残殪毼氄汋泬洏洮涘湄溔潞澂濼瀚瀲瀸灞点熀熄熚燖牴牷狨猳獦珩琬璅璠瓔瓚瓴痏痙瘙瘝皖皸皿盯眢睆睖睩瞚碪碻祏禖秒穌穸窌竁竣笔箄簠簳籯紂綷縋繽罂翛胼膰臕臿舠舷芮苻茜菠蒔蒺蓀蕾薏薔藟藺蘑蘢蛑蜘蝘蝙蟉蟟蟧蟯裌覦觫諝譊譸谾貜贛赏趍趑跤跫踟躊軏輷轑轻远迺迾逅逑邗邢郇鄶醄醍鈹鏇鏞鏦鏵钁铁闠阯隐雊靺韌韙餱饎駏騞騧騭髼鬅魋魍魑鯊鯷鰻鱼鶂鶖鷩鷯鷿鸂鸝黤齗齬齰
万仵佣佶倬偲僰僽僾儃儌党凊击剮听吷呾哎啍啑啕喭嗅嘓嘸嚄囮圇圞垸埵堁墁墝夤奫妊妲媺嬙嬿宄屙屮岠岧岬崦崱嵯嶝嶧嶭嶰庀廒廞彖徘忐忑恟恶惨惴扔抎抏抔捄揵搞搯摒撬擻攉攩敉旎旝昈暐曏曒曰朓朣杇极枑棽榾槭樝樴檗欐毚氾汍汭沅沔泙洟洧涆涫淈渀湑湟湲滎澠澧澶瀯瀵灂烤熲牣犄狺猓猘猲獝獯玀玅玼琚琥琫琭琲瑽璁璆瓿甔痝痲瘌瘏瘐皚皰盩瞟瞷硉硪硼碉磝礿祺秬穵窞筇筳筷箘箙篔篰簀簰粼糙紝絻綀綖緄縉縰纕绝罗翐聶胏胜胠胭艓莒菶菸萑营蕎薶蘤虼蚳蛹蜆蜇蜴蝚蝡蝯螗蟈蟶蠪衕袀裴褸襂襹訹詅詿諟諵謖謻说谥豤赸趠趹跰踉踘蹣蹧蹯躕躺輇轇轖迵遹邂邋邙邠酊酏酩醊醰醽鉚鉻鋅錁鎢靮鞁韔顶餬餾饈饐駙駴駻駼騣髒鬙鮆鯖鰈鰾鱔鲠鴰鵓鷖鸇麩麰黦黶齍齶齷
为丽乒乱亲仟伢伾侜俜俴俺倥傎傯傱僬儥兮凤剁劻匍华卲呰呲呸咥咪唈唲唷啊啵喂喒嗃嗎嗐嗖嗹嘀嘂嘄嘐嘒噢噣噯噸嚾囫囹圬坫垃垮堮墐备妗姘娠婘媕媻嫕嫪嬥孌孖学寱层屭岁岪嵲嶚巑幗庬廑廧张彄徜忧恌惊惦愔慇懅戤扺抆拮挍揶搕搰摋摎摴擩攲旖时昶晜晾朅杂杝栭梲椗楝楩楶榕榪榫榰槱橚檛檥歕歜汇汔汧沬泅洱洴浓浞涪涷涿淀淰湣溈滀滇滈滭漦潗潟潬澔瀍炱烋烯烺焌焞煟熳燉燴爌爝爿牿犵獗玕璈璐疔疻瘀瘛瘺皙盬睎矱矹砆砟砮硗硩磞离秪稞穷窀窐窱窴笪笭笴筤筥筰箜篴簭簹粑粻絏絿綌綮緲縊縚繰纸罥罦罫罳罻罼羃羇耷耾肭胲脽腓腠腷腾臏臡臲艿芾荈莛莨获萐葳蒟蒹蓱蕆蕕蕝薹蘅蘗蘺虒蚜蛣蛬蛸蜊蜞蜥蜼蝀蝍螓螿蟀蟜蟥蠁蠯衩裡襮覂覡见觭觶訬詄謣謦讔谼豌豻賝赮跇跙踼蹎躚躩輠輣輬轠辞迒遰邳郅郝鄱酃酈釦釽鈆鈚鉶銕銬錡鍪鎦鎰鏐鏨鐏鐻销锤閜陊隒雎霪靃靷鞈鞨韺颶飀飥餖餺餿饰馞駸騍驊驒驫骭髇髏鬌魈鱍鱘鱧鴠鵔鵽鶹鷟鸐鸡鸾麃黄黐黟黳鼲鼴齲齿
举乓从仳伋伭伻佌佝侁俉倛偫偭傺傽僛僩僪儅儓儽关别剄剚剞剺勣匼启吰咇哫哳唃唌唪唸啎啥喌喲噁噞嚜嚵团囪圣坩埸埻堲塈塕塙墬夬妞娙婀婺媌媯嫫嫽孋孬孵宬尬屝屺岕峋峗崍崴嵁嵺嶁嶸帡庉庨廌弸彉归彧忷怊怩恝恲悆悷惔惼愓愶慁慅慫慺憛憭憮懘懩懮懹戥扫扱拫捔捭掤掫揅搡搿摵撋擽攆攓攦斒昫昳晼杰杲柷柺栳桹椌榑樅樏樿橢橿檉櫚欃欘欨殀氧氯汃汐汕汨沺泃泧浯涒涬淢渹湜湢湱溓漎漘潒潚潠澉澓澴濈濔瀇瀎瀜瀼灊灟灤灭灯烔烞烰焄焠煔爟爣牏牵犗犛犨狋狌猺獉獍獒獫獬玖玢玭珌琇瑀瑙瑶璉甒甗画畽痎痠瘈瘣癌皪皭盝盦眑眒眕眶眹睍睥矉矓砯硐硜硱硿碔磉磎礓礜祊禔禠禨秈稌穇穭窵笓笵筅筧箛箯篌篣篹簜簬籔籛籸粞糨紃紩紾絖綑綪緆緪緺縭繂繾纑纤纵绁绦缿罈羖翡翿耏肛肜肠胗脤腧膃臢艄艎艣艨节芔芡芨芯芴苨茯茴荂荇荳荽莪菔菘菫萆萹蒍蓯蓰蓲蔘蔦蕣藭蘙蘠蘸虙虴蚴蚺蚼蛅蛔蛨蜢蜪蜱蝭蝹螄螈螣螬蟋蠉蠛蠵衚补衵袨裎褧褳襏襘襢襼观规觟誂誻諑諞諴謞譆譣议记诗语诵貆贉负贪趵跦跲踪蹔蹚蹸躟軔軥軬輊輘辙迄迆迨逜遢邰郗酳釉釤釱鈀鈒鈷鉈鋃鋈鋋錕錣鍍鍘鎳鏌鑌钓钻铜铲閌闑闛陆靉鞔鞙韅韸頀頏顣顴顾颮颻颾飉飘餃餟餤餪餮馽駉駓騸骋骴骹髧髲髾鬖鬷魎鮀鮪鯈鲜鵁鵂鵪鵯鶌鶺鷕鸑黂鼐鼖鼛鼩齇齘齟齮齴齵龠
丝习争仂伤佁佺侲俅俇俍俔俭倓倳偊傛傞傮僔僶儠儴儸儿兹养内凘刌则剕劊劗劙匟卍卖厤厹参号吩呥咡咺咼哃哅哱唚啀喓嗈嗊嗙嗯嘌噌噰嚀嚫嚭囅囌囝囟图圌圾坚垆垝堋堶塺墦墼壎奊妁姌姏姤娀娌婑婓婕婥嫢嫦嫿嬝孿宠宾寋寔尘尷屌属屴岈岊岝岣岵峉峿崝崥嵒嵫嵽嵾嶊嶓嶕嶞嶟嶬嶱嶲巹帊幦庌廙徦忞忺怓怜怦怮恛悐悗悾惄愻慉慥慱懫懻戃戩扜抪抰拟拲挻捅捘捥捵掍揠揥搣搵摁摓摜摝摞撘擐擸敔敪敹斨断旳昝晟晱暀暠暹曭杕杬杴枓枙柜柟柲栟桯桼梂梜梠梪梴棡棫椋椸楄楖楟榠榣榥榧槷樔樨橉橹檎檖檬檽櫞欂欋欱歟殑殕殗毧毨毹毽氍汏汴沇泂泖洵浟浰涀涊涗涮涽淞淴渊渢湉溰溱滞滹滻漈漯潇潎潾澦澼濂濦瀢炅炘熂燹爞爸牚犆犋犓狒狟狪独狻猙猰猵獶珈珣珫珽琁瑒璵甂甪甽畇畈疰痀痑痣瘉瘊瘓瘯瘲癤皜眐睊睕睭瞍矲矸砒硊硤硫硾碘碡碳磍磢磥礉礐礽祴祸禕秭稑窙竫竻笊笘笫筈简篘篥篨簁簨籓籧籪糱紖綟綯繄繯繶经绒绩缩罃羉羚羧羵耡耤肕胴胹脚腒腜腱臌舀舑舔艛艟艴艼芩芼苣茷药荴菆菵菼萇萦葯葶蒢蓇蓓蕁蕢蕷蕺藨蘦蘼虩虭蚘蚡蚣蚯蚵蚹蚿蛄蛚蛞蛦蛮蜰蜾蝒蝓蝻螃螇螉蟛蟞蟨蟷蠙蠦蠩蠮蠰蠽衱袅袭裉褷褾襌襐襫襳覗覜覶视览觡触觺訢詍詨詻諆諈諓謍譐譺计论诚调谨谽豲贞账贼趓趧跅跮踮踸蹛蹢躠躨軠軵輂輗輛轞迁过迋还逄逤逿遳邾郟郿酘醛醥醱釬鈣鉀銡銻鋁鋐鋘錛錞錧錳鍉鍰鎂鎞鎡鎯鏚鏬鐀鐎鐔鑐鑢鑤银闆问隑难雘雯靘靼靽靿鞹鞻韆韱頇頍頖頩顎顩顽餰饙饮駪騕騤驌驏驔骿髁髕髟髺鬁鬺鬿魌魷鮞鰉鰩鰱鱭鳦鳱鳲鳷鳻鴶鴾鵃鵊鵙鵹鶄鶊鶋鶒鶘鶪鶵鷞鸃鸓鸠鸣鹊鹤麀黈黰黵黹鼘鼜齃齆齱
丏业东乇买仑伀伈众会伝伪佖佟佤佰侒侘侹俁俋俙倗倠倾偆偓偞偠偨傂僁僎僓僠僸儚儢儦儱兟兴冓冔冘冱决减凭刚刜剭劀劁劂办勀匊卼叼吇吤吪咖咠咩哞哤啡啶啽啿喥喨嗋嗨嗲嗺嘜嘺噙噳噾嚃嚍嚗嚳囋园国圂圢坲坶垽埂埮埲堄堍堕堛堥堧塒塝塤墈墋墔墫墱墺壏处夹奭妐妤妯妺姞姼姽娴娸婐婗婧媄媞媦媰媱媸嫇嫈嫜嫟嫥嫭嫶嬃嬬孢孲孷宧宫宽导尰岋岟岢岭峞崣崷崹嵑嵞嵥嵼嶈嶜巆帤幀幍幎幓幝幭幮庂庆庛庪庰廇廔廗弚弮弰徬徻徾忕忣怞怢怭怲悇悊您悹惇惉愲慞慪慲憓憢憴憿懁懤懱戁戄户扐扤护报抮抻挃挡捊捖捗捯捼掁掜掝掮掱揘揙搳摇摦撠擖擛攎攕数旓旧旼旽昄昉昡昢昤昺晁晒晛暋暡朹权来枅枍枎枺柊柍柭柮柶标栯栺桋桫桲梐梡梦检棌棷棻椇椐椔椴楅楢楺槔槢槲樀樕樘樠横樲橤橧橪檁檃檡櫌櫐櫧櫫櫯櫹櫼欀欏欓欞欯歁殈殟殠殰毣毰毸氀氁氃氉氋氨氫氮氿汒汤汦汯沋沭泏泞泵洁洎洙洚洬浅济浑浘浤涑淠淲渧温湁湅湝湴溞溹滒滵滽漇漊漍漙潐潜澐澫濎濏濜濧濿瀄瀌瀘瀤炟烧烻烿焕煠煲煻燂爁爊爢爱牄牉犘犦犪犮狁狆狑狫狿猁猇猞猦猧猼獊獌獑獙獟獢玆玈玗玟玠珇珙琄琊琺瑗瑲瑵瑿璚璱璲璸璿瓝瓞瓬瓻甀甏甹畾疕痯痷瘑瘜瘨瘭瘰瘱瘸癈癐癜皒皵皻盉眽睄睏睔睮瞙瞡瞲瞼矊矎矐矘矙矼砎砝硞碄碅碆碏碙碚碞碫磏磡磿礛礝礥礩祡禗种秞秽稃稘稙稛稯穄穊穜穬窔窸竘竷笯笸筱箅箊箵篿簂籉籊籦粅粕粮緙緛緟緶緷縏縒縓縩縺縿繜繠繣繲纳纷线组绳绿缚网罢罭罶罿羁翂翏翞翢翯翴翽耞联聬胶脘脢脱腃腄腇腩腲腶膇膌膍膕膢膬膱膹臃臷舕舢舳艑艒艗艤芃芎芑芚芫芵苙苜茙茳茺荓莆莚莤莮菂菉菎菢菤菨菪萉萓萯萷葖葙葚葠葥葧葰葹蒘蒛蒡蓏蓩蓿蔈蔉蔎蔪蔰蔾蕀蕄蕡蕫蕶薁薎薝薟薠薡薢薧薷薿藋藘藸蘀蘌蘘蘛蘩蘪虆虋虤虬虰蚕蚗蚧蚷蚻蚾蛁蛈蛓蛖蜈蜛蜲蝂蝃蝑蝩螑螖螪螲螵螹螼蟂蟃蟅蟢蟪蟭蟴蠀蠍蠑蠥蠳蠸蠼衃衋衯袈袗袚袹袼袽裟裧裰裲裶裷褘褞褢褦褯襉襋襒襬襶覤覮觠觲觾訒訧訰詷誒誙諗諰諲謈謑謘謜謰譝譨譻讆讨试诡谈豅豇豏豖豜豩豱豵貅貑贙贵赐赠趌趪趭跆跘跜跢践跾踃踑踕踜踤踥踾蹁蹗蹥蹪躗躝躣躦軉軑軯輁輆輖輚輲轒轕轗轣轮辅辑边迣逌逯邆邍郙郜郫鄔鄠鄨鄹酓酨醐醓醝醠醧醭醹醾釕釗釿鈉鈑鈜鈲鉍鉠鉧鉿銊銋銍銗鋀鋄鋇鋗鋙鋞鋦錍錥錪鍖鍚鍭鎝鏙鏧鐩钂锻閂閛闹阢阳阹陜陼陾隉隹雱霂霩霫霮靇靬靰鞀鞡鞣鞳韐韕韗韘韣韥韰韹韽頲题颜颬颱颲颽飋飶餂餩餲餵饃饡饭馝馡駍駖駧駬駰駶駷駹駾騉騊騋騝騠騬驉驐驻骯骳骷髑髖髣髳髶鬎鬑鬾魛魧魱鮥鮯鮹鯞鯪鯬鯸鰷鰼鱐鱖鳿鴕鴘鴯鵀鵌鵖鵫鵳鵻鶆鶗鶝鶠鶤鷅鷈鷘鷚鷥鷫鷮鷽鷾鸁鸅鸆鸟麆麊麌麚麡黓黖鼊鼚鼱齉齙齝齞齣齯
丌丧丳义乔亄亍仚仪伄伅佒佘佢佧侂侅侷俷倇倰倱偁偅偌偩偯偺傋傝傣僆僖僗僤儩儭兗兰册凉凛刉创剑剒剬劋动励劼勰勼匉匎匷卣厉厊厏厔厗厙双变吨呡呤呬呺咏唑唦啈啤喍喎喢喱喿嗍嗏嗕嗩嗼嘕嘧嘳噅噈噘噮嚁嚂嚆嚐嚧囃围圔圚圛圠坋坒坢坭坽垌垞垟埌埔埡埢堈堌堑堣堽塓塥塯塽塿墠墣墽壈壛夗奋奘她妇妘妠妢妦妴姅姈姎姮姷姺娇娗娱婇婊婟婠婩婼媃媐媥媬媶嫄嫘嫛嫳嬡嬽孓宝审宨寍寎寝寪寿尃尒尝尥屖岉岍岒岥岮岯岰峇峈峊峎峓峘峚峛峪峬峮崋崌崨崮崺嵃嵅嵊嵋嵧嵱嵷嶀嶉嶗嶡嶨嶴嶵巂巟巿帄帗帣帩帴幏幧幩幵广庄应废庢庹廎廲弃弝弶弹彋录彳彸彽彿忀忨恋恞恿悈悜惀惈惧惮惾愄愅愖愝愤慏慬慹憪憰憳憵懥懭懰戉戙戠戫戭扂扲抚抭抯抳抾拎择拸挌挎挓挟挴挶捀捇捌捰掑掔揊揍揓揰揱搋搌搎搛摆摙摡摨摫摰摲撜撽擉擨攇攗攡攥攳敁敓敜敶斄斖斪旴昲晅晲曘曣曮朁朄朊朐朢朳朾杍杗杚枃枪枮柀柃柉柣柧栒栜栫栮栴样栻桢桭桵桸桻桾梀梋梖梩梬梮棂棆棎棜棝棦棪棳棴棶椄椊椥椪椳楈楉楎楑楘楜楥楻楼榍榎榐榞榹榽槂槤槶槻槼槾樻樼橀橆橏橭橾檇檑檕檦檨檷檸櫏櫡櫰櫸欙欭歅歋歑歞歭歾殥殦殶毄毇毈毌毐毘毞毢毤毲毷毻氆氌氟汉汸汹沏沰沶泒泪泭泲洀洇洝洰浏浢浧浬浵浶浺浻浽浿涍涳淔淛淦淭渃渜渮渱渼湀湠湨湳湸溛溦溧溳溴滊滍滏滖满漃漷潡潫潲潷澋澖澯濌濭濴瀔瀖瀡瀩瀪瀱瀴瀷灃灄灖灗灡灢灦灨灪炔炖炡炾烊烑烓烛烴烷焍焐焥焺煁煣熁熉熐熝熿燅燤爂爔牁牦牼犅犎犝犞犣犤犩犰犺犿狔狘狚狤狳猎猭獀獛獩獳玁玒玓珖珶珸琀琩琼瑄瑊瑢璗璟璯瓁瓃瓅瓋瓖瓾甐畅畣畷疿痁痄痦痶痻瘚瘽癒癗癙癠癹皕皯皾盅盏盐监盖盷眃眅眝眳睅睋睯睾瞁瞂瞄瞇瞈瞉瞗瞛瞜矂矔矕矧砅砏砐砠砡砣砨砪砫砬砱砵硍硥硨硰碖碢碥碬碱磃磄磛磟磠磩磪磲磾礒礞礣礤礵礼祋祑祩禀禂禓禴秎秝秠称秷稄稕稫稰穈穮窇窋窏窫窲竑笒笢笲笼筀筣筶箎箖篕篱簃簐簙簩籐籗籹籺粔粖粣粪粺糌糔糢紟紧紽絅絎絘絧絭絯綅綎綝綧緁緉緎緧緰縃縎縡縸縼繀繘繨繵繷繸纡细绛续维绵综编缧缹罚罜罬羑羜羠羢羬羭羰羾翀翍翲耔耛耩耴耵耸聐聝聤聹肣肮肵胂胅胆胇胈胉胍胑胕胦胱胵脀脝脟脥腞腤膆膙膟膫膵臄臅臇臒舝舨舴舽艅艋艏艚艞艩艭艽芀芄芅芏芞芠芣芧苤苯苲茉茖茠茢茤茩茪茻茼茿荋荍荎荣荵荸荾莁莃莉莌莏莐莕莗莝莲菄菈菗菙菛菡菣菥菧菾萏萧萭萰萴萵萿葀葄葇葎葐葒葨葽蒝蒠蒩蒬蒴蒶蓎蓒蓖蓝蓪蓫蓶蓹蔂蔍蔏蔙蔝蔠蔤蔧蔯蔱蕍蕑蕓蕗蕠蕧蕬蕮蕵蕹蕻薃薍薐薕薚薣薱薴薵薸藇藈藑藒藙藞藦藯藰藶藾蘞蘟蘡蘬蘮蘵蘹虈虑虥虮虾蚅蚆蚎蚙蚚蚝蚞蚥蚸蛂蛃蛌蛗蛘蛜蛢蛵蛷蜁蜄蜅蜠蜤蜦蜧蜳蜵蜸蝏蝐蝛蝜蝞蝢蝪蝫蝬蝳蝷蝺螐螔螛螝螰螴蟑蟓蟗蟝蟤蟦蟳蟼蟿蠈蠊蠌蠗蠜蠝蠠蠨蠾蠿衁衈衧袃袎袓袘袙袛袡袬袶袺袾裋裮裺裻褉褑褟褣褼襓襗襛襭襺覭觞觤觩觰觼詑詙詺誋誺諀諔諯謋謥謧謯謱謵譂譅譇譑譒譓譕譭讄讅讘订让访识诈译询详诬请课谋谏谗谻豃豍豦豰豶豷豽貁貏貐貒貕貘貚賌賏賗賟賰賱賹贕责贤质贯资赆赈赋赡赶赽趋趎趡趬趮跓跠跩跻踀踄踇踛踿躆躈躘躤躽軓軘軜軝軞軦軩軮軱軶輋輐輑輹轈轙轚轨轩轿输辔辴达迈迉运迖这迟迡迿选遻邥邶郈郖郲鄋鄏鄗鄘鄞鄢鄦鄩鄯鄳酕酚酮醂醏醚醡醷释釪釳鈌鈭鈾鉆鉋鉎鉒鉔鉬銆銔銙銪銮鋂鋊鋕鋧鋺錆錋錏錔錤鍇鍐鍑鍒鍜鍞鍡鍱鎏鎒鎕鏂鏄鏏鏒鏕鐇鐖鐱鐳鑉鑴鑵鑸钟钩钱钵铳锄锅锈锋错锦镂镇镺镼閍閵閷间阁阅队阴陑陓险陫陭隿雓雟雥雿霘霝霟霢霦靆靪靻鞂鞃鞄鞗鞜鞪鞷韄韇韏韟頄頜頠頨頯頵顄顉顊顐顑顜顝顢顳项颁领颖飁飌飒飙饬饷馑馣馧馰馲馵駗駜駣駤駥駽騛騢騩騱騵驆驖驙驞驦驾骇骈验骑骱髂髊髷鬊鬕鬞鬤鬵魖魨魶魻魽鮚鮛鮦鮸鯀鯆鯇鯔鯕鯚鯠鯧鰅鰋鰒鰝鰤鰨鰴鰶鰹鰽鱊鱎鱙鱨鱮鱳鱴鱺鲁鳞鳪鳭鳺鳼鴅鴐鴔鴢鴥鴮鴽鵏鵗鵚鵱鵴鵵鵸鶀鶅鶔鶙鶜鶞鶟鶢鶣鶨鶶鶷鷊鷋鷎鷏鷐鷑鷒鷛鷜鷡鷢鷤鷬鷳鷴鷵鷷鸀鸋鸒鹇麙麮麷黀鼏鼢鼫鼵齂齌齐齖齛齜齤齫齹齻龄龤
与丛两丮临丼乌乿亃亏亓亵亸亿仈仉仜仝仨仩仱仴伂伒伓伔伟伬伳伿佡佫佮佴佸侀侇侐侕侚侞侠侥侬侳侺俀俓俖俬倎倞倢倧倯倵倷偀偋偍偑偗偛偝偡偣偤偮偰偳偻傃傇傌傕傰傶傸傿僋僣僯僳儊儑儮儰兙兛兝兞兡兣兽冇冈冑军冞况冹冻冼冾净凅凎凐凔凗凞凵刍刐刞刡刱刵剆剢剥剫剻剼劝劦劮劲劳勂勓勫勯勱勴匋匑匒匚匢匰匴医卄卅卌协单卧卫厂厅压厒厕厜厞厧厬厴叙叻吋吘吙吜吥吴呁呅呇呎呏呔呗呠呣呧呯咁咑咘咤咦咰咾响哑哖哠哷哸哻哿唊唋唎唒唗唭唴唹唻啋啒啢喕喡喦喵嗀嗂嗧嗿嘝嘪嘱嘾噊噚噿嚝嚪嚽囆囍囗囥囧圁圳圴圹场坁坅坉坛坟坴垀垏垔垕垗垘垙垚垥垦垵垶垹垺垼垿埁埇埐埕埙埣埥埧埩埬埰埱埼堉堎堐堔堜堩堬堭堳堷堸堹堻塎塛塣塨塭塱塴塶塻墂墇墎墏墑墘墡墥墿壂壆壉壔壢壣壧壨壴壾壿夃夆夌夎夒夼奀奁奅奜奱奲奷奻奾奿妀妅妎妏妡妧妱妵妶妼妽姀姃姇姖姛姠姡姩姭姲姳姴姵姶姾娊娏娕娞娮娳娷娹娾婂婃婄婈婌婍婒婖婛婜婝婤婰婸婻婽媊媋媎媏媓媔媗媜媝媩媴媷媹嫀嫆嫊嫍嫙嫝嫞嫨嫬嫴嫸嫹嬁嬂嬅嬇嬏嬐嬓嬔嬚嬞嬠嬣嬦嬧嬨嬮嬯嬼孇孈孍孎孙孮孻宎宒宭寁寊寑寙寣寯寲对寻将尌尐尔尕尟尢尳屄屇屔屘屪屳屻屾岆岓岤岦岶峆峌峏峐峔峖峟峱峷峸峹崀崁崏崞崠崰崲崳崵崶崸崼嵀嵉嵕嵙嵢嵣嵨嵹嵿嶆嶍嶩嶯巃巏巕巠巰币师帎帐帠带帮帾幁幊幋幜幠幯庈庍庐庙庣庤庮庱庲庴廅廆廘廜廦廮廯廾弅弣弤弨弳彃彏彶彾徆徖徛徟徥徫徲徶徿忁忆忏忥忯忴忾态怆怉怋怌怐怑怚怤怬怴怷怹总恀恄恅恔恘恦恮恸恻悀悎悕悝悦悬悺悿惁惃惌惍惢惤惩惲惿愃愋愐愘愩愮慀慒慔慖慛慡慦憉憌憟憡憱憼懔懖懠懧懪戆戣扊扙扚扡扥执扪扰扴扷扻扽抁抇抈抌抩抴抸拥拰拵拹拺拻挀挋挔挕挠挩挬挭挳挸捁捈捑捙捚换捸掅掟掭掽揂揇揈揋揌揕揗揝揟揤揧揨揯揳揹搚搟搫搮搷搹搾摀摃摄摍摠摥摬摮摷摿撉撊撌撖撗撱撳撷擃擏擙擤擳擼攁攃攌攍攐攠攭攽敃敆敊敤敥敨敯敳敼敿斀斋斔斞斢斳斶斻旚旞旡旲旵旷昀昅昋昍昐昑昜昦昮昹昼显晇晊晑晓晙晥晪晸晹暆暊暔暕暙暟暩暪暯暰暲暷暸暺暻暽曊曋曌曞曤曫朠朡朸朻朼朿杀杋条杶杸杹杺杽枆枔枟枣枴柆柋柌柒柛柤柦柪柫柼栈栋栏树栔栚栠栥栦栨栵桍桏桡桥桱桽梇梉梊梌梑梒梛梣梤梫棇棈棑棔棞棤棩棯棸椆椈椕椯椲椵椻椼楀楁楋楌楏楒楪楰楱楴榃榓榗榙榚榡榤榩榬榯榳榵榶榿槄槆槉槏槙槦槫槬槴槸樄樆樇樈樉樍樖樥樦樧樱橁橍橎橔橕橖橝橞橠橨橩橯橶檅檌檍檒檓檚檞檤檭檴檶檹檺櫅櫆櫇櫋櫍櫙櫠櫮欈欉欗欚欥欧欳欴欶欼歂歖歶殌殎殏殔殙殧毃毉毊毕毠毾氕氖氘氙氚氝氠氡氥氦氪氬氰氶氻汆汌汎汥汫汱汳汻沀沊沎沘沜沝没沦沷泀泇泍泑泜泩泹洃洈洉洍洐洖洘洠洢洨洭洯洷洺浀浂浊测浠浨浭浾涃涄涋涐涛涝涤润涧涺涻涾淂淉淊淍淏淐淓淕淗淝淣淯淶淽渐渔渗渨渳渵渶渻渽渿湆湇湋湒湕湚湞湡湤湥湦湷湹溍溎溒溗溙溠溡溣溤溮溾溿滁滆滐滘滚滜滥滩滱滶滼漀漅漒漜漞漟漡漥漧漮漹漺潀潃潓潕潣潧潩潪潳潶潻潽潿澅澕澜澞澢澩澪澬澭澰澲澸澺澽澿濄濉濋濍濒濝濢濣濨濰濲濷濻瀀瀊瀗瀙瀫瀳瀺瀻瀿灀灁灅灆灈灉灒灚灛灠灥灱灴灾炂炃炄炆炑炓炚炩炴炵烁烂烅烆烇烍烎烒烗烚烠烡烢烦烳烶烸烼焀焂焆焋焎焓焗焛焟焢焣焨焲煂煃煄煆煋煍煐煓煘煚煝煡煪煰煸熆熗熜熞熡熤熥熧熩熪熰熵熼熽燆燇燊燏燘燚燛燜燡燢燨燰燱燲燸燻燽爃爅爙爦爧爩爷牊牞牠牪牬牮牰牳牶牻犈犉犌犐犑犕犚犡犥犷犹犽狅狈狊狜狣狦狮狾猀猈猌猏猑猣猫献獂獎獚獞獡獥獭獽獿玂玊玑玔玝玡玤玥玨玬玴玵玶玸玹玾玿珃珅珆珋珐珒珔珛珜珰珴珵珺珼珿琈琋琌琍琠琡琣琿瑂瑆瑍瑎瑏瑐瑔瑧瑭瑮瑹瑼璊璒璔璕璡璥璦璩璪璭璶璷璻璾瓀瓂瓕瓗瓘瓙瓛瓡瓥瓨瓩瓽甇甈甋甝甭甮电甾畟疀疄疌疗疘疧疪疶疺痋痐痚痭痳痵痸痽瘔癓癚癪癵癿皉皊皏皝皫皽盄盓盗盚盰盳盵盺眓眛眣眧眭眱眲眻睌睙睧睼瞃瞏瞕瞝瞣瞨瞩瞫瞱瞴瞺矄矌矏矠矨矷矺矽砃砓砩砳砷硅硈硒硢硭硹硻碀碃碠碤碲磌磭磹磺磼礂礄礅礌礑礔礗礭礯礸礹祂祄祌祒祣祤祪祰祳祹祽禄禈禐禒禚禛禢禤禭禲禶禷禸秅秖秜秮秶秺税稐稒稓稢稦稨稹穋穔穖穘穚穛穧穱穻窉窝窢窷竀竖竞竤竮笀笁笅笉笎笐笚笝笣笰筄筎筘筡筸箂箈箌箤箫箷箹篊篎篜篞篟篢篧篫篻簅簆簊簎簝簢簥簻簼籅籇籈籚籣籫籵籿粀粁粄粈粊粌粍粡粨粯粴粿糋糎糐糑糪糬糮糷糸糽紁紌紎紏紑紨紶紸紻絊絑絒絔絟絩絼絽綄綒綔綞綡綩綼緀緂緅緮緳縌縍縔縖縜縤縥縪縯縳繉繌繑繓繗繟繴繺纀纋纗纙纠纥纫纯纺练织绊绍绎绕绘给统绣绥绪绮绷缀缉缋缔缤缨缭缮缰罊罞罠罧罺羋羍羒羕羛羥羦羱羳羷羺羻翃翇翉翋翑翗翜翨翪翭翵翷翸耖耟耪耹聇聈职聏聑聜聧聸肂肊肏肒肙肾胁胐胘胣胧胺胻脁脏脑脕脙脧脭脺腍腏腛腡腢膉膗膞膣膦膧膮膲膷膼臐臗臙臦臩臮臸臹舆舥舯舺舼舿艀艂艉艐艕艖艜艡艬艰艵艺芐芓芗芛芢芤芶芺苀苂苃苖苠苪苬苭苰苳苵苺茌茍茛茞茥茦茧荁荌荖荚荧荶荺荿莇莈莋莍莔莙莣莥莦莯莰莺莿菃菋菏菕菝菞菬菮菳菺菻菿萒萛萝萣萩萫萲萳萶萺萻葂葃葋葌葍葔葝葞葟葮葴葾蒆蒋蒎蒏蒑蒗蒚蒤蒧蒪蒫蒮蒰蓅蓌蓔蓗蓛蓦蓧蓨蓳蓷蓻蓾蔆蔇蔊蔋蔒蔖蔜蔨蔩蔮蕅蕇蕔蕛蕥蕦蕱蕸蕼薂薋薖薘薞薳薽藀藃藄藅藆藗藚藡藢藣藫藬藱藲藽蘁蘉蘊蘜蘣蘥蘱蘲蘳蘴蘶蘻蘾虃虇虌虍虏虨虪虳虷蚇蚐蚔蚢蚽蛝蛪蛫蛶蜌蜗蜙蜬蜭蝁蝆蝇蝉蝔蝖蝧蝵蝼螁螅螏螒螚螜螤螮螶螷螸蟌蟔蟘蟙蟡蠂蠤蠫蠬蠷衅衪衭衴衶衼袄袉袌袑袕袧袲袸裍裐裖裗裚裞裫裬褁褅褆褋褔褖褗褩褬褮褱褽襑襙襝襡襣襩襱襾覅覕覛覝覞覟覢覣覹覾觉觊觎觐觓觙觛觢觨觬觷觻訄詊詌詏詟詴誁誃誉誏誧誫誸誽諃諅諘諙諨諻諿謆謒謓謕謢謤謪謮謶謺謽譀譈譋譗譠譥譧譪譹譿讂讈认讥讦训讲讷许讹讽设评诊诋诒诘话诞诧诩诱诳谆谇谒谢谮豂豊豋豝豟豥豯貀貄貗貥貵貹貾賥賳贀贂贆贇贡败货贩贫贬贴贷费贺贻赉赒赓赖赙赛赨赯赲赹赻趀趉趏趐趒趖趛趜趥趶跁跈跍跞跴跿踂踍踓踗踙踚踫蹑蹖蹞蹳躌躎躖躯軂軗軡軧軴輍輎轃轋轏轐轛软轸轹较辄辿迗违迠迩迶迼适递逦逻逽遉遧遾邔邘邞邟邡邧邲邽邿郃郋郔郕郘郚郠郣郥郩郪郬郯郰郱郳郴郹郺郻郼郾鄀鄁鄃鄄鄅鄆鄇鄈鄍鄎鄐鄑鄖鄚鄛鄜鄝鄟鄡鄤鄪鄫鄬鄮鄵鄸鄺鄻鄾鄿酀酁酄酅酐酟酠酯酰酿醀醙醣釆釓釔釙釚釢釨釩釫釮釴釷釸釹鈁鈂鈃鈄鈅鈊鈏鈖鈗鈙鈤鈥鈦鈧鈮鈰鈱鈳鈶鈺鈽鉊鉌鉐鉑鉓鉖鉡鉣鉭鉯鉰鉲鉹鉺鉼鉽鉾銂銇銈銌銎銝銠銢銣銤銥銦銧銨銩銫銲銴銵銶鋆鋉鋍鋎鋑鋓鋝鋠鋡鋨鋮鋯鋰鋱鋷鋹鋻鋾鋿錀錂錈錉錌錎錒錓錖錝錟錩錭錴錵錸錹錼鍆鍌鍎鍏鍕鍗鍙鍣鍶鍷鍹鍺鍻鎀鎃鎈鎉鎍鎎鎑鎘鎙鎟鎣鎤鎥鎨鎱鎲鎴鎵鎷鏀鏍鏎鏔鏣鏮鏶鏷鏸鏺鏻鏼鏾鏿鐆鐉鐊鐋鐌鐑鐒鐓鐕鐠鐨鐪鐬鐰鐷鐹鐼鐽鐿鑀鑅鑆鑇鑈鑋鑏鑗鑝鑨鑩鑫鑭鑮鑯鑳鑶钀钃钉钝钢钦钧钳铄铍铎铭锁锲锵锼镋镌镕镜镠镳镵镻镽閆閐閞閮閰閺閿闀闅闣闭闳闺闻阋阖阘阙阞阠阣阭阰阶阺陃陈陎陏陯陱隀隇随隓隞隡隢隬隽雂雃雈雔雗雡雵雸雽雾霋霐霒霠霥霨霬霯霵霺靋靓靲靾鞊鞎鞝鞢鞤鞥韎韖韦韬韾頛頝頧顁顃顅顈顗顟顠顤顪顲顺颂预颈颔颤颳飨飹飺餀餇餥餭餯饇饓饖饛饱饿馁馔馜馦馫馯馻駂駇駋駌駎駩駺騆騇騔騚騜騥騪騲騴騹騺騽騿驈驓驠驧驨驰驼驿骀骄骖骻髆髍髐髜髬髱鬗鬠鬫鬳魊魒魕魙魟魠魡魤魦魬魰魵魺魼魾鮂鮅鮇鮈鮕鮠鮡鮢鮤鮨鮵鮶鮽鮿鯃鯄鯓鯙鯛鯜鯡鯥鯦鰆鰇鰎鰔鰗鰜鰡鰣鰫鰬鰳鰿鱀鱁鱄鱆鱈鱋鱌鱒鱕鱞鱢鱦鱱鱵鱹鲊鲲鳖鳵鳹鳽鴀鴄鴗鴙鴩鴭鴱鴷鴸鵅鵋鵘鵛鵟鵧鵨鵿鶁鶇鶈鶐鶛鶦鶧鶭鶲鶳鶸鶾鷌鷍鷝鷣鷨鷭鷶鷻鸄鸉鸍鸏鸔鸗鸙鸦鹏鹘鹢鹫麉麍麎麔麜麠麧麭麶黚黫黺鼀鼁鼆鼒鼞鼣鼤鼥鼨鼭鼮鼰鼳鼶鼸齀齈齥齸齺龑龒龘龟
'''#'''

订正版冫前二六一九汉字乊频数不小于七十 = (r'''
子不人一大頭心風天三無行生金山馬
水花白文門玉道地小家中兒氣相雲龍
黃言石日神長青火書事之口下上老公
清手車官五明然流魚高重出酒月眼通
分國衣木節意正時法遺面香學名情成
食發世合連有方百打自二聲身光海草
土兵目平八命東物作四年會語本主靈
九解開見民色王曲路同飛客骨交和軍
服過士理女錢進落說如樂直陽十空化
外春義宮體星調田竹力寒六紅陰鼓死
鳳德斷遠當雨鬼機虎夫腳內筆華角起
畫素論首實望後千朝黑利詞足辭知經
煙工得絕臺輕關私窮來安離西字散牛
動積師古邊餘養思羅惡玄亂坐精轉仙
新音戶虛放堂禮定南指信毛鐵詩沒野
使城傳好引真破兩珠赤七回前步計盤
林寶業失歌從親教入市制志橫立功皮
令戰室結牙簡鶴楚沙禁度布極為閒雪
居秋俗歸河用可才鄉刀沈耳元變幽深
樹鳥病燕折隱難雞房武點露孤甲取懷
器胡倒容封負夜守疾運戲絲走觀遊達
塵驚微形格治善常性根眾伏章營問密
對板質笑表逸丹舉鴻政管修數霜異別
條皇順乾急先將疏游要影帶景薄象朱
話視末陵司江科退宿而電浮識銀阿反
里號齊圖君支貴都冰處血參息收油還
母省索飯麗報美周雜附賢故樓背品場
張殺班刻短紙柳冠聖議暴波眉追雅歲
切漢賣麻宗席典熱造奇逆以墨夷蟲陳
半燈騰塞應枝權謝北尾興舍飲所揚選
郎錦推烏肉舌齒弄任祖勞鳴比脫臣資
狗蛇賞迷擊稱綠萬采勢覆貞懸登藏輪
嘴嚴貨丁豐局獨留雄桃活英談謀至葉
顧決靜移銅髮刑單照假傷棄儀御易苦
集府裏井端舞邪商太越遷印屬律除句
愛強昏期松非次秀職策籍聽列刺吏多
榮淫磨約拔毒博告狂迴族果斗梅鬥鼎
能泥浪的罪臨荒錯頓怨拜保婦送投求
量案碧豪危厲執是羽賊巴枯避船鹽亡
威蕩護溜鸞位履鼠聞乘旗雷偏材鉤館
代原全恩腦佛村符部吃尊種良濟累群
若史帳洋近降環考少差敗辟鬱梁滿委
復感頂夢徒黨伯受舊規軒險魂休凶干
校福類帝率略顏社紫藥補勝喪底憂拉
款殘革察禍柔裝蹟顯飾屋智消澤防院
龜改煩盡致試責具池泉翠膽劍囊排術
鏡納講寄標亭檢射淵溫爭羊閣屈熟訓
貫便傾圓宣習杖殿領包含床線討冥監
米貪鹿奉父設課醉尺巧庭疑駕承洞等
冷壁延着算持料暗潛產者鼻備呼妙招
間在粉財雕幹施桑犯念束注程菜賤霞
塗壽待愁貧接闕隨題垂富慮童鮮嘉害
盜農逼哀役蓋記務弱蘭詭就怪扇細聚
茶警買逐操止韻候卷歷湯灰騎漏腸臉
違抱牌優枕烈肆谷靡盛其姦弓賓跡軟
帖痛適銷劇吹更著踏錄夏披歡界翼侯
提狀謹辯做克翻跳敵衛瓜瓦蒙何奪序
滅看請顛了味廣彈練遐喜奏戒豆鱗友
孫氏祭託鋪驕廢繁肥腹陣丘唱寵悲愚
毀爛衡旁炎誠厚寢想腰蠻特衰斂漫存
則園壯左戎征載鬧冒劫州徵滯狼獻辨
雀剌亮仁審巾緣升去娘把晚賦輿鄙銜
團奴搭稅突證豔馳介凡吟屯救裁詳費
儒宇快撲敬橋洗祿箭隆齋削向寡甘迎
頑員彩焦籠雙卒吉婆置響忽慢掌淺舟
賜樣瑤總諸李釋凌式怒旋曠片牽乳探
答庸被屏忠拘玩珍膏驅剛廉津禪縱繩
配啟專旅槍激爵獄階霧魄價宴寸陶依
固寬往整杯桂吐查潤琴矜穀停縣針借
初契川弟紀統翁脩贊觸詐邑陸姑燭票
衝峻殊肩讓速災申穴弊架邦共剝吳困
孔廟曹陋雁寫汗聯京僧巖芳額麥弦撫
朗獸瓊秦第篤勁尚染柱泰涼潔牆默凝
寧崇惠敦昭爾矢函扶毫窩尋派版狐番
網蜂趣那巡攻爽祝纖今匠奔幕托穢蟻
街辱郊阻鞭俊勇勤恨源乖慘慶滑燒脈
軌震區幸掩許鋒鐘飄駭耕蠶貢遮渾璧
畏終譽仗侍加占撥旨莊蓮貼徑昌洪缺
超鍾戾杜遇壓憲摩研編裂充厭授曆沖
穿展忌暮枉遁倚冤及攝榜牢由誅趨搖
未零魁供嬌惑憤損昧曉禽糧酸醜旦欲
淡混祥逃鎮到宅犀繫肅訪賈免境壤導
己忘棘楊淹低媚縮途割建挂撒男碎薦
詔輔輸兼抵掃棲給諫辰久換據牧籌膠
衍貌側兔堅完庶謬隔仰巨帽座擾旌淨
莫鵲奧臥茂蘇襲僻弔拳灶爐翰返鎖隊
侵像冬演瑞遲右寺抗斥暢栗羞蒲遣閉
例夕態拙構汙盈蹇偽勾卑套攢於漁纏
與限鵝冊助夾孝尸耗慎戈戴洽犬碑綿
緒胎藝豫障宰效焚疊癡益眷祠訊遙驗
魯卻因壇徹暖朽維羈蔽闇卜按樸歎殷
篇育荊賴釣願麤伐侈叢壺晦植泛湖溪
硬祕須兆抑敘瑣肝諧隙驛健姿患慕札
盟究繡罷誣乞倉悍祀蓬蠹覽述駁勒庫
慧截沮澄薪辦鄰判勸吞始幣早畜窗署
訟鑽頹倫崩忍核溢繼豁麟奮妖孽憑振
捕敏盧秩蹈遞圍基稽誘陷竊粟紛罰腐
蠟丸佩偃捷析梨模淚層挑攘淪竄蒼襟
促悟抹押攀森潑炮矯稟茅豎迹于匡妻
峰抽椒示竿級臂藻蹙偶創慈猛獲耀蟬
誦餐丈填悶拂敝斜柴鑿鵠僕擁擔準現
綺裘隸麵儲冗括朋漿潮罵荷藉評豬躁
遂錫匿唐徽悅範邁閃儉坊宏巷循採瞻
謙郵闊鴉協濫瘦羹認醫黎住卿呵宵屠
恤拍擺斑朴滴融贈跌銳霄魔冶宜寇必
怯絃苗躍軸逞乎午叫婚季岳悔減簿袍
讒鈔鞋岸廬斧梵棋誤謗賀跑鑑餅偷援
梯樞渠續袖踐遼墮壘尖峭捐欽藍貳赫
踵透逢傲允嗣墜壞巢帷康忿擬斬柏粧
緩芒鈍妄妝敷歇濁猜球篆褒覺諭謁贍
蹤迫郭閑飽黜再姓撓播煞獵睡窺筋訛
貝際駢佐垢扎批梗梢永爪綱翦脂艾藩
虐虞誓閱匹敕泣翔詰霸鷹享刷台囂忙
摧斯椎沉潰熊筵縷賭赴鴨仇佳個傍副
夭戚技撞穩耍胸觴詠讀趙髻鬢凍幾欺
涉溝瑕盆租芝趁蹄較輝逾唇寓挺槐沸
牒窟譯轡咎喬恭戀扣替梟棗漆狡肚膚
蜜鈴券劣崖彫掠擇映督簪緊蕃製豹預
伊偉傅兄刮塔戟洛爺糾訴趕轍頌鶯卓
即墓悠惜扯暑滾狎疆筒組纓翳聳苑螺
遭雉鴛並刃嗟坑域帥憐棒紗郡鍋閭韜
駿鳩圈楞淑淳畢競簾胥裙譜貶跨躬釁
鬚串刊愧曜測灼筍箱諱酬釐鑒駐驢倡
呆妍嶺彌拿搜漂績罔蒸蛋鈞兜剪叉店
愆脅舒蜀裹譏迂醇餉宦暈皂盲禾粗綴
蝶讎酌隅雋飢似啞拾泄紋逋閨韶項馭
馮伍剋喝墳帛并廝廷溺滋灑碌秉織蝦
裳賽輩駝騷乏僭召惶捉晨榆砂稚竭絡
膳鏤飆且佚叔徼液炭瘡稀系緝蟠訾傑
后均媒希幫慰此沐澀疲純蔭諷貸輦辣
遵鄭酷凄勳哲囚垣妃弛懼攬晝氛猥硯
臘艷莽蘆虧誇販釘伴債堆幻敲槃浩浸
渴股腿衷逝邀鬻呈婉怠我抄拒掉沾牲
眩竅羸腔艱葬袋詆贅酣鞠頤飭柄澆穆
鉛饑饒卵哥埋寂屑拖揭沓洲煎狹綵翹
膝蕭蹶邃伎倍哄壑娥廩戍戮握旱晶柯
桐檀濕灌眇箕縫般輯佞侶倦哭嚼圭奸
已恆濡眠箋築絮繆蛾衙該賬銘鍊陌亢
姻廚摘普曳檐燎甚稻穎衫複迭鋼闌丟
互僚咽嫌弩彝徙慚插揮擢斤湊熙牋矩
膺虹蟹衢誨遏陀饗駒孟尉帆拱摸澹焰
皋虜蠅訂謫距阜鳧黍兇剖宸曼榻炙瓶
葛躡邏鬆劈叟吾坎幡暉杏棍穹竦耆褐
褲貂迸韓侮催呂弘擲曾桀泊瑟痕稿糖
綸虯謾鯨麼亞剔匪哨喇嘯姬悖挽朔棚
畔皓糊膩誕軫釵騁他付仲劑娛彊概欣
漸猴貲隘值剽劉厄嘆奠尤尼撮欄湛甕
確磕禿籬蟾誼讌鹵兀几卹吸增慌歪污
瘠聘訶諂諾謠跋邈黠咨喻嘲嚮夙宋巫
恣措棹牘犁疵碩脊豕遜饌什係否喧廳
惟懦涵漠瀆瑰盼脯蠲裔謨譎銓閎靖塊
墊奢幼恐晴氈淋淘渡爨甸笛綜蠱軼轟
刁哈宛屍恬悽晏樵檻盪睿粥絳繭脣芽
苟蓄贓跟轅鉅饋凋嘗塌悴慝懶棧瀝窠
綏聰覈轂邸醋鑄闈靠魏件伸俯俸控搆
搶棉榷殼添烹甜瞎窘粹緯縛繞羨翫航
蠢軋迅閫靴黏冕准各寮徐恥拏昆橈涌
溷漕煤猾甄砲籤蚤辛陂隕雍髓黛企勘
匱妾宕幅懇拐樽渚煉狠琅疇祈祗稍纂
芻苛誥軀韋俏勃叱坡塘墟嫁孩幃悚擦
欠毬浦縈蛟訐訕譴貓貽醒驥髯鱉僮勵
卦夸嬉岑怕拓楮橐段湘潭熏禱稜簇蕪
隴鷙啼噴妓宥悉捨捲撰攤械梳棟浴渥
磬簫糟翅菊衿踢雌馴麾黷
'''.replace('\n', '')#'''
)
assert 订正版冫前二六一九汉字乊频数不小于七十 == ''.join(订正版冫汉字行每频数.split()[:614])
assert len(订正版冫前二六一九汉字乊频数不小于七十) == 2619
assert 订正版冫前二六一九汉字乊频数不小于七十[-1] == '黷'

assert all('一' <= ch <= '龥' for ch in 订正版冫前二六一九汉字乊频数不小于七十)
assert min(订正版冫前二六一九汉字乊频数不小于七十) == '一'
assert max(订正版冫前二六一九汉字乊频数不小于七十) == '龜' == '\u9F9C', max(订正版冫前二六一九汉字乊频数不小于七十)
assert '龜' == '\u9F9C' < '龥' == '\u9FA5'
assert ord('龥') - ord('龜') == 9

__all__
from script.字频统计冫词汇纟汉语大辞典 import *
