#__all__:goto
#输出文件:goto
r'''[[[
e script/排序冫汉字牜按字义的字数.py

script.排序冫汉字牜按字义的字数
py -m nn_ns.app.debug_cmd   script.排序冫汉字牜按字义的字数 -x # -off_defs
py -m nn_ns.app.doctest_cmd script.排序冫汉字牜按字义的字数:__doc__ -ht # -ff -df
#######
from seed.pkg_tools.ModuleReloader import mk_doctestXmodule_reloader_
doctestXmodule_reloader = mk_doctestXmodule_reloader_('', 'script.排序冫汉字牜按字义的字数:__doc__', '-ht')
doctestXmodule_reloader(reload_first=False)
doctestXmodule_reloader()
#######

[[
===
view /sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典.txt
    <BR>&nbsp;
    ,词条
    :词义
view /sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典-词汇繁简对照-补空.txt
===
view /sdcard/0my_files/tmp/out4py/script.中文字典囗..格式化囗新华字典囗..新华字典.out.txt
    含有:词语
    ,猫
    :...
    :...
    /猫哭老鼠
        #<空行结束>
===
]]


'#'; __doc__ = r'#'
>>>


[[
===
py_adhoc_call   script.排序冫汉字牜按字义的字数   ,排序冫汉字牜按字义的字数扌  :读取冫词典牜两行扌  :/sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典.txt  >  /sdcard/0my_files/tmp/3tmp
view /sdcard/0my_files/tmp/3tmp

===
py_adhoc_call   script.排序冫汉字牜按字义的字数   ,排序冫汉字牜按字义的字数扌  :读取冫词典牜空行结尾扌  :/sdcard/0my_files/tmp/out4py/script.中文字典囗..格式化囗新华字典囗..新华字典.out.txt  >  /sdcard/0my_files/tmp/4tmp
view /sdcard/0my_files/tmp/4tmp
]]



[[
===
py_adhoc_call   script.排序冫汉字牜按字义的字数   ,str.排序并串化冫汉字牜按字义的字数扌  :读取冫词典牜两行扌  :/sdcard/0my_files/tmp/out4py/script.欧路词典囗.试读囗囗假设简介字节数地址固定囗.汉语大辞典.out.词典.txt  >  /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.txt
view /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.txt
!du -h /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.txt
    3.7M

===
py_adhoc_call   script.排序冫汉字牜按字义的字数   ,str.排序并串化冫汉字牜按字义的字数扌  :读取冫词典牜空行结尾扌  :/sdcard/0my_files/tmp/out4py/script.中文字典囗..格式化囗新华字典囗..新华字典.out.txt  >  /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..新华字典.out.txt
view /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..新华字典.out.txt
!du -h /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..新华字典.out.txt
    156K












===
===
tar -cvf script/排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.txt.tar.lzma --lzma -C /sdcard/0my_files/tmp/out4py/  script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.txt
!du -h script/排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.txt.tar.lzma
    1.4M
rm -iv script/排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.txt.tar.lzma

===
tar -cvf script/排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..新华字典.out.txt.tar.lzma --lzma -C /sdcard/0my_files/tmp/out4py/  script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..新华字典.out.txt
!du -h script/排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..新华字典.out.txt.tar.lzma
    40K












===
===
cp -iv /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..新华字典.out.txt /sdcard/0my_files/tmp/4tmp
e /sdcard/0my_files/tmp/4tmp
    20920字
    %s/:.*//
    并为一行:
        !du -h /sdcard/0my_files/tmp/4tmp
            64K

===
cp -iv /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.txt /sdcard/0my_files/tmp/3tmp
e /sdcard/0my_files/tmp/3tmp
    348430词:
        +348369词:正常
        +61词:释义残缺:
            +3字:释义残缺:牦牧牣
                牦:0
                牧:0
                牣:0
    %s/^...*:.*\n//
    13133字
    !du -h /sdcard/0my_files/tmp/3tmp
        104K
    cp -iv /sdcard/0my_files/tmp/3tmp /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.仅单字.txt
    %s/:.*//
view /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.仅单字.txt
===
tar -cvf script/排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.仅单字.txt.tar.lzma --lzma -C /sdcard/0my_files/tmp/out4py/  script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.仅单字.txt
!du -h script/排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.仅单字.txt.tar.lzma
    28K












===
===
[6216==sum[1..=111]]
取前6216字:

新华字典:字义字数最多的前6216字:
不大一天小高打人无中上生下水自老平公风发干白过分清心出开地行有文相花外回通后明正长对重火气光空主神转前黄同失工金三当时手流如好海反作家半精电红内死轻国破方落口深阴百交多山五经定解青强成以日引古直先坐声见东土会关归头可万起推放独书入太调面保千表说进要本走来子热体实倒年铁军门点为断横合感安排虚单言情名黑顶血管故马十官绝得变投身比游改原连复收包道私全阳和偏新提举云隐毛恶折左假总西油指拉脱吃四标灵短机细急别传周苦散节活沉难冷立接信春根动耳看修食两背将眼草兵应阿冲乐报孤石事斗知少广没共专结烟法木着翻若教盘遗积理更喜穷离顺观低飞肉数二华世龙软暴朝望兴皮所画八夜亲胡疏蒙真骨冰切极女退满任宿守随异病远素挂格奇首杀招加倾沙留美圆六角曲受目月还就硬南临简善元松字告民化便学微制做宽非野荒鼓超色北压盛近齐至赶豪从听寒里余商封支物集师圣鬼七特双尽惊消负意向乱照把编禁张闲战乘河用间执语良扬在追规披休都并旧挑含抽取令服配常果称麻争补香底装英薄盖几尊礼台功京路图玉牛问呼客号罗等造探宫纵优端鱼养思群运乳代泥视论与车参第吊司雅农省衣柔伤旁系幽市缩脚量旋丝混熟银舍暗磨送拜领布甘王使率因计征燕求板注去江洗义形粗顾杂居索严力施被乡秋终星众卷未痛劳洋丧音其防俗弹联九隔密败质容是利攻潜再笔借滑耍初条搭度勾升疾喷固影列委贵登何温宝介悲印钻决差祖准套零扑浮雪校供显治末种申累仁托残建基片狗奉铺毒只针溜诗乌统丰徒胜致营危悬衰快逆围飘偷选激属宗尚夹停环牵虎冒浑审贫叶识资典命班步现爱昏早宣汉闪穿品宁抱伏整雨树儿药货即个展屈卖轮震跳记酸带怀奸柳适厚摄降怪试权歌寡娇各才认塞寻刚能科抗历绿扫贯牙护武童政依紧摇雄采钟炮欢露亡赤移边垂克词莫博抢党团谢夏威敬凝豆滚处章象玩那城承射废拔凶请吹狂罪戏丁约钢刺烧玄晚备易皇除寄漏越谷酒息凉镇淫违具寿汤贼免铜济静判突幸庸壮性预岁丑透堂跑轩抵习雷士弱完嘴漂批算贴永导爽逸核扶仰救达颠刻错监撒孔田局评载存刀顿占拍陈雕卧充摆讲粉御财迁辞矜冥弄坚附净兼料险叫款焦李肆林漫巧狼销贪右卑勤洞希怒羽足亮互效跟姑瓦史往迷构闭乖饮井枪概纪伯逐豁尾攀创遂志殷待弦浅波巨尖杜什灰略羊夷君腾设疑写及臭笑吐旷庶竹植社革避寸绳荣买缺珠男郁缘墨害许赋策吸赞增界警业冠球茶按粘枉凌延然庄剧彩输窝席景珍劲插划期旅纤厉振尸鸿污矫慢缓季恩鲜闹舒船响涂稳罢维夫歪灯枯须肃责甲鼻刑藏而困扇置序房掩了陶骚拥父福阻膏瓜区泰夸填刮顽税派诸渔则宾胶演较组戒惠康启佛哀灌廉念损且聚伊凡让屏富侧检妙犯迫股楚拖涉龟仪候拱儒盈荆沾县邪抹邮始歇筑逼纯坏铅户汗获次势蒲拨偶闻最苏朴剪伸这必趋裂扎触炎腰赏桃浸冬想屯挺陆侵挥释鄙谋巴梁艺怨钩兰句哈驱止亭详敷鲁题肥证担秀舞覆惟忍纲否亚职拘由笼架签逃贡扣奔悠尺戎卫助既贤查踏场版督苗契饥郎谈纳副兜费削滴庭产讨斜模减烦胆苟蒸稀哨淡秦久汇泡术衡奏医浪陪继考滞割盲稍牢猛话换甜迎烈翘部乎萧敌母票练尘劈履德骑线甚蓬循帮肝津晋掌繁妖敛束唐毕钱勒示今霜圈绵殊卒敦普颓矢祸盐诛匹冤湿到网螺已器抓幻孟吉泼协妄钳健忧锦纸忠袭扭诡贱梦祝丹给泛著辛案巡操羞弓虞寝或煞畜航奋速斑鸣答轨仙训隆之击恒类径敢渐俯垫腐狐范尔毫猎醉丢辟桥冻滥哥鼎却函绞摩染禅壁智持乙劝驾宴纷畏位齿骄贾状抑钉宰芳哑犹窃邻帖荷献眉课瘦据于欺阵者该均拿融孝栗惨炉援灭浓蜂笃拾拙贞誓律欲苍稽鸡矿宇罔弥秘押泄陵凭卓搜曾崇舌授阙截奖拟纠朱室住庙唯滋脑吞饶裁抛米泽堆戳阁迂夺攘项村伴湖饱跌绕赘梅驳捉刷森肩厌拼柴读务弃拳润辩频丽冗棉厮付幼丘障佳拐递唱糊倡翼饭瞎蓝忽菜麦嘉挨斋益织爆竖夭剖亏朔够脸傍牌俊荡衍匡似盗抚式庆奴洪茅坦替锐遣咸挤趣旗伐墙咬痴婚拆拓卡误鞭艳脉的絮宏溶偃闷蛇艰屠杖耐浩忘屋躬荐族疲鉴毁掉欠埋窗穴殿耗紫丛享录辅劫仆沟伪议碧徐枝煤锁镜叔烂宦扁朋宛鳞牧剥僵暖串兔每骈觉罚捕胎符幕租坎胸邑靡讼哪轰彻捻碰跨惜旱竟呵帝庐坟夙患踵赛胁脩储诱遭咽岩枕糖雍枢梯挠欧诏技街驯禽稿耸琐兽婉撮秽勇某籍酣卜凄辱愿窘价译灾猫站魔吟溃腊蜡综燎愁侯磕蓄驻裹莲库员阔赊斯韵匪择琼验友续衅哄墓卍烛遮弊拂愚扒搬驰酬确床帅轧研午嚼颂像茹炼桑欣嗣卵腹遥挽撞睡聊乔伟挟谨臣筹魁厘熏妇掠扰窥枭梗叹坑侍锋寓扳讯耕办叩囊轴炸猪仿府沃赴沸宅捐叙揣恭焉棱峭赢婆狭淮秩弯抄池栖霸撑渗恣惹究蜀况崩杯慈鸟倍碎奥結艾藉仕贬熙叠映竦砂蠢晦祥卤昭汽涨撤渊鼠辽猥淹戴秉程遇抬淋舆兆距凿徽座饰刍乞阶播忙赫藻撇訾酌逢察雁啊寂昆翠卸芝芥苛抖仇赔闰也讥乃冶擅刘奢廪践谐忌纬糟凑限役慎敲铭揭篆顷迟峻斥寥旦爬般值绪椎巾兑摘澄薪召驼斩洒氏粮寺僻测晃宜淘恐赠卿荫熊菲阑味婴尿找绷棘绥蹲戾闺州栽栈篇摸孩盆尤盟兀液杠衮蹑媚衷浊瑰摧吏层挣猜诚弟雀宠悟隙哭昧祭刊蕃穆倚逗遐块搏喝靠稚翰笨默予雌慌坠耶雇返谦宵园巫阅赖样筛蹇攒汪豫惯孽鹰靖遽撩瞻楼姿潮傅驴厢狡绅绣孺喧搞榜锻臧暮肯弛朗番诉缕窈殉斤诈挖晕泉怎馆贝奠谒葛旨胃蛮耿钦催剽洁鸾虫咳恢勃圜慰蛊谓捣辨貌刁仍尼槛皋际徼疆亢芒呈摊萌岂拗梳晓辑钧颇仗浇穰舟颁涌怜队蕴媒伙捧柜瑞促访梨啸犀额茂匀傻孰辜擢冯姐熔箕恨梢估缉赵咕鹄聘醒悔甄邦他捷漆凤札肺硕刨藩弘删佚怯俭另嫌恬伶述戚锥幅咨妻沿焊桂芦键剂禄隧诵哼圭宪悉逾乾括沦徇例唇呆啬勉酥堪莽握魄讳匿伦冢佩沮陋佐塌悖挡晏牺碑蹈丈殆黎滔槁酷嵌堕愤畅蔑嘎恰鸭陨劣侈渡坛跋陷缝犁牲裸蚕蔓吝控瑕禾薰娘坊磁嚣涕仲滂贿衬挚恋魏谱捎虾俏携纱辣醇猴缠鞋鞠遁馈掘肤禀署竞妆渠塔境棋棕凯棚亵壤肾谏灼砌袍乏濡剩订缀姻犬霍叉姨级韦鸦穹趁瓮繇荼拧肖卢虽乍斧胥锡蔚邀咏疚畴芸孙诘朽纶恍夕皂擦泪缴骇襄债吾烘狎瘠裙鹿呕扼衔谗廷蔽杳绰袅颐又川宋摔曼码寅缨览赌眇咋戮敝脂傲梭锤陌捏旌我企迈焚荧暂隶潦垛佣畔奈眷箭册啼贰愆铸侦诊彼囚燃锢奶溺怕遏羁胚耽飨颜仄诎允唾妥餐缟倦孕腥璧燧柱晶畸箱董虏翔尉剑嘻炙昌锯耀贸诰弁蚊戍材赚厂嫡拦措匠叛奚隽萍觚爵链颖栎讹途嫁掖棒币慝脆筋逞挫渺琴扛培舅份段曳脏筒绊绮袖贺罩姬蜜虐弧掐绒烝嫩漠溢纹粪徙闾浴渎圩惶敏沓垒裨莹搁灶梓爪甸蹙窄襟暑涵魂揽佃骞拒此秃亿饷叨羲扩沧恤赭哲愈皱庚呜阖汹狱搅浚祀挈袒蛋涩摹鸠揉殚秧镂聪伽逝吧堵踞讽眩竿院搔株竭踢韶赂苞怠窑呱耦兄狮购腻碾匣涓矮轶炭仓哇懒桡稔崖泊涤晴炒姜岳骏苫汩蠹仞僮闯缊膝黔勿诤苕涡缪伎锅扯店绘辕杰柏娱跃遵鸳皓沤衙洼胖虹翳蹶嘶柄态雾郑彗缭贷臂罄蹄需迸稠郭仔嗜杏韬粟昔蜕钝跪绸雏隤僚屑诞贩遒吁惰栅疯抟涎壶翕厨簇帐孚诠幺辇祈羡葡沐钥诺茫掀淑源巢逮央饿垓垢寇沥沛脓伺弭岗栋膀窦痎蚁颉谪廓廊喇症矩迥嗛葵抉樊厅掇孑迭吕琢蛟翩庞喉骗沽洽悦旄杭驷澹赍询彰肌丸俶瞬倩壹塑惩稗郊俱纽尝愧愣贻殖笋些骊桀脊汲厥蒜阉溲潭臆钓券溷烫瑟鹅偻辉械晒晨簪育蚤簿亦驿稷盼淤瑶逊坤佞祷韩慧诟骤揆贲斟炫胙砖伉谁撰醮霉兹勘菩彤赎凋侠庖售妾濯翁诣咒湘牡膺窟妍捋腔跷羸萎嫔腿刃讪喀烙檀芬蒐阃钿霓麟杨虑颤隅悄陡吴戟诬谅疵卦姣捍栏梵睹糜丐彝泻析虺纂抒黩咎俄伍芜绩俨帽拊擒绾怡熬烤檐睿倔僧葱很壅炕旺添滩悼煮窜叱涝躁郡墩褊衢俪岸槽橡砥碳磬莺吨滓脾疗凛肘簸侄骂纫氛茜啜娃歉砧褒昂鳏谣芽庠滤盥姓洿楔惑酿纰缥戗炳碌酱侨莱闸纡港络俳谩绢恃旬肚瞑撕煎渍帷纺牟铄蛤罕叽轸耆狠圃搂颈丫佥馁蚂佼毋衽咯恼芟宥棍铲妒蛾勋皆凸你栉臊颛哗嗯琅蝇娴抠拌砸碍俘塘眯筠趾彭澜囤樵哉醴雉撺潢焰晤鹊碱蜃讫淅蹊藤嘘岭掺涅炽磷辰莎弗幢昼稼畿阕腕镶蚩邹呛绍账遍媵瞒粥厕捞涣侮霄谬摽穗褶彪搪绉赓扃疙桐晷龛菌婿辎戈扈晻敕葬眠痞觞譬黍夯驮型弋煽杆馨嫚巷辄吵唤汛瘅酉谎谑蒿幡恂嗟淳酋挹溅缇楷妨煦炊瘪甫侥贳赡飒醋亘努迩堡恕硝慨宕狩屡饵瘗躯驽瀑珥阡邃侗饬啮噬湮殒氓荤泣烽秤谆嘤缦肇莅喘嬴爷豢霞毡榨铢甩傥歧躲趟僭骆揪澡枚秒箴篾但枸磔笙剿帆玷它尧榛葆幂癞虔喂捶倘桌榴彷洮簧閤鲸蔼燥匝陂陟俎莞摅惧穑铨疟雠谕蓐旃恳蠲丙仅傧谯辍歹偎菹唆崭铣耻勺缯箪逋帘驭敞儆曙肿觜妪滨觥黛颔迹冀嘲偕呢缔煴樱鹤螳筐赦邈咄桓鹏漾桩膳锄麋帛缮墟戢斫瑜莨咱闳攸胞陛隘募谲遴泠鬲厄巩嬉抡榷笺垄埃夐孳朕剔陇诀茎描沼蛀驺捡赐楛惕赀歙奎汰粒蹉洲贮枳砭踊溪珊铍啖辐穀疮粤谍篡菑奕泮羔殇戊槃腓鳾偾庇吓吻澌纨翣娥泌怅橛剡萃釉咫噫撂桁卯蔺驹戆肋粱跄页菊萦噎蚌啧喋犷挪淬锭磅籀喑涯恁瞥釜哕峡淖懦档楣鲠麾匮荑奄岔框罂哺矛蝉聒酤鞍阮搓煨忿蜗蠡誉俚撝沈辙椿氐裕苻椓曹妃圉蟹髦黯骀湫堤歼窾舷阀胪矣褪檄綦荛届牝祧钞睽疫倏掊掷擘璇佯倨葺域斡掣铰躅诽茁逻喻渴腆蝗峦屦擿湾毅瓶秾邸诅溯怙恫焕桄碴窕銮谥吱爻蝼踪讴婢瓯蟾呐懈殡脯蛙翦舰笄鳄骖洛舛曰铤佗诲哽猗蹦茧嗳渥瞽褚叮沁缁垩熨暇琉鲑苔藕吼绚舜枷窳笏跂谤拈絜裘谴猿慕怫祛甃窠剃噤妹惛膻盎耙篱黜卬佻遑闱澳昨罅髯彫扪圻堙浆糠衾掂蔫監啄觐缶颢蔬喊撵毙歆咧啦烹殴褐蜚閟靳荃怵箸淀鸢荏屁埒胄腌盍鸥聋薯拢湍燔糁辫厝件迄己瀚钮黝寮坡憾赣殃窨慷祠憨朦踝谚猝堑瞀衲惴欸腮钜伞瓤瘤闉怔瓷玑冕励掎艮炀鹑蚀縻砰闇飧伫骋姥桢槐胫裼麒迅骁绛硼哮圪胀凹吆梧哩绎袜伛哜湛绌怏辖嬗孱赃桶玻瞳砚臼霁亟湑氧鹦阎姚嬖浏漱慑镀匍亩瞿磐裤靓刹邓蕉峨渣慊袪莘巽悍晖珰诳嚷寤飕瓣痒窭蛰髡妈坌痿啾洫纮缙萤阐橐竺酝弩岑岐朵铮镌鹬虬翡谂芭芙绠缆梏祼痕羌诋啴洄绨赅飙觅胳衿絓叟徂娆拭铠鸷砻縢帑馔浣懊锉麇茸搉楞秕钐甬醍剜帏叵楫曝懋筚刳濆囿榆锈黼冉亹垣眚蟒刬蕨毗棺曷钺窖豺挞拽撅涔溟缗杵黻拏鸩虱跛涟漕锱讶蓊嘱噱禺熛桎棐睁罐儋谀藐哦牒懿脔裔刓奂呗澎忮辗敖篷趄鬣颗隰蓍阍绲坯瘁鹘鬓苹狷渝曜胰龚侃芋庾捆梆粹踣乜劄阆濒肛硗芹苇宸恺睦厦惮戕盱饘讻茀泾悯觑甥窅翅媾娉祁镖倪蘖闽狄摈汝愕贽轫辔祚瓢锚睨窒鞅嫉湔渰圹桴瞪阜靶偿菁啰娄岱彬沆牍鸽谳茗嘈獠崔饼圮炯桔汞钙瞭酲匈傩纾垦畦畬蹬羹䌷俟茄藿嗤殄膨铙虢紬篙阽茵梃诔茈徕吗捂涛琳噪惺瘿饕茕唠滃趺鲀霎驸峰撄缄焯柎柠柚憋鹜剀苯荟喙挢捅摭绶谛啐嚎浔怛慆晢筮霆霖颙蓼晌痼彘娟麝颡俦亨椒昵搴粲麓陉挝稻眄菽菟姒饯飏俞伥廑猖憔氨眊蜇聿隋嗨棰瞠螫舂貉阪谜阗婵岛潇悚翱骸丞俾廋嘟疥傒吭喽猬搊缚螟舳箫狞孜柝铛铿蟠臬跼韭陔吮涸渚镣踬鬻驶欻鹖緌臻荚掬曩笛蹿陬谰捭揲埙棹橘鹭篝谭苓茭赝椰槌腋眺闵姊忝殳瞰碗轘蓑揜杞棼砍壑胠皎缸篮郤鹫耨裳饔騑藁啃宙钲陀讷逴姆扦撬愠楯玲腴颊劾庵辂燠疼厩伧幌寨肱爰瘟阈屎囷愉秫輮僝苒耄挛裾阱彀寐泯甑锣鏖僇茨娣婶汭泱肠硅荩唧掸汶扉瞧瘥耒邕刎阼邅栾絷籥赳赆蛭箔阬儇迆弈搠漉坝柘橹矇踔蹂仳诹萋浃绽囹惬氯瑑脐铆硫踌躔黥剉邯谇嘿崴揠攫堇埤惇辊觇欿肴铩镬疣霏诂薮幔堰轹柙椽痘畛窬覃魇茔咖潸殪烁窍舵诩薇崛泫洸忤柩鸱蝶侑椅町蛔仵莳逡弢嫂饲擂潴杼矾褫褰跗倜嗷嗔闿饧洎栝锲褴芡茴薨唉犴扔杪曛盔跻侏哎壬掏涧溉熄爨禘钤镗趸躐蒴啪骛溱灿枵舫喃揄滇滕忒痹矰筭芮藜骥澍悛悸皙皦襁苴抨樽畋裱舱笮豕豚迍溥翌冈蕙啁嗒尹掾缒缛铉铦砺蜻徯巍拣轿枣晾瘫纑葫帙姗獭盾酾逛咀巉氾瀹夤怿梼襦兢哙柑槟槅玮痈峥湎恸祇簋銜浒悭脍蜷讣芫遛缢熹旻恚侪狃惙柬盒箩隼颅倖迪嘒骠娑杈篹錾隈侔馑扮瀼戌癖鲵丕侣诇苑菅喔怆榻眦遘咂阇狙狸掯揎浍钴磋耜趴靸黠卉帕沔垆蛛蹭鲎鳜寰猩嵬撼坍憺毂镏貤倭诮芯葭嗻嶷绑痤觭霤葑妓淌栲緘箍谄婪汁祓蝎鄂峙绋爿锽磊赧詹裒骧汀缌忻祊粳茬姘岿毳秣袤溽缅灸筵蹀霈霅俸搀泓尨肫疡罾翎捺澈禹珑玺傀馏搢熯痔硌詟剌俛茇婺嫠旭肢褡絺濠喁馅擩恇憯赈痏蕲阘塾悻慵杓擎砀騃奁屐捽泳忖忾暵臀酽媟拯晞斐穟鬯匕潼柯璞眨蚑蝴鲔咍喟驲揩沫忏辘眸黵侬萝蔡吠呻嗌浦漩椹瘢蹴鲤弼缜圄赁脖眈衒邠莩淄悒殁杉镘鳁嗅骜惭炬暄憙鸨襚耘翊飂拷棨檠铃痢鲍鲲陕葩姝婋杌昙昱玦朏畎謷仟叁嘬阂汕赇躺躄荦蔗嗾渲楦癫羝亥奓帱壸憧赙卮胤镝皴讙壳揖膜罡貔喳猘屉铎铫铚鬃苎迢庑帜阊惆橄旮惫菀岘岷戛棣樛矞踦羯刲莠幄宄妣媿饩拮址忆烬臑瞋箬鞔匾摋泗赉跖邛诖呃阏辀觏枋杲榔罟蠕耰絻髫蕤呀搒洌纴爹楮锧笥餬鲨囮炷樟笾蹩雝佑蕊缵辏犊膘侩渑枫瑱腱裎襜紊襞鞘隩迕潲绁惝槎暧锵睚篁跐娶岫绫懔殓镊镰詈齮剟阨咆嗄骡饴坻榧瞩瘾笠鲮娓嵩浛坼胯瘴谿豹咤姁拶掼缱酗醵谮逶骍攮暌祲禋慁瘌黾猾拴恻疠蠖侻诶漰懵楗暍舐庳嘌泞洵缎缃禬皈痨蜘聆豨踩龆錞魋颦峤怍晬锌翮趱剐谧呶骎绡埂煌怂盂薙觊棓铒铝罹醢雒魟佶奘嗞噩殛旸禳掰碣醲髻芴萱蕈咿揃揾湓椠愍痂褥縆亶谵蓁迨幖噍馕涮慅煅胼蜒筌筝譔蹚鲐雹唼驵炖犍甾踅酂勖荔奭骐濑盏睫碇酵鳔龠颏衄诐掞睢踠谙谶挜辁皤絣雩髋匏匽娠潺绀恪焌杻軿鞶倌芼廆嗓馋泷圬犒鹞砾碘絡籁鳇刽坞楹橱锔磺衫耎鲭袋劚讦诓闬峒纩壕琮琱碛筥簉詒馘凫芘廛噗撚氿渟漭瀛缧堀轭烜燹朓疝袢蟊黉齁诪逍吖噌囫牖肓矶祟颀俫蓟捯漪漳祗玳曶镭谖姱抔搦缫怃桅珂笞剁巳楤挲璎皿仡菘澥斮腑镫睑罨虻跸骰乒佁谊谟娖觌敩琦繙劭菠骘沱枥桧朘酎彳徘啷饫淦怖爇枞欬韪腺砉硁裆骫鼾芧蘑庋拚拑悴憎琵戡歃铳綮莪廥唝纻悃悽惋榰曦怼懑竣睆襻纁羿諠醪龀鮀匙刭崚馂撙垡楂酺跬鲣黏蔟薏挎膛瘐鸵纇髭侜茏荨渤溘杙歔旰憩鹳聂阄轼栓斁誊謇貂黕佾僄芾叭咪喈嘏泚纣癃畚蛆覈艘跽蒯邂墉瞤蚍蜩籋霭隹冱帧渫燋柞祉锪窆繻躏儡诫蔸逑姹滦绐惘钨罥踧鄣劬俩诿荠狍堞尴晧膂砣窊蜿聱耧龄拇挏潆愦桕珩镪蝤踯鎞鲰鞣谔喏媪抴缤瘘佝蓦澨怗桨榉胭攲盬睒矍砢鳒鼬郦倥哏娩彦抿泸憀毖镯鹀糯藨邋哂巇沴浙绦枹韧膈镐瘸礌聩糗鑣鞲佹僦哆哓屹坪縑繐譟魆剞芊嘁揸擀沵潋憬烊耇氮暨禫韫憖盯疱瘝罘蛎耥萨巅漯杷椭氦琪瞆礁蛹筏咻媛嫣獐汜渌氢腯瓠钗瞌硎褙蜮赸趿陲蕡阒狨猱岬掮涴尜旆旒耋棵橙玫祔臃皑铊瞢疢螭觖刖邵吡淆恹柰暝锾糙齑蹒鲳劘荅嚬埴楬膑舄趑髀隳苣莛蕻坳垮惓柢昕慇痉鹃罴蝈舶鳗鳝靴唅唁阋涫悌尪栊柿琥腭箓鳎馥俺芷茛奡嫽堋堧忸贶於柃栌榭牿牂皖矗糨轒颞偈卐嫖歠稣锶镛碜碉耔蹎鲊芍茉迒搐洑绂煜柽樯犄昃砑蝠笳鳌鳖羧冏莓扢浼缬孵燬枘铷镦絪麃迮嗑嘚撸漼绖垌氰韨钌磏髁芨囋塍杝枨柅瑾朒钵锼聃籼笪篦鳟靪鼹诙弇咔猃尻拄忪憭弑祐璋钘臿颿髓鼍萩哝抻掳汔溏怄酪蔷唬嚄馌撷缏懂轱睛鹗粝諓霰菰媳孖辒樘琤悫癔笆踹龈鬟俑嗥娈绯坨辈朐钫瘕刈帲毨榫玎瘃袾蚶覼訢帻捘捩墒桠椐珉畤艄簏醑髹讵诧荜嗉澒埵愀栩椟铬鸻甿袴缿糈翚酢鋜鄹菉妗姽嶙瑳铪紞霾靷佴呲婞捃滈柲恧钡镡粜韔郢鄗傫阚扺滀绔囟昒臞疔痧鹪褎趫鼋鼌芗蔌吪咡嬷孢楠玼慼腈簠疸趯龋剚阸佪哟嗡峣绻飐槷铡痱袱甪蝮耷舔笈鳅郓荇忡轺辚牦镮皲粢醊茝呰缳赗钯铴锸裋粽笱陴荭嗢嘹嫱孅岚泅渭轵籧踡龇鲞黭卨荸遨唻娭抏愎焠牣砒蚃踉餤鞫韡鸊卣伾徭噭嵎澧梱禖珐膰鹧畯蝙衎箅篼謟鞑鞞駓萑菱幛岌嵚巂绺枇璀蚋謏颩靥鬅偌儜厾莆蒺薹迓啑泐孪熇柈栭棑榕槲琛锏磙畈蟫篘謦蹐龌郅勐们婼婧涿炱耢粑繦譊苋庀哿闩娜婀囝悁椑氩漦秭钷蚰箧赪鐍餍鲅鬑龥匆弸咥溆漷璜恙睟癣鹣鎓魑邰菖蘩廒咦啱寔沪惦殂瓴稹镍疳艇筷籑諴鉥霹乂谠蕞帔唏阛婬猲戤炜钛铌籽龁鏺餔讧姤媲滁潘墐焘殣焮焱椴祫毌钠镞痡篠輣鳉芑犰饾箦燖欷晅腠癌蚧綷麸鲂郛隗遄骓她妮挦殢戽楸祯疤蝾糕筲輗踟妞搋沣湟缋缡埽戬烩晰瞍瘈硖裯蚱笭踱蹓釭么倬菆蔀蒻帨狴摞墀钾瘀鸴磴覂觿鮭颌冽佽苷蒌逭奅噶寘篸潞椇檵祆毓睍矬輶酊苘幞孀汨沂淙灏埠珲炝枰椋樗欤鹟耏罍鞯剒傢谌葚蓉薆呫娲猇沌潍钍锞睇睐襮蛩胾箘蹁鳍黪萼廨啭嫘崽墠悱桯槿牷甗胗褝繸鹾醺鳚鞬鼯劓芰嘡妩婷垤埯枊稙锒镵睎蚓翟鼙颃颧莝蒟猢屣撽昊钽疹砷簌賧鲛鳕鰆黦羖刜谝蘅揥洇滉埏轥醅蹋鏦俅倞蕣遌姌崟涘溴斠斲杕敉氪昳汆钪铯笿篪訇豸鋗鲟鞴邱偭莜葳狈峪泔孛轪斛焙檩脡跣傣芩荄蒂闼宓彧淞漓垧堠戥膍铱睥鹝裀糅轖鲕麈羼酆苜呦溓纥惎眜瞜痫螂螾貆跞鲈傈遹帊呓淇瑚钒盝耖鳡邳诌茱藓藟噀娼猺濮梮瞅袂蛏蜺雎呙呷咭咮嚚媦揞泂滟缂缰坢忱孥榇晛璪惄铟鹢疃袿酯鰕叆攧汃琬牚胺癸钊瘙磈窣筳輀闟靛鱲齘邢徵屟汴沭慓殠榱锓罛酩鞓鞚鬈倢莒逖狌崎泺墅胝铈铓眢硒褓舾酦鲆萘噣掿擞缞柂檑镩睋窌袼蝘臾綪翛鱿唵汐沨湄旂櫜肮镉鹓蛁螨

汉语大辞典:字义字数最多的前6216字:
發為辟齊行當起適正子方解上生合重脩離道下中至疏服和白格閒任比與頓家出破明從體以會角開通有來注放清食要舉文直本處還得關鉤轉長率將游朝風故載望落由氣錯陰決禁名薄末養且容走老分則點連打甲歷厲越標便假板過強守一乘造斷就安班數陽沈頭厭飛金時著校端遂作化外官御鄉科高省漸貫登敦殺實資周把鎮阿淫介背內旅都衡言極負期表質肆見折挑刺是被管冒傳事而足沒若次散成盤着犯論卻虛定善策可辨漫卷門章倒的隱蒙施微流遊面治能調封疾猶簡致切更宮汙交帶靈鼓句口料說同引取攝入對磨房主屬伏貞距拔氏相深於淹庸宿脫濟度素獲節沙火淺布業拂遺回陷謂幹單別常橫令襲衝理須撫附概客權坐經索辯偶用宣壯毛部儀孤衍營謝裁宗保易靡精委象所居機闕駕抵乾復惡順向進約廣案底頂準肥略窮其伯信空考采龍先泛好達青訛勝皇溢鮮倚黃集紀母湛止應支命繇式請除觀藉參吃軒排條渾程德修知曲包大胡荒總賁申代追路幾投仁澤降匡之兩畫武立監踐推麗較原亞候趨年稱溜抱翼魁平雅興尚固選寫法烈星嚴政人土積累于水留熱運夷張難報身領挺徵草獻振課抄牙者勾洞符痛焦偏光彈蓋如石局師室地元聖做月書士挂旋毒乃量陶契鞠款存術古樂湯充干罷公已趣接苦燕義物滿移邑混才花防病奉番亂在徹豪臨趕饒提寒弔赤籍井玄帖暴非許顛徽札丁削郎字濫野建訾狂木求詳逆親去俞疇扎誓貳納克遇植舍疑錄傅急梁目夾聲照架柳漏輪共洗場爛射華序遲員爽頃世待界畜指揭況神稍首兜優等題炎右設莫撇頗陳鑿斗差問豫殷里苞奇蕩那輕趁枝衛釋制割羽尊傾傍視衰徒責漢結盡掇學乳獨不具休燒蹇鋪襄崇亡益緣搭翻撥撲跋骨承艾掉揚戾魄滾果障隨延類掩良雜招特讓律哨逗識停弱抗幕浪展葆該區輸送卒浸般祖眼革云蔽小屏寶規扣賴密寬未意圓縣抹夫然君車贏狀敗遽亢枯加胥博齒蕃疊並即異厚了材雪畢置王跌退收銜聞騰弊歸既側鈞遠懷搶髦威仙按浮弦第靜牢教輿賓洒邪貼變抑手蹶駁拉盜隔勒豐籠攢震拜戲波宛魚塞衣壞曾真情品羅披職拘尸民戒矜慢輯徇薦伊覆每夏顧剝廢屈試銷扇因弄死鑑役列窩藏激謾填縱勺諸廉輔維猗飾損辰唐執議泥押攻坎息軫芒摽迷磬攘黨工托宅佚專號逸挾橋卑捷朋准融秋幸洋印迸豁繩偽梢種括圖占闌屯楚使撩憲閃爾墨兆蒸眾日雄躬窠銳滋反孚隧形暗遁國賊猥色根餘釘督利灑斂違版陵惟詞戶惠消援族蹬矯盛賈跂巨無必也昏孽滯弓絕斥飲騷沓紅完操借天多徼歐受訊軸扶灌濁剛鬱耶邊鋒心宥話隆阻撮害新辭鬥擁垂甚沃祝景刻敷寄賦創佛步磕搆染動獵梟刷告躡肉稅統鑽饗際看竊晉畏察涉靖壓速何純枉蹙龜環計勞升懸肅朴甘匪晦壽構練攬尋宜竄繆失快麻嚮豔蹟聯研蘭釐圈司討踏兒跳串拍踦吟鬲峻旁咸束及全玉猷據隸擬沖漂啟耗梗或覺鄰軋閱扁市冥頹係乙刑劈頌齎裏膏亮臣備鄙甸熏闇雕寧鼎蹺田庭突囂叉乍軌滑迴侯露少聳奪昧嗛村匹潑綽弟審免麤蟬淡段黎榮抽猛軍孰仰鬻摘持遷廩左曠蘇府爭倍雉煞閣虞功貌賒烝查棘殿唱聽煙語答熟揮席初崩斯季沮險杖習繫片寢倡邸頑硬替毀穴短近器雌盪危副邈筆詔希奧位志鄣揣谷橈刮蹴鎖薰巴倉愛盧奏敝池叩凌疆亭渝牒泡竅英貢侵夸寵朱務穿徑童帳給牟吐捻鐵燧圍撒孔商瀆亦台蠱呼閉寡犁騫泰均漆派傷喜吹蹲冷夕悶颺捉耐阜眇又伎溫榜馮雍昌感摸臺軼讎戎贊拓殆津謀檢牌循赴弛述海判康憚供錮鄂樓莊擔渠奔暢憑賞但付函塊履湫伐活叫淑二躁冠涼凡貴遣奄攸自典產旄旗詘鬼怨劇零撓拖餐矢諭宴壇兀凝講牽毫騎顯掙菑忽拳雖鴻后腳沾拿蚤慘斜畿緡籤烏裝隊皂曹凶鏡羸鍾逼再摶性父吸釁衷泄幽柢楞彌韻蠻值驕澹鹵歲觸濡昭思偷擺瘠念私孫錘覽齋拆佻縮仞吻杠黑像壹個笮協剋淖漬製撰灰稷舊柎泊攤飭曼跨堂床跟瞀到淘劑潛摯爆導赫批味訂配響陣墊樊塗綴缺允限斬扒呵碎罔贅措敬演編捲女逐剽綱衙陌佗掌縷州賢油戴擊瑕乎廟始嬰橛雲脅輩兼膺郵陟墩陸朔爰丘套蹠久怒敵嘔碑票卜嗑喪儻伍扞聘兌香穰甫超汩訟唯費血磔穀勁股愈酸團啞杼貲臧壤窕坊彀脈依究鎗挈認踣逞褚壺厥驅攛畔裹算爵闊獸豆郊拙播沿掬熨男膠飄墮尖潤逮祥槃醜辦慮滅拗禮胞柏只勤透欽蚩亶餉挫燎鬧陂陋翔馬鉛儘揵夭巢欠探禦鹽馳餌姦屋糾迮綏苴虧力犀跑尾扢緊緯燥征酌闈遮駝摩彭困搏鈔溷裨錫霍狼帥館恆某署誅柴咨醒閑院奴鼻燭鬣蛇什瞑訪砌掃棧瑣雁捽盟悖辱偃耍焉玩寅隘縕絮剡墳擿菀音鳴柰梯柔築韜荷隤鱉碰予僕訓徂董槁拱竟幢辜旦樞暈誠潔雙鵠東壘猜最劫桀潮價揜刀柱膚捐迺酬汲控育邁淨麼溺農繹卬踧驚呈億勃聊麋槎嬌拾稚帝扈聚皮狹敖狠灼庚爍五護毗詡掊翁傒幅楯掣蜀咒茹秀窘僻否緒鞭侈影尤摻蜂攀寘扳溉絞妖沸翣羨梓吉瓊胎尉褒肩螺炮今勿緝梅隋墟狷搨驛例霧測遞夢孝掠媒贍涌稟濕谿踵卓併瑩篤鯁邀汗淋棄迤馴敺捎靚珥杓丹桂跕炙茲皋翦低春龕飧顏暫拒閫闋渥咽撅隙辛庶禪奠洪宇藩喝旌劍猒柯補擅佐膩忘永憂罪霸廬岐迂竿仍癡醮往嬴貝孛穢攏噫繁砥桴胙摹誣枚苗社樹午趺祇掐寺欲福狎榆詭曷貨瓦叢摟枕錠前顓魔迫恤咬竭南詩涂摺闖京瑱襚揄袍析漚怕嗄斤絡紐洛翹卿勢舋掘遼扭旬蹭促栗搜美仔乞擾巖捨細袞妃苑三晻閔稽迎伉吝綸囊愉寓擇這儲杜狄遏仇潦墜朦馱絲穹馭駭悔舞諱洽俗掀詆嘻獘諜雇驪羞誦宕竺謹漾它藝穆山狩採頡衽驩窺櫟慝敘銘掖獄淒殽棲汰健昆倪增閏蔚昔棹喬豸嘗皓趟系隩甄躋亟蠲浚霜韋禺圭吁抓眊罰含澆靳隅爪揉咋挨敢晃儉儳炕俶溝酋揖樁茶尺富哥倅訖鹿穎僉溲腰酉飯弧瞞後握些葉倫邱侍臥亥竦岳熬撐爬舒沛恬縵旨財爨矩怠畸鋌挹頻褶汪線享欒九摳褊虐弁瘦浩咎眉千慶嗇涎迭冶悠敕艱宰截咳召篆騶摧迪僭漕乖晞殖耳噦踞淩霅柄澀讀嗣眩逢複匱狃鐫賜件仡踴确他仵睢鉅妙殊茀晷撤拐萌桐轍閟狡闞陘蘊趾樸倩群壁腦挽洎綿冊朏苓楮歧洫湊漱瞎續盈漲寂諒僚詐萃觳窟隴纖終牆咻癉奮縻鐙彄悟丙噴諦苛裂診冰搔緘褰飫轅抬擢癟叱啜暉惛減稔杏購史巡劖械鏟煎淪郤撣願枳燋俊拈檀晏粥梵貉愍袪駔滂坌踔熯杵貿翳蹈恍纈諠郁矣莽鍛坏畦窅竇轂泠黜祿示釣鈐圜禾翕糟忌吼錢剔憮楊礧勸彎丸呴粲洮譽僂巧諍搬鄧苟翰雋愁擠檠確豎帑瘉鳩耽跗劃患姬朗籥并錞捱簿鬨李慎魏蕭輦埽盲袒髡洿獠雒甃覈堪搪荼沂丟核僵濃闢詮噎智閡競盼鬆嚇朕饋蔑汋軟渫闉怪詢輒耆蛻仗譯滌梧針警磊迕觚戛嫩纓雷妻殘岔拊豈嗆賸熙夜澄碩趙忙晚驀誼賀蔭刁檻寤匠氂杯聰蛾毆搉餔扛仕搊逾避孱虹羈鋸儷鑠醇坑簇卵逃藥濯撚輟煩煇沐蠟骫歇裕陬秉默需幻瑟哉闡郭棱槍郢吒腐閹謁恭撞繃鳳燼佩觜河嫌彼剎歌賤筒懿斟瞢雨嗤粉閭灶閤犧檐臆傖層匽遵蒐刓搖逋哀蠶黷堵垛蓬謙貪俯棒廠犍虜耎十眷林礱柞飽殯繭仆瓜孑屠紛暨呀整浹捧栽祠範砲儒憖織翠遑恪厖弭現兄叔駘屑軨耀槽厎弗婁遐鬚拌幫鐺酥粟鴆姑枷太擦枋腹桓銑早耿窾搦熹雝阼基鸞窒噯鞫鎔箋楗貸涅泚撿孟譜廝胄貆償匝抖傑寇曆棚逝插箕扃駿粗堅潼絜茇闔轄髮戟笑砧襯掎潘刃蓄籌訣授西趲俳悄塌洩擘緩澇擰綦詠恣鶬淬忍箱匈醴泮摔吾纔塵阬寮髯蜃嘯涯扯叨巾肯庾槌裾鈴斑詰簽嘶梭攖證亹吳戢階惹兵悍彊璧哈湔磷攪闚譚杭碼驟龢穩廡杌項卯徙纏憤祕譙纚湮奕弈轑駟住桁救嚼凱媵丑酢駒勉幣蟲評券瀉蒼改銓捵陀巂顆培搠暇恂肄絣旱宏餼厄戧倖卹骹桃喻勻箸雛臘眠貧鄗頒颯朽喑儋夥妥鈕炳乏噲掄沱廂冢懲龐朐躓涸柙咢抉蓼卸軹惑滔攜鉏譎漣鳥吞驗慌謷襟牝俏捄埋賣眯秩蹤繚曰菹燔觭毋姿煬額褭橐歆氐敏剸宦婆嵌靸膊電濩街捩弋絓潢詎刳悉瓠虺酷餽轢販瑰哲卞狗蹝赭唅葷拏想漠霎誰繄傭恰琴懾慧稜槷戌姚仲暮僨茭畎翊株鮭渙嬪叵萬孥蝦瞻礙瞽逕絃咱敞悼牡鯢貶盍撟僅藍酣睨怯閎浣鍵嶠瀾匏斁臻猝佃閼飂幔趯銛杝妝劾劣珍鐘篩泝鉦估翫楂百彝衿繒刊瞭畝唼徐銖漓眚愚疵哆劉軀榷麾筌誶疋寸棐隕舟貯賺麃貺謬敲森遜詒丞巔梨毬藪遙詹偈嘿纍遭睪愆浴俚劄葛茂劘禽蕝捺週寰霤餒你耦貤摭臂儔芻梏歡噤蹄曜嶷熒爚澧匿縹虔蹉贛碣卡腊姓份匯贐迥霄裔咂跱鞅釬鐍貰濊袟憨旆鉗蛩遒鞏買崖毖腓衄似蹔鏤茅鐃眴銀腴肇毳郡誇弢斡祚訐罩颩糝粵喋扼祲睦顙僮攙廓倘匣幼榛鏃迨斛屆七穗藹睆貊託央翟竹鶉怛擂臑售踅掂揆呂歿昵痒乂謫砭嚌諫寥圻飴猋祭鈹覷擲鑷垣膀哺肺腌誘註隄挩鑱覲蠡偎仄篦騁蘄恁苕蝨褎余琅阡醫划价儆坤尼暖淌囿駐棖婦枸袷轡掞淤園臉黏渧唬剿模揎箔扠戈慕哪甌蜮垓踝壟楙衲牘泐杪楔揳纂虎茫哇壅菆崎胔戀淜域嗔畯鏽邦烘脊輛拋鼠扆峙柒泉遰峒貀椹蔡賅跼倔黔趫贖戰琢嗢噪辣捋腔蹚桶剪箭窶戮幡麓奈泣町綰牖袗寖奢伸駛諄伽懼擗兔焰侑盆溶絆悲瞿佞刨浦球換紉煨葦嫗疚勵傲娥僦捏牛榻蛭倳靶斧橦悅粹澱鐸很蕉輮攄枻炷彫嚲沽蒿潰慊殉憶磅頸么訴騖霞豬互牓亙盬敧愀泱吧哄宁褪庳氛獷纑猱滲灣恢咀絭啐鞞驂妄貍盭溥樵呰畀轟曶訥蛆荑畬炸茬稿砍挐騏鬄俠撙半跐摋珠鄒城遫盾慆漻溟梃醋丐輅煤筍諺毅灝瀝禰銅芋淵災剌澍砑釜樣躍讚啖貂湘楦鏇椎儐硌臠暱燠夯脾汶怫魯帙慈櫑駢繕我返糊僤杷鬐逡蝎友詛囚笙儇泫撈埒丕睿簉茨膽洸豢霈甜誤讌醳租棓偪扱綢脆朵酤楬鏝拴穨賭舅麟茸閘擱馘泓焄篡鞬睽佈桑釃四網臾磴懃腆窳絀懣碾銚肫蔟缸藐蒲奸缶葺啄澳堇涓楷鱗窴撾玷姐纇殳亨嘉鍊屢泯忒嘖踆締瀧僇嗽境貓嘵熊甬虣汔賽鶩薌盦崑憐貘侮贈錙庵躄叛姻岑冬杆瓤蟻預秤啗蠹錦菌奩喣掤績釀圉鐻哩繡恐呢孕砦滓濛朅巷崒組繳隈罅蟄贄嘬漿罄廷甕黝窄廛級秒弇淈醬濼霓硎鴨椓閬囉棠慰佑譸廚縫柬裼皛奓攔綠曛嵎祗范蜜凄儼汁煉嶺扑諧恫衢覃穾饔斲儃臭齕軔磑誾芸裱咼埤苫壝奚冤璫揲垢謨濤貣朓刈猘斃焚撝莖遴婿迍綜譟嫡紘邏褻噩秏謇藻柤瓣晨霽勦儌眄噓疹蹩盥靺僑邛梳洶尹髀滄陡紡咈舄彪各偉猲胕觖棨澥邢紼縛鑊賃刪諮捶恨楫衎挻途站嘲侔柅听涿厝諷爐湣黍媮徯灺隹襆祼邅阤觕堆瘕匜躅稗匾熾愴賄淚澌晤譣杳鑣餅褫擋菲渴碕槧韶紓瑤浥筰阨觥佹憧攩皎迓杅柵芬閽凋芳窖媚嬭窨聒搒歪裛逴碓鐓哽喇篇廞閩爓耕鐶鉸痾狸妾惜廁鬯鸛几繼靠宓繞謚肖歟忮醉漼虖奎袢芑松堤滇米篸枵曉鶴窌蟠溱餳隻猾誚鋼抨胜婉閻魘蛋炬梡們沕屎詣剟胯拚恩煦柚助鯨烹翩談倜蚊唏滎饌桄輥孩啃茗璇嶒篹伶踡莎炤妲咶楛凜圩掗訬娣斐龔謊机闓繅鯊岨秪座畚痼毌鞘昂菜笴樏謳賕扮鎬跬畾隰櫛岸庇嗟映阯俾鞚儗濮黥液隃窆臚獶倭壎丈躥癸褲兇砸暵櫺祈柂晬茈荅猴喙撂糜蚑奭娃鴟踹娖桔攷墁歉殄譏攣迋搵筵摐燈饑虡搴蝕啼桯紕鰍坼雰讙駱霾縟汴獦趄銙旒娘瓢宋塔衒疐頷髁胠蓑柘彆湍餧盱瘞棼櫃瑞闟輾錐堡碧讖瞪棟仿柜隮霉矇朒企搧儵嗚欻肴嗌北憺柑餕嗎耨卦槨冀欿咮籀陼嘴櫓螫屹餤瘋艮踖愷懦豚窯佁縶俘陔嘏葭瞥裒胃川誥裸態彰燾坫閨袀魅沫睄惓邵舌縐驃枹瀸荊嶮讞頤債壩捭剉坻嘎澎戍筩暾龠綻諳崔煌悸攫盔嘛儺逌蠢趓榦臊欣恙顒倦巽銼姣楣奶諾孺赸靦鑄靄侉另愒宵崽櫝鍰蔣獧淥芟瘵佇憋昊麇礦媿篾踢鮑鬟技嫁圃汭悚釅欑峭扔邕簪啊詫翅牋懋燿儕倀瘳頏弘湟粒冪堋汝愬鴇脯嘩祀諉鮪渦淅歙杬鷙渚梆涵滈狙捫椴翬佼矻咯壚灘悌輓斿桉瘨躲鏜旃摜蟺擯襜蟾頖殪腸踶搰癘泌昇闥蜎噣膘鶻鶡愜紲黶禋豻耡鱟怳慷羊鱣諗歎萎樗澮鱠淠糖虓暄杙矰熛萑皦耄穠爿擎冗紆摓遘狐殣葵蔞臝濘眥釵痕己峽嶄椑璞懆宸滴棣佳闃汜汀貽諂紬誨絳晶俱傀懍疲菩穡殤娑懊憯伙趴鞶炰戕莞蔫蟜噬眺痿蝸鏦据栝咧腿巫珧欸驁遍踩罕脛鏗棬鮦訝唶櫬鰈蛤擫鏢祔霿琦礐僩髹皺拄涇蛙潁楨軑韝擐菅晾帕羶廋洼媼垝顥芥捂喳瘢騑熸磐沁囷槫帟姪縋鈍呃軛簳豗揩恕哮証鄭硜庖帔欺嬈誂紃瘖垸瀹脂啑釭碌憝懽頰哭薺裙汕姒鑰傴酖淀濬呶陛詶珪諢懶繂吶您瘧痞覜窬鷸瞋碭釱擄帊磧帢鈒暀縈鰾侗藎筠聆螻秘蜻鉒犢皆邋扐罹詗翌箴弼涔鵰搤忿筐濆曝捅渰噉閈泲夔儂頎杞胤髭蚶硼韘毼樛賚癩巒僄壬楅豳肝鱖鍭吽犖筱砉讒唇薅繢慁溓灊髓彤靨眢緇磣呆纛薾槐褱惕尪頁癰粘痹辮飢酒捆欐瀏廧嬗撢菟啍捥忤茵聿衩燀瘁妨憾跲瓶蘧齠愿榨鼇跛港卉椒儡吏弩胖俔柝偕粢恥匭殛櫳圮誒覡詖黻箇苹悛赦嘽鐔源黦瘣堀娩衃蒨廳咺婭饜霏膴燐嚜撻碗贓邶樅疸蝮褐偟璣慳阮紹祧畹啣堨欹拯斫邽弸荃蒩帛緄沍槿顉抌嬸踠髐馨齦輳蕡爟椷酪饕衕曦酇伴藨叮絹蕢募蜱祁繰膻芝銍拽鎛焯搓祓庋魂僥筋墠襮鰥嘄罥欄迾蹻撏鍚曳娛碴阽篁鬋裳蹍坳痺竁郃迄荏睟秭鈇齁礨鐮繻殢岏嬖毚涷蕤紗霣鮓衫諼齍盎笨此膈瀨黽唾罌寀哼鮆榔离蘢賂漭軿傘涴劓醆汃擣嗨彙衱堙齗刖鏊僰催揪踉縢忳痏蝟鈃癢絺吪瀼帨嫣鉋亳椿攉霝忸娉鍬軵堯耰漦吭藜恃晝叭顫韣檟潏磿躐靘崴驍萱泆嶲焜鱸浼塹惙焠殫耑蜚齏剴箐蕊芮蜆鷕异褕覘圪邯鱭籙甍蹡塘窪縝夬圂擭漉鋩晌綖忖詬噭甥氳忠拑鄔蚖菴紞晥倨姱鯤蟒溪脹鍖螭輴睹燉昒蔂六譴唔雩俵棰淮糨愧裘麴倏夙闒瀁紙瑒禘夠荐灕掔潭賧湑酳嗶飀肭耜饘纘橙迦誄雺嗯蹌緦鉉汛痘隳摎坦爺毉啁咫爹戇哏箍丱嚄笈蠃芴洵窣翾騭搗媾雚緬抿呿鰓桎筑惰繙墐烙棉膿睡胾蹕儭舂喘賵捃跧狨塼鄢晢斸餟矬慣劌胲湖餞朧蝥憔擩塾巳呫鑐呾醢熇箬腕鴉鴛縳棕蚳蔥帆駹寐攓軾抒呷絢悆囮瞶沔曬釤颼韙泑譖聱佰琯鷦剩緗慵忱炊閥冱澗磈薙蜿獮肘矮邠麷噱妮墅夤侏懺鋤袋牿篲菫鋗樘擷錚椽獃囤郟懵甦紋圬鹹痟蜒蛘鄴圄揍怵聃糞怙禍爌姥穟姁喭佯瞅搞韓燬嘰祛鉥埶饐鱄剚瘥捯轘縭尨譬彯仟嗾曀妣訌鏵髻嬲瞬嗡酅髇滫瀛旟戳俸擽鍪庀万碨悁疢簟噶笏愾擼儜傰慉潯棗餲鉼淙磋詷航菱稑摞汸坯秫掏赩瀦唄僝碇灸愣覓蕪硝焮篪彷揃棵蒞滷旻襁煽腫嗒轎誆嘍堥芼妹餪皤弰稀黟禱羹禬嵁笓癖僾飆鞔氓磽邰髽俎襞堊諤蛟聵萊杻矧瘟餡詀颭捘唵鏖笪邇覂譁唧孋鐏簸沌峨痱檜冽鏹膳塈茁婢泔荔葩鮐戊廕邾柀棍砰汧蹂禿塢攕椅黮蛀縞呱嘂兢庫斄蓱跚嬥庠姨譔犴稻湩馥欱鋦蹓酺涕逖穜瑋炫暘謠蜇讋銃俄毦璜幌箄衾鯖眙陊簏謎澨筳禊鉶嬛醺崢吵繣虆牲炭嵬缿翛柍禹船窗抇饉屨臬鬈慅餂憊磁淦潞汽黠訏肚僱梱嫚箝茜蘠寔陑舫矸橑療鐐描傻嵩鯗嘐潺餓嘒榼憀蜺囁犬撋襂檄烜癭悊卮檛磻篘菁藟拼鏘槮騸墆鈀檔稘軻蓮憭鯪瘺蛖漰蠯韏胸堰栘鏨胗丳渡渢桿戽繯蝗螝砠勘繖筭浯薪黿阪濱睇屐蜡笠攦湓狌瀅麈諶觝繪猳柟枰鋟煔邃黈轙斮徬焌漯巘霑輈剷搥畤掫洑咍廑篛喢薀棷誖蔀礉惎泬鑪渺柈筮儓燖槱牏敶囀躔氅囪枙茷絯玃喀嘸藕桼蓲謖歊禓牸劗蹯祴咕谾嚾詼帽鴝閷嘆畋喂陜伭橡綃袖呦踮訇楖蟆榭醞蘸舛眈矼鍠蒯麛蕘嗉頫硯暍澈蔕膾癃嘌鄡橚曇踒漁圌膹罡輵姆尿顰跎唌喧櫻餫葑虙堠槲觔栲絇殞鷩躉咄縑綹蔓駸訕蓍橢滃眹鐲昨蹦悴痤鬌隑薨輝薉岠钁喏縚魋簫淛笵惶蚧嫋溽摵搯魖訹怡鳶僎朾幬礎鳱壑啕揥氈褔趼憍珂厘邐瓏蠪騙蜩訑灃賻覯逭洊鱧茆飼惔渲齪喤陞潬妍鰩庂嗺黯燦吠椵疥柁醯諏俺黛頜江蠰痡碁蠼脤傃晼醷墉矞朘赬臷耏匊篷坡悽剬幃噷饁迻譺鳧豤抏懈洇鈸稠蜑襠涪釦顱齧慟簷抴礿裻跽斝泞嵞謅唉鬢蚕瘡椗礬蕙蛣髳洴觴昕喒肢啵浡琛傎訃嫮駃框惏皿仳臞虒襪祆閾稯缽瞠騍煖鯷舁瑜蚌頦噥燃挼泗炘酎樽豝癲轓谹樺虀覛擏蚺睍腋淢煜樔脣嫉筊莙籬驢麵睒蔘檮蝭鵯琮鄲盹帗苻睞磞抔僿腧潚祟躺孅鍱喿璋賬傂稙曖矗讜訶戔冏殼晒濌銻悕盞鍉黼肌苣騤努吷訧昱賑硾螯蠆蓯咡滉揀纊阞薶庬衊燙趐焱勇鱆抃皴烽緱黴瞧霆磢膜胚芘唦犆諴傿郾膬赶拮敹攮錡簨驒絻焙耖輻撼渹歕棋杉捕椆逿哿罐翮鹼挍臼脢瀰俛髂姝狺楹芓捌歭酘跢颿腑靃嶙耙陝硤扻奡店摷攆甯螓蝺厹楥偵丰搿蛔睫躒鈚襹伺餿蠅蚴昃欘蕞幨抻摛楓盉摦蟣殲嚙聶愓紳颸俟芽噞愔釿彴嘈椯佶莒轔萋鰷褖眑浞孳篰島崗邗逵鏐枇槭焞鷖浙堲跪昈鯉鉚羃劬嚷嗓蔪撕廈鑲奼悰嵯泒輠滬婚悾摙懞襻普唁澶旐愊裯緪皞蕑秸瘤媽頩娠騂庥漪椸甾杈昶悗茄螾疣鍼鞮馯櫰慄礪賠縿轃厂罘薧魟痢紝嬬鮀狖鵷樾唸蓧姤悢畽睎睚瀠蚣窐骸喊觟咭欙袂楸舀掾柷箠胹踽侃禡幪蹊佉挖崦狋諯趍岱摡幠刲媺慪暑鑴搳鎣賾粧瀕晡讟枌笳鈌徠藺荓藤鯈鷂袘勩拶宙萆詁褘笄儽謐哦鉈帷懌抎惝啻魵鉿喚驥螞樠矕泖鍥逑馹溏鷴鈗寨煮骴嗝靬怜痑糈盂媛鄹蹛嘟鮒埳廥螟芹曏漳盩灟搽棺纜菉蟃廿緌怢庨篠燮熅齰躇庉鮫鄶喃冉洳蝝瘴鈿汞佝雊柺謼橘瞰櫪諆襦嬉咥勖軺瑀鱊揕瓿蚹峘蹐菊砢乜醲汱沇秧瘯飣磯憬玦聾矉簭鼮鉞遄餬芔搕襴讄掜諰醑峿猿磳佔凹鶚峰恒仂麥稊謞莘謻鬷倆砮臍孀獀蓨啋砟痔胏鬃笞闍餾簁幓忝羿淄嚵緟輲趠蔇蘋淇鰨斢螇癮遹蝹琲騩艽挎讕躪盝冕歾瀑綺綣埏扤撊旭痂廄醵壙呣魶怗徉傛澡櫧啅虫覿鵝愕胳綆稒儈暌苶沜壖柿皖鄫桌玕洄嘳齡慓坪憩跣胝埴輖簞軬韍荄鼛旝晜瞟磩碻訒糅遝霰蹢祊鼜郛輣璆陾鱔箾醰齘獝琖鈲韉虯鄀崧簌蓊璽迅檥膞泜賨爝帘挪珮脽蜪狶鯔粱笭鑢艿葸謣儤鯧欓啦瀲湃秠鞦葇鸀虩絪輊豹敓汾拲濺鶄雎厤嘹膫瘼祺墝觩朣彖忺憸羛怔彘偅袚炒


===
===
===
输出文件:here
==>>:

view /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..新华字典.out.txt
view /sdcard/0my_files/tmp/out4py/script.排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.仅单字.txt

tar -xvf script/排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..新华字典.out.txt.tar.lzma -O | more
tar -xvf script/排序冫汉字牜按字义的字数..排序并串化冫汉字牜按字义的字数扌..汉语大辞典.out.仅单字.txt.tar.lzma -O | more

===
]]





from script.排序冫汉字牜按字义的字数 import *
]]]'''#'''
__all__ = r'''
排序并串化冫汉字牜按字义的字数扌
    排序冫汉字牜按字义的字数扌
        读取冫词典牜两行扌
        读取冫词典牜空行结尾扌
读取冫文本扌
'''.split()#'''
__all__
___begin_mark_of_excluded_global_names__0___ = ...
#.from itertools import islice
#.from seed.tiny_.check import check_type_is, check_int_ge
#.
#.from seed.abc.abc__ver1 import abstractmethod, override, ABC
#.from seed.for_libs.for_importlib__reload import clear_later_variables_if_reload_
#.clear_later_variables_if_reload_(globals(), '')
#.    # <<== seed.pkg_tools.ModuleReloader
#.from seed.helper.lazy_import__func import lazy_import4func_, lazy_import4funcs_, force_lazy_imported_func_
#.repr_helper = lazy_import4func_('seed.helper.repr_input', 'repr_helper', __name__)
#.lazy_import4funcs_('seed.tiny', 'mk_tuple,print_err,ifNone:ifNone_', __name__)
#.if 0:from seed.tiny import mk_tuple,print_err,ifNone as ifNone_ #xxx:null_tuple #xxx:echo,fst,snd
#.
#.
#.from seed.helper.repr_input import repr_helper
#.from seed.tiny_._Base4repr import _Base4repr
        #sf._reset4repr(may_args4repr, may_kwds4repr)
        #sf._init4repr(*args4repr, **kwds4repr)
___end_mark_of_excluded_global_names__0___ = ...

#.class __(ABC):
#.    __slots__ = ()
#.    ___no_slots_ok___ = True
#.    def __repr__(sf, /):
#.        return repr_helper(sf, *args, **kwargs)
#.if __name__ == "__main__":
#.    raise NotImplementedError(Exception, StopIteration)

def 读取冫文本扌(ipath, *, encoding='utf8'):
    with open(ipath, 'rt', encoding=encoding) as ifile:
        txt = ifile.read()
    return txt
_regex4filterout = r'(&\w+;|</?\w+>)'
def __():
    import re
    rex = re.compile(_regex4filterout)
    body = '<DIV>aaa<BR>&nbsp;</DIV>'
    content = rex.sub('', body)
    assert 0 < len(content) < len(body), (content, body)
    assert content == 'aaa', content
__()
def 读取冫词典牜两行扌(ipath, *, encoding='utf8', prefix4head=',', prefix4body=':', regex4filterout=_regex4filterout):
    txt = 读取冫文本扌(ipath, encoding=encoding)
    ss = txt.split('\n')
    assert not ss[-1]
    ss.pop()
    assert all(s.startswith(prefix4head if j&1==0 else prefix4body) for j,s in enumerate(ss))
    assert len(ss)&1 == 0
    import re
    rex = re.compile(regex4filterout)
    for j in range(0, len(ss), 2):
        head = ss[j].removeprefix(prefix4head)
        body = ss[j+1].removeprefix(prefix4body)
        entry = head
        content = rex.sub('', body)
        #if body.startswith('#'):
            #assert body == '#'*len(body), (entry, content)
            #AssertionError: ('牧民', '#################################################################################################################################################################################################################################################################################################################################################################################�，以禮樂為教，而聖人喜之，此千載牧民之良法。”清姚鼐《詠史》：“牧民豈謂非良幹，伐畔何教震友邦。”2.指治民的官。《三國志‧魏志‧明帝紀》：“其郎吏學通一經，才任牧民，博士課試，擢其高第者亟用。”《警世通言‧蘇知縣羅衫再合》：“我早登科甲，初任牧民，立心願為好官 。”3.牧區中以畜牧為主要職業的人。降邊嘉措《格桑梅朵》 第二十章：“由於牧民一般不吃魚，更不吃‘神湖’的魚，所以 這裏的魚根本不怕人。”碧野《雪路雲程》：“我們的小汽車離開蒙族牧民居住的和靖縣……飛奔在依山傍河的新開闢的烏庫公路上。”')
        if '###' in body:
            yield (entry, 0)
            continue
        assert not '#' in body
        assert 0 < len(content) < len(body), (entry, content)
            #AssertionError: ('牢髀', '###########################################################################################################################################################################################')
            #   ,牢髀
            #   :###########################################################################################################################################################################################
        yield (entry, len(content))
def 读取冫词典牜空行结尾扌(ipath, *, encoding='utf8', prefix4head=',', prefixes4body=':/', prefix4comment='#'):
    txt = 读取冫文本扌(ipath, encoding=encoding)
    ss = txt.split('\n\n')
    assert not ss[-1]
    ss.pop()
    ss = [s for s in ss if not s.startswith(prefix4comment)]
    assert all(s.startswith(prefix4head) for s in ss)
    for s in ss:
        (head, body) = s.split('\n', 1)
        ts = body.split('\n')
        assert all(any(t.startswith(prefix4body) for prefix4body in prefixes4body) for t in ts)
        entry = head.removeprefix(prefix4head)
        content = body
        yield (entry, len(content))

def 排序冫汉字牜按字义的字数扌(nm4reader, /, *args, **kwds):
    from seed.tiny_.funcs import snd
    f = globals()[nm4reader]
    it = f(*args, **kwds)
    return sorted(it, key=snd, reverse=True)
def 排序并串化冫汉字牜按字义的字数扌(nm4reader, /, *args, **kwds):
    for entry, count in 排序冫汉字牜按字义的字数扌(nm4reader, *args, **kwds):
        yield f'{entry!s}:{count!r}'

__all__
#[f,g] = lazy_import4funcs_('script.排序冫汉字牜按字义的字数', 'f,g', __name__)
from script.排序冫汉字牜按字义的字数 import *
