#__all__:goto
r'''[[[
e script/收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地.py
view ../../python3_src/nn_ns/CJK/cjk_subsets/收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地-20241213.py
    cp -iv script/收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地.py ../../python3_src/nn_ns/CJK/cjk_subsets/收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地-20241213.py

view ../../python3_src/nn_ns/CJK/cjk_subsets/hanzi.py
    cjk_common_subset_2513
        => base_encodins4cjk
view ../../python3_src/seed/text/charset_filter.py
    EncodingCharFilter(encoding).to_NonTouchRanges()/.to_CharsetCharFilter()
view ../../python3_src/nn_ns/CJK/CJK_data/汉字繁简.py
    简体字到繁体字串


script.收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地
py -m nn_ns.app.debug_cmd   script.收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地 -x # -off_defs
py -m nn_ns.app.doctest_cmd script.收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地:__doc__ -ht # -ff -df

[[
view ../../python3_src/nn_ns/CJK/cjk_subsets/hanzi.py

cjk_common_subset_2513
    # cjk_part of (big5&cp949&gb2312&iso2022_jp)
]]


py_adhoc_call   script.收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地   ,str.收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地扌  >  /sdcard/0my_files/tmp/0tmp
view /sdcard/0my_files/tmp/0tmp

]]]'''#'''
__all__ = r'''
收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地扌
    base_encodins4cjk
'''.split()#'''
__all__
___begin_mark_of_excluded_global_names__0___ = ...
___end_mark_of_excluded_global_names__0___ = ...
base_encodins4cjk = tuple(sorted(r'big5 cp949 gb2312 iso2022_jp'.split()))

def 收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地扌(base_encodins4cjk=base_encodins4cjk):
    '-> (encodings, szs4encodings, len_hzs7common, len_hzs8half_result, hzs8half_result, news_with_TS_closure, len_hzs8result, hzs8result)'
    #old: '-> (len_hzs7common, len_hzs8half_result, hzs8half_result, len_hzs8result, hzs8result)'
    #old: '-> (len_hzs8result, hzs8result)'
    ######################
    import unicodedata
    char2may_name_ = unicodedata.name
    def is_hz_(ch, /):
        return char2may_name_(ch, '').startswith('CJK')

    ######################
    from nn_ns.CJK.CJK_data.汉字繁简 import 简繁字对集, 繁体字到简体字串, 简体字到繁体字串
    from nn_ns.CJK.CJK_data.汉字繁简 import 简繁字对集, 繁体字到简体字串, 简体字到繁体字串
    from seed.text.charset_filter import EncodingCharFilter
    from seed.data_funcs.rngs import IRanges
    ######################
    ######################
    js5encoding = {}
    encodings = []
    jss4encodings = []
    for encoding in base_encodins4cjk:
        if encoding in js5encoding:
            continue
        char_filter = EncodingCharFilter(encoding)
        assert char_filter.is_good_char_ord(ord('一')), encoding
        char_filter.to_CharsetCharFilter()
        js4encoding = char_filter.to_NonTouchRanges()
        js5encoding[encoding] = js4encoding
        encodings.append(encoding)
        jss4encodings.append(js4encoding)
    jss4encodings
    encodings
    js5encoding
    szs4encodings = [js.len_ints() for js in jss4encodings]
    ######################
    if not encodings:raise TypeError
    ######################
    js7common = jss4encodings[0]
    js7whole = jss4encodings[0]
    for js4encoding in jss4encodings:
        js7common &= js4encoding
        js7whole |= js4encoding
    js7common
    js7whole
    js7other = js7whole -js7common
    ######################
    js7common = IRanges.from_sorted_ints(j for j in js7common.iter_ints() if is_hz_(chr(j)))
    len_hzs7common = js7common.len_ints()
    ######################
    j_set = set()
    def puts(js, /):
        for _ in map(put, js):pass
    #def put(j, /):
    put = j_set.add
    j_js_pairs = []
    def on_news_(j4S, js4T, /):
        if not js4T:return
        j_js_pairs.append((j4S, js4T))
    if len(简体字到繁体字串) < js7whole.len_ints():
        def iter_S_Ts_():
            return iter(简体字到繁体字串.items())
        iter_S_Ts_
    else:
        def iter_S_Ts_():
            get = 简体字到繁体字串.get
            for j in js7whole.iter_ints():
                m = get(ch:=chr(j))
                if m:
                    yield (简体字:=ch, 繁体字串:=m)
        iter_S_Ts_
    iter_S_Ts_
    for 简体字, 繁体字串 in iter_S_Ts_():
        #for 简体字, 繁体字串 in 简体字到繁体字串.items():
        if not is_hz_(简体字):
            continue
        j4S = ord(简体字)
        if not j4S in js7whole:
            continue
        js4T = tuple(j for j in map(ord, 繁体字串) if j in js7other)
            # exclude js7common:
            #   !! j_set |= js7common
        if not js4T:
            continue
        if j4S in js7common:
            #put(j4S)
                # exclude js7common:
                #   !! j_set |= js7common
            puts(js4T)
            on_news_(j4S, js4T)
            continue
        for encoding in encodings:
            js4encoding = js5encoding[encoding]
            #bug:if j4S in js5encoding: continue
            if j4S in js4encoding: continue
            #encoding4fail = encoding
            js4T = tuple(j for j in js4T if j in js4encoding)
            if not js4T:break
        js4T
        if js4T:
            put(j4S)
            puts(js4T)
            on_news_(j4S, js4T)
    j_js_pairs.sort()
    j_set
    #j_set = {j for j in j_set if is_hz_(chr(j))}
    news_with_TS_closure = 新增汉字耂简繁扩充 = ';'.join(f'{简体字}:{繁体字串}' for (j4S, js4T) in j_js_pairs for 简体字, 繁体字串 in [(chr(j4S), ''.join(map(chr, sorted(js4T))))])
    ######################
    if 0:
        j_set |= js7common
            # TypeError: unsupported operand type(s) for |=: 'set' and 'NonTouchRanges'
        js8result = IRanges.from_unsorted_ints(j_set)
    else:
        js8half_result = IRanges.from_unsorted_ints(j_set)
        # news_with_TS_closure >= half_result
        js8result = js8half_result | js7common
    js8result
    ######################
    #len_hzs8result = total = js8result.len_ints()
    hzs8result = js8result.to_chars__str()
    len_hzs8result = len(hzs8result)
        #5455 # cjk_common_subset_TS_covered_extension_5455/共享汉字字集牜简繁覆盖扩增
    len_hzs7common = js7common.len_ints()
        #2513 # cjk_common_subset_2513/共享汉字字集
    hzs8half_result = js8half_result.to_chars__str()
    len_hzs8half_result = len(hzs8half_result)
        #2942 # cjk_TS_covered_extension_of_cjk_common_subset_2942/简繁覆盖扩增字集纟共享汉字字集
    return (encodings, szs4encodings, len_hzs7common, len_hzs8half_result, hzs8half_result, news_with_TS_closure, len_hzs8result, hzs8result)

    ######################
    ######################

r'''[[[
result after fixed bug:『if j4S in js5encoding: continue』
[2513+2942==5455]
[2513/len_hzs7common+2942/len_hzs8half_result==5455/len_hzs8result]
===
['big5', 'cp949', 'gb2312', 'iso2022_jp']
[13834, 17176, 7573, 7009]
2513 # cjk_common_subset_2513/共享汉字字集
===
s/.\{16}/\0\r/g
2942 # cjk_TS_covered_extension_of_cjk_common_subset_2942/简繁覆盖扩增字集纟共享汉字字集
与专业丛东丝两严丧个临丽义乌乐乔
乗习书买乱亂争亏亘亙亚亞亩亲亵亿
仅仆从仑仓仪们仿伕优会伞伟传伤伦
伫佇佈体佔佣佥侄來侖侠価侣侥侦侧
侨侶侷係俞俠俨俩俪俭倆倉個們倖倣
倫债倾偉側偵偷偸偿傑傘備傚傢储傩
傭傳債傷傾僅僉僊僑僕僥僱價儀億儉
償優儲儷儺儼儿兇兌兎兑兒兔党內兩
兪兰关兴养兽内冈冊册冑写军农冢冪
冯冲决况冻净凉凍减凑凖凛凜几凤凫
凭凯凱凿刍划刘则刚创删別刧刪别刹
剂則剋剎剑剛剝剥剧剰創劃劄劇劉劍
劑劝务动励劲劳劻势勁勋動勖勗務勝
勞勢勣勦勳勵勸匯区医區华协協单卖
卢卤卧卫即却卹卻卽厂厅压厌厢厦厨
厭县参參双发变叠叢叶号叹吋吒吕吞
听呂呎呑呕呗员呜咏咚咤响哗員唄唤
唸問啗啣啬啮啸喆喚喦喪喫喬單喷嗇
嗚嘆嘔嘗嘘嘯嘱噓噴嚥嚮嚯嚴囑囘团
园围国图圆國圍圏園圓圖團圣圹场坏
块坚坛坞坟坠垄垅垒垦垩埰執埼堅堊
堑堕堯報場塊塋塗塚塡塢填塵塹増墙
墜增墮墳墾壇壓壘壙壞壟壮壯声壳壶
壺壽处备复夢头夸夹夺夾奂奋奐奥奧
奪奮妇姙姦姪娄娇婁婦婬婵媿嫔嬋嬌
嬢嬪孃孙学孫學宁宝实宠审宪宫宮宾
寀寝寢實寧審寫寵寶对寻导寿尅将將
專尋對導尔尘尙尚尝尧尽层屆届屍屏
屛属屡屢層屬屿岂岖岗岚岛岡岭峡峦
峩島峽崑崗崙崧嵐嵒嶇嶺嶼嶽巌巒巖
巢巣巩巻币帅师帐帘帜帥带帧師帳帶
幀幂幟幣并幹幾广庆庐库应庙废庫廂
廈廚廟廠廢廣廬廳廻廼开异弃弑弒弔
张弥弯張強弹强彈彊彌彎归当彙彥彦
彫彻彿径徑徕從徠復徬徳徴徵德徹徼
忆忏忧忾怀态怂怃怆总恆恋恒恥恳恵
恶恸恻恼恿悅悦悬悯悶悽惊惡惧惨惩
惫惮惯惱惻愛愤愴愼愾慂慄慇態慎慘
慟慣慫慮慶慼慾憂憊憐憑憚憤憫憮憲
憶懃懇應懒懞懲懶懷懸懺懼戀战戰扎
扑払执扩扫扬扰抚抛护报抬担拋拝拟
拣拥拨择挂挚挛挞挟挠挥挶挾捆捞损
换捣捨捲掃掛採掷揀揚換揮揹揽搅損
搖搗搨携搾摄摆摇摯撈撓撚撥撫撲撻
擁擇擔據擡擬擲擴擺擾攜攝攣攪攬攷
敌敎敗教敛数敵數斂斃斋斩斬断斷旂
旛无旧时旷昇昙昼显時晉晋晓晔晕晖
晝暂暈暉暢暧暫曄曇曉曏曖曠書會朧
朮术朵朶杀杂权条来杨杪東极构枢枣
枪枫枭枴柜柵柺栀栅标栈栉栋栏树样
栾桡桥桦桧桿梔條梟梦梱检棄棌棗棟
棧棱棲椁楊楓業極楼概榄榈榖榦榨榮
槃構槍槛槟槨槪樂樑樓標樞樣横樯樱
樴樸樹樺橈橋機橦橫橹檜檢檣檯檳檻
櫂櫃櫓櫚櫛櫱櫻欄權欒欖欢欤欧欽歎
歐歟歡歸歼歿殀殁残殒殘殞殡殯殲殴
殺殼毀毁毆毌毎每毕毙毡毬氈气氣氾
汇汉汎汚污汤汹決沉沒沖沟没沥沦沧
況泪泷泸泻泽洁洒洩洶洼浃浅浆浊测
济浏浑浒浓浹涂涉涛涟涡涣涤润涧涨
涼淒淚淨淩淪淵淸淺清渉渊渍渐渔渖
渗渙減渦温測渾湊湣湧湯湾湿溃溉準
溝溫滄滅滌滚滞满滤滥滨滩滯滲滸滾
滿漁漑漢漣漤漬漲漸漿潁潅潇潔潛潜
潟潤潰澂澔澗澜澤澱濁濃濒濕濛濟濤
濫濬濱濾瀉瀋瀏瀕瀘瀝瀟瀧瀾灑灘灣
灭灯灵災灾灿炀炉炖炤炫炮点炼炽烂
烏烛烟烦烧烬热焔焕無焰煉煖煙煥煩
煬熱熾燈燉燐燒營燦燬燭燻燼燿爐爛
爭爱爷爺爾牀牆牍牘牴牵牺牽犇犊犢
犧状犹狀狈狞独狭狮狯狱狹狽猎猪猫
猬献猶獄獅獨獪獭獰獲獵獸獺獻玛环
现玺珐珑珪珮珲現琍琯琱琺琼琿瑤瑩
瑪瑯瑶璎環璽瓊瓏瓔瓶甁甕甦甯电畄
畅畝畢異畴當疇疊疗疡疮疱痈痉痙痠
痲痳痹痺瘉瘍瘡療癒癞癡癢癣癥癩癫
癬癰癲發皰皱皺盃盏盐监盖盗盘盜盞
盡監盤盧着睏睑睪瞋瞒瞞瞭瞼矇矫矯
矶矽矾码砚砲砺砾础硃硕确硯碁碍碕
碩確碼磙磯磷礎礙礪礫礬礼祂祇祐祕
祯祷祸祿禀禄禅禍禎禦禪禮禱离禿秃
秆种积称秽稅稈税稜稟種稱稲稳穀穂
積穎穑穡穢穩穫穷窃窍窑窜窝窥窦窩
窪窮窯窺竄竅竇竊竝竞競笃笋笔笺笼
筆筍筛筝筱筹签简箇箋箏箪箫節範築
篠篤篩篮篱篲簑簞簡簫簽簾籃籌籐籠
籤籬类粪粮糞糢糧糾紀紂約紅紆紋納
紐純紗紙級紛紡紧紮細紳紹紺終絃組
絆結絞絡絢給絨統絲絳絹綏經綜綢綬
維綱網綴綵綸綺綻綽綾綿緇緊緋緘線
緝緞締緡編緩緬緯練緻縉縊縛縞縟縣
縫縮縯縱縷總績繃繆繈織繕繞繦繩繪
繫繭繰繹繼續纍纏纓纔纖纜纠纡红纣
纤约级纪纬纯纱纲纳纵纶纷纸纹纺纽
线绀练组绅细织终绊绍绎经绒结绕绘
给绚绛络绞统绢绥绦继绩绫续绮绯绰
绳维绵绶绷绸综绽缀缁缄缅缆缉缎缓
缔缕编缗缙缚缛缝缟缠缢缨缩缪缮缲
罂罋罌网罗罚罢罰罵罷羁羅羈羡羨義
習翘翹耑耡耸耻聋职联聖聞聪聯聰聲
聳職聽聾肃肅肠肤肾肿胀胁胆胜胧胫
胶脅脈脉脍脏脐脑脓脚脛脣脩脫脱脹
腊腎腦腫腳腸腾膚膠膽膾膿臍臘臟臥
臨臺舄舆與興舊舣舰舱艙艤艦艰艱艸
艹艺节芜芦芻苇苍苎苏苧茍茎茔茧荅
荆荊荐荘荚荞荠荡荣荨荫药荳莊莖莢
莱莲莳获莹莺莼菇菓華菴菸萊萝萤营
萧萨萬葉葦葯葱蒋蒐蒔蒼蓆蓋蓝蓦蓮
蓴蔆蔔蔘蔣蔥蔭蔷蔺蕁蕎蕓蕩蕪蕭蕴
薑薔薙薦薩薫薮薰薺藍藓藝藥藪藷藺
蘆蘇蘊蘖蘗蘚蘭蘿虏虑處虖虚虛虜號
虧虫虱虽虾蚀蚁蚕蛊蛎蛮蛰蛲蜗蝇蝉
蝕蝟蝦蝨蝸螢蟄蟬蟯蟲蟻蠅蠍蠣蠱蠶
蠻衊衒術衔衕衚衛衝补衮衹袜袞袭袷
装裏補裝裡製複褛褴褸褻襤襪襲覇覈
見規覓視覜覡親覲覺覽觀见观规觅视
览觉觋觐觔觝觞触觴觸訂訃計訊訌討
訓訖託記訛訝訟訢訣訥訪設許訴訶診
註詐詔評詛詞詠詢詣試詩詭詮詰話該
詳誅誇誉誊誌認誕誘語誠誡誣誤誥誦
誨誰課誹誼調諂諄談請諍諏諒論諛諜
諠諡諦諧諫諭諮諱諷諸諺諾謀謁謂謄
謎謐謔謖謗謙謚講謝謠謨謫謬謳謹謼
譁證譎譏識譚譜譯議譴護譽讀變讌讎
讒讓讖讚计订讣认讥讧讨让讫训议讯
记讲讳讴讶讷许讹论讼讽设访诀证诃
评诅识诈诉诊词诏译试诗诘诚诛话诞
诠诡询诣诤该详诫诬语误诰诱诲诵请
诸诹诺读诽课谀谁调谄谅谆谈谊谋谍
谏谐谑谒谓谕谗谘谚谛谜谟谡谢谣谤
谥谦谧谨谪谬谭谱谲谴谶谿豈豬貍貓
貝貞負財貢貧貨販貪貫責貯貰貳貴貶
買貸費貼貽貿賀賁賂賃賄資賈賊賑賓
賚賜賞賠賢賣賤賦質賭賸賻購賽贄贅
贈贊贍贓贖贝贞负贡财责贤败货质贩
贪贫贬购贮贯贰贱贲贳贴贵贷贸费贺
贻贼贽贾贿赁赂赃资赈赉赋赌赍赎赏
赐赔赘赙赛赞赠赡赵趋趙趨跃跖跡践
跼踌踐踪踰踴蹟蹠蹤蹧躊躍躏躪躯軀
車軋軌軍軒軟軫軸軻軾較輅載輒輓輔
輕輛輜輝輟輦輩輪輯輳輸輻輾輿轄轅
轉轍轎轟轢车轧轨轩转轮软轰轲轴轸
轹轻轼载轿辂较辄辅辆辇辈辉辍辎辏
辐辑输辕辖辗辙辞辟辩辭辯農边辽达
迁过迈运还这进远违连迟迩迳迴迹迺
迻适选逊递逕這連週進逻遊運過達違
遗遙遜遝遞遠遥適遲遷選遺遼邁還邇
邊邏邨邮邹郃郑郵郸鄒鄭鄲酿醜醫醼
釀释釋釐釘針釣釧釵鈍鈑鈔鈞鈴鈿鉅
鉉鉗鉛鉞鉤鉦鉴銀銃銅銑銓銖銘銜銷
鋏鋒鋤鋪鋸鋼錐錘錚錠錢錦錨錫錮錯
錶鍋鍍鍔鍛鍵鍼鍾鎖鎚鎧鎬鎰鏃鏇鏑
鏚鏡鏤鐘鐫鐵鐸鑄鑑鑒鑵鑽鑿针钉钏
钓钗钜钝钟钢钣钦钧钩钱钲钳钺钻钿
铁铃铅铉铎铗铜铠铢铣铨铭铮铳银铸
铺销锁锄锅锋错锚锡锢锤锥锦锭键锯
锷锺锻镀镂镌镐镒镜镝镞镟長长門閃
閉開閏閑間閔閘閣閤閥閧閨閭閻閼闆
闇闊闔闕闖闘關闡闢门闪闭问闯闰闲
间闵闷闸闹闺闻闾阀阁阎阏阐阔阖阙
队阨阬阯阳阴阵阶际陆陈陕陜陝陞陣
陥陨险陰陳陸陽隄隊階随隐隕際隨險
隱隻隽难雋雏雖雙雛雜離難雲雳電雾
霁霉霑霤霧霭霸霽靂靄靈靑青静靜鞏
鞦韆韋韓韜韦韩韬韵韻響頁頂頃項順
須頌預頑頒頓頗領頫頭頸頻顆題額顎
願類顧顫顯页顶顷项顺须顽顾顿颁颂
预领颇颈颍频颖颗题颚额颤風颯颱颳
飄风飒飘飛飞飢飨飭飯飴飼飽飾餃餉
養餌餓餘餚餞館餬饅饉饋饌饑饒饗饥
饬饭饯饰饱饲饴饵饶饷饺饿馀馆馈馑
馒馔馬馭馮馳馴駁駐駑駒駕駝駟駭駱
駿騁騎騏騙騫騰騷驀驃驅驍驕驗驚驛
驟驢驥驩驪马驭驯驰驱驳驴驷驹驻驼
驽驾驿骁骂骄骆骇骊骋验骏骐骑骗骚
骞骠骤骥體髮髴鬆鬍鬚鬥鬧鬨鬪鬱魚
魯鮑鮫鮮鯉鯖鯤鯨鰍鰒鰥鰲鰻鱗鱼鲁
鲍鲛鲜鲤鲭鲲鲸鳅鳆鳌鳏鳗鳞鳥鳧鳩
鳳鳴鳶鴉鴛鴦鴨鴻鵑鵝鵠鵡鵬鵰鵲鶩
鶯鶴鷰鷲鷸鷹鷺鸚鸞鸟鸠鸢鸣鸦鸭鸯
鸳鸾鸿鹃鹄鹅鹉鹊鹏鹜鹤鹦鹫鹬鹭鹰
鹵鹹鹽麗麤麥麦麪麴麵麹黃黄黑黒點
黨黴鼇鼕鼡齊齋齎齐齒齟齡齣齧齪齬
齷齿龃龄龉龊龌龍龕龙龛龜龟龢
===
s/.\{16}[^;]*/\0\r/g
万:萬;与:與;丑:醜;专:專;业:業
;丛:叢;东:東;丝:絲;两:兩
;严:嚴;丧:喪;个:個箇;临:臨
;丽:麗;乃:廼迺;义:義;乌:烏
;乐:樂;乔:喬;乘:乗;习:習
;书:書;买:買;乱:亂;乾:幹榦
;了:瞭;争:爭;亏:虧;云:雲
;亘:亙;亚:亞;亩:畝;亲:親
;亵:褻;亿:億;仅:僅;仆:僕
;仇:讎;从:從;仑:侖崙;仓:倉
;他:祂;仙:僊;仪:儀;们:們
;价:価價;仿:倣;优:優;会:會
;伞:傘;伟:偉;传:傳;伤:傷
;伦:倫;伫:佇;佑:祐;体:體
;余:餘;佛:彿髴;佣:傭;佥:僉
;佩:珮;侄:姪;侠:俠;侣:侶
;侥:僥;侦:偵;侧:側;侨:僑
;俞:兪;俨:儼;俩:倆;俪:儷
;俭:儉;修:脩;俯:頫;债:債
;倾:傾;偷:偸;偿:償;储:儲
;傩:儺;儿:兒;克:剋尅;兑:兌
;兔:兎;党:黨;兰:蘭;关:關
;兴:興;养:養;兽:獸;内:內
;冈:岡;册:冊;写:寫;军:軍
;农:農;冢:塚;冬:咚鼕;冯:馮
;冲:沖衝;决:決;况:況;冻:凍
;净:淨;凄:悽淒;准:凖準;凉:涼
;凌:淩;减:減;凑:湊;凛:凜
;几:幾;凤:鳳;凫:鳧;凭:憑
;凯:凱;凶:兇;出:齣;凿:鑿
;刍:芻;划:劃;刘:劉;则:則
;刚:剛;创:創;删:刪;别:別
;刮:颳;制:製;刹:剎;剂:劑
;剃:薙;剑:劍;剥:剝;剧:劇
;剩:剰賸;剿:勦;劝:勸;务:務
;动:動;助:耡;劫:刧;励:勵
;劲:勁;劳:勞;势:勢;勋:勳
;勖:勗;勤:懃;匡:劻;区:區
;医:醫;千:韆;升:昇陞;华:華
;协:協;单:單;卖:賣;卜:蔔
;占:佔;卢:盧;卤:鹵;卧:臥
;卫:衛;即:卽;却:卻;卷:巻捲
;厂:廠;厄:阨;厅:廳;压:壓
;厌:厭;厘:釐;厢:廂;厦:廈
;厨:廚;县:縣;参:參蔘;双:雙
;发:發髮;变:變;叠:疊;只:祇衹隻
;台:檯臺颱;叶:葉;号:號;叹:嘆歎
;吃:喫;合:郃閤;吊:弔;同:衕
;向:嚮曏;吒:咤;吕:呂;吞:呑
;听:聽;呕:嘔;呗:唄;员:員
;呜:嗚;周:週;呼:虖謼;和:龢
;咏:詠;咤:吒;咨:諮;咸:鹹
;咽:嚥;哄:閧鬨;响:響;哗:譁
;哲:喆;唇:脣;唤:喚;啖:啗
;啬:嗇;啮:齧;啸:嘯;喧:諠
;喷:噴;嗔:瞋;嘘:噓;嘱:囑
;嚯:謔;回:囘廻迴;团:團;园:園
;困:睏;围:圍;国:國;图:圖
;圆:圓;圈:圏;圣:聖;圭:珪
;圹:壙;场:場;址:阯;坏:壞
;坑:阬;块:塊;坚:堅;坛:壇
;坞:塢;坟:墳;坠:墜;垄:壟
;垅:壟;垒:壘;垦:墾;垩:堊
;堑:塹;堕:墮;堤:隄;填:塡
;墙:牆;增:増;壮:壯;声:聲
;壳:殼;壶:壺;处:處;备:備
;复:復複;夫:伕;夭:殀;头:頭
;夸:誇;夹:夾挾;夺:奪;夾:袷
;奂:奐;奋:奮;奔:犇;奥:奧
;奸:姦;妇:婦;妊:姙;姜:薑
;娄:婁;娇:嬌;娘:嬢孃;婵:嬋
;嫔:嬪;孙:孫;学:學;宁:寧
;宝:寶;实:實;宠:寵;审:審
;宪:憲;宫:宮;宴:讌醼;家:傢
;宾:賓;寝:寢;寸:吋;对:對
;寻:尋;导:導;寿:壽;将:將
;尔:爾;尘:塵;尚:尙;尝:嘗
;尧:堯;尸:屍;尺:呎;尽:盡
;局:侷挶跼;层:層;届:屆;屏:屛
;属:屬;屡:屢;屿:嶼;岂:豈
;岖:嶇;岗:崗;岚:嵐;岛:島
;岩:喦嵒巌巖;岭:嶺;岳:嶽;峡:峽
;峦:巒;峨:峩;崎:埼碕;嵩:崧
;巢:巣;巨:鉅钜;巩:鞏;币:幣
;布:佈;帅:帥;师:師;帐:帳
;帘:簾;帜:幟;带:帶;帧:幀
;席:蓆;幂:冪;幡:旛;幢:橦
;干:幹榦;并:竝;幸:倖;广:廣
;庄:荘莊;庆:慶;床:牀;庐:廬
;库:庫;应:應;庙:廟;废:廢
;庵:厂广菴;开:開;异:異;弃:棄
;弑:弒;张:張;弥:彌;弦:絃
;弯:彎;弹:彈;强:強彊;归:歸
;当:當;彗:篲;彦:彥;彩:綵
;彷:仿徬;彻:徹;征:徴徵;径:徑逕
;徕:徠;御:禦;德:徳;徼:僥
;忆:憶;忏:懺;志:誌;忧:憂
;念:唸;忾:愾;怀:懷;态:態
;怂:慫;怃:憮;怆:愴;怜:憐
;总:總;恋:戀;恒:恆;恤:卹
;恳:懇;恶:惡;恸:慟;恻:惻
;恼:惱;恿:慂;悦:悅;悬:懸
;悯:憫;惊:驚;惠:恵;惧:懼
;惨:慘;惩:懲;惫:憊;惮:憚
;惯:慣;愈:瘉癒;愍:湣;愤:憤
;愧:媿;愿:願;慎:愼;懒:懶
;战:戰;戚:慼鏚;才:纔;扎:紮
;扑:撲;托:託;执:執;扩:擴
;扫:掃;扬:揚;扰:擾;抄:杪鈔
;抚:撫;抛:拋;护:護;报:報
;抬:擡;抵:牴觝;拂:払;担:擔
;拈:撚;拐:枴柺;拓:搨;拜:拝
;拟:擬;拣:揀;拥:擁;拨:撥
;择:擇;挂:掛;挚:摯;挛:攣
;挞:撻;挟:夾挾;挠:撓;挥:揮
;挽:輓;捆:梱;捞:撈;损:損
;换:換;捣:搗;据:據;捻:撚
;掷:擲;揽:攬;搅:攪;搜:蒐
;携:攜;摄:攝;摆:擺;摇:搖
;效:傚;敌:敵;教:敎;敛:斂
;数:數;斋:齋;斗:闘鬥鬪;斤:觔
;斩:斬;断:斷;旋:鏇镟;旗:旂
;无:無;旧:舊;时:時;旷:曠
;昆:崑;昙:曇;昼:晝;显:顯
;晋:晉;晓:曉;晔:曄;晕:暈
;晖:暉;暂:暫;暖:煖;暗:闇
;暧:曖;曲:麴;札:劄;术:朮術
;朱:硃;朴:樸;朵:朶;机:機
;杀:殺;杂:雜;权:權;杆:桿
;村:邨;条:條;来:來;杨:楊
;杯:盃;杰:傑;松:鬆;板:闆
;极:極;构:構;果:菓;枢:樞
;枣:棗;枪:槍;枫:楓;枭:梟
;枳:樴;柜:櫃;栀:梔;栅:柵
;标:標;栈:棧;栉:櫛;栋:棟
;栏:欄;树:樹;栖:棲;栗:慄
;样:樣;核:覈;栾:欒;桡:橈
;桥:橋;桦:樺;桧:檜;梁:樑
;梦:夢;检:檢;棋:碁;棱:稜
;棹:櫂;椁:槨;楼:樓;概:槪
;榄:欖;榈:櫚;榨:搾;槛:檻
;槟:檳;模:糢;横:橫;樯:檣
;樱:櫻;橹:櫓;欢:歡驩;欣:訢
;欤:歟;欧:歐;欲:慾;歼:殲
;殁:歿;残:殘;殒:殞;殡:殯
;殴:毆;殷:慇;毁:毀燬;毋:毌
;每:毎;毕:畢;毙:斃;毡:氈
;气:氣;汇:匯彙;汉:漢;污:汚
;汤:湯;汹:洶;沈:沉瀋;沓:遝
;沟:溝;没:沒;沥:瀝;沦:淪
;沧:滄;沾:霑;泄:洩;泛:氾汎
;注:註;泪:淚;泷:瀧;泸:瀘
;泻:瀉;泽:澤;洁:潔;洒:灑
;洼:窪;浃:浹;浅:淺;浆:漿
;浊:濁;测:測;济:濟;浏:瀏
;浑:渾;浒:滸;浓:濃;浚:濬
;浩:澔;涂:塗;涉:渉;涌:湧
;涛:濤;涟:漣;涡:渦;涣:渙
;涤:滌;润:潤;涧:澗;涨:漲
;淀:澱;淋:痳;淫:婬;清:淸
;渊:淵;渍:漬;渐:漸;渔:漁
;渖:瀋;渗:滲;温:溫;游:遊
;湾:灣;湿:濕;溃:潰;溉:漑
;溜:霤;溪:谿;滚:滾;滞:滯
;满:滿;滤:濾;滥:濫;滨:濱
;滩:灘;演:縯;漤:濫;潇:瀟
;潜:潛;澄:澂;澜:瀾;濒:瀕
;灌:潅;灭:滅;灯:燈;灵:靈
;灾:災;灿:燦;炀:煬;炉:爐
;炖:燉;炫:衒;炮:砲;点:點
;炼:煉;炽:熾;烂:爛;烛:燭
;烟:煙菸;烦:煩;烧:燒;烬:燼
;热:熱;焕:煥;焰:焔;照:炤
;熏:燻薰;燕:讌醼鷰;爱:愛;爷:爺
;牍:牘;牵:牽;牺:犧;犊:犢
;状:狀;犹:猶;狈:狽;狞:獰
;独:獨;狭:狹;狮:獅;狯:獪
;狱:獄;狸:貍;猎:獵;猪:豬
;猫:貓;猬:蝟;献:獻;獭:獺
;玛:瑪;环:環;现:現;玺:璽
;珐:琺;珑:瓏;珲:琿;球:毬
;琅:瑯;琼:瓊;瑶:瑤;璃:琍
;璎:瓔;瓮:甕罋;瓶:甁;甯:寧
;电:電;畅:暢;留:畄;畴:疇
;疗:療;疡:瘍;疮:瘡;疱:皰
;症:癥;痈:癰;痉:痙;痒:癢
;痴:癡;痹:痺;癞:癩;癣:癬
;癫:癲;皱:皺;盏:盞;盐:鹽
;监:監;盖:蓋;盗:盜;盘:槃盤
;眺:覜;睑:瞼;睾:睪;瞒:瞞
;矫:矯;矶:磯;矾:礬;码:碼
;砚:硯;砺:礪;砾:礫;础:礎
;硅:矽;硕:碩;确:確;碍:礙
;磙:滾;磷:燐;礼:禮;祯:禎
;祷:禱;祸:禍;禀:稟;禄:祿
;禅:禪;离:離;秃:禿;秆:稈
;秋:鞦;种:種;秘:祕;积:積
;称:稱;移:迻;秽:穢;税:稅
;稳:穩;稻:稲;穑:穡;穗:穂
;穷:窮;窃:竊;窍:竅;窑:窯
;窜:竄;窝:窩;窥:窺;窦:竇
;竞:競;端:耑;笃:篤;笋:筍
;笔:筆;笺:箋;笼:籠;筋:觔
;筑:築;答:荅;筛:篩;筝:箏
;筱:篠;筹:籌;签:簽籤;简:簡
;管:琯;箪:簞;箫:簫;篮:籃
;篱:籬;类:類;粗:麤;粪:糞
;粮:糧;糊:餬;糟:蹧;系:係繫
;紧:緊;累:纍;纠:糾;纡:紆
;红:紅;纣:紂;纤:纖;约:約
;级:級;纪:紀;纬:緯;纯:純
;纱:紗;纲:綱;纳:納;纵:縱
;纶:綸;纷:紛;纸:紙;纹:紋
;纺:紡;纽:紐;线:線;绀:紺
;练:練;组:組;绅:紳;细:細
;织:織;终:終;绊:絆;绍:紹
;绎:繹;经:經;绒:絨;结:結
;绕:繞;绘:繪;给:給;绚:絢
;绛:絳;络:絡;绞:絞;统:統
;绢:絹;绥:綏;绦:絳;继:繼
;绩:勣績;绫:綾;续:續;绮:綺
;绯:緋;绰:綽;绳:繩;维:維
;绵:綿;绶:綬;绷:繃;绸:綢
;综:綜;绽:綻;缀:綴;缁:緇
;缄:緘;缅:緬;缆:纜;缉:緝
;缎:緞;缓:緩;缔:締;缕:縷
;编:編;缗:緡;缙:縉;缚:縛
;缛:縟;缝:縫;缟:縞;缠:纏
;缢:縊;缨:纓;缩:縮;缪:繆
;缮:繕;缲:繰;罂:罌;罐:鑵
;网:網;罗:羅;罚:罰;罢:罷
;羁:羈;羡:羨;翘:翹;耀:燿
;考:攷;耸:聳;耻:恥;聋:聾
;职:職;联:聯;聪:聰;肃:肅
;肠:腸;肤:膚;肴:餚;肾:腎
;肿:腫;胀:脹;胁:脅;胄:冑
;胆:膽;背:揹;胜:勝;胡:衚鬍
;胧:朧;胫:脛;胶:膠;脉:脈
;脍:膾;脏:臟;脐:臍;脑:腦
;脓:膿;脚:腳;脱:脫;腊:臘
;腥:胜;腾:騰;致:緻;舄:潟
;舆:輿;舍:捨;舣:艤;舰:艦
;舱:艙;艰:艱;艹:艸;艺:藝
;节:節;芜:蕪;芦:蘆;芸:蕓
;苇:葦;苍:蒼;苎:苧;苏:甦蘇
;苟:茍;范:範;茎:莖;茔:塋
;茧:繭;荆:荊;荐:薦;荚:莢
;荞:蕎;荠:薺;荡:蕩;荣:榮
;荨:蕁;荫:蔭;药:葯藥;莱:萊
;莲:蓮;莳:蒔;获:獲穫;莹:瑩
;莺:鶯;莼:蓴;菰:菇;菱:蔆
;萝:蘿;萤:螢;营:營;萧:蕭
;萨:薩;著:着;葱:蔥;蒋:蔣
;蒙:懞濛矇;蓑:簑;蓝:藍;蓦:驀
;蔑:衊;蔷:薔;蔺:藺;蕴:蘊
;薮:藪;薯:藷;薰:薫;藓:蘚
;藤:籐;蘖:櫱蘗;虏:虜;虑:慮
;虚:虛;虫:蟲;虱:蝨;虽:雖
;虾:蝦;蚀:蝕;蚁:蟻;蚕:蠶
;蛊:蠱;蛎:蠣;蛮:蠻;蛰:蟄
;蛲:蟯;蜗:蝸;蝇:蠅;蝉:蟬
;蝎:蠍;衔:啣銜;补:補;表:錶
;衮:袞;袜:襪;袭:襲;装:裝
;褛:褸;褴:襤;襁:繈繦;见:見
;观:觀;规:規;觅:覓;视:視
;览:覽;觉:覺;觋:覡;觐:覲
;觞:觴;触:觸;誉:譽;誊:謄
;计:計;订:訂;讣:訃;认:認
;讥:譏;讧:訌;讨:討;让:讓
;讫:訖;训:訓;议:議;讯:訊
;记:記;讲:講;讳:諱;讴:謳
;讶:訝;讷:訥;许:許;讹:訛
;论:論;讼:訟;讽:諷;设:設
;访:訪;诀:訣;证:證;诃:訶
;评:評;诅:詛;识:識;诈:詐
;诉:訴;诊:診;词:詞;诏:詔
;译:譯;试:試;诗:詩;诘:詰
;诚:誠;诛:誅;话:話;诞:誕
;诠:詮;诡:詭;询:詢;诣:詣
;诤:諍;该:該;详:詳;诫:誡
;诬:誣;语:語;误:誤;诰:誥
;诱:誘;诲:誨;诵:誦;请:請
;诸:諸;诹:諏;诺:諾;读:讀
;诽:誹;课:課;谀:諛;谁:誰
;调:調;谄:諂;谅:諒;谆:諄
;谈:談;谊:誼;谋:謀;谍:諜
;谏:諫;谐:諧;谑:謔;谒:謁
;谓:謂;谕:諭;谗:讒;谘:諮
;谚:諺;谛:諦;谜:謎;谟:謨
;谡:謖;谢:謝;谣:謠;谤:謗
;谥:諡謚;谦:謙;谧:謐;谨:謹
;谪:謫;谬:謬;谭:譚;谱:譜
;谲:譎;谴:譴;谶:讖;谷:榖穀
;豆:荳;贝:貝;贞:貞;负:負
;贡:貢;财:財;责:責;贤:賢
;败:敗;货:貨;质:質;贩:販
;贪:貪;贫:貧;贬:貶;购:購
;贮:貯;贯:貫;贰:貳;贱:賤
;贲:賁;贳:貰;贴:貼;贵:貴
;贷:貸;贸:貿;费:費;贺:賀
;贻:貽;贼:賊;贽:贄;贾:賈
;贿:賄;赁:賃;赂:賂;赃:贓
;资:資;赈:賑;赉:賚;赋:賦
;赌:賭;赍:齎;赎:贖;赏:賞
;赐:賜;赔:賠;赘:贅;赙:賻
;赛:賽;赞:讚贊;赠:贈;赡:贍
;赵:趙;趋:趨;跃:躍;跖:蹠
;践:踐;踊:踴;踌:躊;踪:蹤
;躏:躪;躯:軀;车:車;轧:軋
;轨:軌;轩:軒;转:轉;轮:輪
;软:軟;轰:轟;轲:軻;轴:軸
;轸:軫;轹:轢;轻:輕;轼:軾
;载:載;轿:轎;辂:輅;较:較
;辄:輒;辅:輔;辆:輛;辇:輦
;辈:輩;辉:輝;辍:輟;辎:輜
;辏:輳;辐:輻;辑:輯;输:輸
;辕:轅;辖:轄;辗:輾;辙:轍
;辞:辭;辟:闢;辩:辯;边:邊
;辽:遼;达:達;迁:遷;过:過
;迈:邁;运:運;还:還;这:這
;进:進;远:遠;违:違;连:連
;迟:遲;迩:邇;迭:叠疊;迳:逕
;迹:跡蹟;适:適;选:選;逊:遜
;递:遞;逻:邏;逾:踰;遗:遺
;遥:遙;邮:郵;邹:鄒;郁:鬱
;郑:鄭;郸:鄲;酸:痠;酿:釀
;采:埰寀採棌綵;释:釋;里:裏裡
;鉅:钜;鉴:鑑鑒;针:針鍼;钉:釘
;钏:釧;钓:釣;钗:釵;钜:鉅
;钝:鈍;钟:鍾鐘;钢:鋼;钣:鈑
;钦:欽;钧:鈞;钩:鉤;钱:錢
;钲:鉦;钳:鉗;钺:鉞;钻:鑽
;钿:鈿;铁:鐵;铃:鈴;铅:鉛
;铉:鉉;铎:鐸;铗:鋏;铜:銅
;铠:鎧;铢:銖;铣:銑;铨:銓
;铭:銘;铮:錚;铳:銃;银:銀
;铸:鑄;铺:鋪;销:銷;锁:鎖
;锄:鋤;锅:鍋;锋:鋒;错:錯
;锚:錨;锡:錫;锢:錮;锤:錘鎚
;锥:錐;锦:錦;锭:錠;键:鍵
;锯:鋸;锷:鍔;锺:鍾;锻:鍛
;镀:鍍;镂:鏤;镌:鐫;镐:鎬
;镒:鎰;镜:鏡;镝:鏑;镞:鏃
;长:長;门:門;闪:閃;闭:閉
;问:問;闯:闖;闰:閏;闲:閑
;间:間;闵:閔;闷:悶;闸:閘
;闹:鬧;闺:閨;闻:聞;闾:閭
;阀:閥;阁:閣;阎:閻;阏:閼
;阐:闡;阔:闊;阖:闔;阙:闕
;队:隊;阳:陽;阴:陰;阵:陣
;阶:階;际:際;陆:陸;陈:陳
;陕:陜陝;陨:隕;险:險;陷:陥
;随:隨;隐:隱;隽:雋;难:難
;雇:僱;雏:雛;雕:彫琱鵰;雳:靂
;雾:霧;霁:霽;霉:黴;霭:靄
;霸:覇;青:靑;静:靜;面:麪麵
;韦:韋;韩:韓;韬:韜;韵:韻
;页:頁;顶:頂;顷:頃;项:項
;顺:順;须:須鬚;顽:頑;顾:顧
;顿:頓;颁:頒;颂:頌;预:預
;领:領;颇:頗;颈:頸;颍:潁
;频:頻;颖:穎;颗:顆;题:題
;颚:顎;额:額;颤:顫;风:風
;飒:颯;飘:飄;飞:飛;飨:饗
;饥:飢饑;饬:飭;饭:飯;饯:餞
;饰:飾;饱:飽;饲:飼;饴:飴
;饵:餌;饶:饒;饷:餉;饺:餃
;饿:餓;馀:餘;馆:館;馈:饋
;馑:饉;馒:饅;馔:饌;马:馬
;驭:馭;驯:馴;驰:馳;驱:驅
;驳:駁;驴:驢;驷:駟;驹:駒
;驻:駐;驼:駝;驽:駑;驾:駕
;驿:驛;骁:驍;骂:罵;骄:驕
;骆:駱;骇:駭;骊:驪;骋:騁
;验:驗;骏:駿;骐:騏;骑:騎
;骗:騙;骚:騷;骞:騫;骠:驃
;骤:驟;骥:驥;鱼:魚;鲁:魯
;鲍:鮑;鲛:鮫;鲜:鮮;鲤:鯉
;鲭:鯖;鲲:鯤;鲸:鯨;鳅:鰍
;鳆:鰒;鳌:鰲鼇;鳏:鰥;鳗:鰻
;鳞:鱗;鸟:鳥;鸠:鳩;鸢:鳶
;鸣:鳴;鸦:鴉;鸭:鴨;鸯:鴦
;鸳:鴛;鸾:鸞;鸿:鴻;鹃:鵑
;鹄:鵠;鹅:鵝;鹉:鵡;鹊:鵲
;鹏:鵬;鹜:鶩;鹤:鶴;鹦:鸚
;鹫:鷲;鹬:鷸;鹭:鷺;鹰:鷹
;麦:麥;麹:麴;麻:痲;黄:黃
;黑:黒;鼠:鼡;齐:齊;齿:齒
;龃:齟;龄:齡;龉:齬;龊:齪
;龌:齷;龙:龍;龛:龕;龟:龜

===
s/.\{16}/\0\r/g
5455 # cjk_common_subset_TS_covered_extension_5455/共享汉字字集牜简繁覆盖扩增
一丁七万丈三上下不与丑专且丕世丘
丙业丛东丝丞两严丧个中串临丸丹主
丽乃久义之乌乍乎乏乐乔乖乗乘乙九
乞也习书买乱乳乾亂了予争事二于亏
云互五井亘亙亚些亞亡亢交亥亦亨亩
享京亭亮亲亵人亿什仁仄仅仆仇今介
仍从仑仓仔仕他仗付仙仝仟代令以仪
们仰仲件价任仿企伉伊伍伎伏伐休伕
优会伞伟传伤伦伫伯伴伶伸伺似伽佃
但佇佈位低住佐佑体佔何余佚佛作佣
佥佩佯佰佳佶使侃侄來侈例侍侏侑侖
供依侠価侣侥侦侧侨侮侯侵侶侷便係
促俄俊俎俑俗俚保俞俟俠信俨俩俪俭
修俯俳俸俺倆倉個倍們倒倖候倚借倡
倣倦倨倪倫倬倭债倾偃假偈偉偏偕做
停健側偵偶偷偸偿傀傅傍傑傘備傚傢
储傩催傭傲傳債傷傾僅僉僊像僑僕僖
僚僥僧僭僱價僻儀億儉儒償儡優儲儷
儺儼儿兀允元兄充兆兇先光克兌免兎
兑兒兔党兜兢入內全兩兪八公六兮兰
共关兴兵其具典养兼兽冀内冈冊册再
冑冒冕冗写军农冠冢冥冪冬冯冲决况
冶冷冻冽净凄准凉凋凌凍减凑凖凛凜
凝几凡凤凫凭凯凰凱凶凸凹出函凿刀
刃分切刈刊刍刎刑划列刘则刚创初删
判別刧利刪别刮到制刷券刹刺刻剂剃
則削剋剌前剎剑剔剖剛剝剥剧剩剪副
剰割創剽剿劃劄劇劈劉劍劑力劝功加
务劣动助努劫励劲劳劻劾势勁勃勇勉
勋勒動勖勗勘務勝勞募勢勣勤勦勳勵
勸勺勾勿包匈匍匏匐匕化北匙匠匡匣
匪匯匹区医匿區十千升午卉半华协卑
卒卓協单卖南博卜卞占卢卤卦卧卫卯
印危即却卵卷卹卻卽卿厂厄厅压厌厘
厚原厢厥厦厨厭去县参參又叉及友双
反发叔取受变叛叠叢口古句叩只叫召
叭可台叱史右叶号司叹吃各合吉吊吋
同名后吏吐向吒吕君吝吞吟吠否吩含
听吸吹吻吼吾呂呈告呎呑呕呗员呜周
呱味呵呻呼命咀咆和咎咏咐咚咤咨咫
咬咳咸咽哀品哄哈哉响哗員哥哨哭哮
哲哺唄唆唇唐唤唯唱唸唾啄商問啖啗
啣啬啮啸啼喀善喆喇喉喊喘喙喚喜喝
喦喧喪喫喬單喷嗅嗇嗔嗚嗜嗟嗣嗤嗽
嗾嘆嘉嘔嘗嘘嘯嘱嘲嘴嘶噓器噫噴嚆
嚥嚮嚯嚴嚼囑囘囚四回因团园困围囹
固国图圃圄圆圈國圍圏園圓圖團土圣
在圭地圹场圻址均坊坎坏坐坑块坚坛
坞坟坠坡坤坦坪垂垄垅型垒垓垠垢垣
垦垩埃埋城域埠埰埴執培基埼堀堂堅
堆堊堑堕堡堤堪堯堰報場堵塊塋塑塔
塗塘塚塞塡塢填塵塹塾境墅墓増墙墜
增墟墨墮墳墾壁壅壇壑壓壕壘壙壞壟
壤士壬壮壯声壳壶壹壺壽处备复夏夕
外夙多夜夢大天太夫夭央失头夷夸夹
夺夾奂奄奇奈奉奋奎奏奐契奔奕套奚
奠奢奥奧奪奮女奴奸好如妃妄妇妊妓
妖妙妥妨妹妻妾姆始姐姑姓委姙姚姜
姦姨姪姻姿威娃娄娇娑娘娜娟娠娥娩
娶娼婁婆婉婚婢婦婬婵媒媚媛媿嫁嫂
嫉嫌嫔嫡嫦嫩嬉嬋嬌嬖嬢嬪孀孃子孑
孔孕字存孙孚孜孝孟季孤学孩孫孰孱
孵學孺宁宅宇守安宋完宏宕宗官宙定
宛宜宝实宠审客宣室宥宦宪宫宮宰害
宴宵家宸容宾宿寀寂寄寅密寇富寐寒
寓寝寞察寡寢寤寥實寧寨審寫寮寵寶
寸对寺寻导寿封射尅将將專尉尊尋對
導小少尔尖尘尙尚尝尤尧就尸尹尺尻
尼尽尾尿局层居屆屈届屋屍屎屏屑展
屛属屠屡屢層履屬屯山屹屿岂岐岑岖
岗岚岛岡岩岫岬岭岱岳岷岸峙峡峦峨
峩峰島峻峽崇崎崑崔崖崗崙崧崩嵋嵌
嵐嵒嵩嵬嵯嶇嶝嶺嶼嶽巌巍巒巖川州
巡巢巣工左巧巨巩巫差己已巳巴巷巻
巽巾币市布帅帆师希帐帑帖帘帙帛帜
帝帥带帧師席帳帶常帽幀幂幄幅幌幕
幟幡幢幣干平年并幸幹幻幼幽幾广庄
庆庇床序庐库应底店庙庚府废庠度座
庫庭庵庶康庸廂廈廉廊廓廖廚廛廟廠
廢廣廬廳延廷建廻廼开弁异弃弄弊式
弑弒弓弔引弗弘弛弟张弥弦弧弩弯弱
張強弹强弼彈彊彌彎归当彖彗彙形彥
彦彩彪彫彬彭彰影彷役彻彼彿往征径
待徇徊律後徐徑徒徕得徘徙從徠御徨
復循徬微徳徴徵德徹徼徽心必忆忌忍
忏忖志忘忙忠忧快念忽忾忿怀态怂怃
怆怏怒怖怜思怠怡急性怨怪怯总恁恂
恃恆恋恍恐恒恕恙恢恣恤恥恨恩恪恬
恭息恰恳恵恶恸恻恼恿悅悉悌悍悔悖
悚悛悟悠患悦悬悯悲悴悶悸悼悽情惊
惑惚惜惟惠惡惧惨惩惫惮惯惰惱想惶
惹惺惻愁愆愈愉愍愎意愕愚愛感愤愧
愴愼愾愿慂慄慇慈慊態慌慎慕慘慝慟
慢慣慧慨慫慮慰慶慷慼慾憂憊憎憐憑
憔憚憤憧憩憫憬憮憲憶憾懃懇懈應懊
懋懒懞懦懲懶懷懸懺懼懿戀戈戊戌戍
戎成我戒或战戚戟戡截戮戰戴房所扁
扇扈扉手才扎扑打払托执扩扫扬扮扰
扶批扼承技抄抉把抑抒投抗折抚抛护
报披抬抱抵抹押抽拂担拇拈拉拋拌拍
拐拒拓拔拗拘拙招拜拝拟拣拥拨择括
拭拮拯拱拳拷拾拿持挂指按挑挚挛挞
挟挠挥挫振挶挺挽挾捆捉捌捏捐捕捞
损换捣捧捨据捲捷捺捻掃授掉掌排掖
掘掛掠採探接控推掩措掷揀揄揆描提
揖揚換握揮援揶揹揽搅損搏搖搗搜搨
搬搭携搾摄摆摇摘摩摯摸摺撈撒撓撚
撞撤撥撫播撮撰撲撻擁擅擇操擒擔擘
據擡擢擦擬擲擴擺擾攀攘攜攝攣攪攫
攬支收攷攸改攻放政故效敌敎敏救敖
敗教敛敞敢散敦敬数敲整敵敷數斂斃
文斋斌斐斑斗料斛斜斟斡斤斥斧斩斫
斬断斯新斷方於施旁旂旅旋旌族旒旗
旛无日旦旧旨早旬旭旱时旷旺昆昇昊
昌明昏易昔昙星映春昧昨昭是昴昶昼
显晁時晃晉晋晏晓晔晕晖晝晟晤晦晨
普景晴晶智暂暄暇暈暉暑暖暗暝暢暧
暫暮暴暹暾曄曇曉曏曖曙曜曝曠曦曰
曲曳更曷書曹曼曾替最會月有朋服朔
朕朗望朝期朦朧木未末本札朮术朱朴
朵朶机朽杀杂权杆杉李杏材村杓杖杜
杞束条来杨杪杭杯杰東杳杵杷松板极
构枇枉枋析枕林枚果枝枢枣枪枫枭枯
枳枴架枷枸柄柏某柑染柔柚柜柝柩柬
柯柱柳柴柵柺栀栅标栈栉栋栏树栓栖
栗校株样核根格栽栾桀桁桂桃案桎桐
桑桓桔桡桥桦桧桶桿梁梅梏梓梔梗條
梟梢梦梧梨梭梯械梱梳梵检棄棉棋棌
棍棒棕棗棘棚棟棠棧森棱棲棹棺椁椅
植椎椒椰椽椿楊楓楔楚楞楠楫業楮極
楷楸楹楼概榄榈榕榖榛榜榦榧榨榮榴
榻槁槃構槌槍槐槛槟槨槪槽槿樂樊樑
樓樗標樞樟模樣横樯樱樴樵樸樹樺樽
橄橈橋橘橙機橡橦橫橹檀檄檎檗檜檢
檣檯檳檻櫂櫃櫓櫚櫛櫱櫻欄權欒欖欠
次欢欣欤欧欲欺欽款歇歌歎歐歟歡止
正此武歪歸死歼歿殀殁殃殄殆殉殊残
殒殖殘殞殡殯殲殴段殷殺殼殿毀毁毅
毆毋毌母毎每毒毓比毕毙毛毡毫毬氈
氏民氓气氣水永氾汀汁求汇汉汎汐汕
汗汚汝汞江池污汤汨汪汰汲汹決汽汾
沁沂沃沈沉沌沐沒沓沖沙沛沟没沥沦
沧沫沮河沸油治沼沽沾沿況泄泉泊泌
泓法泗泛泡波泣泥注泪泯泰泳泷泸泻
泽洁洋洌洒洗洙洛洞津洩洪洲洵洶活
洼洽派流浃浅浆浊测济浏浑浒浓浙浚
浣浦浩浪浮浴海浸浹涂涅消涉涌涎涓
涕涛涟涡涣涤润涧涨涯液涵涼淀淅淆
淇淋淑淒淘淙淚淞淡淨淩淪淫淮深淳
淵混淸淹淺添清渉渊渍渐渔渖渗渙渚
減渠渡渣渤渥渦温渫測渭港游渺渾湃
湊湍湖湘湛湟湣湧湫湮湯湾湿溃溉源
準溜溝溟溢溥溪溫溯溶溺滂滄滅滋滌
滑滓滔滚滞满滤滥滨滩滯滲滴滸滾滿
漁漂漆漏漑演漕漠漢漣漤漫漬漱漲漸
漿潁潅潇潔潘潛潜潟潤潭潮潰潺潼澂
澄澎澔澗澜澤澱澳澹激濁濂濃濒濕濛
濟濠濡濤濫濬濯濱濾瀉瀋瀏瀑瀕瀘瀚
瀛瀝瀟瀧瀾灌灑灘灣火灭灯灰灵灸灼
災灾灿炀炉炊炎炒炖炙炤炫炬炭炮炯
炳炸点炼炽烂烈烏烙烛烟烦烧烬热烹
烽焉焔焕焙焚無焦焰然煉煌煎煖煙煤
煥煦照煩煬煮煽熄熊熏熔熙熟熬熱熹
熾燃燈燉燎燐燒燔燕營燥燦燧燬燭燮
燻燼燿爆爐爛爪爬爭爰爱爵父爷爺爻
爽爾牀牆片版牌牍牒牘牙牛牝牟牡牢
牧物牲牴牵特牺牽犀犁犇犊犢犧犬犯
状犹狀狂狄狈狎狐狗狙狞狡狩独狭狮
狯狱狸狹狼狽猊猎猖猛猜猝猥猩猪猫
猬献猶猷猾猿獄獅獗獨獪獭獰獲獵獸
獺獻玄率玉王玖玛玩环现玲玳玺珀珂
珊珍珐珑珞珠珥珪班珮珲現球琅理琉
琍琢琥琯琱琳琴琵琶琺琼琿瑁瑕瑙瑚
瑛瑜瑞瑟瑤瑩瑪瑯瑶瑾璃璋璎璞璧環
璽瓊瓏瓔瓜瓠瓢瓣瓦瓮瓶瓷甁甄甑甕
甘甚生甥甦用甫甬甯田由甲申电男甸
町畄畅界畏畔留畛畜畝畢略畦番異畴
當畸畿疆疇疊疋疏疑疗疝疡疥疫疮疱
疲疳疵疸疹疼疽疾痂病症痈痉痍痒痔
痕痘痙痛痠痢痰痲痳痴痹痺痼瘉瘍瘟
瘠瘡瘢瘤療癌癒癖癞癡癢癣癥癩癫癬
癰癲癸登發白百的皆皇皎皓皮皰皱皺
皿盂盃盆盈益盏盐监盒盖盗盘盛盜盞
盟盡監盤盧目盲直相盾省眄眈眉看眠
眩眷眸眺眼着睏睑睛睡督睦睪睫睹睾
睿瞋瞑瞒瞞瞥瞬瞭瞰瞳瞻瞼瞿矇矗矛
矜矢矣知矩矫短矮矯石矶矽矾码砂砒
砚砥砦砧砲破砺砾础硃硅硕硝硫硬确
硯硼碁碇碌碍碎碑碕碗碣碧碩確碼磁
磅磊磋磐磙磨磬磯磷礁礎礙礪礫礬示
礼社祀祁祂祇祈祉祐祕祖祗祚祝神祠
祥票祭祯祷祸祺祿禀禁禄禅禍禎福禦
禧禪禮禱禳禹离禽禾禿秀私秃秆秉秋
种科秒秕秘租秤秦秧秩积称移秽稀稅
稈程稍税稔稗稚稜稟稠種稱稲稳稷稻
稼稽稿穀穂穆積穎穑穗穡穢穩穫穰穴
究穷穹空穿突窃窄窈窍窑窒窕窘窜窝
窟窥窦窩窪窮窯窺竄竅竇竊立站竝竞
竟章竣童竭端競竹竺竿笃笋笏笑笔笙
笛笞笠符第笺笼筆等筋筌筍筏筐筑筒
答策筛筝筮筱筵筹签简箇箋箏箔箕算
箝管箪箫箭箱箴箸節篁範篆篇築篠篤
篩篮篱篲簇簑簞簡簧簪簫簽簾簿籃籌
籍籐籠籤籬米类粉粒粕粗粘粟粥粪粮
粱粲粳粹精糊糖糞糟糠糢糧系糾紀紂
約紅紆紊紋納紐純紗紙級紛素紡索紧
紫紮累細紳紹紺終絃組絆結絞絡絢給
絨絮統絲絳絹綏經綜綢綬維綱網綴綵
綸綺綻綽綾綿緇緊緋緘線緝緞締緡編
緩緬緯練緻縉縊縛縞縟縣縫縮縯縱縷
總績繁繃繆繈織繕繞繦繩繪繫繭繰繹
繼纂續纍纏纓纔纖纛纜纠纡红纣纤约
级纪纬纯纱纲纳纵纶纷纸纹纺纽线绀
练组绅细织终绊绍绎经绒结绕绘给绚
绛络绞统绢绥绦继绩绫续绮绯绰绳维
绵绶绷绸综绽缀缁缄缅缆缉缎缓缔缕
编缗缙缚缛缝缟缠缢缨缩缪缮缲缶缸
缺罂罋罌罐网罔罕罗罚罢罪置罰署罵
罷罹羁羅羈羊羌美羔羚羞羡群羨義羲
羸羹羽翁翅翊翌習翔翕翘翠翡翩翰翹
翼耀老考者耆而耐耑耕耗耘耡耳耶耸
耻耽耿聆聊聋职联聖聘聚聞聪聯聰聲
聳職聽聾聿肃肄肅肆肇肉肋肌肖肛肝
肠股肢肤肥肩肪肯肱育肴肺肾肿胀胁
胃胄胆背胎胚胛胜胞胡胤胥胧胫胱胴
胶胸能脂脅脆脈脉脊脍脏脐脑脓脚脛
脣脩脫脯脱脹脾腊腋腎腐腑腔腕腥腦
腫腰腱腳腸腹腺腾腿膀膈膊膏膚膜膝
膠膣膨膳膺膽膾膿臀臂臆臍臘臟臣臥
臧臨自臭至致臺臻臼臾舄舅舆與興舊
舌舍舒舛舜舞舟舣航舫般舰舱舵舶舷
船艇艙艤艦艮良艰艱色艸艹艺艾节芋
芍芒芙芜芝芟芥芦芬芭芯花芳芸芹芻
芽苇苍苎苏苑苒苔苗苛苞苟苡若苦苧
英茂范茄茅茉茍茎茔茗茧茨茫茯茱茴
茵茶茸茹荀荅荆草荊荏荐荒荘荚荞荠
荡荣荨荫药荳荷荻莉莊莎莖莞莢莪莫
莱莲莳获莹莺莼莽菁菅菇菊菌菓菖菜
菩華菰菱菲菴菸菽萃萄萊萌萍萎萝萤
营萧萨萬萱萸落葉著葛葡董葦葫葬葯
葱葵葺蒋蒐蒔蒙蒜蒡蒲蒸蒼蒿蓄蓆蓉
蓋蓍蓑蓝蓦蓬蓮蓴蓼蔆蔑蔓蔔蔗蔘蔚
蔡蔣蔥蔬蔭蔷蔺蔽蕁蕃蕉蕎蕓蕨蕩蕪
蕭蕴薄薇薑薔薙薛薦薨薩薪薫薮薯薰
薺藉藍藏藓藕藜藝藤藥藩藪藷藺藻蘆
蘇蘊蘖蘗蘚蘭蘿虎虏虐虑虔處虖虚虛
虜虞號虧虫虱虹虽虾蚀蚁蚊蚌蚓蚕蚣
蚤蚩蛇蛊蛋蛎蛔蛙蛛蛟蛤蛭蛮蛰蛲蛾
蜀蜂蜃蜈蜗蜘蜚蜜蝇蝉蝎蝕蝗蝟蝦蝨
蝴蝶蝸螂融螟螢螳螺蟄蟠蟬蟯蟲蟹蟻
蟾蠅蠍蠢蠣蠱蠶蠻血衊行衍衒術衔衕
街衙衚衛衝衡衢衣补表衫衮衰衲衷衹
衾衿袁袂袈袋袍袒袖袜袞被袭袷裁裂
装裏裔裕裙補裝裟裡裨裳裴裸製複褐
褒褓褛褥褪褴褶褸褻襁襄襟襤襪襲西
要覃覆覇覈見規覓視覜覡親覲覺覽觀
见观规觅视览觉觋觐角觔觝觞解触觴
觸言訂訃計訊訌討訓訖託記訛訝訟訢
訣訥訪設許訴訶診註詐詔評詛詞詠詢
詣試詩詭詮詰話該詳誅誇誉誊誌認誓
誕誘語誠誡誣誤誥誦誨誰課誹誼調諂
諄談請諍諏諒論諛諜諠諡諦諧諫諭諮
諱諷諸諺諾謀謁謂謄謎謐謔謖謗謙謚
講謝謠謨謫謬謳謹謼譁證譎譏識譚譜
警譬譯議譴護譽讀變讌讎讒讓讖讚计
订讣认讥讧讨让讫训议讯记讲讳讴讶
讷许讹论讼讽设访诀证诃评诅识诈诉
诊词诏译试诗诘诚诛话诞诠诡询诣诤
该详诫诬语误诰诱诲诵请诸诹诺读诽
课谀谁调谄谅谆谈谊谋谍谏谐谑谒谓
谕谗谘谚谛谜谟谡谢谣谤谥谦谧谨谪
谬谭谱谲谴谶谷谿豁豆豈豌豕豚象豪
豫豬豹豺貂貊貌貍貓貝貞負財貢貧貨
販貪貫責貯貰貳貴貶買貸費貼貽貿賀
賁賂賃賄資賈賊賑賓賚賜賞賠賢賣賤
賦質賭賸賻購賽贄贅贈贊贍贓贖贝贞
负贡财责贤败货质贩贪贫贬购贮贯贰
贱贲贳贴贵贷贸费贺贻贼贽贾贿赁赂
赃资赈赉赋赌赍赎赏赐赔赘赙赛赞赠
赡赤赦赫走赳赴赵起超越趋趙趣趨足
趺趾跃跋跌跏跖跛距跡跣跨路跳践跼
踊踌踏踐踞踪踰踴踵蹂蹄蹇蹈蹉蹊蹙
蹟蹠蹤蹧蹴蹶躁躇躊躍躏躪身躬躯軀
車軋軌軍軒軟軫軸軻軾較輅載輒輓輔
輕輛輜輝輟輦輩輪輯輳輸輻輾輿轄轅
轉轍轎轟轢车轧轨轩转轮软轰轲轴轸
轹轻轼载轿辂较辄辅辆辇辈辉辍辎辏
辐辑输辕辖辗辙辛辜辞辟辣辨辩辭辯
辰辱農边辽达迁迂迅过迈迎运近返还
这进远违连迟迦迩迪迫迭述迳迴迷迹
迺迻追退送适逃逅逆选逊逋逍透逐逑
递途逕逗這通逝逞速造逡逢連逮週進
逵逸逻逼逾遁遂遇遊運遍過遐遑道達
違遗遙遜遝遞遠遣遥適遭遮遲遵遷選
遺遼遽避邀邁邂邃還邇邊邏邑那邦邨
邪邮邯邱邵邸邹郁郃郊郑郡部郭郵郸
都鄂鄒鄙鄭鄲酉酊酋酌配酎酒酢酩酪
酬酵酷酸酿醇醉醋醍醒醜醫醯醴醵醼
釀采釉释釋里重野量釐金釘釜針釣釧
釵鈍鈑鈔鈞鈴鈿鉅鉉鉗鉛鉞鉤鉦鉴銀
銃銅銑銓銖銘銜銷鋏鋒鋤鋪鋸鋼錐錘
錚錠錢錦錨錫錮錯錶鍋鍍鍔鍛鍵鍼鍾
鎖鎚鎧鎬鎰鏃鏇鏑鏚鏡鏤鐘鐫鐵鐸鑄
鑑鑒鑵鑽鑿针钉钏钓钗钜钝钟钢钣钦
钧钩钱钲钳钺钻钿铁铃铅铉铎铗铜铠
铢铣铨铭铮铳银铸铺销锁锄锅锋错锚
锡锢锤锥锦锭键锯锷锺锻镀镂镌镐镒
镜镝镞镟長长門閃閉開閏閑間閔閘閣
閤閥閧閨閭閻閼闆闇闊闔闕闖闘關闡
闢门闪闭问闯闰闲间闵闷闸闹闺闻闾
阀阁阎阏阐阔阖阙阜队阡阨阪阬阮阯
防阳阴阵阶阻阿陀陂附际陆陈陋陌降
限陕陛陜陝陞陟院陣除陥陨险陪陰陳
陵陶陷陸陽隄隅隆隊隋隍階随隐隔隕
隘隙際障隧隨險隱隻隽难雀雁雄雅集
雇雉雋雌雍雎雏雕雖雙雛雜離難雨雪
雲雳零雷雹電雾需霁霆震霉霑霓霖霜
霞霤霧霭霰露霸霹霽靂靄靈靑青靖静
靜非靡面革靴鞋鞍鞏鞠鞦鞫鞭韆韋韓
韜韦韩韬音韵韶韻響頁頂頃項順須頌
預頑頒頓頗領頫頭頸頻顆題額顎願類
顧顫顯页顶顷项顺须顽顾顿颁颂预领
颇颈颍频颖颗题颚额颤風颯颱颳飄风
飒飘飛飞食飢飨飭飯飴飼飽飾餃餉養
餌餐餓餘餚餞館餬饅饉饋饌饑饒饗饥
饬饭饯饰饱饲饴饵饶饷饺饿馀馆馈馑
馒馔首香馥馨馬馭馮馳馴駁駐駑駒駕
駝駟駭駱駿騁騎騏騙騫騰騷驀驃驅驍
驕驗驚驛驟驢驥驩驪马驭驯驰驱驳驴
驷驹驻驼驽驾驿骁骂骄骆骇骊骋验骏
骐骑骗骚骞骠骤骥骨骸髓體高髮髴鬆
鬍鬚鬥鬧鬨鬪鬱鬼魁魂魃魄魅魏魔魚
魯鮑鮫鮮鯉鯖鯤鯨鰍鰒鰥鰲鰻鱗鱼鲁
鲍鲛鲜鲤鲭鲲鲸鳅鳆鳌鳏鳗鳞鳥鳧鳩
鳳鳴鳶鴉鴛鴦鴨鴻鵑鵝鵠鵡鵬鵰鵲鶩
鶯鶴鷰鷲鷸鷹鷺鸚鸞鸟鸠鸢鸣鸦鸭鸯
鸳鸾鸿鹃鹄鹅鹉鹊鹏鹜鹤鹦鹫鹬鹭鹰
鹵鹹鹽鹿麒麓麗麝麟麤麥麦麪麴麵麹
麻麾黃黄黍黎黑黒黔默黛黜點黨黴鼇
鼎鼓鼕鼠鼡鼻齊齋齎齐齒齟齡齣齧齪
齬齷齿龃龄龉龊龌龍龕龙龛龜龟龢
===
#]]]'''#'''
r'''[[[
buggy result@bug:『if j4S in js5encoding: continue』
2513
300
乗仿伕佈佔価侷係倖傑傚傢僊僱價兇冑凖刧剋剰劄劻勦卹厂叠吋呎咚唸啗喆喦喫嚥嚮囘圏埰埼姙姦婬媿嬢孃寀尅屍峩崑崧嵒嶽巌巖巻幹广廻廼弔彫彿徬徴徵恵悽慄慇慼慾憐懃懞払拝挶捨捲採揹搨撚據攷旂旛昇曏杪枴柺桿棌棲榖榦樑樴樸機橦檯櫂殀毌毬氾汎沉洩淒淩湣湧準潅澂澔澱濛濬瀋炤煖燻燿牀牴犇珪珮琍琯琱瑯甕畄疊痠痲痳瘉癒癡癢癥盃着睏睪瞋瞭矇矽硃碁碕祂祇祐祕禦稲穀穂範築篲簑籐糢絃綵緻縯繈繦繫纍纔罋耑耡胜脣脩臺茍荅荘荳莊菇菓菴萬蒐蓆蔆蔔蕓薑薙薰藷虖蠍衊衕衚衹裏裡製覈覜觔觝託訢註誌諠諮謼讌讎谿貍賸跼踰踴蹧輓迴迺迻週遊遝邨郃醜醼釐鈔鉅錶鏇鏚鑵钜镟閤閧闆闇闘阨阬阯陞陥隄隻雲霑霤鞦韆頫願颱颳餘餚餬髴鬆鬍鬥鬨鬪鬱鵰鷰鹹麤麪麴麵鼕鼡齣龢
2813
一丁七万丈三上下不丑且丕世丘丙丞
中串丸丹主乃久之乍乎乏乖乗乘乙九
乞也乳乾了予事二于云互五井些亡亢
交亥亦亨享京亭亮人什仁仄仇今介仍
仔仕他仗付仙仝仟代令以仰仲件价任
仿企伉伊伍伎伏伐休伕伯伴伶伸伺似
伽佃但佈位低住佐佑佔何余佚佛作佩
佯佰佳佶使侃侈例侍侏侑供依価侮侯
侵侷便係促俄俊俎俑俗俚保俟信修俯
俳俸俺倍倒倖候倚借倡倦倨倪倬倭偃
假偈偏偕做停健偶傀傅傍傑傚傢催傲
僊像僖僚僧僭僱價僻儒儡兀允元兄充
兆兇先光克免兜兢入全八公六兮共兵
其具典兼冀再冑冒冕冗冠冥冬冶冷冽
凄准凋凌凖凝凡凰凶凸凹出函刀刃分
切刈刊刎刑列初判刧利刮到制刷券刺
刻剃削剋剌前剔剖剩剪副剰割剽剿劄
劈力功加劣助努劫劻劾勃勇勉勒勘募
勤勦勺勾勿包匈匍匏匐匕化北匙匠匡
匣匪匹匿十千升午卉半卑卒卓南博卜
卞占卦卯印危卵卷卹卿厂厄厘厚原厥
去又叉及友反叔取受叛叠口古句叩只
叫召叭可台叱史右司吃各合吉吊吋同
名后吏吐向君吝吟吠否吩含吸吹吻吼
吾呈告呎周呱味呵呻呼命咀咆和咎咐
咚咨咫咬咳咸咽哀品哄哈哉哥哨哭哮
哲哺唆唇唐唯唱唸唾啄商啖啗啼喀善
喆喇喉喊喘喙喜喝喦喧喫嗅嗔嗜嗟嗣
嗤嗽嗾嘉嘲嘴嘶器噫嚆嚥嚮嚼囘囚四
回因困囹固圃圄圈圏土在圭地圻址均
坊坎坐坑坡坤坦坪垂型垓垠垢垣埃埋
城域埠埰埴培基埼堀堂堆堡堤堪堰堵
塑塔塘塞塾境墅墓墟墨壁壅壑壕壤士
壬壹夏夕外夙多夜大天太夫夭央失夷
奄奇奈奉奎奏契奔奕套奚奠奢女奴奸
好如妃妄妊妓妖妙妥妨妹妻妾姆始姐
姑姓委姙姚姜姦姨姻姿威娃娑娘娜娟
娠娥娩娶娼婆婉婚婢婬媒媚媛媿嫁嫂
嫉嫌嫡嫦嫩嬉嬖嬢孀孃子孑孔孕字存
孚孜孝孟季孤孩孰孱孵孺宅宇守安宋
完宏宕宗官宙定宛宜客宣室宥宦宰害
宴宵家宸容宿寀寂寄寅密寇富寐寒寓
寞察寡寤寥寨寮寸寺封射尅尉尊小少
尖尤就尸尹尺尻尼尾尿局居屈屋屍屎
屑展屠履屯山屹岐岑岩岫岬岱岳岷岸
峙峨峩峰峻崇崎崑崔崖崧崩嵋嵌嵒嵩
嵬嵯嶝嶽巌巍巖川州巡工左巧巨巫差
己已巳巴巷巻巽巾市布帆希帑帖帙帛
帝席常帽幄幅幌幕幡幢干平年幸幹幻
幼幽广庄庇床序底店庚府庠度座庭庵
庶康庸廉廊廓廖廛延廷建廻廼弁弄弊
式弓弔引弗弘弛弟弦弧弩弱弼彖彗形
彩彪彫彬彭彰影彷役彼彿往征待徇徊
律後徐徒得徘徙御徨循徬微徴徵徽心
必忌忍忖志忘忙忠快念忽忿怏怒怖怜
思怠怡急性怨怪怯恁恂恃恍恐恕恙恢
恣恤恨恩恪恬恭息恰恵悉悌悍悔悖悚
悛悟悠患悲悴悸悼悽情惑惚惜惟惠惰
想惶惹惺愁愆愈愉愍愎意愕愚感愧愿
慄慇慈慊慌慕慝慢慧慨慰慷慼慾憎憐
憔憧憩憬憾懃懈懊懋懞懦懿戈戊戌戍
戎成我戒或戚戟戡截戮戴房所扁扇扈
扉手才打払托扮扶批扼承技抄抉把抑
抒投抗折披抱抵抹押抽拂拇拈拉拌拍
拐拒拓拔拗拘拙招拜拝括拭拮拯拱拳
拷拾拿持指按挑挫振挶挺挽捉捌捏捐
捕捧捨据捲捷捺捻授掉掌排掖掘掠採
探接控推掩措揄揆描提揖握援揶揹搏
搜搨搬搭摘摩摸摺撒撚撞撤播撮撰擅
操擒擘據擢擦攀攘攫支收攷攸改攻放
政故效敏救敖敞敢散敦敬敲整敷文斌
斐斑斗料斛斜斟斡斤斥斧斫斯新方於
施旁旂旅旋旌族旒旗旛日旦旨早旬旭
旱旺昆昇昊昌明昏易昔星映春昧昨昭
是昴昶晁晃晏晟晤晦晨普景晴晶智暄
暇暑暖暗暝暮暴暹暾曏曙曜曝曦曰曲
曳更曷曹曼曾替最月有朋服朔朕朗望
朝期朦木未末本札朱朴机朽杆杉李杏
材村杓杖杜杞束杪杭杯杰杳杵杷松板
枇枉枋析枕林枚果枝枯枳枴架枷枸柄
柏某柑染柔柚柝柩柬柯柱柳柴柺栓栖
栗校株核根格栽桀桁桂桃案桎桐桑桓
桔桶桿梁梅梏梓梗梢梧梨梭梯械梳梵
棉棋棌棍棒棕棘棚棠森棲棹棺椅植椎
椒椰椽椿楔楚楞楠楫楮楷楸楹榕榖榛
榜榦榧榴榻槁槌槐槽槿樊樑樗樟模樴
樵樸樽橄橘橙機橡橦檀檄檎檗檯櫂欠
次欣欲欺款歇歌止正此武歪死殀殃殄
殆殉殊殖段殷殿毅毋毌母毒毓比毛毫
毬氏民氓水永氾汀汁求汎汐汕汗汝汞
江池汨汪汰汲汽汾沁沂沃沈沉沌沐沓
沙沛沫沮河沸油治沼沽沾沿泄泉泊泌
泓法泗泛泡波泣泥注泯泰泳洋洌洗洙
洛洞津洩洪洲洵活洽派流浙浚浣浦浩
浪浮浴海浸涅消涌涎涓涕涯液涵淀淅
淆淇淋淑淒淘淙淞淡淩淫淮深淳混淹
添渚渠渡渣渤渥渫渭港游渺湃湍湖湘
湛湟湣湧湫湮源準溜溟溢溥溪溯溶溺
滂滋滑滓滔滴漂漆漏演漕漠漫漱潅潘
潭潮潺潼澂澄澎澔澱澳澹激濂濛濠濡
濬濯瀋瀑瀚瀛灌火灰灸灼炊炎炒炙炤
炬炭炯炳炸烈烙烹烽焉焙焚焦然煌煎
煖煤煦照煮煽熄熊熏熔熙熟熬熹燃燎
燔燕燥燧燮燻燿爆爪爬爰爵父爻爽牀
片版牌牒牙牛牝牟牡牢牧物牲牴特犀
犁犇犬犯狂狄狎狐狗狙狡狩狸狼猊猖
猛猜猝猥猩猷猾猿獗玄率玉王玖玩玲
玳珀珂珊珍珞珠珥珪班珮球琅理琉琍
琢琥琯琱琳琴琵琶瑁瑕瑙瑚瑛瑜瑞瑟
瑯瑾璃璋璞璧瓜瓠瓢瓣瓦瓮瓷甄甑甕
甘甚生甥用甫甬田由甲申男甸町畄界
畏畔留畛畜略畦番畸畿疆疊疋疏疑疝
疥疫疲疳疵疸疹疼疽疾痂病症痍痒痔
痕痘痛痠痢痰痲痳痴痼瘉瘟瘠瘢瘤癌
癒癖癡癢癥癸登白百的皆皇皎皓皮皿
盂盃盆盈益盒盛盟目盲直相盾省眄眈
眉看眠眩眷眸眺眼着睏睛睡督睦睪睫
睹睾睿瞋瞑瞥瞬瞭瞰瞳瞻瞿矇矗矛矜
矢矣知矩短矮石矽砂砒砥砦砧破硃硅
硝硫硬硼碁碇碌碎碑碕碗碣碧磁磅磊
磋磐磨磬礁示社祀祁祂祇祈祉祐祕祖
祗祚祝神祠祥票祭祺禁福禦禧禳禹禽
禾秀私秉秋科秒秕秘租秤秦秧秩移稀
程稍稔稗稚稠稲稷稻稼稽稿穀穂穆穗
穰穴究穹空穿突窄窈窒窕窘窟立站竟
章竣童竭端竹竺竿笏笑笙笛笞笠符第
等筋筌筏筐筑筒答策筮筵箔箕算箝管
箭箱箴箸篁範篆篇築篲簇簑簧簪簿籍
籐米粉粒粕粗粘粟粥粱粲粳粹精糊糖
糟糠糢系紊素索紫累絃絮綵緻縯繁繈
繦繫纂纍纔纛缶缸缺罋罐罔罕罪置署
罹羊羌美羔羚羞群羲羸羹羽翁翅翊翌
翔翕翠翡翩翰翼耀老考者耆而耐耑耕
耗耘耡耳耶耽耿聆聊聘聚聿肄肆肇肉
肋肌肖肛肝股肢肥肩肪肯肱育肴肺胃
胄背胎胚胛胜胞胡胤胥胱胴胸能脂脆
脊脣脩脯脾腋腐腑腔腕腥腰腱腹腺腿
膀膈膊膏膜膝膣膨膳膺臀臂臆臣臧自
臭至致臺臻臼臾舅舌舍舒舛舜舞舟航
舫般舵舶舷船艇艮良色艾芋芍芒芙芝
芟芥芬芭芯花芳芸芹芽苑苒苔苗苛苞
苟苡若苦英茂范茄茅茉茍茗茨茫茯茱
茴茵茶茸茹荀荅草荏荒荘荳荷荻莉莊
莎莞莪莫莽菁菅菇菊菌菓菖菜菩菰菱
菲菴菽萃萄萌萍萎萬萱萸落著葛葡董
葫葬葵葺蒐蒙蒜蒡蒲蒸蒿蓄蓆蓉蓍蓑
蓬蓼蔆蔑蔓蔔蔗蔚蔡蔬蔽蕃蕉蕓蕨薄
薇薑薙薛薨薪薯薰藉藏藕藜藤藩藷藻
虎虐虔虖虞虹蚊蚌蚓蚣蚤蚩蛇蛋蛔蛙
蛛蛟蛤蛭蛾蜀蜂蜃蜈蜘蜚蜜蝎蝗蝴蝶
螂融螟螳螺蟠蟹蟾蠍蠢血衊行衍衕街
衙衚衡衢衣表衫衰衲衷衹衾衿袁袂袈
袋袍袒袖被裁裂裏裔裕裙裟裡裨裳裴
裸製褐褒褓褥褪褶襁襄襟西要覃覆覈
覜角觔觝解言託訢註誌誓諠諮謼警譬
讌讎谷谿豁豆豌豕豚象豪豫豹豺貂貊
貌貍賸赤赦赫走赳赴起超越趣足趺趾
跋跌跏跛距跣跨路跳跼踊踏踞踰踴踵
蹂蹄蹇蹈蹉蹊蹙蹧蹴蹶躁躇身躬輓辛
辜辣辨辰辱迂迅迎近返迦迪迫迭述迴
迷迺迻追退送逃逅逆逋逍透逐逑途逗
通逝逞速造逡逢逮週逵逸逼逾遁遂遇
遊遍遐遑道遝遣遭遮遵遽避邀邂邃邑
那邦邨邪邯邱邵邸郁郃郊郡部郭都鄂
鄙酉酊酋酌配酎酒酢酩酪酬酵酷酸醇
醉醋醍醒醜醯醴醵醼采釉里重野量釐
金釜鈔鉅錶鏇鏚鑵钜镟閤閧闆闇闘阜
阡阨阪阬阮阯防阻阿陀陂附陋陌降限
陛陞陟院除陥陪陵陶陷隄隅隆隋隍隔
隘隙障隧隻雀雁雄雅集雇雉雌雍雎雕
雨雪雲零雷雹需霆震霑霓霖霜霞霤霰
露霹靖非靡面革靴鞋鞍鞠鞦鞫鞭韆音
韶頫願颱颳食餐餘餚餬首香馥馨骨骸
髓高髴鬆鬍鬥鬨鬪鬱鬼魁魂魃魄魅魏
魔鵰鷰鹹鹿麒麓麝麟麤麪麴麵麻麾黍
黎黔默黛黜鼎鼓鼕鼠鼡鼻齣龢
#]]]'''#'''
__all__
from script.收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地 import 收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地扌
from script.收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地 import *
