#__all__:goto
#TODO:goto
r'''[[[
e script/整数分解牜尸方法牜吸引子.py
view ../../python3_src/seed/algo/rho_method.py
view ../../python3_src/seed/algo/rho_method__7iter.py

script.整数分解牜尸方法牜吸引子
py -m nn_ns.app.debug_cmd   script.整数分解牜尸方法牜吸引子 -x # -off_defs
py -m nn_ns.app.doctest_cmd script.整数分解牜尸方法牜吸引子:__doc__ -ht # -ff -df
#######
[[
@20260604:傍晚
逐步搜索，避免一步到位:
    [x1 == x0 -f(x0)/f'(x0)]
    [f(x)==a*x**2+b*x+c]
    [f'(x)==2*a*x+b]
    x0
    y0:=f(x0)
    k0:=f'(x0)
    k0==y0/(x0-x1)
    x1 == x0 -y0/k0
    x1 == x0 -(a*x0**2+b*x0+c)/(2*a*x0+b)
        == (a*x0**2-c)/(2*a*x0+b)
        == x0/2 +(-c-x0*b/2)/(2*a*x0+b)
        == x0/2 -(c+x0*b/2)/(2*a*x0+b)
        == x0/2 -b/4/a -(c-b/4/a *b)/(2*a*x0+b)
        == x0/2 -b/4/a +(b**2 -4*a*c)/(2*a*x0+b)/4/a
        == (2*a*x0 -b)/4/a +(b**2 -4*a*c)/(2*a*x0+b)/4/a
    2*a*x1 == (2*a*x0 -b)/2 +(b**2 -4*a*c)/(2*a*x0+b)/2
    [z1 == (z0-b)/2 +D/(z0+b)/2][(D-b**2)%4 == 0]
        [b%2==1] <-> [D%4==1]
        [b%2==0] <-> [D%4==0]
        [b%2==D%4]
        [D%4 < 2]
    [t*z1 == (t*z0-t*b)/2 +t**2*D/(t*z0+t*b)/2][(D-b**2)%4 == 0]
    [y1 == (y0-tb)/2 +ttD/(y0+tb)/2][(ttD-tb**2)%4 == 0]
    [t:=-1] => b符号改变，D不变
    即(b**2,D)可同比例缩放{缩放倍数必须是平方以保证Jacobi_symbol(M;D)不变}{b符号任意改变}，森林结构不变

    [z1:=s1+ds]
    [z0:=s0+ds]
    [s1+ds == (s0+ds-b)/2 +D/(s0+ds+b)/2][(D-b**2)%4 == 0]
    [s1 == (s0-ds-b)/2 +D/(s0+ds+b)/2][(D-b**2)%4 == 0]
    [s1 == (s0-(ds+b))/2 +D/(s0+(ds+b))/2][(D-b**2)%4 == 0]
    [b:=d-ds]
    [s1 == (s0-d)/2 +D/(s0+d)/2][(D-(d-ds)**2)%4 == 0]
        [b%2==D%4]
        [(d-ds)%2==D%4]
        [D%4 < 2]
    [s1 == (s0-d)/2 +D/(s0+d)/2][D%4 < 2]
    即b可随意改变，森林结构不变
    结合上面有:
        D可缩放平方倍，森林结构不变
        b可随意改变，森林结构不变
    [d:=0]
    [s1 == s0/2 +D/s0/2][D%4 < 2]
    [Jacobi_symbol(M; Dn) == -1][Dn%4 < 2]
    [Jacobi_symbol(M; Dp) == +1][Dp%4 < 2]
    森林结构只有两种:假设[M素数]:
        [x1 == x0/2 +Dn/x0/2][Dn%4 < 2][Jacobi_symbol(M; Dn) == -1]
        [x1 == x0/2 +Dp/x0/2][Dp%4 < 2][Jacobi_symbol(M; Dp) == +1]

    [M==p*q][Jacobi_symbol(M; D) == -1]:
        [Jacobi_symbol(p; D) == -Jacobi_symbol(q; D)]


try_tab__search_:goto
    失败@[M:=49123]
    但表现已经相当好了
iter_try_square__search_:goto

改进:调整比率:
    1/2+1/2 --> 2/3+1/3...
        ver=-7770 --> ver=-7771
    1/2+1/2 --> (M+1-u)/(M+1)+u/(M+1)...
        1/2+1/2 --> (1-u)+u...
        ver=-7770 --> ver=-7773 表现还行
改进:搜索立方根:
    ...
    [x1 == x0 -f(x0)/f'(x0)]
    [f(x)==a*x**3+b*x+c]
    [f'(x)==3*a*x**2+b]
    x1 == x0 -(a*x0**3+b*x0+c)/(3*a*x0**2+b)
        == (2*a*x0**3-c)/(3*a*x0**2+b)
        == x0*2/3 +(-b*x0*2/3-c)/(3*a*x0**2+b)
        == (x0*2 +(-2*b*x0-3*c)/(3*a*x0**2+b))/3
        [b:=0]
        == (x0*2 +(-c/a)/(x0**2))/3
        == (2*x0 +D/(x0**2))/3
        --> ver=-7772 表现不佳

    #:-->:
    #:[x1 == x0 -f(x0)/f'(x0)]
    #:[f(x)==a*x**3+b*x**2+c]
    #:[f'(x)==3*a*x**2+2*b*x]
    #:x1 == x0 -(a*x0**3+b*x0**2+c)/(3*a*x0**2+2*b*x0)
    #:    == (2*a*x0**3+b*x0**2-c)/(3*a*x0**2+2*b*x0)
    #:    == x0*2/3 +(-b*x0**2*1/3-c)/(3*a*x0**2+2*b*x0)
假设[M素数][M%3 > 0]:
    [M%3 == 1]:
        森林结构只有三种
    [M%3 == 2]:
        森林结构只有一种
改进:搜索k次方根:
    [x1 == x0 -f(x0)/f'(x0)]
    [f(x)==a*x**k+c]
    [f'(x)==k*a*x**(k-1)]
    [x1 == x0 -(a*x0**k+c)/(k*a*x0**(k-1))]
    [x1 == x0*(1-1/k) +(1/k)*(-c/a)/(x0**(k-1))]
    [x1 == x0*(1-1/k) +(1/k)*D/(x0**(k-1))]
    [x1 == x0*((1-1/k) +(1/k)*D/(x0**k))]
    # 泛化比率:(1/k) --> u
    [x1 == x0*((1-u) +u*D/(x0**k))]
    [t*x1 == t*x0*((1-u) +u*t**k*D/((t*x0)**k))]
    [z1 == z0*((1-u) +u*(t**k*D)/(z0**k))]
    =>:
        森林结构数量是:gcd(k,phi(M))

等价形态:假设[M是素数]:
    [p:=M]
    (A,B,w)[A%p !<- {0,1}][w%(p-1)=!=0]
        [z1 == z0*A + B*z0**w %p]
    (A,B,e)[A%p !<- {0,1}][e%(p-1)=!=0]
        [z1 == z0*A + B/z0**e %p]
    (u,D,e)[u%p !<- {0,1}][e%(p-1)=!=0]
        [y1 == y0*(1-u) + u*D/y0**e %p]
    (D,k)[k%(p-1)=!=0][k%p=!=0]
        [x1 == x0*(1-(1/k)) + (1/k)*D/x0**k %p]

    [e =[%(p-1)]= -w]
    [e =[%(p-1)]= (p-2)*w]
    [e =[%(p-1)]= (p-1-w)]

    [A =[%p]= (1-u)]
    [B =[%p]= u*D]
    !! [A%p=!=1][u%p=!=1]
    <==>:
    [u =[%p]= (1-A)]
    [D =[%p]= B/(1-A)]

    [u =[%p]= 1/k]
    [e =[%(p-1)]= k]
    !! [u%p=!=0][e%(p-1)=!=0][k%(p-1)=!=0][k%p=!=0]
    <==>:
    [k =[%p]= 1/u]
    [k =[%(p-1)]= e]
    <==>:
    [k =[%(p*(p-1))]= e*p -(u**-1%p)*(p-1)]

    =>:遍历所有 (A,B,e)[A%p !<- {0,1}][e%(p-1)=!=0]，列出最优值，考察其原理...
    TODO


改进:调整步长:
    [x1 == x0 -f(x0)/f'(x0)]
    -->:
    [x1 == x0 -w*f(x0)/f'(x0)]
    x1 == x0 -w*(a*x0**2+b*x0+c)/(2*a*x0+b)
        == ((2-w)*a*x0**2+(1-w)*b*x0-w*c)/(2*a*x0+b)
        == x0*(2-w)/2 +(-w/2*b*x0-w*c)/(2*a*x0+b)
        == x0*(2-w)/2 -w*b/4/a +(w*b**2/4/a-w*c)/(2*a*x0+b)
        == x0*(2-w)/2 -w*b/4/a +w*(b**2-4*a*c)/(2*a*x0+b)/4/a
            #vs:[w:=1]: x0/2 -b/4/a +(b**2 -4*a*c)/(2*a*x0+b)/4/a

        == (2*a*x0*(2-w) -w*b)/4/a +w*(b**2-4*a*c)/(2*a*x0+b)/4/a
            #vs:[w:=1]: (2*a*x0 -b)/4/a +(b**2 -4*a*c)/(2*a*x0+b)/4/a

    [z1 == (z0*(2-w)-w*b)/2 +w*D/(z0+b)/2]
    [z1/w == (z0/w*(2-w)-b)/2 +D/(z0+b)/2]
]]
[[
@20260604:中午
多设置几个驻点
驻点/自环根 泛化成 环状根
===
[zs::预设驻点集]
多驻点:x0*(1+a*fff(zs;x0))
  [fff(zs;x) == II[(x-z) | [z:<-zs]]]
强制指定环状根:
  驻点 本身就是 自环根
  ggg(x0)*(1+a*fff(zs;x0))
  [ggg :: zs -> zs]
  eg:
    ggg(z) = b -z
    ggg(z) = b /z
    ggg(z) = z
拉格朗日插值？
]]
[[
@20260604:晨两点
也许 可以考虑一下:%M*N，k=1,x=a**-1%(M*N), x0=a**-1%N
[k:=1]:
    [x0 := a**-1%N]
    [x1 := (2 -a*x0)*x0 %(M*N)]
    [x1%N == x0]
    [q:=a*x0//N]
    [a*x0 == (1+q*N)]
    [(1 -a*x1) %(M*N)
    == (1 -(2 -a*x0)*a*x0) %(M*N)
    == (1 -(2 -(1+q*N))*(1+q*N)) %(M*N)
    == (1 -(1-q*N)*(1+q*N)) %(M*N)
    == ((q*N)**2) %(M*N)
    == (q**2*N) %M  *N
    ]
    [a*x1 == (1-q**2*N**2) %MN]
    [a*x0 == (1+q*N)]
iter_try_MN_:goto
]]
[[
@20260604:晨一点
也许 可以考虑一下:%M**2，k=1,x=a**-1%M**2, x0=a**-1%M
[k:=1]:
    a=1/x=f(x)
    [x0 := a**-1%M]
    [x0 == (2 -a*x0)*x0 %M]
    [x1 := (2 -a*x0)*x0 %M**2]
    [x1%M == x0]
    [x1*a =[%M**2]= (2 -a*x0)*x0*a == (1-(a*x0-1))*(1+(a*x0-1)) == 1-(a*x0-1)**2]
    [1-x1*a =[%M**2]= (a*x0-1)**2 =[%M**2]= 0]
        ...一步到位，反而无用
    窜改:
    [x1 := (3 -2*a*x0)*x0 %M**2]
    [x2 := (3 -2*a*x1)*x1 %M**2]
    [x1%M == x0]
    [q:=a*x0//M]
    [a*x0 == (1+q*M)]
    [a*x1 %M**2
    == (3 -2*a*x0)*a*x0 %M**2
    == (3 -2*(1+q*M))*(1+q*M) %M**2
    == (3*(1+q*M) -2*(1+q*M)*(1+q*M)) %M**2
    == (3*(1+q*M) -2*(1+2*q*M)) %M**2
    == (1 -q*M) %M**2
    == (2 -x0) %M**2
    ]
    [a*x2 %M**2
    == (3 -2*a*x1)*a*x1 %M**2
    == (3 -2*(1-q*M))*(1-q*M) %M**2
    == (3*(1-q*M) -2*(1-q*M)*(1-q*M)) %M**2
    == (3*(1-q*M) -(2-4*q*M)) %M**2
    == (1+q*M) %M**2
    == a*x0 %M**2
    ]
    [x2 == x0]
    [ver:=2] => [周期<=2]

iter_try_square__reciprocal_:goto

[k>=1]:
    [x1 =[%M]= x0*((1+vk) -a*vk*x0**k)]
    -->:
    [a*x0**k %M == 1]
    [vk*k %M**2 == 1]
    [x1 =[%M**2]= x0*((1+vk) -a*vk*x0**k)]
    ???[a*x1**k %M**2 =?= 1]???

    [(1-a*x0**k) %M == 0]
    [(1-a*x0**k)**2 %M**2 == 0]
    [(a*x1**k -1) %M**2
    == (a*x0**k*((1+vk) -a*vk*x0**k)**k -1) %M**2
    == (vk**k*a*x0**k*((k+1) -a*x0**k)**k -1) %M**2
    == (vk**k*a*x0**k*(k+(1 -a*x0**k))**k -1) %M**2
    == (vk**k*a*x0**k*(k**k+k*k**(k-1)*(1 -a*x0**k) +0...) -1) %M**2
    == (a*x0**k*(1+1*(1 -a*x0**k) +0...) -1) %M**2
    == (a*x0**k*(1+(1 -a*x0**k)) -1) %M**2
    == ((1-(1 -a*x0**k))*(1+(1 -a*x0**k)) -1) %M**2
    == (1-(1 -a*x0**k)**2 -1) %M**2
    !! [(1-a*x0**k) %M == 0]
    == 0
    ]
    [a*x1**k %M**2 == 1]
        ...一步到位，反而无用
]]

[[
@20260604
###############################
没用！
###############################
吸引子:
f(x) ~= f(x0) +f'(x0)*(x-x0)
x ~= x0 +(f(x) -f(x0))/f'(x0)

x==a**/-k
a==x**-k
f(x)==a==x**-k
f'(x)==-k*x**-(k+1)
x ~= x0 +(f(x) -f(x0))/f'(x0)
    == x0 +(a -x0**-k)/(-k*x0**-(k+1))
    == x0 +(a*x0**(k+1) -x0)/(-k)
    == x0*((k+1) -a*x0**k)/k
    [vk:=pow(k,-1,M)]
    =[%M]= x0*((1+vk) -a*vk*x0**k)
    [vb:=pow(b,-1,M)]
    =[%M]= x0*((1+vk) -b*(vb*a)*vk*x0**k)
[(vb*a) =[%M]= t**k]
[t =[%M]= (vb*a)**pow(k,-1,phi(M))]
t*x ~=[%M]= (t*x0)*((1+vk) -b*vk*(t*x0)**k)
  (M,a,x0) --> (M,b,t*x0)
    类似 子群克隆体

t*x ~=[%M]= (t*x0)*((1+vk) -(a*t**-k)*vk*(t*x0)**k)
  (M,a,x0) --> (M,(a*t**-k),t*x0)
    [k:=1][is_prime_(M)] => t**-k 必然存在，此时 a值不重要


[k:=1]
    a=1/x=f(x)
    x ~= 2*x0 -a*x0**2


[k:=1][is_prime_(M)][a=!=0]:
    [a值不重要]
    [x ~= (2 -a*x0)*x0]
    [x1 := (2 -a*x0)*x0]
    [a:=1]:
        [x1 == (2 -x0)*x0]
        [x0:=0] => [x1==0]
        [x0:=2] => [x1==0]
        [x0:=1] => [x1==1]
        注意:[M:=1019] => 存在 极大环状根 规模为508:[1019==3+2*508]

        [x0:=-1] => [x1==-3]
        [x0:=3] => [x1==-3]
        x1 => [x0a+x0b == 2]
            对称性
    [y(z) == (2 -a*z)*z]
    [由于是二次函数，逆函数 要么两根，要么零根]
    每棵树 有 一个 环状根，由于根上节点必然有逆，故高度一的节点 必存在，与环状根同规模、一一对应，更高节点形成二叉树
        但同一环状根上的这些二叉树高度是否一致？
    [y == (2 -a*z)*z]
    [a*z**2 -2*z +y == 0]
    [va := a**-1%M]
    [z**2 -2*va*z +va*y == 0]
        [z0(y)+z1(y) == 2*va]#对称性
        [z0(y)*z1(y) == y*va]
        [z1(y) == 2*va -z0(y)]
        [z1(y) == y*va /z0(y)]
        唯一重根是va，va是唯一自环根，va是唯一零高树
    [(z-va)**2 == (va**2 -va*y)]
    y非叶节点 <==> z(y)存在 <==> (va**2 -va*y) 是 平方剩余
    [a**2*(z-va)**2 == (1 -a*y)]
    [(1-a*z)**2 == (1 -a*y)]
    y非叶节点 <==> (1 -a*y) 是 平方剩余
    !! [z0(y)+z1(y) == 2*va]#对称性

    [a*z0(y)+a*z1(y) == 2]
    [(1-a*z0(y)) +(1-a*z1(y)) == 0]
    [(1-a*z0(y)) == -1*(1-a*z1(y))]
    [M%4 == 1]:
        [-1是 平方剩余]
        [z0(y),z1(y) 同时是或同时非 叶节点]
        除了va，所有树 高度至少为二
    [M%4 == 3]:
        [-1非 平方剩余]
        [z0(y),z1(y) 一为 叶节点，另一为 非叶节点]
        除了va，所有树 高度为一

    ##############################
    !! [(1-a*z)**2 == (1 -a*y)]
    序列 其实是 (1-w**2**k)/a，周期是order_mod_(phi(M);2)
    没用！
    ##############################
]]


'#'; __doc__ = r'#'
>>>


[[
k:=2
    3次多项式
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =2 =43
    #注意:[M%(1+k) == 0]
    {0: 1, 1: 1, 42: 1, 8: 3, 18: 3}
    {0: (44, -1), 1: (2, 2), 42: (2, 2), 8: (2, 8), 18: (2, 8)}
    (5, 3, 8)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =2 =47
    #注意:[M%(1+k) =!= 0]
    {0: 1, 1: 1, 46: 1, 20: 4}
    {0: (3, 3), 1: (4, 4), 46: (4, 4), 20: (1, 4)}
    (4, 4, 4)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =2 =1021
    {0: 1, 1: 1, 1020: 1, 37: 12, 8: 6, 22: 4, 41: 6, 106: 2}
    {0: (3, 5), 1: (1, 1), 1020: (1, 1), 37: (1, 63), 8: (1, 6), 22: (1022, -1), 41: (1, 6), 106: (1, 1)}
    (8, 12, 63)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =2 =1019
    {0: 1, 1: 1, 1018: 1, 8: 60, 172: 17, 59: 17, 122: 6, 32: 2, 79: 6}
    {0: (1, 1), 1: (3, 3), 1018: (3, 3), 8: (1, 22), 172: (1, 30), 59: (1, 30), 122: (1, 4), 32: (1020, -1), 79: (1, 4)}
    (9, 60, 30)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =2 ='1+2**8'
    {0: 1, 1: 1, 256: 1, 9: 22, 14: 4}
    {0: (258, -1), 1: (1, 1), 256: (1, 1), 9: (1, 16), 14: (3, 10)}
    (5, 22, 16)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =2 ='1+2**16'
    {0: 1, 1: 1, 65536: 1, 127: 694, 209: 50, 502: 98, 2356: 68, 271: 29, 3136: 29, 3750: 6, 1265: 54}
    {0: (65538, -1), 1: (1, 1), 65536: (1, 1), 127: (1, 246), 209: (1, 43), 502: (1, 65), 2356: (1, 50), 271: (1, 29), 3136: (1, 29), 3750: (1, 4), 1265: (1, 12)}
    (11, 694, 246)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =2 ='65521'
    {0: 1, 1: 1, 65520: 1, 525: 518, 3124: 4, 1742: 8, 9569: 19, 76: 21, 1438: 19, 23837: 8, 5419: 4, 1543: 21, 1041: 8, 2364: 4, 2328: 8, 12017: 2, 28015: 4, 14409: 2, 26815: 2}
    {0: (1, 1), 1: (1, 1), 65520: (1, 1), 525: (1, 255), 3124: (1, 107), 1742: (1, 24), 9569: (1, 36), 76: (1, 30), 1438: (1, 36), 23837: (1, 24), 5419: (1, 107), 1543: (1, 30), 1041: (1, 5), 2364: (1, 2), 2328: (1, 5), 12017: (2, 5), 28015: (1, 2), 14409: (65522, -1), 26815: (65522, -1)}
    (19, 518, 255)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =2 ='65519'
    {0: 1, 1: 1, 65518: 1, 5165: 12, 912: 41, 19267: 7, 1383: 74, 996: 53, 1186: 53, 7656: 7, 929: 41, 897: 28, 5252: 2}
    {0: (3, 3), 1: (3, 4), 65518: (3, 4), 5165: (1, 65), 912: (1, 299), 19267: (1, 340), 1383: (1, 77), 996: (1, 102), 1186: (1, 102), 7656: (1, 340), 929: (1, 299), 897: (1, 21), 5252: (65520, -1)}
    (13, 74, 340)

]]

[[
k:=4
    5次多项式
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =4 =43
    {0: 1, 1: 1, 7: 4, 42: 1, 13: 2}
    {0: (44, -1), 1: (1, 6), 7: (1, 4), 42: (1, 6), 13: (44, -1)}
    (5, 4, 6)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =4 =47
    {0: 1, 1: 1, 12: 2, 7: 2, 10: 2, 46: 1}
    {0: (48, -1), 1: (3, 3), 12: (1, 6), 7: (1, 1), 10: (1, 1), 46: (3, 3)}
    (6, 2, 6)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =4 =61
    {0: 1, 1: 1, 7: 4, 8: 2, 11: 1, 27: 2, 60: 1, 50: 1}
    {0: (62, -1), 1: (1, 1), 7: (2, 4), 8: (1, 3), 11: (1, 1), 27: (1, 3), 60: (1, 1), 50: (1, 1)}
    (8, 4, 4)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =4 =1021
    {0: 1, 1: 1, 647: 1, 18: 24, 374: 1, 26: 24, 1020: 1, 51: 8, 32: 2, 284: 2}
    {0: (1, 1), 1: (3, 15), 647: (3, 15), 18: (1, 24), 374: (3, 15), 26: (1, 24), 1020: (3, 15), 51: (3, 3), 32: (1, 3), 284: (1, 3)}
    (10, 24, 24)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =4 =1019
    {0: 1, 1: 1, 274: 3, 201: 3, 375: 2, 1018: 1}
    {0: (1, 1), 1: (1020, -1), 274: (1, 42), 201: (1, 42), 375: (1020, -1), 1018: (1020, -1)}
    (6, 3, 42)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =4 =1013
    {0: 1, 1: 1, 141: 6, 50: 12, 7: 6, 54: 6, 107: 6, 31: 6, 968: 1, 88: 8, 45: 1, 86: 8, 240: 6, 1012: 1, 263: 4}
    {0: (1014, -1), 1: (2, 2), 141: (1, 7), 50: (1, 20), 7: (1, 7), 54: (1, 8), 107: (1, 7), 31: (1, 8), 968: (2, 2), 88: (1, 4), 45: (2, 2), 86: (1, 4), 240: (1, 7), 1012: (2, 2), 263: (1014, -1)}
    (15, 12, 20)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =4 ='1+2**8'
    {0: 1, 1: 1, 87: 2, 29: 2, 38: 2, 84: 2, 7: 12, 8: 5, 16: 1, 150: 2, 94: 2, 50: 2, 241: 1, 37: 5, 126: 5, 59: 2, 53: 5, 256: 1}
    {0: (258, -1), 1: (1, 2), 87: (1, 9), 29: (1, 9), 38: (6, 7), 84: (6, 7), 7: (1, 7), 8: (1, 1), 16: (1, 2), 150: (1, 9), 94: (6, 7), 50: (1, 9), 241: (1, 2), 37: (1, 1), 126: (1, 1), 59: (6, 7), 53: (1, 1), 256: (1, 2)}
    (18, 12, 9)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ =4 ='1+2**16'
    {0: 1, 1: 1, 22: 172, 194: 172, 53: 18, 256: 1, 424: 18, 2977: 28, 719: 18, 1042: 18, 65536: 1, 65281: 1}
    {0: (65538, -1), 1: (1, 11), 22: (1, 195), 194: (1, 195), 53: (1, 6), 256: (1, 11), 424: (1, 6), 2977: (1, 10), 719: (1, 6), 1042: (1, 6), 65536: (1, 11), 65281: (1, 11)}
    (12, 172, 195)


(num_trees, max_len_period, max_height)
    [ver:=-6669] => [a值影响结果！]
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6669 =1 =43 =1
    {0: 1, 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 1, 7: 1, 12: 7}
    {0: (44, -1), 1: (1, 1), 2: (1, 6), 3: (44, -1), 4: (44, -1), 5: (44, -1), 6: (2, 2), 7: (44, -1), 12: (1, 3)}
    (9, 7, 6)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6669 =1 =43 =17
    {0: 1, 1: 1, 42: 1, 39: 1, 38: 1, 40: 1, 41: 1}
    {0: (1, 1), 1: (2, 2), 42: (1, 1), 39: (5, 7), 38: (4, 7), 40: (1, 2), 41: (1, 1)}
    (7, 1, 7)
    此俩处证明:[ver:=-6669] => [a值影响结果！]

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6669 =1 =47 =1
    (9, 5, 12)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6669 =1 =47 =17
    (11, 2, 8)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6669 =1 =1019 =1
    (11, 8, 84)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6669 =1 =1019 =17
    (11, 15, 47)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6669 =1 =65521 =1
    (15, 177, 248)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6669 =1 =65521 =17
    (12, 85, 928)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6669 =1 =65519 =1
    (10, 183, 322)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6669 =1 =65519 =17
    (12, 105, 356)







py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6660 =1 =65519 =1
    (22, 540, 335)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6660 =1 =65519 =17
    (22, 299, 396)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6660 =1 =65521 =1
    (21, 119, 393)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6660 =1 =65521 =17
    (25, 174, 585)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6660 =1 =65521 =1777
    (24, 125, 660)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6660 =1 =1019 =1
    (15, 4, 49)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__neg_kth_root_ --ver=-6660 =1 =1019 =19
    (13, 11, 80)
]]
[[
ver=1
    [ver:=1] => [周期==1]
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,3:iter_try_square__reciprocal_ =47 =5
    19
    442
    442
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,3:iter_try_square__reciprocal_ =43 =5
    26
    370
    370

ver=2
    [ver:=2] => [周期<=2]
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,3:iter_try_square__reciprocal_ --ver=2  =47 =5
    19
    865
    19
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,3:iter_try_square__reciprocal_ --ver=2  =43 =5
    26
    714
    26
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,3:iter_try_square__reciprocal_ --ver=2  =1019 =5
    204
    622813
    204








ver=3
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=3  =47 =5
    (0, 46, 46, 19)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9:iter_try_square__reciprocal_ --ver=3  =43 =5
    26
    1058
    843
    1273
    413
    284
    542
    26
    (0, 7, 7, 26)


ver=6
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,23:iter_try_square__reciprocal_ --ver=6  =43 =5
    (0, 21, 21, 26)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=6  =47 =5
    (0, 23, 23, 19)

ver=-3
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-3  =43 =5
    26
    1058
    843
    1273
    413
    284
    542
    26
    (0, 7, 7, 26)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-3  =47 =5
    (0, 46, 46, 19)

ver=-33
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-33  =43 =5
    26
    26
    (0, 1, 1, 26)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-33  =47 =5
    (0, 1, 1, 19)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-33  =47 =17
    (0, 1, 1, 36)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-33  =1019 =17
    (0, 1, 1, 60)

ver=-1
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-1  =43 =5
    (0, 42, 42, 26)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-1  =47 =5
    (0, 23, 23, 19)

ver=-333
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-333  =43 =5
    26
    499
    1144
    800
    1015
    112
    1101
    757
    1402
    1273
    69
    69
    (10, 11, 1, 69)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-333  =47 =5
    19
    1006
    677
    2181
    1523
    301
    301
    (5, 6, 1, 301)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-333  =1019 =17
    60
    603308
    509560
    166157
    478990
    537073
    1026193
    572738
    482047
    218126
    383204
    895761
    238506
    218126
    (9, 13, 4, 218126)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-333  =193707721 =17
    (3705, 6360, 2655, 2633797654659112)

ver=-666
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-666  =43 =5
    (3, 10, 7, 241)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-666  =47 =5
    (1, 2, 1, 442)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-666  =1019 =17
    (0, 1, 1, 60)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-666  =193707721 =17
    ...未成尸

ver=-667
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-667  =43 =5
    (1, 4, 3, 456)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-667  =47 =5
    (0, 22, 22, 19)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-667  =1019 =5
    (4, 5, 1, 830689)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-667  =193707721 =5
    ...未成尸

ver=-668
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-668  =43 =5
    (3, 4, 1, 1789)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-668  =47 =5
    (2, 3, 1, 2181)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-668  =1019 =5
    (34, 56, 22, 932589)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-668  =193707721 =5
    ...未成尸

ver=-669
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-669  =43 =5
    (2, 3, 1, 69)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-669  =47 =5
    (6, 7, 1, 113)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-669  =1019 =5
    (19, 20, 1, 827632)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-669  =193707721 =5
    (1664, 5715, 4051, 3298046504862867)

ver=-6666
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-6666  =43 =5
    (3, 4, 1, 456)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-6666  =47 =5
    (1, 2, 1, 442)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-6666  =1019 =5
    (30, 50, 20, 888772)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-6666  =193707721 =5
    ...未成尸


ver=-6667
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-6667  =43 =5
    (4, 5, 1, 1574)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-6667  =47 =5
    (2, 3, 1, 724)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-6667  =1019 =5
    (9, 39, 30, 598357)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_square__reciprocal_ --ver=-6667  =193707721 =5
    (6064, 6856, 792, 25441291548618448)



]]
[[
又见508@1019 => 本性难移
===
iter_try_MN_
===
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_MN_ --ver=1  =47 =44 =17
    13
    1289
    1465
    761
    145
    629
    497
    1949
    981
    1773
    673
    717
    1289
    (1, 12, 11, 1289)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_MN_ --ver=1  =47 =45 =17
    8
    1043
    98
    1898
    638
    1808
    323
    1538
    908
    2033
    1853
    8
    (0, 11, 11, 8)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_MN_ --ver=1  =47 =46 =17
    19
    387
    1537
    1951
    1583
    939
    1767
    1721
    801
    1675
    1445
    19
    (0, 11, 11, 19)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_MN_ --ver=1  =47 =43 =17
    38
    1801
    1328
    1242
    1371
    855
    1414
    253
    1672
    210
    511
    81
    1801
    (1, 12, 11, 1801)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_MN_ --ver=1  =43 =47 =17
    36
    271
    1023
    1916
    318
    1399
    83
    271
    (1, 7, 6, 271)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_MN_ --ver=1  =43 =46 =17
    19
    1813
    1675
    1261
    1813
    (1, 4, 3, 1813)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_MN_ --ver=1  =43 =45 =17
    8
    863
    1358
    863
    (1, 3, 2, 863)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_MN_ --ver=1  =43 =44 =17
    13
    937
    497
    189
    453
    1201
    13
    (0, 6, 6, 13)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_MN_ --ver=1  =1019 =444 =17
    (1, 509, 508, 162713)
    又见508
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_MN_ --ver=1  =1019 =4444 =17
    (1, 509, 508, 265333)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,9999:iter_try_MN_ --ver=1  =1021 =444 =17
    (1, 9, 8, 164489)

]]
[[
py_adhoc_call   seed.math.Jacobi_symbol   @Jacobi_symbol =1019 =19
    1
py_adhoc_call   seed.math.Jacobi_symbol   @Jacobi_symbol =1019 =-19
    -1
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =1019 =1 =19
    #(M, D, b, Jacobi_symbol(M, D))=(1019, 944, 1, -1)
    #(M, D, b, z0, g)=(1019, 944, 1, 1018, 1019)
    {276: 8, 1: 8, 32: 8, 3: 4, 4: 2, 30: 8, 6: 8, 224: 8, 56: 8, 97: 8, 112: 8, 260: 8, 206: 8, 194: 8, 25: 8, 269: 8, 87: 8, 203: 8, 22: 8, 200: 8, 132: 8, 36: 8, 110: 8, 84: 8, 55: 8, 90: 8, 94: 4, 146: 8, 376: 8, 102: 8, 559: 4, 109: 8, 258: 8, 164: 8, 1018: 1}
    {276: (2, 2), 1: (2, 2), 32: (2, 2), 3: (2, 2), 4: (2, 2), 30: (2, 2), 6: (2, 2), 224: (2, 2), 56: (2, 2), 97: (2, 2), 112: (2, 2), 260: (2, 2), 206: (2, 2), 194: (2, 2), 25: (2, 2), 269: (2, 2), 87: (2, 2), 203: (2, 2), 22: (2, 2), 200: (2, 2), 132: (2, 2), 36: (2, 2), 110: (2, 2), 84: (2, 2), 55: (2, 2), 90: (2, 2), 94: (2, 2), 146: (2, 2), 376: (2, 2), 102: (2, 2), 559: (2, 2), 109: (2, 2), 258: (2, 2), 164: (2, 2), 1018: (1, 1)}
    (35, 8, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =1019 =1 =-19
    #(M, D, b, Jacobi_symbol(M, D))=(1019, 77, 1, -1)
    #(M, D, b, z0, g)=(1019, 77, 1, 1018, 1019)
    {124: 8, 126: 8, 483: 8, 3: 8, 4: 8, 175: 8, 6: 8, 7: 8, 9: 8, 41: 8, 12: 8, 310: 8, 37: 8, 205: 8, 73: 4, 44: 8, 20: 8, 292: 8, 25: 8, 100: 8, 62: 8, 56: 8, 39: 8, 143: 8, 109: 8, 105: 8, 226: 8, 115: 8, 247: 4, 84: 8, 70: 8, 309: 2, 1018: 1, 245: 8, 230: 4}
    {124: (2, 2), 126: (2, 2), 483: (2, 2), 3: (2, 2), 4: (2, 2), 175: (2, 2), 6: (2, 2), 7: (2, 2), 9: (2, 2), 41: (2, 2), 12: (2, 2), 310: (2, 2), 37: (2, 2), 205: (2, 2), 73: (2, 2), 44: (2, 2), 20: (2, 2), 292: (2, 2), 25: (2, 2), 100: (2, 2), 62: (2, 2), 56: (2, 2), 39: (2, 2), 143: (2, 2), 109: (2, 2), 105: (2, 2), 226: (2, 2), 115: (2, 2), 247: (2, 2), 84: (2, 2), 70: (2, 2), 309: (2, 2), 1018: (1, 1), 245: (2, 2), 230: (2, 2)}
    (35, 8, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =1019 =1 =17
    #(M, D, b, Jacobi_symbol(M, D))=(1019, 952, 1, 1)
    #(M, D, b, z0, g)=(1019, 952, 1, 1018, 1019)
    {0: 508, 193: 1, 824: 1, 1018: 1}
    {0: (1, 1), 193: (1020, -1), 824: (1020, -1), 1018: (1020, -1)}
    (4, 508, 1)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =1021 =1 =17
    #(M, D, b, Jacobi_symbol(M, D))=(1021, 954, 1, 1)
    #(M, D, b, z0, g)=(1021, 954, 1, 1020, 1021)
    {0: 8, 52: 8, 9: 8, 85: 8, 199: 8, 6: 4, 16: 8, 62: 8, 89: 8, 179: 8, 97: 8, 53: 8, 121: 8, 46: 8, 528: 8, 189: 8, 222: 8, 28: 8, 26: 8, 103: 8, 129: 8, 32: 8, 144: 8, 36: 8, 65: 8, 185: 4, 138: 8, 223: 8, 57: 8, 270: 8, 255: 8, 232: 4, 150: 8, 386: 2, 1020: 1, 359: 1, 660: 1}
    {0: (2, 2), 52: (2, 2), 9: (2, 2), 85: (2, 2), 199: (2, 2), 6: (2, 2), 16: (2, 2), 62: (2, 2), 89: (2, 2), 179: (2, 2), 97: (2, 2), 53: (2, 2), 121: (2, 2), 46: (2, 2), 528: (2, 2), 189: (2, 2), 222: (2, 2), 28: (2, 2), 26: (2, 2), 103: (2, 2), 129: (2, 2), 32: (2, 2), 144: (2, 2), 36: (2, 2), 65: (2, 2), 185: (2, 2), 138: (2, 2), 223: (2, 2), 57: (2, 2), 270: (2, 2), 255: (2, 2), 232: (2, 2), 150: (2, 2), 386: (2, 2), 1020: (1, 1), 359: (1022, -1), 660: (1022, -1)}
    (37, 8, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =1021 =1 =19
    +1
    (37, 8, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =1021 =1 =13
    +1
    (37, 8, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =1021 =1 =23
    +1
    (37, 8, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =1021 =1 =29
    +1
    (37, 8, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =1021 =1 =27
    #(M, D, b, Jacobi_symbol(M, D))=(1021, 914, 1, -1)
    #(M, D, b, z0, g)=(1021, 914, 1, 1020, 1021)
    {0: 9, 153: 9, 2: 9, 3: 9, 4: 9, 55: 9, 377: 9, 75: 9, 9: 9, 12: 9, 11: 9, 14: 9, 15: 9, 16: 9, 17: 9, 65: 9, 19: 9, 21: 9, 151: 9, 24: 9, 25: 9, 54: 9, 27: 9, 28: 9, 125: 9, 36: 9, 52: 9, 35: 9, 37: 9, 50: 9, 42: 9, 45: 9, 46: 9, 47: 9, 246: 9, 207: 9, 104: 9, 224: 9, 61: 9, 184: 9, 64: 9, 83: 9, 148: 9, 122: 9, 200: 9, 130: 9, 81: 9, 85: 9, 91: 9, 503: 3, 121: 9, 141: 9, 135: 9, 137: 9, 217: 9, 163: 9, 284: 9, 210: 3, 1020: 1}
    {0: (1, 1), 153: (1, 1), 2: (1, 1), 3: (1, 1), 4: (1, 1), 55: (1, 1), 377: (1, 1), 75: (1, 1), 9: (1, 1), 12: (1, 1), 11: (1, 1), 14: (1, 1), 15: (1, 1), 16: (1, 1), 17: (1, 1), 65: (1, 1), 19: (1, 1), 21: (1, 1), 151: (1, 1), 24: (1, 1), 25: (1, 1), 54: (1, 1), 27: (1, 1), 28: (1, 1), 125: (1, 1), 36: (1, 1), 52: (1, 1), 35: (1, 1), 37: (1, 1), 50: (1, 1), 42: (1, 1), 45: (1, 1), 46: (1, 1), 47: (1, 1), 246: (1, 1), 207: (1, 1), 104: (1, 1), 224: (1, 1), 61: (1, 1), 184: (1, 1), 64: (1, 1), 83: (1, 1), 148: (1, 1), 122: (1, 1), 200: (1, 1), 130: (1, 1), 81: (1, 1), 85: (1, 1), 91: (1, 1), 503: (1, 1), 121: (1, 1), 141: (1, 1), 135: (1, 1), 137: (1, 1), 217: (1, 1), 163: (1, 1), 284: (1, 1), 210: (1, 1), 1020: (1022, -1)}
    (59, 9, 1)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =4079 =1 =27
    #(M, D, b, Jacobi_symbol(M, D))=(4079, 3972, 1, 1)
    #(M, D, b, z0, g)=(4079, 3972, 1, 4078, 4079)
    {0: 1019, 10: 1019, 220: 1, 3857: 1, 4078: 1}
    {0: (1, 1), 10: (1, 1), 220: (4080, -1), 3857: (4080, -1), 4078: (4080, -1)}
    (5, 1019, 1)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =4079 =1 =17
    +1
    (5, 1019, 1)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =4079 =1 =18
    +1
    (5, 1019, 1)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =4079 =1 =19
    #(M, D, b, Jacobi_symbol(M, D))=(4079, 4004, 1, -1)
    #(M, D, b, z0, g)=(4079, 4004, 1, 4078, 4079)
    {202: 8, 1004: 8, 2: 8, 4: 2, 526: 8, 158: 8, 156: 8, 33: 4, 236: 8, 10: 8, 384: 8, 1208: 8, 42: 8, 322: 8, 863: 8, 112: 8, 492: 8, 1078: 8, 412: 8, 607: 8, 1414: 4, 75: 8, 84: 8, 403: 4, 1318: 8, 96: 8, 44: 8, 240: 8, 109: 8, 1115: 8, 336: 8, 506: 8, 83: 8, 1539: 8, 4078: 1}
    {202: (4, 4), 1004: (4, 4), 2: (4, 4), 4: (4, 4), 526: (4, 4), 158: (4, 4), 156: (4, 4), 33: (4, 4), 236: (4, 4), 10: (4, 4), 384: (4, 4), 1208: (4, 4), 42: (4, 4), 322: (4, 4), 863: (4, 4), 112: (4, 4), 492: (4, 4), 1078: (4, 4), 412: (4, 4), 607: (4, 4), 1414: (4, 4), 75: (4, 4), 84: (4, 4), 403: (4, 4), 1318: (4, 4), 96: (4, 4), 44: (4, 4), 240: (4, 4), 109: (4, 4), 1115: (4, 4), 336: (4, 4), 506: (4, 4), 83: (4, 4), 1539: (4, 4), 4078: (3, 3)}
    (35, 8, 4)


py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =65521 =1 =19
    #(M, D, b, Jacobi_symbol(M, D))=(65521, 65446, 1, 1)
    #(M, D, b, z0, g)=(65521, 65446, 1, 65520, 65521)
    ...
    (353, 12, 4)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =65521 =1 =17
    +1
    (353, 12, 4)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =65521 =1 =18
    #(M, D, b, Jacobi_symbol(M, D))=(65521, 65450, 1, -1) #(M, D, b, z0, g)=(65521, 65450, 1, 65520, 65521)
    {0: 32580, 914: 180, 65520: 1}
    {0: (1, 1), 914: (1, 1), 65520: (65522, -1)}
    (3, 32580, 1)


py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =65519 =1 =18
    #(M, D, b, Jacobi_symbol(M, D))=(65519, 65448, 1, 1)
    #(M, D, b, z0, g)=(65519, 65448, 1, 65518, 65519)
    ...
    (65, 920, 1)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =65519 =1 =17
    +1
    (65, 920, 1)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =65519 =1 =19
    #(M, D, b, Jacobi_symbol(M, D))=(65519, 65444, 1, -1)
    ...
    (351, 12, 4)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =65537 =1 =19
    #(M, D, b, Jacobi_symbol(M, D))=(65537, 65462, 1, -1)
    ...
    (1097, 30, 1)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =65537 =1 =17
    -1
    (1097, 30, 1)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =65537 =1 =18
    #(M, D, b, Jacobi_symbol(M, D))=(65537, 65466, 1, 1)
    #(M, D, b, z0, g)=(65537, 65466, 1, 65536, 65537)
    {65536: 1, 27105: 1, 38430: 1}
    {65536: (15, 15), 27105: (65538, -1), 38430: (65538, -1)}
    (3, 1, 15)


py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =49139 =1 =18
    -1
    (582, 36, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ --ver=-7770 =49139 =1 =17
    -1
    (582, 36, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49139 =1 =19
    -1
    (582, 36, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49139 =1 =20
    +1
    (11, 6045, 1)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49123 =1 =20
    +1
    (15, 4092, 1)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49123 =1 =19
    +1
    (15, 4092, 1)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49123 =1 =18
    -1
    (3, 6140, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49123 =1 =17
    -1
    (3, 6140, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49123 =1 =1777
    -1
    (3, 6140, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49123 =999 =1777
    -1
    (3, 6140, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49123 =999 =7788
    +1
    (15, 4092, 1)




py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =7788
    -1
    (13, 4092, 1)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =78
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =2
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =3
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =5
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =6
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =7
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =8
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =9
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =12
    -1
    (13, 4092, 1)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =4
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =10
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =49121 =999 =11
    +1
    (13, 204, 5)


py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =65539 =0 =1
    -1
    (587, 28, 2)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =65539 =0 =2
    +1
    (1099, 30, 1)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =65543 =0 =1
    -1
    (317, 26, 3)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =65543 =0 =5
    +1
    (4, 32770, 1)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =65551 =0 =1
    -1
    (173, 24, 4)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7770 =65551 =0 =3
    +1
    (71, 1980, 1)





py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =65551 =0 =1
    -1
    (12, 112, 210)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =65551 =0 =2
    -1
    (12, 112, 210)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =65551 =0 =3
    +1
    (7, 322, 286)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =65551 =0 =6
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =65551 =0 =12
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =65551 =0 =13
    +1
    (7, 322, 286)


py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =65543 =0 =1
    -1
    (6, 98, 280)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =65543 =0 =5
    +1
    (12, 37, 468)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =65539 =0 =1
    -1
    (6, 195, 282)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =65539 =0 =1
    +1
    (11, 584, 236)


py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =49123 =0 =1
    -1
    (6, 74, 397)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7771 =49123 =0 =2
    +1
    (14, 100, 274)






py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-1 =49123 =0 =1
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-1 =49123 =0 =4
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-1 =49123 =0 =6
    -1
    (7, 27, 267)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-1 =49123 =0 =2
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-1 =49123 =0 =3
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-1 =49123 =0 =5
    +1
    (7, 36, 395)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-2 =49123 =0 =1 #1,4,6
    -1
    (9, 149, 253)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-2 =49123 =0 =2 #2,3,5
    +1
    (10, 288, 178)


py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+2 =49123 =0 =1 #1,4,6
    -1
    (6, 230, 176)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+2 =49123 =0 =2 #2,3,5
    +1
    (14, 100, 162)


py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-1 =65551 =0 =1
    -1
    (7, 233, 255)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-1 =65551 =0 =3
    +1
    (8, 104, 334)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-2 =65551 =0 =1
    -1
    (5, 64, 373)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-2 =65551 =0 =3
    +1
    (8, 316, 367)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+2 =65551 =0 =1
    -1
    (13, 174, 265)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+2 =65551 =0 =3
    +1
    (11, 248, 276)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+233 =65551 =0 =1
    -1
    (3, 290, 443)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+233 =65551 =0 =3
    +1
    (14, 116, 257)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-233 =65551 =0 =1
    -1
    (11, 210, 264)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-233 =65551 =0 =3
    +1
    (8, 164, 515)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-377 =65551 =0 =1
    -1
    (7, 140, 590)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-377 =65551 =0 =3
    +1
    (13, 582, 241)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+377 =65551 =0 =1
    -1
    (6, 300, 237)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+377 =65551 =0 =3
    +1
    (13, 141, 238)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+'65551*333//667' =65551 =0 =1
    -1
    (7, 214, 280)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+'65551*333//667' =65551 =0 =3
    +1
    (13, 338, 351)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-'65551*333//667' =65551 =0 =1
    -1
    (10, 258, 238)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-'65551*333//667' =65551 =0 =3
    +1
    (13, 270, 250)


py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-1 =4079 =0 =1
    -1
    (6, 108, 47)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-1 =4079 =0 =11
    +1
    (11, 50, 97)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+2 =4079 =0 =1
    -1
    (2, 84, 82)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=+2 =4079 =0 =11
    +1
    (8, 19, 81)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-2 =4079 =0 =1
    -1
    (3, 27, 88)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7773 --u=-2 =4079 =0 =11
    +1
    (8, 8, 152)
    这里:表现还行












注意:[(49123-1)%3==0]
    森林结构只有三种
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =1
    -1
    (17, 47, 206)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =2
    +1
    (12, 222, 142)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =3
    +1
    (17, 47, 206)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =4
    -1
    (5, 174, 131)
    Jacobi_symbol无用，以后不再显示
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =5
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =6
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =15
    (12, 222, 142)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =7
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =10
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =11
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =12
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =13
    (5, 174, 131)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =8
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =9
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =49123 =0 =14
    (17, 47, 206)


注意:[(65551-1)%3==0]
    森林结构只有三种
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =65551 =0 =1
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =65551 =0 =2
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =65551 =0 =4
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =65551 =0 =8
    (21, 459, 163)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =65551 =0 =3
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =65551 =0 =6
    (11, 274, 224)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =65551 =0 =5
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =65551 =0 =7
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =65551 =0 =9
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =65551 =0 =10
    (8, 414, 205)


注意:[(1019-1)%3=!=0]
    森林结构只有一种
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =1019 =0 =1
1..=5
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,try_tab__search_ +simp --ver=-7772 =1019 =0 =5
    (5, 26, 44)

===
view others/数学/整数分解/素数/safe_prime.txt
A059455:Safe primes which are also Sophie Germain primes.
5, 11, 23, 83, 179, 359, 719, 1019, 1439, 2039, 2063, 2459, 2819, 2903, 2963, 3023, 3623, 3779, 3803, 3863, 4919, 5399, 5639, 6899, 6983, 7079, 7643, 7823, 10163, 10799, 10883, 11699, 12203, 12263, 12899, 14159, 14303, 14699, 15803, 17939 ...
1019
2039
4079==1+2*2039==3+4*1019
is_prime =4079
is_prime =2039
is_prime =1019
===
1+2**16==65537
iter_prev_probable_primes ='2**16+2' | head -n 3
    65537
    65521
    65519
iter_prev_probable_primes ='2**14*3' | head -n 3
    49139
    49123
    49121
iter_next_probable_primes ='2**16+2' | head -n 3
    65539
    65543
    65551

===
1021
43
47
===
193707721
py_adhoc_call   seed.math.factor_pint.factor_pint__naive_brute_force   ,iter_factor_pint__naive_brute_force_ =193707721-1  --max1_num_bits=29
193707721*761838257287==-1+2**67==147573952589676412927
193707721==1+2**3*3**3*5*67*2677
py_adhoc_call   seed.math.max_order_mod_   @order_mod_ ='(193707721-1)>>3' =2 ='[3,5,67,2677]'
    88308
py_adhoc_call   seed.math.factor_pint.factor_pint__naive_brute_force   ,iter_factor_pint__naive_brute_force_ =88308
    (2, 2)
    (3, 2)
    (11, 1)
    (223, 1)
[phi(phi(193707721)) == phi(-1+193707721)]
[phi(-1+193707721) %88308 == 0]
py_adhoc_call   seed.math.prepare_p2e4N   @phi_ =193707721-1 ='[2,3,5,67,2677]'
    50865408
>>> 50865408/88308
576.0

===


]]
[[
结果仍旧是 一步到位
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,300:iter_try_square__search_ --ver=-7770 =49123 =5 =0
    +1
    5
    5
    (0, 1, 1, 5)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,300:iter_try_square__search_ --ver=-7770 =49123 =5 =1
    +1
    5
    49128
    49128
    (1, 2, 1, 49128)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,300:iter_try_square__search_ --ver=-7770 =49123 =5 =56
    +1
    5
    2750893
    2750893
    (1, 2, 1, 2750893)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,300:iter_try_square__search_ --ver=-7770 =49121 =5 =56
    +1
    5
    2750781
    2750781
    (1, 2, 1, 2750781)

py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,300:iter_try_square__search_ --ver=-7771 =49121 =5 =56
    ...未成尸
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,30000:iter_try_square__search_ --ver=-7771 =49121 =5 =56
    ...未成尸
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,49123:iter_try_square__search_ --ver=-7771 =49121 =5 =56
    (0, 49120, 49120, 5)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,49123:iter_try_square__search_ --ver=-7771 =4079 =5 =56
    (0, 2039, 2039, 5)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,49123:iter_try_square__search_ --ver=-7771 =4079 =5 =1
    (0, 2039, 2039, 5)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,49123:iter_try_square__search_ --ver=-7771 =4079 =5 =0
    (0, 1, 1, 5)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,49123:iter_try_square__search_ --ver=-7771 =1019 =5 =1
    (0, 509, 509, 5)
py_adhoc_call   script.整数分解牜尸方法牜吸引子   ,49123:iter_try_square__search_ --ver=-7771 =1021 =5 =1
    (0, 34, 34, 5)


]]



py_adhoc_call   script.整数分解牜尸方法牜吸引子   @f
from script.整数分解牜尸方法牜吸引子 import *
]]]'''#'''
__all__ = r'''
group_
tab_
    try_tab__neg_kth_root_
        kMa2f_args_
    try_tab__search_
        Mbac2f_args_
div2_mod_odd_

iter_try_MN_
iter_try_squareT_
    iter_try_square__reciprocal_
    iter_try_square__search_
'''.split()#'''
__all__
___begin_mark_of_excluded_global_names__0___ = ...
#.#################################
from seed.helper.lazy_import__func7context import mk_ctx4lazy_import4funcs_ #NOTE:not support "as"
with mk_ctx4lazy_import4funcs_(__name__):
    from itertools import count #islice
    from seed.math.II import II_mod
    from seed.math.Jacobi_symbol import Jacobi_symbol
    from math import gcd
    from seed.tiny_.check import check_type_is, check_int_ge
#.#################################
___end_mark_of_excluded_global_names__0___ = ...

r'''[[[

===
f=lambda M,a,x:(2*x-a*x**2)%M
M=97
a=31
x=1
for _ in range(6): print(x:=f(M,a,x))
  68
  61
  7
  47
  0
  0
31*47%97
  2

M=97*257
x=1
for _ in range(6): print(x:=f(M,a,x))
  24900
  23729
  5439
  9650
  0
  0

M=257
x=1
for _ in range(6): print(x:=f(M,a,x))
  228
  85
  42
  141
  0
  0

M=257
x=59
for _ in range(6): print(x:=f(M,a,x))
def g(M,a,x,N,/):
    x2j = {x:0}
    for j in range(1,1+N):
        print(x:=f(M,a,x))
        if x in x2j:
            i = x2j[x]
            print((i, j, j-i, x))
            break
        x2j[x] = j

g(257,31,1,6)
  228
  85
  42
  141
  0
  0
g(257,31,59,8)
  147
  157
  256
  224
  99
  141
  0
  0
g(97,31,59,8)
  71
  41
  60
  70
  45
  74
  45
  74

g(97*257,31,59,8)
  16852
  23030
  10536
  18985
  3440
  20444
  17990
  18504
17990%257
  0
18504%257
  0
(18504-20444)%97
  0
(17990-3440)%97
  0

prev_probable_prime ='2**16'
  65521
g(65521,31,59,17)
  23249
  63402
  32896
  4412
  19170
  18710
  31466
  57067
  2111
  42060
  23268
  52705
  62305
  31006
  17830
  4412      --repeat
  19170
g(1+2**16,31,59,17)
  23281
  6683
  10869
  39307
  39994
  56461
  43997
  46099
  19211
  25435
  43339
  32240
  40300
  59203
  42282
  0
  0

193707721*761838257287==-1+2**67==147573952589676412927
193707721 .bit_length()
  28

g(193707721,31,59,1000)
  ... ...
  14117283
  117291476
  164666181
  174286382
g(193707721,31,59,100000)
  193599928
  96889155
  76434221
  ... ...
  171802200
  76434221
  (3, 29439, 29436, 76434221)

29436 .bit_length()
  15  # > 28/2

g(193707721,233,999,100000)
  ... ...
  55938129
  106803938
  (3, 29439, 29436, 106803938)

g(193707721,377,1,100000)
  ... ...
  40684849
  59917810
  (3, 29439, 29436, 59917810)

g(193707721,377,356778,100000)
  ... ...
  80783198
  138594859
  (3, 88311, 88308, 138594859)

88308 .bit_length()
  17  # > 28/2
88308/29436
  3.0
193707721/29436
  6580.640066585134
divmod(193707721, 88308)
  (2193, 48277)
bin(2193)
  '0b100010010001'
divmod(193707721, 29436)
  (6580, 18841)
gcd(193707721-1, 29436)
  12

py_adhoc_call   seed.math.factor_pint.factor_pint__naive_brute_force   ,iter_factor_pint__naive_brute_force_ =193707721-1  --max1_num_bits=29
193707721*761838257287==-1+2**67==147573952589676412927
193707721==1+2**3*3**3*5*67*2677
py_adhoc_call   seed.math.max_order_mod_   @order_mod_ ='(193707721-1)>>3' =2 ='[3,5,67,2677]'
    88308
py_adhoc_call   seed.math.factor_pint.factor_pint__naive_brute_force   ,iter_factor_pint__naive_brute_force_ =88308
    (2, 2)
    (3, 2)
    (11, 1)
    (223, 1)
[phi(phi(193707721)) == phi(-1+193707721)]
[phi(-1+193707721) %88308 == 0]
py_adhoc_call   seed.math.prepare_p2e4N   @phi_ =193707721-1 ='[2,3,5,67,2677]'
    50865408
>>> 50865408/88308
576.0


g(193707721,1,9,100000)
  ... ...
  193707714
  193707658
  (1, 67, 66, 193707658)

29436/66
  446.0

g(193707721,1,9999,100000)
  ... ...
  78555816
  144946894
  (3, 88311, 88308, 144946894)

g(193707721,1,2,100000)
  0
  0
  (1, 2, 1, 0)
g(193707721,1,3,100000)
  ... ...
  193707720
  193707718
  (1, 67, 66, 193707718)
g(193707721,1,4,100000)
  ... ...
  10
  193707641
  (2, 88310, 88308, 193707641)
g(193707721,1,5,100000)
  ... ...
  193707718
  193707706
  (1, 67, 66, 193707706)


def group_(x2y, /):
    M = len(x2y)
    y2xs = [[] for x in range(M)]
    for x in range(M):
        y = x2y[x]
        y2xs[y].append(x)
    y2xs
    x2min_root = {}
    x2height = {}
    min_root2len_period = {}
    for x in range(M):
        if x in x2min_root:continue
        xs = [x]
        x2j = {x:0}
        for j in range(1,1+M):
            x = x2y[x]
            if x in x2min_root:break
            if x in x2j:break
            xs.append(x)
            x2j[x] = j
        else:
            raise Exception((M, xs[0]))
        x
        if x in x2min_root:
            min_root = x2min_root[x]
            height = x2height[x]
            extra = xs
            for x in xs:
                x2min_root[x] = min_root
            for height, x in enumerate(reversed(extra), 1+height):
                x2height[x] = height
            continue
        j = x2j[x]
        period = xs[j:]
        extra = xs[:j]
        min_root = min(period)
        min_root2len_period[min_root] = len(period)
        for x in xs:
            x2min_root[x] = min_root
        height = 0
        for x in period:
            x2height[x] = height
        for height, x in enumerate(reversed(extra), 1+height):
            x2height[x] = height
    x2min_root = [x2min_root[x] for x in range(M)]
    x2height = [x2height[x] for x in range(M)]
    y2num_xs = [*map(len, y2xs)]
    return (y2num_xs, y2xs, x2min_root, x2height, min_root2len_period)

def h(M, a, /):
    if M > 2**16:raise 000
    x2y = [None]*M
    for x in range(M):
        y = f(M,a,x)
        x2y[x] = y
    x2y
    (y2num_xs, y2xs, x2min_root, x2height, min_root2len_period) = group_(x2y)
    return (x2y, y2num_xs, y2xs, x2min_root, x2height, min_root2len_period)



h(257, 1)
  ([0, 1, 0, 254, 249, 242, 233, 222, 209, 194, 177, 158, 137, 114, 89, 62, 33, 2, 226, 191, 154, 115, 74, 31, 243, 196, 147, 96, 43, 245, 188, 129, 68, 5, 197, 130, 61, 247, 174, 99, 22, 200, 119, 36, 208, 121, 32, 198, 105, 10, 170, 71, 227, 124, 19, 169, 60, 206, 93, 235, 118, 256, 135, 12, 144, 17, 145, 14, 138, 3, 123, 241, 100, 214, 69, 179, 30, 136, 240, 85, 185, 26, 122, 216, 51, 141, 229, 58, 142, 224, 47, 125, 201, 18, 90, 160, 228, 37, 101, 163, 223, 24, 80, 134, 186, 236, 27, 73, 117, 159, 199, 237, 16, 50, 82, 112, 140, 166, 190, 212, 232, 250, 9, 23, 35, 45, 53, 59, 63, 65, 65, 63, 59, 53, 45, 35, 23, 9, 250, 232, 212, 190, 166, 140, 112, 82, 50, 16, 237, 199, 159, 117, 73, 27, 236, 186, 134, 80, 24, 223, 163, 101, 37, 228, 160, 90, 18, 201, 125, 47, 224, 142, 58, 229, 141, 51, 216, 122, 26, 185, 85, 240, 136, 30, 179, 69, 214, 100, 241, 123, 3, 138, 14, 145, 17, 144, 12, 135, 256, 118, 235, 93, 206, 60, 169, 19, 124, 227, 71, 170, 10, 105, 198, 32, 121, 208, 36, 119, 200, 22, 99, 174, 247, 61, 130, 197, 5, 68, 129, 188, 245, 43, 96, 147, 196, 243, 31, 74, 115, 154, 191, 226, 2, 33, 62, 89, 114, 137, 158, 177, 194, 209, 222, 233, 242, 249, 254]
  , [2, 1, 2, 2, 0, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 0, 2, 2, 2, 2, 0, 0, 2, 2, 2, 0, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 2, 0, 2, 0, 2, 0, 0, 2, 2, 0, 2, 0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 0, 2, 0, 0, 2, 2, 0, 2, 0, 2, 2, 0, 0, 0, 0, 0, 2, 0, 2, 0, 0, 2, 0, 0, 0, 2, 2, 0, 0, 2, 0, 0, 2, 0, 0, 2, 2, 2, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0, 0, 2, 2, 0, 0, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 2, 2, 2, 0, 0, 2, 0, 0, 2, 0, 0, 2, 2, 0, 0, 0, 2, 0, 0, 2, 0, 2, 0, 0, 0, 0, 0, 2, 2, 0, 2, 0, 2, 2, 0, 0, 2, 0, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 2, 0, 2, 2, 0, 0, 2, 0, 2, 0, 2, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 2, 2, 2, 0, 0, 2, 2, 0, 2, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 0, 2]
  , [[0, 2], [1], [17, 242], [69, 190], [], [33, 226], [], [], [], [122, 137], [49, 210], [], [63, 196], [], [67, 192], [], [112, 147], [65, 194], [93, 166], [54, 205], [], [], [40, 219], [123, 136], [101, 158], [], [81, 178], [106, 153], [], [], [76, 183], [23, 236], [46, 213], [16, 243], [], [124, 135], [43, 216], [97, 162], [], [], [], [], [], [28, 231], [], [125, 134], [], [90, 169], [], [], [113, 146], [84, 175], [], [126, 133], [], [], [], [], [87, 172], [127, 132], [56, 203], [36, 223], [15, 244], [128, 131], [], [129, 130], [], [], [32, 227], [74, 185], [], [51, 208], [], [107, 152], [22, 237], [], [], [], [], [], [102, 157], [], [114, 145], [], [], [79, 180], [], [], [], [14, 245], [94, 165], [], [], [58, 201], [], [], [27, 232], [], [], [39, 220], [72, 187], [98, 161], [], [], [], [48, 211], [], [], [], [], [], [], [115, 144], [], [13, 246], [21, 238], [], [108, 151], [60, 199], [42, 217], [], [45, 214], [82, 177], [70, 189], [53, 206], [91, 168], [], [], [], [31, 228], [35, 224], [], [], [], [103, 156], [62, 197], [77, 182], [12, 247], [68, 191], [], [116, 143], [85, 174], [88, 171], [], [64, 195], [66, 193], [], [26, 233], [], [], [], [], [], [], [20, 239], [], [], [], [11, 248], [109, 150], [95, 164], [], [], [99, 160], [], [], [117, 142], [], [], [55, 204], [50, 209], [], [], [], [38, 221], [], [], [10, 249], [], [75, 184], [], [], [], [], [], [80, 179], [104, 155], [], [30, 229], [], [118, 141], [19, 240], [], [], [9, 250], [], [25, 234], [34, 225], [47, 212], [110, 149], [41, 218], [92, 167], [], [], [], [], [57, 202], [], [44, 215], [8, 251], [], [], [119, 140], [], [73, 186], [], [83, 176], [], [], [], [], [], [7, 252], [100, 159], [89, 170], [], [18, 241], [52, 207], [96, 163], [86, 173], [], [], [120, 139], [6, 253], [], [59, 200], [105, 154], [111, 148], [], [], [78, 181], [71, 188], [5, 254], [24, 235], [], [29, 230], [], [37, 222], [], [4, 255], [121, 138], [], [], [], [3, 256], [], [61, 198]]
  , [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
  , [0, 0, 1, 4, 8, 3, 8, 8, 8, 4, 7, 8, 6, 8, 7, 8, 5, 2, 5, 7, 8, 8, 7, 6, 6, 8, 7, 7, 8, 8, 7, 5, 7, 4, 8, 5, 6, 7, 8, 8, 8, 8, 8, 7, 8, 6, 8, 6, 8, 8, 7, 7, 8, 7, 8, 8, 8, 8, 7, 7, 7, 5, 7, 7, 8, 3, 8, 8, 6, 5, 8, 6, 8, 7, 6, 8, 8, 8, 8, 8, 7, 8, 6, 8, 8, 7, 8, 8, 8, 6, 7, 8, 8, 6, 8, 8, 6, 8, 8, 7, 7, 7, 8, 8, 8, 7, 8, 8, 8, 8, 8, 8, 6, 8, 7, 7, 8, 7, 6, 7, 8, 5, 5, 7, 6, 7, 8, 8, 8, 4, 4, 8, 8, 8, 7, 6, 7, 5, 5, 8, 7, 6, 7, 8, 7, 7, 8, 6, 8, 8, 8, 8, 8, 8, 7, 8, 8, 8, 7, 7, 7, 8, 8, 6, 8, 8, 6, 8, 8, 7, 6, 8, 8, 8, 7, 8, 8, 6, 8, 7, 8, 8, 8, 8, 8, 6, 7, 8, 6, 8, 5, 6, 8, 8, 3, 8, 7, 7, 5, 7, 7, 7, 8, 8, 8, 8, 7, 8, 7, 7, 8, 8, 6, 8, 6, 8, 7, 8, 8, 8, 8, 8, 7, 6, 5, 8, 4, 7, 5, 7, 8, 8, 7, 7, 8, 6, 6, 7, 8, 8, 7, 5, 2, 5, 8, 7, 8, 6, 8, 7, 4, 8, 8, 8, 3, 8, 4]
  , {0: 1, 1: 1}
  )

h(97,1)
  ([0, 1, 0, 94, 89, 82, 73, 62, 49, 34, 17, 95, 74, 51, 26, 96, 67, 36, 3, 65, 28, 86, 45, 2, 54, 7, 55, 4, 48, 90, 33, 71, 10, 44, 76, 9, 37, 63, 87, 12, 32, 50, 66, 80, 92, 5, 13, 19, 23, 25, 25, 23, 19, 13, 5, 92, 80, 66, 50, 32, 12, 87, 63, 37, 9, 76, 44, 10, 71, 33, 90, 48, 4, 55, 7, 54, 2, 45, 86, 28, 65, 3, 36, 67, 96, 26, 51, 74, 95, 17, 34, 49, 62, 73, 82, 89, 94]
  , [2, 1, 2, 2, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 0, 0, 0, 2, 0, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 2, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 2, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 2, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 0, 2, 0, 0, 0, 2, 2, 0, 2, 2, 0, 2, 0, 2, 2, 2]
  , [[0, 2], [1], [23, 76], [18, 81], [27, 72], [45, 54], [], [25, 74], [], [35, 64], [32, 67], [], [39, 60], [46, 53], [], [], [], [10, 89], [], [47, 52], [], [], [], [48, 51], [], [49, 50], [14, 85], [], [20, 79], [], [], [], [40, 59], [30, 69], [9, 90], [], [17, 82], [36, 63], [], [], [], [], [], [], [33, 66], [22, 77], [], [], [28, 71], [8, 91], [41, 58], [13, 86], [], [], [24, 75], [26, 73], [], [], [], [], [], [], [7, 92], [37, 62], [], [19, 80], [42, 57], [16, 83], [], [], [], [31, 68], [], [6, 93], [12, 87], [], [34, 65], [], [], [], [43, 56], [], [5, 94], [], [], [], [21, 78], [38, 61], [], [4, 95], [29, 70], [], [44, 55], [], [3, 96], [11, 88], [15, 84]]
  , [0, 1, 0, 37, 37, 37, 37, 37, 37, 0, 37, 37, 37, 0, 37, 37, 37, 37, 37, 0, 0, 0, 37, 0, 37, 37, 37, 37, 0, 0, 37, 0, 37, 37, 0, 0, 37, 37, 37, 37, 37, 37, 37, 0, 37, 37, 0, 0, 0, 37, 37, 0, 0, 0, 37, 37, 0, 37, 37, 37, 37, 37, 37, 37, 0, 0, 37, 37, 0, 37, 0, 0, 37, 37, 37, 37, 0, 37, 0, 0, 0, 37, 37, 37, 37, 37, 0, 37, 37, 37, 0, 37, 37, 37, 37, 37, 37]
  , [0, 0, 1, 4, 4, 3, 5, 2, 5, 4, 3, 5, 4, 4, 5, 5, 5, 2, 5, 4, 5, 5, 5, 2, 5, 3, 4, 5, 4, 5, 5, 5, 4, 4, 3, 5, 1, 0, 5, 5, 5, 5, 5, 5, 3, 4, 5, 5, 3, 4, 4, 3, 5, 5, 4, 3, 5, 5, 5, 5, 5, 5, 1, 0, 5, 3, 4, 4, 5, 5, 5, 4, 5, 4, 3, 5, 2, 5, 5, 5, 4, 5, 2, 5, 5, 5, 4, 4, 5, 3, 4, 5, 2, 5, 3, 4, 4]
  , {0: 1, 1: 1, 37: 2}
  )
h(97,19)
  ([0, 80, 25, 29, 92, 20, 7, 53, 61, 31, 60, 51, 4, 16, 87, 23, 18, 72, 88, 66, 6, 5, 63, 83, 65, 9, 12, 74, 1, 84, 32, 39, 8, 36, 26, 75, 86, 59, 91, 85, 41, 56, 33, 69, 67, 27, 46, 27, 67, 69, 33, 56, 41, 85, 91, 59, 86, 75, 26, 36, 8, 39, 32, 84, 1, 74, 12, 9, 65, 83, 63, 5, 6, 66, 88, 72, 18, 23, 87, 16, 4, 51, 60, 31, 61, 53, 7, 20, 92, 29, 25, 80, 0, 76, 17, 17, 76]
  , [2, 2, 0, 0, 2, 2, 2, 2, 2, 2, 0, 0, 2, 0, 0, 0, 2, 2, 2, 0, 2, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 0, 2, 0, 0, 2, 0, 2, 0, 0, 0, 0, 1, 0, 0, 0, 0, 2, 0, 2, 0, 0, 2, 0, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 2, 0, 0, 2, 0, 2, 2, 2, 0, 0, 0, 2, 0, 0, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 0]
  , [[0, 92], [28, 64], [], [], [12, 80], [21, 71], [20, 72], [6, 86], [32, 60], [25, 67], [], [], [26, 66], [], [], [], [13, 79], [94, 95], [16, 76], [], [5, 87], [], [], [15, 77], [], [2, 90], [34, 58], [45, 47], [], [3, 89], [], [9, 83], [30, 62], [42, 50], [], [], [33, 59], [], [], [31, 61], [], [40, 52], [], [], [], [], [46], [], [], [], [], [11, 81], [], [7, 85], [], [], [41, 51], [], [], [37, 55], [10, 82], [8, 84], [], [22, 70], [], [24, 68], [19, 73], [44, 48], [], [43, 49], [], [], [17, 75], [], [27, 65], [35, 57], [93, 96], [], [], [], [1, 91], [], [], [23, 69], [29, 63], [39, 53], [36, 56], [14, 78], [18, 74], [], [], [38, 54], [4, 88], [], [], [], []]
  , [0, 0, 53, 53, 0, 53, 53, 53, 53, 53, 53, 53, 0, 0, 53, 53, 0, 53, 0, 0, 53, 53, 53, 53, 0, 53, 0, 0, 0, 53, 53, 53, 53, 53, 0, 53, 53, 53, 0, 53, 53, 53, 53, 53, 53, 0, 46, 0, 53, 53, 53, 53, 53, 53, 0, 53, 53, 53, 0, 53, 53, 53, 53, 53, 0, 0, 0, 53, 0, 53, 53, 53, 53, 0, 0, 53, 0, 53, 53, 0, 0, 53, 53, 53, 53, 53, 53, 53, 0, 53, 53, 0, 0, 0, 53, 53, 0]
  , [0, 4, 5, 5, 2, 4, 2, 1, 3, 3, 5, 5, 3, 5, 5, 5, 4, 4, 3, 5, 3, 5, 5, 4, 5, 4, 4, 4, 5, 4, 5, 2, 4, 4, 5, 5, 3, 5, 5, 1, 5, 4, 5, 5, 5, 5, 0, 5, 5, 5, 5, 4, 5, 0, 5, 5, 3, 5, 5, 4, 4, 2, 5, 4, 5, 4, 4, 4, 5, 4, 5, 5, 3, 5, 3, 4, 4, 5, 5, 5, 3, 5, 5, 3, 3, 0, 2, 4, 2, 5, 5, 4, 1, 5, 5, 5, 5]
  , {0: 1, 53: 2, 46: 1}
  )
  M=97,a=1,b=19,t=a*b**-1==46

h(1021,1)
  ([0, 1, 0, 1018, 1013, 1006, 997, 986, 973, 958, 941, 922, 901, 878, 853, 826, 797, 766, 733, 698, 661, 622, 581, 538, 493, 446, 397, 346, 293, 238, 181, 122, 61, 1019, 954, 887, 818, 747, 674, 599, 522, 443, 362, 279, 194, 107, 18, 948, 855, 760, 663, 564, 463, 360, 255, 148, 39, 949, 836, 721, 604, 485, 364, 241, 116, 1010, 881, 750, 617, 482, 345, 206, 65, 943, 798, 651, 502, 351, 198, 43, 907, 748, 587, 424, 259, 92, 944, 773, 600, 425, 248, 69, 909, 726, 541, 354, 165, 995, 802, 607, 410, 211, 10, 828, 623, 416, 207, 1017, 804, 589, 372, 153, 953, 730, 505, 278, 49, 839, 606, 371, 134, 916, 675, 432, 187, 961, 712, 461, 208, 974, 717, 458, 197, 955, 690, 423, 154, 904, 631, 356, 79, 821, 540, 257, 993, 706, 417, 126, 854, 559, 262, 984, 683, 380, 75, 789, 480, 169, 877, 562, 245, 947, 626, 303, 999, 672, 343, 12, 700, 365, 28, 710, 369, 26, 702, 355, 6, 676, 323, 989, 632, 273, 933, 570, 205, 859, 490, 119, 767, 392, 15, 657, 276, 914, 529, 142, 774, 383, 1011, 616, 219, 841, 440, 37, 653, 246, 858, 447, 34, 640, 223, 825, 404, 1002, 577, 150, 742, 311, 899, 464, 27, 609, 168, 746, 301, 875, 426, 996, 543, 88, 652, 193, 753, 290, 846, 379, 931, 460, 1008, 533, 56, 598, 117, 655, 170, 704, 215, 745, 252, 778, 281, 803, 302, 820, 315, 829, 320, 830, 317, 823, 306, 808, 287, 785, 260, 754, 225, 715, 182, 668, 131, 613, 72, 550, 5, 479, 951, 400, 868, 313, 777, 218, 678, 115, 571, 4, 456, 906, 333, 779, 202, 644, 63, 501, 937, 350, 782, 191, 619, 24, 448, 870, 269, 687, 82, 496, 908, 297, 705, 90, 494, 896, 275, 673, 48, 442, 834, 203, 591, 977, 340, 722, 81, 459, 835, 188, 560, 930, 277, 643, 1007, 348, 708, 45, 401, 755, 86, 436, 784, 109, 453, 795, 114, 452, 788, 101, 433, 763, 70, 396, 720, 21, 341, 659, 975, 268, 580, 890, 177, 483, 787, 68, 368, 666, 962, 235, 527, 817, 84, 370, 654, 936, 195, 473, 749, 2, 274, 544, 812, 57, 321, 583, 843, 80, 336, 590, 842, 71, 319, 565, 809, 30, 270, 508, 744, 978, 189, 419, 647, 873, 76, 298, 518, 736, 952, 145, 357, 567, 775, 981, 164, 366, 566, 764, 960, 133, 325, 515, 703, 889, 52, 234, 414, 592, 768, 942, 93, 263, 431, 597, 761, 923, 62, 220, 376, 530, 682, 832, 980, 105, 249, 391, 531, 669, 805, 939, 50, 180, 308, 434, 558, 680, 800, 918, 13, 127, 239, 349, 457, 563, 667, 769, 869, 967, 42, 136, 228, 318, 406, 492, 576, 658, 738, 816, 892, 966, 17, 87, 155, 221, 285, 347, 407, 465, 521, 575, 627, 677, 725, 771, 815, 857, 897, 935, 971, 1005, 16, 46, 74, 100, 124, 146, 166, 184, 200, 214, 226, 236, 244, 250, 254, 256, 256, 254, 250, 244, 236, 226, 214, 200, 184, 166, 146, 124, 100, 74, 46, 16, 1005, 971, 935, 897, 857, 815, 771, 725, 677, 627, 575, 521, 465, 407, 347, 285, 221, 155, 87, 17, 966, 892, 816, 738, 658, 576, 492, 406, 318, 228, 136, 42, 967, 869, 769, 667, 563, 457, 349, 239, 127, 13, 918, 800, 680, 558, 434, 308, 180, 50, 939, 805, 669, 531, 391, 249, 105, 980, 832, 682, 530, 376, 220, 62, 923, 761, 597, 431, 263, 93, 942, 768, 592, 414, 234, 52, 889, 703, 515, 325, 133, 960, 764, 566, 366, 164, 981, 775, 567, 357, 145, 952, 736, 518, 298, 76, 873, 647, 419, 189, 978, 744, 508, 270, 30, 809, 565, 319, 71, 842, 590, 336, 80, 843, 583, 321, 57, 812, 544, 274, 2, 749, 473, 195, 936, 654, 370, 84, 817, 527, 235, 962, 666, 368, 68, 787, 483, 177, 890, 580, 268, 975, 659, 341, 21, 720, 396, 70, 763, 433, 101, 788, 452, 114, 795, 453, 109, 784, 436, 86, 755, 401, 45, 708, 348, 1007, 643, 277, 930, 560, 188, 835, 459, 81, 722, 340, 977, 591, 203, 834, 442, 48, 673, 275, 896, 494, 90, 705, 297, 908, 496, 82, 687, 269, 870, 448, 24, 619, 191, 782, 350, 937, 501, 63, 644, 202, 779, 333, 906, 456, 4, 571, 115, 678, 218, 777, 313, 868, 400, 951, 479, 5, 550, 72, 613, 131, 668, 182, 715, 225, 754, 260, 785, 287, 808, 306, 823, 317, 830, 320, 829, 315, 820, 302, 803, 281, 778, 252, 745, 215, 704, 170, 655, 117, 598, 56, 533, 1008, 460, 931, 379, 846, 290, 753, 193, 652, 88, 543, 996, 426, 875, 301, 746, 168, 609, 27, 464, 899, 311, 742, 150, 577, 1002, 404, 825, 223, 640, 34, 447, 858, 246, 653, 37, 440, 841, 219, 616, 1011, 383, 774, 142, 529, 914, 276, 657, 15, 392, 767, 119, 490, 859, 205, 570, 933, 273, 632, 989, 323, 676, 6, 355, 702, 26, 369, 710, 28, 365, 700, 12, 343, 672, 999, 303, 626, 947, 245, 562, 877, 169, 480, 789, 75, 380, 683, 984, 262, 559, 854, 126, 417, 706, 993, 257, 540, 821, 79, 356, 631, 904, 154, 423, 690, 955, 197, 458, 717, 974, 208, 461, 712, 961, 187, 432, 675, 916, 134, 371, 606, 839, 49, 278, 505, 730, 953, 153, 372, 589, 804, 1017, 207, 416, 623, 828, 10, 211, 410, 607, 802, 995, 165, 354, 541, 726, 909, 69, 248, 425, 600, 773, 944, 92, 259, 424, 587, 748, 907, 43, 198, 351, 502, 651, 798, 943, 65, 206, 345, 482, 617, 750, 881, 1010, 116, 241, 364, 485, 604, 721, 836, 949, 39, 148, 255, 360, 463, 564, 663, 760, 855, 948, 18, 107, 194, 279, 362, 443, 522, 599, 674, 747, 818, 887, 954, 1019, 61, 122, 181, 238, 293, 346, 397, 446, 493, 538, 581, 622, 661, 698, 733, 766, 797, 826, 853, 878, 901, 922, 941, 958, 973, 986, 997, 1006, 1013, 1018]
  , [2, 1, 2, 0, 2, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 2, 2, 2, 0, 0, 2, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 0, 0, 2, 0, 0, 2, 0, 2, 0, 0, 2, 2, 0, 2, 2, 0, 2, 2, 2, 0, 2, 0, 0, 0, 2, 2, 0, 0, 0, 2, 2, 2, 0, 2, 0, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 2, 0, 2, 0, 2, 0, 0, 0, 0, 2, 2, 2, 2, 0, 2, 0, 0, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 0, 2, 0, 0, 2, 2, 0, 2, 0, 2, 0, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 2, 2, 0, 2, 0, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 2, 2, 0, 0, 2, 0, 0, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 2, 0, 2, 0, 0, 2, 2, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 2, 0, 2, 2, 0, 2, 2, 0, 0, 0, 0, 2, 2, 2, 0, 0, 2, 2, 2, 2, 2, 2, 2, 0, 2, 0, 0, 0, 2, 0, 2, 0, 0, 2, 0, 0, 2, 0, 0, 0, 2, 2, 0, 0, 2, 2, 2, 0, 0, 2, 0, 2, 0, 0, 2, 0, 2, 0, 2, 0, 2, 2, 2, 2, 2, 0, 2, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2, 2, 2, 0, 0, 2, 0, 2, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0, 0, 2, 0, 0, 2, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 2, 2, 0, 0, 2, 2, 0, 0, 2, 0, 2, 2, 0, 0, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 2, 2, 0, 0, 0, 0, 2, 2, 2, 2, 0, 2, 0, 0, 0, 2, 0, 2, 2, 0, 0, 2, 2, 2, 0, 0, 0, 2, 2, 0, 0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 2, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 0, 0, 0, 2, 2, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 2, 2, 0, 0, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 2, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 2, 2, 2, 0, 0, 2, 2, 0, 2, 0, 0, 0, 2, 0, 2, 2, 2, 2, 0, 0, 0, 0, 2, 2, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 0, 0, 2, 2, 0, 2, 0, 0, 2, 2, 0, 0, 2, 2, 0, 0, 0, 2, 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 2, 0, 0, 2, 0, 0, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 0, 2, 0, 0, 2, 2, 2, 2, 0, 0, 2, 2, 2, 2, 2, 2, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 2, 0, 2, 2, 2, 2, 2, 0, 2, 0, 2, 0, 2, 0, 0, 2, 0, 2, 0, 0, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 2, 0, 0, 2, 0, 0, 2, 0, 2, 0, 0, 0, 2, 0, 2, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2, 2, 0, 0, 0, 0, 2, 2, 0, 2, 2, 0, 2, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 2, 2, 2, 0, 0, 2, 0, 2, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 2, 2, 2, 2, 0, 0, 2, 2, 0, 0, 2, 0, 0, 2, 2, 2, 2, 0, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 0, 2, 0, 2, 2, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 0, 2, 0, 2, 0, 2, 2, 0, 0, 2, 0, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 0, 0, 2, 0, 2, 2, 2, 2, 0, 0, 0, 0, 2, 0, 2, 0, 2, 0, 0, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 2, 0, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0, 2, 0, 2, 2, 2, 0, 0, 0, 2, 2, 0, 0, 0, 2, 0, 2, 2, 2, 0, 2, 2, 0, 2, 2, 0, 0, 2, 0, 2, 0, 0, 2, 0, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 0, 2, 0, 0, 2, 2, 2, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 2, 0]
  , [[0, 2], [1], [375, 648], [], [285, 738], [274, 749], [176, 847], [], [], [], [102, 921], [], [167, 856], [454, 569], [], [190, 833], [496, 527], [476, 547], [46, 977], [], [], [351, 672], [], [], [299, 724], [], [173, 850], [220, 803], [170, 853], [], [391, 632], [], [], [], [208, 815], [], [], [203, 820], [], [56, 967], [], [], [464, 559], [79, 944], [], [333, 690], [497, 526], [], [314, 709], [116, 907], [446, 577], [], [420, 603], [], [], [], [240, 783], [379, 644], [], [], [], [32, 991], [432, 591], [292, 731], [], [72, 951], [], [], [361, 662], [91, 932], [348, 675], [387, 636], [272, 751], [], [498, 525], [154, 869], [400, 623], [], [], [140, 883], [383, 640], [322, 701], [304, 719], [], [368, 655], [], [336, 687], [477, 546], [229, 794], [], [309, 714], [], [85, 938], [426, 597], [], [], [], [], [], [], [499, 524], [345, 678], [], [], [], [439, 584], [], [45, 978], [], [339, 684], [], [], [], [], [342, 681], [283, 740], [64, 959], [242, 781], [], [187, 836], [], [], [31, 992], [], [500, 523], [], [147, 876], [455, 568], [], [], [], [270, 753], [], [415, 608], [120, 903], [], [465, 558], [], [], [], [], [], [195, 828], [], [], [405, 618], [501, 522], [], [55, 968], [], [215, 808], [], [], [111, 912], [136, 887], [478, 545], [], [], [], [], [], [], [], [], [410, 613], [96, 927], [502, 521], [], [222, 801], [157, 866], [244, 779], [], [], [], [], [], [], [358, 665], [], [], [447, 576], [30, 993], [268, 755], [], [503, 520], [], [], [124, 899], [325, 698], [396, 627], [], [297, 726], [], [231, 792], [44, 979], [372, 651], [], [132, 891], [78, 945], [], [504, 519], [], [290, 733], [317, 706], [], [184, 839], [71, 952], [106, 917], [128, 895], [], [], [101, 922], [], [], [505, 518], [246, 777], [], [], [281, 742], [200, 823], [433, 590], [479, 544], [], [210, 813], [], [266, 757], [506, 517], [], [466, 557], [], [], [], [], [], [421, 602], [365, 658], [507, 516], [], [29, 994], [456, 567], [], [63, 960], [], [], [508, 515], [160, 863], [205, 818], [], [90, 933], [440, 583], [509, 514], [], [248, 775], [], [510, 513], [54, 969], [511, 512], [143, 880], [], [84, 939], [264, 759], [], [150, 873], [427, 596], [], [], [], [], [355, 668], [302, 721], [392, 631], [], [], [181, 842], [376, 647], [312, 711], [192, 831], [328, 695], [115, 908], [43, 980], [], [250, 773], [], [], [], [480, 543], [], [262, 761], [], [], [233, 790], [], [], [28, 995], [], [], [], [307, 716], [401, 622], [], [], [224, 799], [252, 771], [163, 860], [], [], [260, 763], [], [448, 575], [], [], [217, 806], [], [279, 744], [], [254, 769], [], [258, 765], [467, 556], [388, 635], [256, 767], [380, 643], [], [178, 845], [], [416, 607], [], [], [], [], [], [], [], [288, 735], [], [], [384, 639], [], [], [], [320, 703], [352, 671], [], [166, 857], [], [70, 953], [27, 996], [481, 542], [331, 692], [457, 566], [295, 728], [77, 946], [], [], [95, 928], [175, 848], [139, 884], [406, 617], [], [], [53, 970], [], [42, 981], [], [62, 961], [169, 854], [411, 612], [], [362, 661], [172, 851], [369, 654], [119, 904], [110, 913], [], [], [], [434, 589], [], [], [235, 788], [153, 870], [], [], [197, 826], [], [], [], [], [], [], [], [441, 582], [189, 834], [], [], [], [349, 674], [26, 997], [], [], [277, 746], [334, 689], [], [], [212, 811], [], [468, 555], [482, 541], [], [], [100, 923], [], [], [], [422, 601], [], [105, 918], [146, 877], [], [397, 626], [], [], [], [135, 888], [83, 940], [89, 934], [226, 797], [], [], [], [], [428, 595], [123, 900], [346, 677], [449, 574], [], [337, 686], [], [], [], [202, 821], [], [315, 708], [41, 982], [], [], [25, 998], [207, 816], [300, 723], [], [], [], [343, 680], [340, 683], [], [], [286, 737], [458, 565], [131, 892], [323, 700], [237, 786], [127, 896], [], [52, 971], [219, 804], [483, 540], [], [], [], [], [], [], [], [373, 650], [], [], [], [], [], [275, 748], [156, 867], [], [69, 954], [359, 664], [], [61, 962], [], [], [], [], [186, 837], [], [469, 554], [24, 999], [310, 713], [], [305, 718], [], [], [], [], [293, 730], [76, 947], [], [], [114, 909], [], [], [393, 630], [], [], [], [], [], [], [417, 606], [], [], [402, 621], [], [], [484, 539], [40, 983], [], [], [], [], [366, 657], [], [194, 829], [435, 588], [442, 581], [], [239, 784], [], [], [], [], [23, 1000], [], [142, 881], [94, 929], [], [228, 795], [377, 646], [], [], [], [], [], [273, 750], [], [], [], [], [], [], [], [450, 573], [149, 874], [326, 697], [], [159, 864], [459, 564], [51, 972], [389, 634], [412, 611], [407, 616], [], [], [183, 840], [284, 739], [], [], [], [485, 538], [470, 553], [214, 809], [], [], [356, 667], [22, 1001], [], [381, 642], [], [], [], [82, 941], [], [109, 914], [385, 638], [318, 705], [423, 600], [], [], [], [], [429, 594], [241, 782], [39, 984], [88, 935], [], [], [], [60, 963], [], [118, 905], [99, 924], [], [221, 802], [], [], [], [271, 752], [], [], [199, 824], [68, 955], [], [298, 725], [], [], [21, 1002], [104, 919], [], [], [162, 861], [486, 537], [], [], [], [138, 885], [180, 843], [], [], [], [], [], [], [], [209, 814], [], [], [329, 694], [291, 732], [], [], [398, 625], [], [], [], [75, 948], [230, 793], [204, 819], [370, 653], [243, 780], [], [191, 832], [471, 552], [353, 670], [], [20, 1003], [], [50, 973], [], [], [363, 660], [460, 563], [269, 754], [443, 580], [], [], [165, 858], [313, 710], [38, 985], [122, 901], [177, 846], [487, 536], [282, 741], [], [451, 572], [], [436, 587], [152, 871], [], [], [], [303, 720], [], [], [134, 889], [], [], [], [], [], [], [], [19, 1004], [], [168, 855], [], [174, 849], [418, 605], [245, 778], [308, 715], [145, 878], [], [332, 691], [], [171, 852], [], [126, 897], [], [], [267, 756], [], [130, 893], [], [], [350, 673], [59, 964], [321, 702], [], [], [488, 535], [93, 930], [], [], [], [113, 910], [], [], [18, 1005], [], [], [403, 620], [], [472, 551], [], [], [], [216, 807], [], [394, 629], [247, 776], [223, 800], [37, 986], [81, 942], [374, 649], [67, 956], [], [], [232, 791], [265, 758], [335, 688], [], [], [], [], [49, 974], [430, 593], [], [347, 676], [413, 610], [], [17, 1006], [188, 835], [424, 599], [461, 562], [], [489, 534], [], [87, 936], [196, 827], [408, 615], [], [280, 743], [249, 774], [289, 734], [], [], [296, 727], [], [338, 685], [263, 760], [], [360, 663], [344, 679], [155, 868], [], [], [], [], [], [341, 682], [], [16, 1007], [74, 949], [], [452, 571], [], [98, 925], [251, 772], [108, 915], [444, 579], [], [], [261, 762], [390, 633], [], [], [378, 645], [], [], [490, 533], [473, 550], [367, 656], [36, 987], [], [253, 770], [141, 882], [], [259, 764], [], [211, 812], [15, 1008], [], [103, 920], [255, 768], [257, 766], [], [437, 586], [], [316, 707], [324, 699], [58, 965], [], [], [117, 906], [], [201, 822], [386, 637], [382, 641], [], [], [234, 789], [], [], [], [], [], [], [14, 1009], [148, 875], [48, 975], [], [491, 532], [206, 817], [185, 838], [], [], [], [], [], [], [], [], [278, 745], [462, 561], [301, 722], [], [], [399, 624], [], [225, 798], [], [158, 865], [13, 1010], [], [], [66, 957], [], [], [], [], [], [35, 988], [], [419, 604], [357, 666], [], [474, 549], [], [], [], [311, 712], [492, 531], [], [218, 805], [], [12, 1011], [], [], [137, 886], [], [287, 736], [80, 943], [306, 717], [92, 931], [], [], [], [], [193, 830], [], [121, 902], [], [453, 570], [], [], [], [11, 1012], [431, 592], [], [], [], [], [], [], [327, 696], [236, 787], [], [182, 841], [], [493, 530], [371, 652], [294, 729], [], [445, 578], [], [10, 1013], [425, 598], [73, 950], [86, 937], [], [], [161, 862], [47, 976], [57, 966], [], [276, 747], [404, 619], [112, 911], [34, 989], [133, 890], [], [], [9, 1014], [], [414, 609], [125, 898], [364, 659], [], [], [], [475, 548], [463, 560], [], [], [], [494, 529], [], [8, 1015], [129, 894], [354, 669], [], [319, 704], [395, 628], [], [438, 585], [409, 614], [], [], [151, 872], [], [7, 1016], [], [], [179, 844], [], [], [], [144, 879], [], [97, 926], [227, 796], [6, 1017], [], [164, 859], [], [], [213, 810], [], [], [495, 528], [5, 1018], [330, 693], [238, 785], [], [65, 958], [198, 825], [], [4, 1019], [], [], [], [107, 916], [3, 1020], [33, 990], []]
  , [0, 1, 0, 5, 4, 5, 45, 37, 50, 37, 4, 70, 70, 37, 28, 49, 16, 5, 18, 188, 42, 21, 315, 62, 164, 50, 45, 27, 28, 49, 30, 70, 62, 4, 34, 75, 150, 37, 131, 39, 28, 459, 42, 43, 39, 45, 18, 75, 459, 49, 50, 459, 39, 50, 39, 57, 39, 57, 119, 182, 45, 62, 62, 221, 49, 37, 75, 30, 357, 34, 70, 21, 37, 49, 57, 75, 76, 21, 70, 43, 49, 221, 4, 39, 42, 50, 43, 119, 164, 221, 182, 34, 50, 16, 34, 459, 21, 28, 221, 188, 164, 70, 4, 75, 76, 188, 30, 45, 42, 5, 75, 321, 70, 28, 50, 278, 49, 150, 28, 119, 45, 45, 70, 62, 119, 62, 315, 315, 34, 49, 278, 131, 49, 357, 45, 164, 75, 119, 131, 459, 43, 18, 75, 5, 30, 37, 28, 315, 57, 42, 150, 39, 188, 321, 75, 278, 4, 57, 28, 315, 18, 76, 45, 43, 164, 21, 76, 70, 459, 57, 28, 43, 370, 45, 321, 182, 45, 278, 459, 34, 30, 30, 182, 188, 150, 164, 34, 119, 188, 131, 49, 16, 37, 5, 39, 75, 18, 49, 70, 34, 42, 182, 18, 37, 370, 150, 21, 30, 34, 49, 76, 70, 21, 21, 50, 150, 119, 315, 119, 42, 27, 221, 459, 76, 321, 57, 16, 27, 4, 164, 119, 5, 131, 18, 278, 57, 50, 459, 49, 34, 39, 221, 150, 42, 28, 18, 150, 278, 182, 18, 119, 27, 182, 37, 315, 39, 188, 5, 37, 42, 278, 150, 150, 49, 278, 182, 57, 62, 182, 182, 131, 164, 37, 30, 5, 221, 37, 76, 278, 43, 150, 119, 70, 278, 76, 4, 34, 150, 45, 28, 18, 57, 221, 28, 43, 43, 221, 16, 21, 164, 62, 321, 182, 43, 4, 16, 278, 16, 62, 182, 39, 315, 221, 43, 459, 315, 131, 37, 62, 18, 188, 321, 221, 459, 188, 188, 39, 16, 76, 321, 16, 70, 315, 45, 21, 182, 43, 4, 34, 5, 188, 4, 50, 76, 57, 70, 27, 278, 70, 131, 43, 21, 4, 62, 459, 182, 459, 357, 278, 75, 50, 357, 42, 357, 62, 57, 16, 21, 42, 370, 370, 119, 75, 30, 5, 0, 5, 221, 70, 57, 321, 18, 30, 49, 43, 27, 30, 21, 18, 131, 50, 30, 131, 28, 43, 45, 131, 45, 5, 150, 76, 21, 50, 150, 21, 37, 357, 34, 182, 42, 164, 16, 131, 42, 221, 357, 188, 28, 188, 45, 39, 278, 221, 164, 39, 221, 16, 49, 164, 16, 150, 164, 62, 27, 5, 164, 4, 16, 43, 188, 18, 30, 315, 459, 119, 42, 50, 30, 62, 5, 75, 76, 76, 188, 37, 315, 34, 131, 131, 459, 459, 315, 75, 39, 42, 75, 4, 62, 357, 315, 30, 57, 4, 30, 131, 57, 5, 119, 278, 221, 4, 278, 34, 75, 76, 62, 131, 27, 21, 182, 34, 76, 315, 164, 39, 18, 16, 18, 57, 164, 119, 28, 76, 150, 42, 50, 16, 50, 28, 119, 315, 188, 188, 315, 119, 28, 50, 16, 50, 42, 150, 76, 28, 119, 164, 57, 18, 16, 18, 39, 164, 315, 76, 34, 182, 21, 27, 131, 62, 76, 75, 34, 278, 4, 221, 278, 119, 5, 57, 131, 30, 4, 57, 30, 315, 357, 62, 4, 75, 42, 39, 75, 315, 459, 459, 131, 131, 34, 315, 37, 188, 76, 76, 75, 5, 62, 30, 50, 42, 119, 459, 315, 30, 18, 188, 43, 16, 4, 164, 5, 27, 62, 164, 150, 16, 164, 49, 16, 221, 39, 164, 221, 278, 39, 45, 188, 28, 188, 357, 221, 42, 131, 16, 164, 42, 182, 34, 357, 37, 21, 150, 50, 21, 76, 150, 5, 45, 131, 45, 43, 28, 131, 30, 50, 131, 18, 21, 30, 27, 43, 49, 30, 18, 321, 57, 70, 221, 5, 0, 5, 30, 75, 119, 370, 370, 42, 21, 16, 57, 62, 357, 42, 357, 50, 75, 278, 357, 459, 182, 459, 62, 4, 21, 43, 131, 70, 278, 27, 70, 57, 76, 50, 4, 188, 5, 34, 4, 43, 182, 21, 45, 315, 70, 16, 321, 76, 16, 39, 188, 188, 459, 221, 321, 188, 18, 62, 37, 131, 315, 459, 43, 221, 315, 39, 182, 62, 16, 278, 16, 4, 43, 182, 321, 62, 164, 21, 16, 221, 43, 43, 28, 221, 57, 18, 28, 45, 150, 34, 4, 76, 278, 70, 119, 150, 43, 278, 76, 37, 221, 5, 30, 37, 164, 131, 182, 182, 62, 57, 182, 278, 49, 150, 150, 278, 42, 37, 5, 188, 39, 315, 37, 182, 27, 119, 18, 182, 278, 150, 18, 28, 42, 150, 221, 39, 34, 49, 459, 50, 57, 278, 18, 131, 5, 119, 164, 4, 27, 16, 57, 321, 76, 459, 221, 27, 42, 119, 315, 119, 150, 50, 21, 21, 70, 76, 49, 34, 30, 21, 150, 370, 37, 18, 182, 42, 34, 70, 49, 18, 75, 39, 5, 37, 16, 49, 131, 188, 119, 34, 164, 150, 188, 182, 30, 30, 34, 459, 278, 45, 182, 321, 45, 370, 43, 28, 57, 459, 70, 76, 21, 164, 43, 45, 76, 18, 315, 28, 57, 4, 278, 75, 321, 188, 39, 150, 42, 57, 315, 28, 37, 30, 5, 75, 18, 43, 459, 131, 119, 75, 164, 45, 357, 49, 131, 278, 49, 34, 315, 315, 62, 119, 62, 70, 45, 45, 119, 28, 150, 49, 278, 50, 28, 70, 321, 75, 5, 42, 45, 30, 188, 76, 75, 4, 70, 164, 188, 221, 28, 21, 459, 34, 16, 50, 34, 182, 221, 164, 119, 43, 50, 42, 39, 4, 221, 49, 43, 70, 21, 76, 75, 57, 49, 37, 21, 70, 34, 357, 30, 75, 37, 49, 221, 62, 62, 45, 182, 119, 57, 39, 57, 39, 50, 39, 459, 50, 49, 459, 75, 18, 45, 39, 43, 42, 459, 28, 39, 131, 37, 150, 75, 34, 4, 62, 70, 30, 49, 28, 27, 45, 50, 164, 62, 315, 21, 42, 188, 18, 5, 16, 49, 28, 37, 70, 70, 4, 37, 50, 37, 45, 5, 4, 5]
  , [0, 0, 1, 2, 0, 0, 1, 2, 2, 2, 1, 2, 1, 1, 2, 1, 0, 1, 0, 2, 2, 0, 2, 2, 1, 2, 1, 0, 0, 2, 0, 2, 2, 2, 0, 2, 2, 0, 2, 0, 2, 2, 0, 0, 2, 0, 1, 2, 1, 0, 0, 2, 1, 2, 2, 2, 1, 0, 2, 2, 2, 1, 0, 1, 2, 0, 2, 2, 1, 1, 0, 1, 1, 2, 1, 0, 0, 2, 2, 1, 0, 1, 1, 2, 0, 2, 0, 1, 1, 2, 1, 2, 1, 0, 2, 2, 2, 2, 2, 2, 1, 0, 2, 2, 2, 1, 2, 0, 2, 1, 2, 2, 2, 2, 1, 1, 1, 1, 2, 0, 2, 2, 1, 2, 1, 2, 1, 1, 2, 2, 2, 0, 2, 1, 1, 2, 0, 2, 2, 2, 2, 2, 0, 2, 2, 1, 0, 2, 1, 2, 0, 2, 2, 1, 0, 1, 2, 2, 2, 2, 2, 2, 2, 2, 0, 1, 0, 2, 1, 1, 0, 2, 2, 2, 2, 2, 2, 1, 2, 2, 0, 0, 0, 2, 1, 2, 2, 0, 0, 0, 2, 0, 2, 1, 1, 0, 2, 1, 1, 2, 1, 2, 0, 0, 2, 0, 0, 1, 1, 2, 2, 0, 2, 2, 0, 0, 2, 2, 0, 0, 0, 0, 2, 1, 2, 1, 1, 2, 1, 2, 2, 2, 2, 2, 1, 0, 1, 2, 1, 0, 2, 0, 2, 2, 0, 1, 0, 2, 0, 0, 1, 2, 0, 2, 1, 1, 1, 1, 2, 0, 1, 2, 0, 1, 2, 2, 2, 2, 0, 0, 0, 2, 2, 0, 0, 1, 1, 1, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 1, 2, 2, 0, 2, 2, 2, 1, 0, 2, 2, 1, 0, 1, 2, 2, 0, 2, 0, 2, 2, 1, 2, 0, 2, 0, 2, 1, 1, 1, 0, 0, 2, 1, 2, 0, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 1, 2, 2, 2, 0, 1, 2, 0, 2, 0, 0, 1, 1, 0, 1, 1, 2, 2, 1, 1, 1, 0, 2, 2, 1, 2, 0, 2, 0, 0, 1, 2, 0, 1, 0, 0, 1, 2, 2, 2, 0, 2, 2, 0, 0, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 1, 0, 2, 2, 2, 0, 0, 2, 2, 0, 1, 2, 2, 1, 2, 1, 0, 2, 2, 0, 2, 2, 2, 1, 2, 0, 0, 2, 0, 2, 2, 2, 1, 1, 1, 0, 2, 2, 2, 2, 1, 1, 0, 1, 2, 1, 2, 2, 2, 0, 2, 0, 1, 2, 2, 1, 0, 1, 2, 2, 2, 0, 0, 2, 2, 1, 0, 0, 0, 1, 0, 2, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 0, 1, 2, 0, 1, 2, 0, 2, 2, 2, 2, 1, 2, 1, 0, 1, 2, 1, 2, 2, 2, 2, 0, 0, 2, 2, 0, 2, 2, 1, 2, 2, 2, 2, 2, 2, 0, 2, 2, 1, 2, 2, 1, 1, 2, 2, 2, 2, 0, 2, 0, 1, 0, 2, 0, 2, 2, 2, 2, 1, 2, 0, 1, 2, 0, 1, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 2, 1, 0, 1, 1, 1, 0, 2, 2, 1, 1, 2, 2, 2, 0, 1, 0, 2, 2, 0, 1, 2, 1, 2, 2, 2, 0, 2, 0, 1, 0, 0, 2, 2, 2, 2, 1, 0, 0, 0, 2, 2, 2, 1, 2, 1, 1, 2, 0, 2, 2, 2, 1, 2, 2, 1, 0, 2, 0, 2, 2, 0, 1, 2, 2, 1, 1, 2, 2, 2, 1, 0, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 1, 1, 2, 2, 1, 2, 2, 2, 0, 1, 1, 0, 1, 2, 0, 1, 1, 2, 1, 2, 0, 2, 2, 1, 0, 0, 0, 2, 2, 0, 0, 1, 0, 0, 1, 1, 2, 1, 2, 0, 1, 2, 2, 2, 0, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 1, 2, 0, 2, 1, 1, 0, 0, 0, 2, 1, 2, 1, 2, 0, 2, 2, 1, 2, 1, 2, 2, 0, 1, 0, 2, 2, 1, 0, 2, 2, 2, 1, 2, 2, 0, 2, 2, 1, 2, 1, 2, 2, 2, 1, 2, 1, 1, 0, 0, 0, 1, 1, 2, 2, 1, 1, 1, 2, 2, 2, 2, 0, 1, 2, 0, 1, 2, 0, 0, 0, 0, 2, 1, 2, 0, 1, 1, 2, 1, 0, 1, 2, 2, 1, 2, 1, 0, 2, 0, 1, 0, 2, 2, 2, 2, 2, 0, 2, 0, 0, 2, 0, 2, 1, 1, 1, 1, 2, 2, 1, 1, 2, 2, 1, 2, 2, 0, 0, 1, 1, 2, 1, 1, 2, 0, 2, 0, 0, 2, 1, 0, 0, 2, 1, 2, 1, 1, 1, 2, 2, 0, 2, 1, 1, 1, 2, 2, 0, 2, 2, 2, 2, 2, 2, 1, 0, 0, 2, 1, 0, 1, 2, 2, 2, 2, 2, 2, 2, 2, 0, 1, 0, 2, 2, 1, 2, 0, 2, 1, 0, 2, 2, 1, 2, 2, 2, 2, 2, 1, 2, 0, 0, 2, 1, 2, 2, 2, 0, 0, 2, 0, 2, 0, 2, 2, 1, 2, 0, 0, 0, 0, 2, 2, 2, 2, 0, 2, 1, 2, 0, 2, 2, 2, 1, 0, 2, 2, 2, 2, 2, 2, 1, 0, 2, 0, 2, 0, 0, 1, 2, 1, 2, 0, 0, 1, 0, 2, 2, 1, 1, 0, 2, 0, 0, 1, 0, 0, 2, 2, 1, 2, 0, 1, 0, 2, 2, 2, 1, 0, 2, 2, 2, 0, 2, 1, 1, 0, 2, 0, 1, 2, 1, 1, 2, 2, 1, 2, 1, 2, 2, 1, 2, 2, 2, 1, 2, 1, 1, 0, 2, 0, 2, 2, 1, 2, 2, 1, 0, 1, 0, 2, 0, 0, 2, 0, 2, 2, 2, 0, 1, 1, 2]
  , {0: 1, 1: 1, 5: 8, 4: 8, 45: 8, 37: 8, 50: 8, 70: 8, 28: 8, 49: 8, 16: 8, 18: 8, 188: 8, 42: 8, 21: 8, 315: 8, 62: 8, 164: 8, 27: 4, 30: 8, 34: 8, 75: 8, 150: 8, 131: 8, 39: 8, 459: 8, 43: 8, 57: 8, 119: 8, 182: 8, 221: 8, 357: 4, 76: 8, 321: 4, 278: 8, 370: 2}
  )

h(1019,1)
  ([0, 1, 0, 1016, 1011, 1004, 995, 984, 971, 956, 939, 920, 899, 876, 851, 824, 795, 764, 731, 696, 659, 620, 579, 536, 491, 444, 395, 344, 291, 236, 179, 120, 59, 1015, 950, 883, 814, 743, 670, 595, 518, 439, 358, 275, 190, 103, 14, 942, 849, 754, 657, 558, 457, 354, 249, 142, 33, 941, 828, 713, 596, 477, 356, 233, 108, 1000, 871, 740, 607, 472, 335, 196, 55, 931, 786, 639, 490, 339, 186, 31, 893, 734, 573, 410, 245, 78, 928, 757, 584, 409, 232, 53, 891, 708, 523, 336, 147, 975, 782, 587, 390, 191, 1009, 806, 601, 394, 185, 993, 780, 565, 348, 129, 927, 704, 479, 252, 23, 811, 578, 343, 106, 886, 645, 402, 157, 929, 680, 429, 176, 940, 683, 424, 163, 919, 654, 387, 118, 866, 593, 318, 41, 781, 500, 217, 951, 664, 375, 84, 810, 515, 218, 938, 637, 334, 29, 741, 432, 121, 827, 512, 195, 895, 574, 251, 945, 618, 289, 977, 644, 309, 991, 652, 311, 987, 642, 295, 965, 614, 261, 925, 568, 209, 867, 504, 139, 791, 422, 51, 697, 322, 964, 585, 204, 840, 455, 68, 698, 307, 933, 538, 141, 761, 360, 976, 571, 164, 774, 363, 969, 554, 137, 737, 316, 912, 487, 60, 650, 219, 805, 370, 952, 513, 72, 648, 203, 775, 326, 894, 441, 1005, 548, 89, 647, 184, 738, 271, 821, 350, 896, 421, 963, 484, 3, 539, 54, 586, 97, 625, 132, 656, 159, 679, 178, 694, 189, 701, 192, 700, 187, 691, 174, 674, 153, 649, 124, 616, 87, 575, 42, 526, 1008, 469, 947, 404, 878, 331, 801, 250, 716, 161, 623, 64, 522, 978, 413, 865, 296, 744, 171, 615, 38, 478, 916, 333, 767, 180, 610, 19, 445, 869, 272, 692, 91, 507, 921, 314, 724, 113, 519, 923, 306, 706, 85, 481, 875, 248, 638, 7, 393, 777, 140, 520, 898, 255, 629, 1001, 352, 720, 67, 431, 793, 134, 492, 848, 183, 535, 885, 214, 560, 904, 227, 567, 905, 222, 556, 888, 199, 527, 853, 158, 480, 800, 99, 415, 729, 22, 332, 640, 946, 231, 533, 833, 112, 408, 702, 994, 265, 553, 839, 104, 386, 666, 944, 201, 475, 747, 1017, 266, 532, 796, 39, 299, 557, 813, 48, 300, 550, 798, 25, 269, 511, 751, 989, 206, 440, 672, 902, 111, 337, 561, 783, 1003, 202, 418, 632, 844, 35, 243, 449, 653, 855, 36, 234, 430, 624, 816, 1006, 175, 361, 545, 727, 907, 66, 242, 416, 588, 758, 926, 73, 237, 399, 559, 717, 873, 8, 160, 310, 458, 604, 748, 890, 11, 149, 285, 419, 551, 681, 809, 935, 40, 162, 282, 400, 516, 630, 742, 852, 960, 47, 151, 253, 353, 451, 547, 641, 733, 823, 911, 997, 62, 144, 224, 302, 378, 452, 524, 594, 662, 728, 792, 854, 914, 972, 9, 63, 115, 165, 213, 259, 303, 345, 385, 423, 459, 493, 525, 555, 583, 609, 633, 655, 675, 693, 709, 723, 735, 745, 753, 759, 763, 765, 765, 763, 759, 753, 745, 735, 723, 709, 693, 675, 655, 633, 609, 583, 555, 525, 493, 459, 423, 385, 345, 303, 259, 213, 165, 115, 63, 9, 972, 914, 854, 792, 728, 662, 594, 524, 452, 378, 302, 224, 144, 62, 997, 911, 823, 733, 641, 547, 451, 353, 253, 151, 47, 960, 852, 742, 630, 516, 400, 282, 162, 40, 935, 809, 681, 551, 419, 285, 149, 11, 890, 748, 604, 458, 310, 160, 8, 873, 717, 559, 399, 237, 73, 926, 758, 588, 416, 242, 66, 907, 727, 545, 361, 175, 1006, 816, 624, 430, 234, 36, 855, 653, 449, 243, 35, 844, 632, 418, 202, 1003, 783, 561, 337, 111, 902, 672, 440, 206, 989, 751, 511, 269, 25, 798, 550, 300, 48, 813, 557, 299, 39, 796, 532, 266, 1017, 747, 475, 201, 944, 666, 386, 104, 839, 553, 265, 994, 702, 408, 112, 833, 533, 231, 946, 640, 332, 22, 729, 415, 99, 800, 480, 158, 853, 527, 199, 888, 556, 222, 905, 567, 227, 904, 560, 214, 885, 535, 183, 848, 492, 134, 793, 431, 67, 720, 352, 1001, 629, 255, 898, 520, 140, 777, 393, 7, 638, 248, 875, 481, 85, 706, 306, 923, 519, 113, 724, 314, 921, 507, 91, 692, 272, 869, 445, 19, 610, 180, 767, 333, 916, 478, 38, 615, 171, 744, 296, 865, 413, 978, 522, 64, 623, 161, 716, 250, 801, 331, 878, 404, 947, 469, 1008, 526, 42, 575, 87, 616, 124, 649, 153, 674, 174, 691, 187, 700, 192, 701, 189, 694, 178, 679, 159, 656, 132, 625, 97, 586, 54, 539, 3, 484, 963, 421, 896, 350, 821, 271, 738, 184, 647, 89, 548, 1005, 441, 894, 326, 775, 203, 648, 72, 513, 952, 370, 805, 219, 650, 60, 487, 912, 316, 737, 137, 554, 969, 363, 774, 164, 571, 976, 360, 761, 141, 538, 933, 307, 698, 68, 455, 840, 204, 585, 964, 322, 697, 51, 422, 791, 139, 504, 867, 209, 568, 925, 261, 614, 965, 295, 642, 987, 311, 652, 991, 309, 644, 977, 289, 618, 945, 251, 574, 895, 195, 512, 827, 121, 432, 741, 29, 334, 637, 938, 218, 515, 810, 84, 375, 664, 951, 217, 500, 781, 41, 318, 593, 866, 118, 387, 654, 919, 163, 424, 683, 940, 176, 429, 680, 929, 157, 402, 645, 886, 106, 343, 578, 811, 23, 252, 479, 704, 927, 129, 348, 565, 780, 993, 185, 394, 601, 806, 1009, 191, 390, 587, 782, 975, 147, 336, 523, 708, 891, 53, 232, 409, 584, 757, 928, 78, 245, 410, 573, 734, 893, 31, 186, 339, 490, 639, 786, 931, 55, 196, 335, 472, 607, 740, 871, 1000, 108, 233, 356, 477, 596, 713, 828, 941, 33, 142, 249, 354, 457, 558, 657, 754, 849, 942, 14, 103, 190, 275, 358, 439, 518, 595, 670, 743, 814, 883, 950, 1015, 59, 120, 179, 236, 291, 344, 395, 444, 491, 536, 579, 620, 659, 696, 731, 764, 795, 824, 851, 876, 899, 920, 939, 956, 971, 984, 995, 1004, 1011, 1016]
  , [2, 1, 0, 2, 0, 0, 0, 2, 2, 2, 0, 2, 0, 0, 2, 0, 0, 0, 0, 2, 0, 0, 2, 2, 0, 2, 0, 0, 0, 2, 0, 2, 0, 2, 0, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0, 0, 0, 2, 2, 0, 0, 2, 0, 2, 2, 2, 0, 0, 0, 2, 2, 0, 2, 2, 2, 0, 2, 2, 2, 0, 0, 0, 2, 2, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 2, 2, 0, 2, 0, 2, 0, 2, 0, 0, 0, 0, 0, 2, 0, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 0, 0, 2, 2, 2, 0, 2, 0, 0, 2, 0, 2, 2, 0, 0, 2, 0, 0, 0, 0, 2, 0, 0, 2, 0, 2, 0, 0, 2, 0, 2, 2, 2, 2, 0, 2, 0, 0, 2, 0, 2, 0, 2, 0, 2, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 0, 2, 0, 0, 2, 2, 2, 0, 2, 2, 2, 0, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 0, 2, 2, 0, 0, 2, 0, 2, 2, 2, 2, 0, 2, 0, 0, 2, 0, 0, 0, 2, 2, 0, 0, 2, 2, 2, 0, 0, 2, 0, 2, 0, 0, 2, 0, 0, 0, 2, 2, 2, 2, 0, 2, 2, 0, 0, 0, 0, 2, 2, 0, 2, 0, 0, 2, 2, 2, 2, 2, 2, 0, 2, 0, 0, 0, 2, 0, 2, 0, 0, 0, 2, 2, 0, 0, 2, 0, 2, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 2, 0, 2, 0, 0, 0, 2, 2, 0, 0, 2, 2, 0, 2, 2, 0, 0, 2, 2, 0, 2, 2, 2, 0, 0, 2, 0, 2, 0, 2, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 0, 2, 0, 0, 0, 2, 2, 2, 0, 0, 2, 0, 2, 0, 2, 2, 2, 0, 2, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 0, 2, 0, 0, 2, 2, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 0, 0, 0, 2, 2, 2, 0, 0, 2, 0, 2, 2, 0, 2, 2, 0, 2, 2, 2, 2, 0, 0, 0, 0, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 0, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 2, 0, 2, 2, 2, 2, 2, 0, 0, 2, 0, 0, 2, 0, 0, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 2, 2, 2, 0, 2, 2, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 2, 2, 0, 2, 2, 0, 2, 2, 0, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 0, 2, 0, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 2, 2, 2, 2, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 2, 0, 2, 2, 0, 0, 0, 2, 2, 2, 0, 2, 0, 2, 0, 0, 2, 2, 2, 0, 0, 0, 2, 2, 0, 2, 2, 0, 0, 0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 0, 2, 0, 0, 2, 0, 2, 0, 2, 0, 0, 0, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 2, 2, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 2, 0, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 0, 0, 2, 2, 0, 0, 2, 0, 0, 2, 2, 0, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 2, 2, 0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 0, 0, 2, 0, 2, 2, 0, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 2, 0, 0, 2, 2, 2, 2, 0, 0, 2, 0, 0, 0, 0, 2, 2, 2, 0, 2, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 2, 0, 0, 2, 2, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 2, 0, 2, 2, 0, 0, 2, 2, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 2, 0, 0, 0, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 0, 2, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 0, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 2, 2, 0, 2, 0, 2, 0, 2, 0, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 0, 2, 2, 2, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 2, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 0, 2, 2, 2, 2, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 2, 0, 2, 0, 2, 2, 2, 0, 2, 0, 0, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 2, 0]
  , [[0, 2], [1], [], [242, 779], [], [], [], [317, 704], [434, 587], [483, 538], [], [441, 580], [], [], [46, 975], [], [], [], [], [297, 724], [], [], [355, 666], [116, 905], [], [388, 633], [], [], [], [154, 867], [], [79, 942], [], [56, 965], [], [406, 615], [411, 610], [], [290, 731], [380, 641], [449, 572], [140, 881], [268, 753], [], [], [], [], [458, 563], [384, 637], [], [], [187, 834], [], [91, 930], [244, 777], [72, 949], [], [], [], [32, 989], [215, 806], [], [469, 552], [484, 537], [281, 740], [], [422, 599], [328, 693], [195, 826], [], [], [], [222, 799], [428, 593], [], [], [], [], [85, 936], [], [], [], [], [], [147, 874], [312, 709], [], [266, 755], [], [231, 790], [], [302, 719], [], [], [], [], [], [246, 775], [], [352, 669], [], [], [], [45, 976], [369, 652], [], [120, 901], [], [64, 957], [], [], [397, 624], [362, 659], [307, 714], [], [485, 536], [], [], [136, 885], [], [31, 990], [157, 864], [], [], [264, 757], [], [], [], [], [111, 910], [], [], [248, 773], [], [331, 690], [], [], [210, 811], [], [184, 837], [320, 701], [200, 821], [55, 966], [], [470, 551], [], [], [96, 925], [], [442, 579], [], [459, 562], [], [262, 759], [], [], [], [124, 897], [349, 672], [250, 771], [435, 586], [279, 742], [450, 571], [132, 889], [205, 816], [486, 535], [], [], [], [], [], [288, 733], [], [], [260, 761], [417, 604], [128, 893], [], [252, 769], [30, 991], [295, 726], [], [], [334, 687], [233, 788], [106, 915], [78, 943], [258, 763], [], [254, 767], [44, 977], [101, 920], [256, 765], [], [], [160, 861], [71, 950], [], [], [346, 675], [], [373, 648], [402, 619], [224, 797], [192, 829], [], [393, 628], [], [], [181, 840], [], [], [], [487, 534], [337, 684], [], [], [143, 878], [150, 871], [217, 804], [], [], [343, 678], [], [471, 550], [], [], [340, 681], [], [], [], [359, 662], [90, 931], [63, 958], [412, 609], [], [29, 992], [429, 592], [], [], [], [], [423, 598], [407, 614], [], [84, 937], [], [], [315, 706], [54, 967], [277, 744], [163, 858], [115, 906], [460, 561], [], [323, 698], [], [], [], [488, 533], [], [178, 843], [], [], [], [366, 655], [377, 644], [], [], [389, 632], [], [235, 786], [300, 721], [], [], [43, 978], [], [], [], [], [], [], [451, 570], [], [], [443, 578], [], [], [], [166, 855], [], [28, 993], [], [], [], [175, 846], [286, 735], [], [], [381, 640], [385, 636], [], [472, 549], [489, 532], [], [], [310, 711], [197, 824], [], [169, 852], [436, 585], [172, 849], [], [], [305, 716], [], [212, 809], [], [139, 882], [], [], [], [189, 832], [], [], [], [226, 795], [], [], [], [], [275, 746], [356, 665], [293, 728], [153, 868], [70, 951], [95, 926], [398, 623], [], [77, 944], [], [], [], [119, 902], [27, 994], [490, 531], [], [], [110, 911], [], [237, 784], [], [326, 695], [461, 560], [53, 968], [], [62, 959], [], [42, 979], [], [202, 819], [418, 603], [], [207, 814], [], [], [], [], [], [], [219, 802], [], [], [], [], [146, 875], [], [], [473, 548], [], [], [], [], [], [], [491, 530], [370, 651], [135, 886], [], [], [100, 921], [], [], [318, 703], [105, 916], [26, 995], [], [], [], [430, 591], [452, 569], [], [123, 898], [], [273, 748], [], [], [], [363, 658], [89, 932], [83, 938], [], [], [284, 737], [], [353, 668], [424, 597], [], [403, 618], [444, 577], [], [239, 782], [186, 835], [492, 529], [131, 890], [], [], [], [], [127, 894], [413, 608], [329, 692], [156, 865], [], [], [], [], [], [], [41, 980], [394, 627], [228, 793], [], [], [25, 996], [298, 723], [], [], [], [408, 613], [], [462, 559], [474, 547], [], [], [194, 827], [], [52, 969], [437, 584], [493, 528], [], [], [], [], [], [], [], [], [], [271, 750], [], [], [69, 952], [], [], [374, 647], [], [61, 960], [291, 730], [114, 907], [350, 671], [313, 708], [], [], [241, 780], [], [], [214, 807], [], [], [76, 945], [24, 997], [332, 689], [494, 527], [], [], [], [], [], [], [142, 879], [], [], [], [183, 838], [], [], [303, 718], [], [], [], [390, 631], [159, 862], [221, 800], [], [149, 872], [453, 568], [], [40, 981], [308, 713], [321, 700], [], [282, 739], [94, 927], [475, 546], [495, 526], [269, 752], [347, 674], [], [], [], [], [378, 643], [360, 661], [], [335, 686], [23, 998], [], [199, 822], [243, 778], [], [], [], [], [], [419, 602], [], [463, 558], [230, 791], [], [386, 635], [445, 576], [], [367, 654], [209, 812], [496, 525], [344, 677], [382, 639], [51, 970], [431, 590], [338, 683], [399, 622], [], [], [], [109, 912], [], [341, 680], [180, 841], [], [], [204, 817], [], [82, 939], [162, 859], [267, 754], [], [], [118, 903], [22, 999], [], [], [], [497, 524], [88, 933], [191, 830], [245, 776], [99, 922], [425, 596], [], [], [], [], [138, 883], [476, 545], [39, 982], [60, 961], [], [], [], [], [104, 917], [], [], [438, 583], [], [], [68, 953], [], [498, 523], [296, 725], [], [], [], [177, 844], [289, 732], [265, 756], [], [165, 856], [], [21, 1000], [], [], [280, 741], [414, 607], [247, 774], [], [], [], [324, 697], [454, 567], [], [404, 617], [499, 522], [], [], [], [152, 869], [316, 705], [75, 946], [357, 664], [464, 557], [174, 847], [], [168, 853], [122, 899], [], [232, 789], [223, 798], [263, 758], [216, 805], [], [171, 850], [409, 612], [134, 887], [500, 521], [249, 772], [50, 971], [], [20, 1001], [], [], [477, 544], [], [145, 876], [], [371, 650], [], [], [], [38, 983], [], [395, 626], [], [261, 760], [501, 520], [], [], [], [251, 770], [126, 895], [446, 575], [], [130, 891], [], [], [], [], [], [], [], [259, 762], [301, 720], [502, 519], [253, 768], [], [19, 1002], [188, 833], [196, 825], [], [257, 764], [255, 766], [364, 657], [], [113, 908], [], [311, 710], [], [93, 928], [503, 518], [], [], [], [59, 962], [], [], [278, 743], [432, 589], [], [], [327, 694], [], [], [504, 517], [306, 715], [], [], [420, 601], [478, 543], [354, 667], [], [18, 1003], [], [465, 556], [81, 940], [505, 516], [], [211, 810], [234, 787], [], [67, 954], [155, 866], [455, 566], [37, 984], [287, 734], [506, 515], [], [375, 646], [439, 582], [], [], [391, 630], [], [507, 514], [49, 972], [], [], [87, 934], [426, 595], [508, 513], [], [201, 820], [], [509, 512], [17, 1004], [510, 511], [], [294, 727], [], [], [], [], [], [], [206, 815], [225, 796], [], [319, 702], [], [], [108, 913], [141, 880], [98, 923], [400, 621], [], [], [74, 947], [], [], [], [], [185, 836], [479, 542], [330, 691], [], [16, 1005], [379, 642], [], [387, 634], [], [351, 670], [276, 745], [], [], [], [218, 803], [103, 918], [], [], [447, 574], [148, 873], [117, 904], [], [383, 638], [36, 985], [], [415, 606], [], [], [], [], [236, 785], [], [466, 555], [15, 1006], [], [], [158, 863], [58, 963], [], [], [], [], [361, 660], [], [], [], [], [], [368, 653], [193, 828], [], [], [], [405, 616], [], [], [], [333, 688], [48, 973], [], [14, 1007], [456, 565], [348, 673], [480, 541], [410, 611], [], [], [], [], [], [], [], [], [], [285, 736], [137, 884], [182, 839], [], [299, 722], [], [66, 955], [], [433, 588], [], [314, 707], [13, 1008], [], [274, 747], [], [], [], [], [35, 986], [], [336, 685], [121, 900], [], [345, 676], [], [440, 581], [92, 929], [], [80, 941], [227, 794], [161, 860], [238, 783], [], [322, 699], [12, 1009], [], [], [396, 625], [], [339, 682], [342, 679], [], [421, 600], [], [], [], [467, 554], [213, 808], [], [481, 540], [], [292, 729], [], [], [133, 888], [11, 1010], [304, 717], [], [309, 712], [], [179, 842], [427, 594], [112, 909], [86, 935], [125, 896], [], [73, 948], [], [198, 823], [], [448, 573], [], [], [151, 870], [10, 1011], [129, 892], [57, 964], [47, 974], [], [372, 649], [164, 857], [358, 663], [272, 749], [], [], [34, 987], [144, 877], [220, 801], [], [], [], [9, 1012], [], [], [], [457, 564], [], [], [240, 781], [190, 831], [176, 845], [], [], [], [208, 813], [], [8, 1013], [482, 539], [], [], [97, 924], [203, 818], [167, 854], [283, 738], [], [], [], [], [], [7, 1014], [], [], [173, 848], [], [392, 629], [], [170, 851], [], [107, 914], [365, 656], [6, 1015], [], [468, 553], [], [], [65, 956], [325, 696], [], [401, 620], [5, 1016], [229, 792], [416, 605], [], [270, 751], [102, 919], [], [4, 1017], [], [], [], [33, 988], [3, 1018], [376, 645], []]
  , [0, 1, 0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]
  , [0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1]
  , {0: 1, 1: 1, 3: 508}
  )
1019-508*2
  3

f=lambda M,a,x:(2*x-a*x**2)%M
#########above^
#########
#########
#########below:
f=lambda M,a,x:(a+x**2)%M
h(97,1)
  ([1, 2, 5, 10, 17, 26, 37, 50, 65, 82, 4, 25, 48, 73, 3, 32, 63, 96, 34, 71, 13, 54, 0, 45, 92, 44, 95, 51, 9, 66, 28, 89, 55, 23, 90, 62, 36, 12, 87, 67, 49, 33, 19, 7, 94, 86, 80, 76, 74, 74, 76, 80, 86, 94, 7, 19, 33, 49, 67, 87, 12, 36, 62, 90, 23, 55, 89, 28, 66, 9, 51, 95, 44, 92, 45, 0, 54, 13, 71, 34, 96, 63, 32, 3, 73, 48, 25, 4, 82, 65, 50, 37, 26, 17, 10, 5, 2]
  , [2, 1, 2, 2, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 0, 0, 0, 2, 0, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 2, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 2, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 2, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 0, 2, 0, 0, 0, 2, 2, 0, 2, 2, 0, 2, 0, 2, 2, 2]
  , [[22, 75], [0], [1, 96], [14, 83], [10, 87], [2, 95], [], [43, 54], [], [28, 69], [3, 94], [], [37, 60], [20, 77], [], [], [], [4, 93], [], [42, 55], [], [], [], [33, 64], [], [11, 86], [5, 92], [], [30, 67], [], [], [], [15, 82], [41, 56], [18, 79], [], [36, 61], [6, 91], [], [], [], [], [], [], [25, 72], [23, 74], [], [], [12, 85], [40, 57], [7, 90], [27, 70], [], [], [21, 76], [32, 65], [], [], [], [], [], [], [35, 62], [16, 81], [], [8, 89], [29, 68], [39, 58], [], [], [], [19, 78], [], [13, 84], [48, 49], [], [47, 50], [], [], [], [46, 51], [], [9, 88], [], [], [], [45, 52], [38, 59], [], [31, 66], [34, 63], [], [24, 73], [], [44, 53], [26, 71], [17, 80]]
  , [5, 5, 5, 5, 5, 5, 5, 7, 5, 5, 5, 5, 5, 5, 5, 5, 7, 5, 7, 5, 5, 7, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 7, 62, 36, 5, 5, 5, 5, 5, 5, 7, 5, 5, 5, 7, 5, 5, 7, 5, 5, 5, 7, 5, 5, 5, 5, 5, 5, 36, 62, 7, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 7, 5, 5, 7, 5, 7, 5, 5, 5, 5, 5, 5, 5, 5, 7, 5, 5, 5, 5, 5, 5]
  , [3, 2, 1, 6, 4, 0, 15, 0, 5, 6, 5, 9, 13, 3, 7, 5, 3, 3, 3, 2, 4, 1, 4, 11, 2, 8, 0, 5, 7, 7, 8, 6, 4, 12, 2, 1, 0, 14, 6, 9, 13, 13, 3, 1, 7, 10, 4, 1, 12, 12, 0, 4, 10, 7, 0, 3, 13, 13, 9, 6, 14, 1, 0, 2, 12, 4, 6, 8, 7, 7, 5, 1, 8, 2, 11, 4, 0, 4, 2, 3, 3, 3, 5, 7, 3, 13, 9, 5, 6, 5, 1, 15, 1, 4, 6, 0, 2]
  , {5: 3, 7: 4, 62: 1, 36: 1}
  )
h(97,19)
  ([19, 20, 23, 28, 35, 44, 55, 68, 83, 3, 22, 43, 66, 91, 21, 50, 81, 17, 52, 89, 31, 72, 18, 63, 13, 62, 16, 69, 27, 84, 46, 10, 73, 41, 11, 80, 54, 30, 8, 85, 67, 51, 37, 25, 15, 7, 1, 94, 92, 92, 94, 1, 7, 15, 25, 37, 51, 67, 85, 8, 30, 54, 80, 11, 41, 73, 10, 46, 84, 27, 69, 16, 62, 13, 63, 18, 72, 31, 89, 52, 17, 81, 50, 21, 91, 66, 43, 22, 3, 83, 68, 55, 44, 35, 28, 23, 20]
  , [0, 2, 0, 2, 0, 0, 0, 2, 2, 0, 2, 2, 0, 2, 0, 2, 2, 2, 2, 1, 2, 2, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 0, 0, 0, 2, 0, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 2, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 2, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 2, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0]
  , [[], [46, 51], [], [9, 88], [], [], [], [45, 52], [38, 59], [], [31, 66], [34, 63], [], [24, 73], [], [44, 53], [26, 71], [17, 80], [22, 75], [0], [1, 96], [14, 83], [10, 87], [2, 95], [], [43, 54], [], [28, 69], [3, 94], [], [37, 60], [20, 77], [], [], [], [4, 93], [], [42, 55], [], [], [], [33, 64], [], [11, 86], [5, 92], [], [30, 67], [], [], [], [15, 82], [41, 56], [18, 79], [], [36, 61], [6, 91], [], [], [], [], [], [], [25, 72], [23, 74], [], [], [12, 85], [40, 57], [7, 90], [27, 70], [], [], [21, 76], [32, 65], [], [], [], [], [], [], [35, 62], [16, 81], [], [8, 89], [29, 68], [39, 58], [], [], [], [19, 78], [], [13, 84], [48, 49], [], [47, 50], [], []]
  , [17, 1, 17, 27, 17, 27, 1, 1, 17, 27, 1, 17, 1, 1, 17, 27, 81, 17, 1, 17, 1, 17, 1, 17, 1, 17, 81, 27, 27, 1, 1, 1, 1, 1, 17, 17, 17, 1, 17, 1, 1, 1, 1, 17, 27, 1, 1, 27, 27, 27, 27, 1, 1, 27, 17, 1, 1, 1, 1, 17, 1, 17, 17, 17, 1, 1, 1, 1, 1, 27, 27, 81, 17, 1, 17, 1, 17, 1, 17, 1, 17, 81, 27, 17, 1, 1, 17, 1, 27, 17, 1, 1, 27, 17, 27, 17, 1]
  , [8, 0, 8, 2, 3, 6, 1, 0, 6, 3, 0, 5, 2, 1, 5, 4, 1, 0, 0, 7, 0, 4, 0, 7, 2, 3, 2, 0, 1, 1, 0, 0, 3, 3, 6, 2, 5, 0, 7, 3, 2, 2, 1, 4, 5, 1, 0, 3, 7, 7, 3, 1, 0, 5, 4, 0, 2, 2, 3, 7, 1, 5, 2, 6, 3, 3, 1, 1, 0, 0, 1, 2, 3, 2, 7, 1, 4, 1, 7, 1, 1, 0, 4, 5, 0, 2, 5, 1, 3, 6, 1, 0, 6, 3, 2, 8, 1]
  , {17: 1, 1: 15, 27: 2, 81: 1}
  )


h(257, 1)
  ([1, 2, 5, 10, 17, 26, 37, 50, 65, 82, 101, 122, 145, 170, 197, 226, 0, 33, 68, 105, 144, 185, 228, 16, 63, 112, 163, 216, 14, 71, 130, 191, 254, 62, 129, 198, 12, 85, 160, 237, 59, 140, 223, 51, 138, 227, 61, 154, 249, 89, 188, 32, 135, 240, 90, 199, 53, 166, 24, 141, 3, 124, 247, 115, 242, 114, 245, 121, 256, 136, 18, 159, 45, 190, 80, 229, 123, 19, 174, 74, 233, 137, 43, 208, 118, 30, 201, 117, 35, 212, 134, 58, 241, 169, 99, 31, 222, 158, 96, 36, 235, 179, 125, 73, 23, 232, 186, 142, 100, 60, 22, 243, 209, 177, 147, 119, 93, 69, 47, 27, 9, 250, 236, 224, 214, 206, 200, 196, 194, 194, 196, 200, 206, 214, 224, 236, 250, 9, 27, 47, 69, 93, 119, 147, 177, 209, 243, 22, 60, 100, 142, 186, 232, 23, 73, 125, 179, 235, 36, 96, 158, 222, 31, 99, 169, 241, 58, 134, 212, 35, 117, 201, 30, 118, 208, 43, 137, 233, 74, 174, 19, 123, 229, 80, 190, 45, 159, 18, 136, 256, 121, 245, 114, 242, 115, 247, 124, 3, 141, 24, 166, 53, 199, 90, 240, 135, 32, 188, 89, 249, 154, 61, 227, 138, 51, 223, 140, 59, 237, 160, 85, 12, 198, 129, 62, 254, 191, 130, 71, 14, 216, 163, 112, 63, 16, 228, 185, 144, 105, 68, 33, 0, 226, 197, 170, 145, 122, 101, 82, 65, 50, 37, 26, 17, 10, 5, 2]
  , [2, 1, 2, 2, 0, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 0, 2, 2, 2, 2, 0, 0, 2, 2, 2, 0, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 2, 0, 2, 0, 2, 0, 0, 2, 2, 0, 2, 0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 0, 2, 0, 0, 2, 2, 0, 2, 0, 2, 2, 0, 0, 0, 0, 0, 2, 0, 2, 0, 0, 2, 0, 0, 0, 2, 2, 0, 0, 2, 0, 0, 2, 0, 0, 2, 2, 2, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0, 0, 2, 2, 0, 0, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 2, 2, 2, 0, 0, 2, 0, 0, 2, 0, 0, 2, 2, 0, 0, 0, 2, 0, 0, 2, 0, 2, 0, 0, 0, 0, 0, 2, 2, 0, 2, 0, 2, 2, 0, 0, 2, 0, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 2, 0, 2, 2, 0, 0, 2, 0, 2, 0, 2, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 2, 2, 2, 0, 0, 2, 2, 0, 2, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 0, 2]
  , [[16, 241], [0], [1, 256], [60, 197], [], [2, 255], [], [], [], [120, 137], [3, 254], [], [36, 221], [], [28, 229], [], [23, 234], [4, 253], [70, 187], [77, 180], [], [], [110, 147], [104, 153], [58, 199], [], [5, 252], [119, 138], [], [], [85, 172], [95, 162], [51, 206], [17, 240], [], [88, 169], [99, 158], [6, 251], [], [], [], [], [], [82, 175], [], [72, 185], [], [118, 139], [], [], [7, 250], [43, 214], [], [56, 201], [], [], [], [], [91, 166], [40, 217], [109, 148], [46, 211], [33, 224], [24, 233], [], [8, 249], [], [], [18, 239], [117, 140], [], [29, 228], [], [103, 154], [79, 178], [], [], [], [], [], [74, 183], [], [9, 248], [], [], [37, 220], [], [], [], [49, 208], [54, 203], [], [], [116, 141], [], [], [98, 159], [], [], [94, 163], [108, 149], [10, 247], [], [], [], [19, 238], [], [], [], [], [], [], [25, 232], [], [65, 192], [63, 194], [], [87, 170], [84, 173], [115, 142], [], [67, 190], [11, 246], [76, 181], [61, 196], [102, 155], [], [], [], [34, 223], [30, 227], [], [], [], [90, 167], [52, 205], [69, 188], [81, 176], [44, 213], [], [41, 216], [59, 198], [107, 150], [], [20, 237], [12, 245], [], [114, 143], [], [], [], [], [], [], [47, 210], [], [], [], [97, 160], [71, 186], [38, 219], [], [], [26, 231], [], [], [57, 200], [], [], [93, 164], [13, 244], [], [], [], [78, 179], [], [], [113, 144], [], [101, 156], [], [], [], [], [], [21, 236], [106, 151], [], [50, 207], [], [73, 184], [31, 226], [], [], [128, 129], [], [127, 130], [14, 243], [35, 222], [55, 202], [126, 131], [86, 171], [], [], [], [], [125, 132], [], [83, 174], [112, 145], [], [], [89, 168], [], [124, 133], [], [27, 230], [], [], [], [], [], [96, 161], [42, 215], [123, 134], [], [15, 242], [45, 212], [22, 235], [75, 182], [], [], [105, 152], [80, 177], [], [100, 157], [122, 135], [39, 218], [], [], [53, 204], [92, 165], [64, 193], [111, 146], [], [66, 191], [], [62, 195], [], [48, 209], [121, 136], [], [], [], [32, 225], [], [68, 189]]
  , [35, 35, 35, 10, 10, 35, 10, 50, 35, 10, 10, 10, 35, 50, 10, 35, 35, 10, 35, 35, 50, 10, 35, 35, 50, 35, 35, 50, 10, 35, 10, 35, 10, 10, 50, 35, 35, 10, 35, 50, 35, 50, 50, 10, 50, 10, 10, 50, 35, 10, 50, 10, 10, 10, 10, 50, 10, 50, 50, 35, 10, 10, 10, 50, 35, 35, 35, 50, 35, 50, 35, 35, 10, 50, 50, 10, 10, 35, 10, 50, 50, 10, 10, 10, 50, 10, 10, 50, 35, 10, 10, 50, 35, 35, 35, 35, 35, 35, 35, 35, 35, 10, 10, 50, 35, 35, 35, 50, 35, 10, 35, 10, 35, 50, 35, 50, 35, 50, 50, 50, 10, 50, 10, 10, 10, 10, 50, 10, 50, 50, 10, 50, 10, 10, 10, 10, 50, 10, 50, 50, 50, 35, 50, 35, 50, 35, 10, 35, 10, 35, 50, 35, 35, 35, 50, 10, 10, 35, 35, 35, 35, 35, 35, 35, 35, 35, 50, 10, 10, 35, 50, 10, 10, 50, 10, 10, 10, 50, 50, 10, 35, 10, 10, 50, 50, 10, 35, 35, 50, 35, 50, 35, 35, 35, 50, 10, 10, 10, 35, 50, 50, 10, 50, 10, 10, 10, 10, 50, 10, 35, 50, 10, 10, 50, 10, 50, 50, 35, 50, 35, 10, 35, 35, 50, 10, 10, 35, 10, 35, 10, 50, 35, 35, 50, 35, 35, 10, 50, 35, 35, 10, 35, 35, 10, 50, 35, 10, 10, 10, 35, 50, 10, 35, 10, 10, 35, 35]
  , [21, 20, 19, 1, 5, 18, 4, 1, 10, 3, 0, 5, 13, 4, 3, 16, 22, 4, 22, 15, 11, 3, 6, 23, 8, 13, 17, 4, 4, 5, 1, 15, 0, 3, 9, 0, 14, 3, 17, 12, 2, 3, 10, 1, 6, 1, 2, 5, 11, 1, 0, 0, 5, 5, 6, 10, 6, 11, 9, 1, 2, 1, 2, 7, 17, 9, 14, 2, 21, 1, 23, 4, 2, 3, 10, 5, 5, 16, 1, 11, 9, 5, 2, 1, 7, 2, 7, 3, 1, 0, 5, 10, 23, 0, 16, 16, 2, 16, 3, 15, 7, 0, 3, 4, 24, 14, 5, 7, 8, 3, 7, 4, 12, 10, 8, 6, 1, 2, 6, 5, 4, 1, 4, 4, 0, 2, 12, 1, 8, 8, 0, 12, 2, 1, 4, 4, 0, 4, 5, 6, 2, 0, 6, 8, 10, 12, 4, 7, 3, 8, 7, 5, 14, 24, 4, 3, 1, 7, 15, 3, 16, 2, 16, 16, 1, 23, 10, 5, 1, 0, 3, 7, 2, 7, 0, 2, 5, 9, 11, 0, 16, 5, 5, 10, 3, 2, 4, 23, 0, 21, 2, 14, 9, 17, 7, 2, 0, 2, 0, 9, 11, 6, 10, 6, 5, 5, 1, 1, 0, 11, 5, 2, 0, 6, 0, 10, 3, 2, 12, 17, 3, 14, 1, 9, 3, 1, 15, 0, 5, 4, 4, 17, 13, 8, 23, 6, 3, 11, 15, 22, 4, 22, 16, 3, 4, 13, 5, 1, 3, 10, 0, 4, 18, 5, 0, 19, 20]
  , {35: 5, 10: 15, 50: 4}
  )


h(1021,1)
  ([1, 2, 5, 10, 17, 26, 37, 50, 65, 82, 101, 122, 145, 170, 197, 226, 257, 290, 325, 362, 401, 442, 485, 530, 577, 626, 677, 730, 785, 842, 901, 962, 4, 69, 136, 205, 276, 349, 424, 501, 580, 661, 744, 829, 916, 1005, 75, 168, 263, 360, 459, 560, 663, 768, 875, 984, 74, 187, 302, 419, 538, 659, 782, 907, 13, 142, 273, 406, 541, 678, 817, 958, 80, 225, 372, 521, 672, 825, 980, 116, 275, 436, 599, 764, 931, 79, 250, 423, 598, 775, 954, 114, 297, 482, 669, 858, 28, 221, 416, 613, 812, 1013, 195, 400, 607, 816, 6, 219, 434, 651, 870, 70, 293, 518, 745, 974, 184, 417, 652, 889, 107, 348, 591, 836, 62, 311, 562, 815, 49, 306, 565, 826, 68, 333, 600, 869, 119, 392, 667, 944, 202, 483, 766, 30, 317, 606, 897, 169, 464, 761, 39, 340, 643, 948, 234, 543, 854, 146, 461, 778, 76, 397, 720, 24, 351, 680, 1011, 323, 658, 995, 313, 654, 997, 321, 668, 1017, 347, 700, 34, 391, 750, 90, 453, 818, 164, 533, 904, 256, 631, 1008, 366, 747, 109, 494, 881, 249, 640, 12, 407, 804, 182, 583, 986, 370, 777, 165, 576, 989, 383, 800, 198, 619, 21, 446, 873, 281, 712, 124, 559, 996, 414, 855, 277, 722, 148, 597, 27, 480, 935, 371, 830, 270, 733, 177, 644, 92, 563, 15, 490, 967, 425, 906, 368, 853, 319, 808, 278, 771, 245, 742, 220, 721, 203, 708, 194, 703, 193, 706, 200, 717, 215, 736, 238, 763, 269, 798, 308, 841, 355, 892, 410, 951, 473, 1018, 544, 72, 623, 155, 710, 246, 805, 345, 908, 452, 1019, 567, 117, 690, 244, 821, 379, 960, 522, 86, 673, 241, 832, 404, 999, 575, 153, 754, 336, 941, 527, 115, 726, 318, 933, 529, 127, 748, 350, 975, 581, 189, 820, 432, 46, 683, 301, 942, 564, 188, 835, 463, 93, 746, 380, 16, 675, 315, 978, 622, 268, 937, 587, 239, 914, 570, 228, 909, 571, 235, 922, 590, 260, 953, 627, 303, 1002, 682, 364, 48, 755, 443, 133, 846, 540, 236, 955, 655, 357, 61, 788, 496, 206, 939, 653, 369, 87, 828, 550, 274, 0, 749, 479, 211, 966, 702, 440, 180, 943, 687, 433, 181, 952, 704, 458, 214, 993, 753, 515, 279, 45, 834, 604, 376, 150, 947, 725, 505, 287, 71, 878, 666, 456, 248, 42, 859, 657, 457, 259, 63, 890, 698, 508, 320, 134, 971, 789, 609, 431, 255, 81, 930, 760, 592, 426, 262, 100, 961, 803, 647, 493, 341, 191, 43, 918, 774, 632, 492, 354, 218, 84, 973, 843, 715, 589, 465, 343, 223, 105, 1010, 896, 784, 674, 566, 460, 356, 254, 154, 56, 981, 887, 795, 705, 617, 531, 447, 365, 285, 207, 131, 57, 1006, 936, 868, 802, 738, 676, 616, 558, 502, 448, 396, 346, 298, 252, 208, 166, 126, 88, 52, 18, 1007, 977, 949, 923, 899, 877, 857, 839, 823, 809, 797, 787, 779, 773, 769, 767, 767, 769, 773, 779, 787, 797, 809, 823, 839, 857, 877, 899, 923, 949, 977, 1007, 18, 52, 88, 126, 166, 208, 252, 298, 346, 396, 448, 502, 558, 616, 676, 738, 802, 868, 936, 1006, 57, 131, 207, 285, 365, 447, 531, 617, 705, 795, 887, 981, 56, 154, 254, 356, 460, 566, 674, 784, 896, 1010, 105, 223, 343, 465, 589, 715, 843, 973, 84, 218, 354, 492, 632, 774, 918, 43, 191, 341, 493, 647, 803, 961, 100, 262, 426, 592, 760, 930, 81, 255, 431, 609, 789, 971, 134, 320, 508, 698, 890, 63, 259, 457, 657, 859, 42, 248, 456, 666, 878, 71, 287, 505, 725, 947, 150, 376, 604, 834, 45, 279, 515, 753, 993, 214, 458, 704, 952, 181, 433, 687, 943, 180, 440, 702, 966, 211, 479, 749, 0, 274, 550, 828, 87, 369, 653, 939, 206, 496, 788, 61, 357, 655, 955, 236, 540, 846, 133, 443, 755, 48, 364, 682, 1002, 303, 627, 953, 260, 590, 922, 235, 571, 909, 228, 570, 914, 239, 587, 937, 268, 622, 978, 315, 675, 16, 380, 746, 93, 463, 835, 188, 564, 942, 301, 683, 46, 432, 820, 189, 581, 975, 350, 748, 127, 529, 933, 318, 726, 115, 527, 941, 336, 754, 153, 575, 999, 404, 832, 241, 673, 86, 522, 960, 379, 821, 244, 690, 117, 567, 1019, 452, 908, 345, 805, 246, 710, 155, 623, 72, 544, 1018, 473, 951, 410, 892, 355, 841, 308, 798, 269, 763, 238, 736, 215, 717, 200, 706, 193, 703, 194, 708, 203, 721, 220, 742, 245, 771, 278, 808, 319, 853, 368, 906, 425, 967, 490, 15, 563, 92, 644, 177, 733, 270, 830, 371, 935, 480, 27, 597, 148, 722, 277, 855, 414, 996, 559, 124, 712, 281, 873, 446, 21, 619, 198, 800, 383, 989, 576, 165, 777, 370, 986, 583, 182, 804, 407, 12, 640, 249, 881, 494, 109, 747, 366, 1008, 631, 256, 904, 533, 164, 818, 453, 90, 750, 391, 34, 700, 347, 1017, 668, 321, 997, 654, 313, 995, 658, 323, 1011, 680, 351, 24, 720, 397, 76, 778, 461, 146, 854, 543, 234, 948, 643, 340, 39, 761, 464, 169, 897, 606, 317, 30, 766, 483, 202, 944, 667, 392, 119, 869, 600, 333, 68, 826, 565, 306, 49, 815, 562, 311, 62, 836, 591, 348, 107, 889, 652, 417, 184, 974, 745, 518, 293, 70, 870, 651, 434, 219, 6, 816, 607, 400, 195, 1013, 812, 613, 416, 221, 28, 858, 669, 482, 297, 114, 954, 775, 598, 423, 250, 79, 931, 764, 599, 436, 275, 116, 980, 825, 672, 521, 372, 225, 80, 958, 817, 678, 541, 406, 273, 142, 13, 907, 782, 659, 538, 419, 302, 187, 74, 984, 875, 768, 663, 560, 459, 360, 263, 168, 75, 1005, 916, 829, 744, 661, 580, 501, 424, 349, 276, 205, 136, 69, 4, 962, 901, 842, 785, 730, 677, 626, 577, 530, 485, 442, 401, 362, 325, 290, 257, 226, 197, 170, 145, 122, 101, 82, 65, 50, 37, 26, 17, 10, 5, 2]
  , [2, 1, 2, 0, 2, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 2, 2, 2, 0, 0, 2, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 0, 0, 2, 0, 0, 2, 0, 2, 0, 0, 2, 2, 0, 2, 2, 0, 2, 2, 2, 0, 2, 0, 0, 0, 2, 2, 0, 0, 0, 2, 2, 2, 0, 2, 0, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 2, 0, 2, 0, 2, 0, 0, 0, 0, 2, 2, 2, 2, 0, 2, 0, 0, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 0, 2, 0, 0, 2, 2, 0, 2, 0, 2, 0, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 2, 2, 0, 2, 0, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 2, 2, 0, 0, 2, 0, 0, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 2, 0, 2, 0, 0, 2, 2, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 2, 0, 2, 2, 0, 2, 2, 0, 0, 0, 0, 2, 2, 2, 0, 0, 2, 2, 2, 2, 2, 2, 2, 0, 2, 0, 0, 0, 2, 0, 2, 0, 0, 2, 0, 0, 2, 0, 0, 0, 2, 2, 0, 0, 2, 2, 2, 0, 0, 2, 0, 2, 0, 0, 2, 0, 2, 0, 2, 0, 2, 2, 2, 2, 2, 0, 2, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2, 2, 2, 0, 0, 2, 0, 2, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0, 0, 2, 0, 0, 2, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 2, 2, 0, 0, 2, 2, 0, 0, 2, 0, 2, 2, 0, 0, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 2, 2, 0, 0, 0, 0, 2, 2, 2, 2, 0, 2, 0, 0, 0, 2, 0, 2, 2, 0, 0, 2, 2, 2, 0, 0, 0, 2, 2, 0, 0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 2, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 0, 0, 0, 2, 2, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 2, 2, 0, 0, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 2, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 2, 2, 2, 0, 0, 2, 2, 0, 2, 0, 0, 0, 2, 0, 2, 2, 2, 2, 0, 0, 0, 0, 2, 2, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 0, 0, 2, 2, 0, 2, 0, 0, 2, 2, 0, 0, 2, 2, 0, 0, 0, 2, 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 2, 0, 0, 2, 0, 0, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 0, 2, 0, 0, 2, 2, 2, 2, 0, 0, 2, 2, 2, 2, 2, 2, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 2, 0, 2, 2, 2, 2, 2, 0, 2, 0, 2, 0, 2, 0, 0, 2, 0, 2, 0, 0, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 2, 0, 0, 2, 0, 0, 2, 0, 2, 0, 0, 0, 2, 0, 2, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2, 2, 0, 0, 0, 0, 2, 2, 0, 2, 2, 0, 2, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 2, 2, 2, 0, 0, 2, 0, 2, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 2, 2, 2, 2, 0, 0, 2, 2, 0, 0, 2, 0, 0, 2, 2, 2, 2, 0, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 0, 2, 0, 2, 2, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 0, 2, 0, 2, 0, 2, 2, 0, 0, 2, 0, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 0, 0, 2, 0, 2, 2, 2, 2, 0, 0, 0, 0, 2, 0, 2, 0, 2, 0, 0, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 0, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 2, 0, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0, 2, 0, 2, 2, 2, 0, 0, 0, 2, 2, 0, 0, 0, 2, 0, 2, 2, 2, 0, 2, 2, 0, 2, 2, 0, 0, 2, 0, 2, 0, 0, 2, 0, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 0, 2, 0, 0, 2, 2, 2, 2, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 2, 0]
  , [[374, 647], [0], [1, 1020], [], [32, 989], [2, 1019], [106, 915], [], [], [], [3, 1018], [], [197, 824], [64, 957], [], [237, 784], [329, 692], [4, 1017], [494, 527], [], [], [212, 809], [], [], [163, 858], [], [5, 1016], [226, 795], [96, 925], [], [143, 878], [], [], [], [178, 843], [], [], [6, 1015], [], [150, 871], [], [], [408, 613], [437, 584], [], [394, 627], [318, 703], [], [353, 668], [128, 893], [7, 1014], [], [493, 528], [], [], [], [462, 559], [474, 547], [], [], [], [363, 658], [124, 897], [413, 608], [], [8, 1013], [], [], [132, 889], [33, 988], [111, 910], [403, 618], [275, 746], [], [56, 965], [46, 975], [160, 861], [], [], [85, 936], [72, 949], [424, 597], [9, 1012], [], [444, 577], [], [293, 728], [370, 651], [492, 529], [], [181, 840], [], [235, 786], [326, 695], [], [], [], [], [], [], [430, 591], [10, 1011], [], [], [], [452, 569], [], [120, 901], [], [192, 829], [], [], [], [], [91, 930], [305, 716], [79, 942], [286, 735], [], [136, 885], [], [], [11, 1010], [], [217, 804], [], [491, 530], [310, 711], [], [], [], [473, 548], [], [356, 665], [418, 603], [], [34, 987], [], [], [], [], [], [65, 956], [], [], [12, 1009], [157, 864], [], [224, 797], [], [398, 623], [], [], [300, 721], [461, 560], [277, 744], [], [], [], [], [], [], [], [], [184, 837], [205, 816], [490, 531], [], [47, 974], [147, 874], [13, 1008], [], [], [], [], [], [], [233, 788], [], [], [381, 640], [385, 636], [200, 821], [], [116, 905], [], [], [57, 964], [323, 698], [315, 706], [], [436, 585], [], [256, 765], [254, 767], [102, 919], [], [14, 1007], [210, 811], [], [258, 763], [], [140, 881], [252, 769], [], [35, 986], [366, 655], [472, 549], [489, 532], [], [], [377, 644], [], [], [389, 632], [260, 761], [], [], [443, 578], [107, 914], [250, 771], [97, 924], [], [451, 570], [], [73, 948], [15, 1006], [], [340, 681], [], [], [], [], [], [154, 867], [343, 678], [359, 662], [], [262, 759], [337, 684], [], [295, 726], [], [], [288, 733], [248, 773], [279, 742], [], [407, 614], [195, 826], [86, 935], [], [488, 533], [], [460, 561], [423, 598], [187, 834], [16, 1005], [], [412, 609], [346, 675], [], [429, 592], [48, 973], [], [], [], [], [334, 687], [264, 757], [231, 790], [], [], [66, 955], [373, 648], [80, 941], [36, 985], [222, 799], [246, 775], [393, 628], [], [215, 806], [], [], [], [471, 550], [], [402, 619], [], [], [17, 1004], [], [], [112, 909], [], [], [], [92, 929], [487, 534], [], [], [320, 701], [58, 963], [349, 672], [], [], [129, 892], [], [266, 755], [], [], [125, 896], [], [170, 851], [], [331, 690], [], [144, 877], [307, 714], [244, 777], [417, 604], [173, 848], [], [167, 854], [], [18, 1003], [], [], [], [], [], [], [], [133, 888], [], [], [302, 719], [], [], [], [151, 870], [435, 586], [], [450, 571], [], [281, 740], [486, 535], [176, 845], [121, 900], [37, 984], [312, 709], [164, 857], [], [], [442, 579], [268, 753], [459, 562], [362, 659], [], [], [49, 972], [], [19, 1002], [], [352, 669], [470, 551], [190, 831], [], [242, 779], [369, 652], [203, 818], [229, 792], [74, 947], [], [], [], [397, 624], [], [], [290, 731], [328, 693], [], [], [208, 813], [], [], [], [], [], [], [], [179, 842], [137, 884], [], [], [], [485, 536], [161, 860], [], [], [103, 918], [20, 1001], [], [], [297, 724], [], [67, 954], [198, 823], [], [], [270, 751], [], [], [], [220, 801], [], [98, 923], [117, 904], [], [59, 962], [], [], [], [87, 934], [38, 983], [240, 781], [428, 593], [], [], [], [], [422, 599], [317, 704], [384, 637], [108, 913], [], [81, 940], [], [], [], [380, 641], [], [21, 1000], [355, 666], [], [], [213, 808], [469, 552], [484, 537], [], [], [], [283, 738], [182, 839], [], [], [406, 615], [411, 610], [388, 633], [50, 971], [458, 563], [158, 863], [], [325, 696], [148, 873], [449, 572], [], [], [], [], [], [], [], [272, 749], [], [], [], [], [], [376, 645], [227, 794], [], [93, 928], [141, 880], [], [22, 999], [], [], [], [], [238, 783], [], [441, 580], [434, 587], [193, 828], [], [365, 656], [], [], [], [], [39, 982], [483, 538], [], [], [401, 620], [], [], [416, 605], [], [], [], [], [], [], [392, 629], [], [], [113, 908], [], [], [75, 946], [292, 729], [], [], [], [], [304, 717], [], [309, 712], [23, 998], [468, 553], [], [185, 836], [], [], [], [], [60, 961], [], [358, 663], [68, 953], [], [155, 866], [274, 747], [], [], [], [], [], [372, 649], [], [], [], [], [], [], [], [482, 539], [218, 803], [51, 970], [], [126, 895], [236, 785], [322, 699], [130, 891], [457, 564], [285, 736], [], [], [339, 682], [342, 679], [], [], [], [299, 722], [206, 815], [24, 997], [], [], [40, 981], [314, 707], [], [201, 820], [], [], [], [336, 685], [], [448, 573], [345, 676], [122, 899], [427, 594], [], [], [], [], [225, 796], [88, 933], [82, 939], [134, 887], [], [], [], [396, 625], [], [145, 876], [104, 917], [], [421, 600], [], [], [], [99, 922], [], [], [481, 540], [467, 554], [], [211, 810], [], [], [333, 688], [276, 745], [], [], [25, 996], [348, 673], [], [], [], [188, 833], [440, 581], [], [], [], [], [], [], [], [196, 825], [], [], [152, 869], [234, 787], [], [], [433, 588], [], [], [], [109, 912], [118, 903], [368, 653], [171, 850], [361, 660], [], [410, 611], [168, 853], [61, 960], [], [41, 980], [], [52, 969], [], [], [405, 616], [138, 883], [174, 847], [94, 927], [], [], [76, 945], [294, 727], [456, 565], [330, 691], [480, 541], [26, 995], [69, 952], [], [165, 856], [], [351, 670], [319, 702], [], [], [], [383, 638], [], [], [287, 734], [], [], [], [], [], [], [], [415, 606], [], [177, 844], [], [379, 642], [255, 766], [387, 634], [466, 555], [257, 764], [], [253, 768], [], [278, 743], [], [216, 805], [], [], [447, 574], [], [259, 762], [], [], [162, 859], [251, 770], [223, 798], [], [], [400, 621], [306, 715], [], [], [], [27, 994], [], [], [232, 789], [], [], [261, 760], [], [479, 542], [], [], [], [249, 772], [], [42, 979], [114, 907], [327, 694], [191, 830], [311, 710], [375, 646], [180, 841], [], [], [391, 630], [301, 720], [354, 667], [], [], [], [], [426, 595], [149, 872], [], [263, 758], [83, 938], [], [142, 879], [510, 511], [53, 968], [509, 512], [], [247, 774], [], [508, 513], [439, 582], [89, 932], [], [204, 817], [159, 862], [507, 514], [], [], [62, 959], [], [455, 566], [28, 993], [], [506, 515], [364, 657], [420, 601], [], [], [], [], [], [465, 556], [], [505, 516], [265, 756], [], [209, 812], [], [478, 543], [432, 589], [199, 822], [280, 741], [], [], [245, 776], [504, 517], [], [], [100, 921], [], [], [127, 894], [105, 916], [70, 951], [183, 838], [], [316, 705], [289, 732], [], [503, 518], [], [77, 944], [131, 890], [], [371, 650], [43, 978], [230, 791], [], [296, 725], [], [395, 626], [324, 697], [123, 898], [], [], [502, 519], [], [267, 754], [29, 992], [446, 575], [], [], [357, 664], [], [], [], [], [], [], [243, 778], [156, 865], [221, 800], [], [501, 520], [95, 926], [409, 612], [], [], [], [], [], [], [], [], [477, 544], [135, 886], [110, 911], [], [], [214, 807], [], [54, 967], [], [500, 521], [404, 617], [], [], [194, 827], [], [], [], [], [], [464, 557], [], [119, 902], [414, 607], [], [269, 752], [], [], [], [454, 567], [146, 875], [], [499, 522], [], [30, 991], [], [], [186, 835], [], [241, 780], [63, 958], [282, 739], [341, 680], [], [], [], [], [338, 683], [], [44, 977], [], [438, 583], [], [], [], [344, 677], [498, 523], [], [], [], [], [], [], [425, 596], [84, 937], [], [308, 713], [], [228, 793], [476, 545], [335, 686], [], [367, 654], [], [303, 718], [321, 700], [382, 639], [139, 882], [], [], [399, 622], [153, 868], [497, 524], [], [271, 750], [386, 635], [347, 674], [90, 931], [360, 661], [], [], [71, 950], [], [291, 730], [431, 590], [31, 990], [], [], [], [378, 643], [239, 782], [], [], [], [419, 602], [], [445, 576], [115, 906], [313, 708], [], [496, 525], [332, 689], [], [78, 943], [463, 558], [], [], [55, 966], [], [202, 819], [], [], [207, 814], [], [], [], [390, 631], [], [169, 852], [219, 802], [172, 849], [], [298, 723], [], [], [350, 671], [], [], [45, 976], [475, 546], [495, 526], [189, 832], [], [453, 568], [166, 855], [], [101, 920], [], [], [], [175, 846], [273, 748], [284, 737], []]
  , [10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 62, 72, 10, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 81, 10, 10, 72, 10, 10, 10, 72, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 369, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 72, 81, 10, 10, 10, 62, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 10, 62, 10, 10, 653, 10, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 653, 369, 10, 10, 10, 81, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 653, 10, 10, 10, 10, 10, 10, 653, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 81, 10, 10, 10, 369, 653, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 10, 653, 10, 10, 62, 10, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 10, 10, 81, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 62, 10, 10, 10, 81, 72, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 369, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 72, 10, 10, 10, 72, 10, 10, 81, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 62, 10, 10, 10, 10, 10, 10, 72, 62, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 81, 72, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 72, 10, 10, 10, 10, 10]
  , [28, 27, 26, 1, 23, 25, 5, 8, 1, 17, 0, 8, 31, 4, 33, 31, 8, 22, 9, 27, 21, 8, 31, 9, 25, 15, 24, 29, 25, 7, 19, 10, 24, 27, 21, 17, 35, 4, 2, 31, 6, 4, 20, 7, 18, 9, 0, 30, 14, 4, 7, 15, 7, 4, 1, 5, 0, 14, 12, 9, 13, 27, 0, 36, 5, 0, 2, 21, 17, 26, 22, 37, 0, 1, 0, 0, 4, 27, 5, 32, 0, 0, 16, 8, 23, 33, 11, 3, 3, 4, 22, 36, 23, 9, 38, 27, 26, 4, 29, 22, 5, 0, 7, 8, 9, 17, 6, 17, 10, 5, 15, 23, 13, 30, 35, 31, 31, 29, 2, 19, 18, 12, 7, 9, 1, 1, 7, 17, 5, 35, 20, 7, 18, 4, 15, 8, 20, 15, 7, 28, 19, 13, 0, 20, 1, 30, 1, 26, 17, 19, 32, 14, 7, 1, 13, 18, 30, 2, 15, 31, 5, 23, 27, 26, 29, 15, 2, 29, 29, 25, 3, 18, 26, 34, 16, 24, 19, 34, 22, 6, 24, 23, 10, 6, 30, 8, 30, 13, 27, 5, 18, 0, 6, 11, 20, 6, 26, 32, 28, 3, 11, 10, 18, 5, 21, 16, 16, 25, 7, 4, 29, 10, 9, 24, 18, 17, 6, 2, 1, 16, 9, 3, 20, 25, 18, 0, 30, 17, 12, 13, 2, 39, 22, 35, 12, 24, 24, 32, 4, 1, 38, 32, 2, 30, 20, 25, 3, 11, 26, 5, 10, 3, 6, 3, 21, 1, 12, 7, 12, 12, 18, 2, 5, 13, 37, 26, 5, 25, 4, 36, 38, 23, 9, 1, 1, 0, 34, 19, 2, 4, 7, 16, 31, 19, 27, 0, 30, 8, 21, 12, 21, 28, 9, 12, 12, 33, 6, 22, 32, 24, 2, 26, 11, 2, 11, 32, 34, 2, 4, 5, 18, 0, 29, 2, 21, 6, 11, 0, 1, 19, 27, 33, 35, 28, 31, 8, 10, 2, 22, 9, 20, 7, 8, 3, 5, 24, 10, 2, 18, 27, 13, 14, 27, 25, 23, 15, 19, 18, 11, 3, 28, 28, 37, 15, 6, 3, 5, 25, 6, 25, 3, 18, 26, 28, 36, 20, 17, 17, 1, 0, 4, 12, 0, 2, 29, 10, 21, 11, 6, 20, 21, 25, 6, 6, 31, 24, 27, 2, 24, 19, 26, 5, 14, 5, 10, 14, 29, 22, 33, 2, 7, 20, 9, 38, 21, 4, 20, 27, 21, 28, 37, 35, 13, 37, 8, 29, 28, 28, 16, 8, 23, 14, 15, 2, 1, 37, 3, 7, 4, 6, 6, 14, 0, 30, 9, 15, 0, 8, 9, 12, 20, 5, 7, 2, 24, 15, 23, 35, 2, 32, 26, 26, 18, 9, 1, 33, 19, 34, 23, 6, 22, 14, 1, 7, 16, 31, 12, 22, 4, 36, 21, 1, 26, 8, 15, 32, 34, 1, 17, 20, 16, 5, 8, 12, 3, 30, 20, 33, 7, 8, 3, 8, 4, 8, 10, 34, 19, 2, 30, 8, 1, 30, 11, 29, 10, 19, 13, 3, 27, 7, 22, 22, 7, 27, 3, 13, 19, 10, 29, 11, 30, 0, 8, 30, 2, 19, 34, 10, 8, 4, 8, 3, 8, 7, 33, 20, 30, 3, 12, 8, 5, 16, 20, 17, 0, 34, 32, 15, 8, 26, 0, 21, 36, 4, 22, 12, 31, 16, 7, 0, 14, 22, 6, 23, 34, 19, 33, 0, 9, 18, 26, 26, 32, 2, 35, 23, 15, 24, 2, 7, 5, 20, 12, 9, 8, 1, 15, 9, 30, 1, 14, 6, 6, 4, 7, 3, 37, 0, 2, 15, 14, 23, 8, 16, 28, 28, 29, 8, 37, 13, 35, 37, 28, 21, 27, 20, 4, 21, 38, 9, 20, 7, 2, 33, 22, 29, 14, 10, 5, 14, 5, 26, 19, 24, 2, 27, 24, 31, 6, 6, 25, 21, 20, 6, 11, 21, 10, 29, 2, 1, 12, 4, 1, 0, 17, 17, 20, 36, 28, 26, 18, 3, 25, 6, 25, 5, 3, 6, 15, 37, 28, 28, 3, 11, 18, 19, 15, 23, 25, 27, 14, 13, 27, 18, 2, 10, 24, 5, 3, 8, 7, 20, 9, 22, 2, 10, 8, 31, 28, 35, 33, 27, 19, 0, 1, 11, 6, 21, 2, 29, 1, 18, 5, 4, 2, 34, 32, 11, 2, 11, 26, 2, 24, 32, 22, 6, 33, 12, 12, 9, 28, 21, 12, 21, 8, 30, 1, 27, 19, 31, 16, 7, 4, 2, 19, 34, 1, 0, 0, 9, 23, 38, 36, 4, 25, 5, 26, 37, 13, 5, 2, 18, 12, 12, 7, 12, 0, 21, 3, 6, 3, 10, 5, 26, 11, 3, 25, 20, 30, 2, 32, 38, 0, 4, 32, 24, 24, 12, 35, 22, 39, 2, 13, 12, 17, 30, 1, 18, 25, 20, 3, 9, 16, 0, 2, 6, 17, 18, 24, 9, 10, 29, 4, 7, 25, 16, 16, 21, 5, 18, 10, 11, 3, 28, 32, 26, 6, 20, 11, 6, 1, 18, 5, 27, 13, 30, 8, 30, 6, 10, 23, 24, 6, 22, 34, 19, 24, 16, 34, 26, 18, 3, 25, 29, 29, 2, 15, 29, 26, 27, 23, 5, 31, 15, 2, 30, 18, 13, 0, 7, 14, 32, 19, 17, 26, 0, 30, 0, 20, 1, 13, 19, 28, 7, 15, 20, 8, 15, 4, 18, 7, 20, 35, 5, 17, 7, 0, 0, 9, 7, 12, 18, 19, 2, 29, 31, 31, 35, 30, 13, 23, 15, 5, 10, 17, 6, 17, 9, 8, 7, 1, 5, 22, 29, 4, 26, 27, 38, 9, 23, 36, 22, 4, 3, 3, 11, 33, 23, 8, 16, 1, 1, 32, 5, 27, 4, 1, 1, 0, 1, 37, 22, 26, 17, 21, 2, 1, 5, 36, 1, 27, 13, 9, 12, 14, 1, 5, 0, 4, 7, 15, 7, 4, 14, 30, 1, 9, 18, 7, 20, 4, 6, 31, 2, 4, 35, 17, 21, 27, 24, 10, 19, 7, 25, 29, 24, 15, 25, 9, 31, 8, 21, 27, 9, 22, 8, 31, 33, 4, 31, 8, 1, 17, 0, 8, 5, 25, 23, 0, 26, 27]
  , {10: 25, 72: 3, 81: 9, 62: 5, 369: 1, 653: 1}
  )

h(1019,1)
  ([1, 2, 5, 10, 17, 26, 37, 50, 65, 82, 101, 122, 145, 170, 197, 226, 257, 290, 325, 362, 401, 442, 485, 530, 577, 626, 677, 730, 785, 842, 901, 962, 6, 71, 138, 207, 278, 351, 426, 503, 582, 663, 746, 831, 918, 1007, 79, 172, 267, 364, 463, 564, 667, 772, 879, 988, 80, 193, 308, 425, 544, 665, 788, 913, 21, 150, 281, 414, 549, 686, 825, 966, 90, 235, 382, 531, 682, 835, 990, 128, 287, 448, 611, 776, 943, 93, 264, 437, 612, 789, 968, 130, 313, 498, 685, 874, 46, 239, 434, 631, 830, 12, 215, 420, 627, 836, 28, 241, 456, 673, 892, 94, 317, 542, 769, 998, 210, 443, 678, 915, 135, 376, 619, 864, 92, 341, 592, 845, 81, 338, 597, 858, 102, 367, 634, 903, 155, 428, 703, 980, 240, 521, 804, 70, 357, 646, 937, 211, 506, 803, 83, 384, 687, 992, 280, 589, 900, 194, 509, 826, 126, 447, 770, 76, 403, 732, 44, 377, 712, 30, 369, 710, 34, 379, 726, 56, 407, 760, 96, 453, 812, 154, 517, 882, 230, 599, 970, 324, 699, 57, 436, 817, 181, 566, 953, 323, 714, 88, 483, 880, 260, 661, 45, 450, 857, 247, 658, 52, 467, 884, 284, 705, 109, 534, 961, 371, 802, 216, 651, 69, 508, 949, 373, 818, 246, 695, 127, 580, 16, 473, 932, 374, 837, 283, 750, 200, 671, 125, 600, 58, 537, 1018, 482, 967, 435, 924, 396, 889, 365, 862, 342, 843, 327, 832, 320, 829, 321, 834, 330, 847, 347, 868, 372, 897, 405, 934, 446, 979, 495, 13, 552, 74, 617, 143, 690, 220, 771, 305, 860, 398, 957, 499, 43, 608, 156, 725, 277, 850, 406, 983, 543, 105, 688, 254, 841, 411, 1002, 576, 152, 749, 329, 930, 514, 100, 707, 297, 908, 502, 98, 715, 315, 936, 540, 146, 773, 383, 1014, 628, 244, 881, 501, 123, 766, 392, 20, 669, 301, 954, 590, 228, 887, 529, 173, 838, 486, 136, 807, 461, 117, 794, 454, 116, 799, 465, 133, 822, 494, 168, 863, 541, 221, 922, 606, 292, 999, 689, 381, 75, 790, 488, 188, 909, 613, 319, 27, 756, 468, 182, 917, 635, 355, 77, 820, 546, 274, 4, 755, 489, 225, 982, 722, 464, 208, 973, 721, 471, 223, 996, 752, 510, 270, 32, 815, 581, 349, 119, 910, 684, 460, 238, 18, 819, 603, 389, 177, 986, 778, 572, 368, 166, 985, 787, 591, 397, 205, 15, 846, 660, 476, 294, 114, 955, 779, 605, 433, 263, 95, 948, 784, 622, 462, 304, 148, 1013, 861, 711, 563, 417, 273, 131, 1010, 872, 736, 602, 470, 340, 212, 86, 981, 859, 739, 621, 505, 391, 279, 169, 61, 974, 870, 768, 668, 570, 474, 380, 288, 198, 110, 24, 959, 877, 797, 719, 643, 569, 497, 427, 359, 293, 229, 167, 107, 49, 1012, 958, 906, 856, 808, 762, 718, 676, 636, 598, 562, 528, 496, 466, 438, 412, 388, 366, 346, 328, 312, 298, 286, 276, 268, 262, 258, 256, 256, 258, 262, 268, 276, 286, 298, 312, 328, 346, 366, 388, 412, 438, 466, 496, 528, 562, 598, 636, 676, 718, 762, 808, 856, 906, 958, 1012, 49, 107, 167, 229, 293, 359, 427, 497, 569, 643, 719, 797, 877, 959, 24, 110, 198, 288, 380, 474, 570, 668, 768, 870, 974, 61, 169, 279, 391, 505, 621, 739, 859, 981, 86, 212, 340, 470, 602, 736, 872, 1010, 131, 273, 417, 563, 711, 861, 1013, 148, 304, 462, 622, 784, 948, 95, 263, 433, 605, 779, 955, 114, 294, 476, 660, 846, 15, 205, 397, 591, 787, 985, 166, 368, 572, 778, 986, 177, 389, 603, 819, 18, 238, 460, 684, 910, 119, 349, 581, 815, 32, 270, 510, 752, 996, 223, 471, 721, 973, 208, 464, 722, 982, 225, 489, 755, 4, 274, 546, 820, 77, 355, 635, 917, 182, 468, 756, 27, 319, 613, 909, 188, 488, 790, 75, 381, 689, 999, 292, 606, 922, 221, 541, 863, 168, 494, 822, 133, 465, 799, 116, 454, 794, 117, 461, 807, 136, 486, 838, 173, 529, 887, 228, 590, 954, 301, 669, 20, 392, 766, 123, 501, 881, 244, 628, 1014, 383, 773, 146, 540, 936, 315, 715, 98, 502, 908, 297, 707, 100, 514, 930, 329, 749, 152, 576, 1002, 411, 841, 254, 688, 105, 543, 983, 406, 850, 277, 725, 156, 608, 43, 499, 957, 398, 860, 305, 771, 220, 690, 143, 617, 74, 552, 13, 495, 979, 446, 934, 405, 897, 372, 868, 347, 847, 330, 834, 321, 829, 320, 832, 327, 843, 342, 862, 365, 889, 396, 924, 435, 967, 482, 1018, 537, 58, 600, 125, 671, 200, 750, 283, 837, 374, 932, 473, 16, 580, 127, 695, 246, 818, 373, 949, 508, 69, 651, 216, 802, 371, 961, 534, 109, 705, 284, 884, 467, 52, 658, 247, 857, 450, 45, 661, 260, 880, 483, 88, 714, 323, 953, 566, 181, 817, 436, 57, 699, 324, 970, 599, 230, 882, 517, 154, 812, 453, 96, 760, 407, 56, 726, 379, 34, 710, 369, 30, 712, 377, 44, 732, 403, 76, 770, 447, 126, 826, 509, 194, 900, 589, 280, 992, 687, 384, 83, 803, 506, 211, 937, 646, 357, 70, 804, 521, 240, 980, 703, 428, 155, 903, 634, 367, 102, 858, 597, 338, 81, 845, 592, 341, 92, 864, 619, 376, 135, 915, 678, 443, 210, 998, 769, 542, 317, 94, 892, 673, 456, 241, 28, 836, 627, 420, 215, 12, 830, 631, 434, 239, 46, 874, 685, 498, 313, 130, 968, 789, 612, 437, 264, 93, 943, 776, 611, 448, 287, 128, 990, 835, 682, 531, 382, 235, 90, 966, 825, 686, 549, 414, 281, 150, 21, 913, 788, 665, 544, 425, 308, 193, 80, 988, 879, 772, 667, 564, 463, 364, 267, 172, 79, 1007, 918, 831, 746, 663, 582, 503, 426, 351, 278, 207, 138, 71, 6, 962, 901, 842, 785, 730, 677, 626, 577, 530, 485, 442, 401, 362, 325, 290, 257, 226, 197, 170, 145, 122, 101, 82, 65, 50, 37, 26, 17, 10, 5, 2]
  , [0, 1, 2, 0, 2, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 2, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 2, 2, 2, 2, 0, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 2, 0, 0, 2, 0, 0, 0, 2, 0, 0, 0, 2, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0, 2, 0, 2, 0, 2, 0, 2, 2, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 0, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 0, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 0, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 2, 0, 2, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 2, 2, 0, 2, 2, 0, 0, 0, 2, 0, 0, 0, 2, 2, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 2, 2, 0, 0, 2, 2, 0, 2, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 2, 0, 0, 0, 0, 2, 0, 0, 2, 2, 2, 2, 0, 0, 2, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 0, 2, 2, 0, 2, 0, 0, 2, 2, 0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 0, 0, 2, 2, 0, 0, 2, 0, 0, 2, 2, 0, 0, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 0, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 2, 2, 2, 0, 0, 0, 2, 2, 0, 2, 0, 2, 0, 0, 0, 2, 0, 2, 0, 2, 0, 0, 2, 0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 0, 2, 2, 2, 2, 2, 2, 0, 0, 0, 2, 2, 0, 2, 2, 0, 0, 0, 2, 2, 2, 0, 0, 2, 0, 2, 0, 2, 2, 2, 0, 0, 0, 2, 2, 0, 2, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 2, 2, 2, 2, 0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 0, 0, 0, 2, 2, 0, 0, 2, 2, 2, 0, 2, 0, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 0, 2, 2, 0, 2, 0, 0, 0, 0, 0, 2, 2, 0, 2, 2, 0, 2, 2, 0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 0, 2, 2, 2, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 2, 2, 2, 0, 0, 2, 0, 0, 2, 0, 0, 2, 2, 2, 2, 2, 0, 2, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 0, 2, 0, 0, 2, 2, 0, 2, 0, 0, 0, 2, 2, 0, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 2, 2, 2, 2, 0, 0, 0, 0, 2, 2, 2, 2, 0, 2, 2, 0, 2, 2, 0, 2, 0, 0, 2, 2, 2, 0, 0, 0, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 2, 2, 0, 0, 2, 0, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 2, 2, 0, 2, 0, 2, 0, 2, 2, 2, 0, 2, 0, 2, 0, 0, 2, 2, 2, 0, 0, 0, 2, 0, 2, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 0, 2, 0, 2, 0, 2, 0, 0, 2, 2, 2, 0, 2, 2, 0, 0, 2, 2, 0, 2, 2, 0, 0, 2, 2, 0, 0, 0, 2, 0, 2, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 2, 0, 2, 0, 0, 2, 2, 0, 0, 0, 2, 0, 2, 0, 0, 0, 2, 0, 2, 2, 2, 2, 2, 2, 0, 0, 2, 0, 2, 2, 0, 0, 0, 0, 2, 2, 0, 2, 2, 2, 2, 0, 0, 0, 2, 0, 0, 2, 0, 2, 0, 0, 2, 2, 2, 0, 0, 2, 2, 0, 0, 0, 2, 0, 0, 2, 0, 2, 2, 2, 2, 0, 2, 0, 0, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0, 2, 2, 2, 0, 2, 2, 2, 0, 0, 2, 0, 0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 0, 2, 0, 2, 0, 2, 0, 2, 0, 0, 2, 0, 2, 2, 2, 2, 0, 2, 0, 0, 2, 0, 2, 0, 0, 2, 0, 0, 0, 0, 2, 0, 0, 2, 2, 0, 2, 0, 0, 2, 0, 2, 2, 2, 0, 0, 2, 0, 2, 0, 2, 2, 0, 0, 0, 2, 0, 2, 0, 0, 0, 0, 0, 2, 0, 2, 0, 2, 0, 2, 2, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 2, 2, 0, 0, 0, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 0, 0, 0, 2, 2, 2, 0, 2, 0, 0, 2, 2, 0, 0, 0, 0, 2, 2, 2, 2, 2, 0, 2, 2, 0, 2, 0, 2, 0, 2, 0, 0, 0, 2, 0, 2, 2, 0, 0, 2, 0, 0, 0, 0, 2, 0, 0, 2, 0, 2, 2, 2, 0, 0, 0, 2]
  , [[], [0], [1, 1018], [], [375, 644], [2, 1017], [32, 987], [], [], [], [3, 1016], [], [101, 918], [269, 750], [], [415, 604], [228, 791], [4, 1015], [400, 619], [], [324, 695], [64, 955], [], [], [467, 552], [], [5, 1014], [364, 655], [106, 913], [], [169, 850], [], [391, 628], [], [172, 847], [], [], [6, 1013], [], [], [], [], [], [282, 737], [166, 853], [202, 817], [96, 923], [], [], [481, 538], [7, 1012], [], [207, 812], [], [], [], [175, 844], [189, 830], [239, 780], [], [], [456, 563], [], [], [], [8, 1011], [], [], [], [219, 800], [143, 876], [33, 986], [], [], [271, 748], [357, 662], [163, 856], [371, 648], [], [46, 973], [56, 963], [128, 891], [9, 1010], [150, 869], [], [], [447, 572], [], [197, 822], [], [72, 947], [], [124, 895], [85, 934], [111, 908], [426, 593], [178, 841], [], [308, 711], [], [303, 716], [10, 1009], [132, 887], [], [], [291, 728], [], [480, 539], [], [212, 807], [466, 553], [], [], [], [420, 599], [], [341, 678], [338, 681], [], [395, 624], [], [], [11, 1008], [321, 698], [], [237, 782], [160, 859], [226, 793], [79, 940], [], [91, 928], [439, 580], [], [344, 675], [], [120, 899], [335, 684], [], [34, 985], [], [], [], [], [273, 746], [], [12, 1007], [313, 706], [], [432, 587], [], [65, 954], [], [298, 721], [], [181, 838], [136, 883], [284, 735], [], [], [], [], [], [], [], [], [], [409, 610], [479, 540], [347, 672], [455, 564], [13, 1006], [], [47, 972], [332, 687], [], [], [], [404, 615], [], [], [], [192, 827], [367, 652], [], [], [], [], [], [360, 659], [], [], [], [], [57, 962], [157, 862], [], [], [14, 1005], [465, 554], [], [235, 784], [], [], [], [], [414, 605], [], [35, 984], [382, 637], [], [116, 903], [147, 872], [446, 573], [], [], [102, 917], [217, 802], [], [], [], [275, 744], [350, 669], [], [386, 633], [], [378, 641], [15, 1004], [], [329, 690], [478, 541], [184, 835], [], [], [], [], [73, 946], [], [], [399, 620], [97, 922], [140, 879], [107, 912], [], [], [318, 701], [], [224, 795], [205, 814], [], [], [], [], [], [], [293, 726], [], [509, 510], [16, 1003], [508, 511], [], [200, 819], [], [507, 512], [425, 594], [86, 933], [], [], [48, 971], [506, 513], [], [390, 629], [], [], [438, 581], [374, 645], [], [505, 514], [286, 733], [36, 983], [454, 565], [154, 865], [66, 953], [], [233, 786], [210, 809], [], [504, 515], [80, 939], [464, 555], [], [17, 1002], [], [353, 666], [477, 542], [419, 600], [], [], [305, 714], [503, 516], [], [], [326, 693], [], [], [431, 588], [277, 742], [], [], [58, 961], [], [], [], [502, 517], [92, 927], [], [310, 709], [], [112, 907], [], [363, 656], [254, 765], [256, 763], [], [195, 824], [187, 832], [18, 1001], [], [252, 767], [501, 518], [300, 719], [258, 761], [], [], [], [], [], [], [], [129, 890], [], [445, 574], [125, 894], [250, 769], [], [], [], [500, 519], [260, 759], [], [394, 625], [], [37, 982], [], [], [], [370, 649], [], [144, 875], [], [476, 543], [], [], [19, 1000], [], [49, 970], [248, 771], [499, 520], [133, 886], [408, 611], [170, 849], [], [215, 804], [262, 757], [222, 797], [231, 788], [], [121, 898], [167, 852], [], [173, 846], [463, 556], [356, 663], [74, 945], [315, 704], [151, 868], [], [], [], [498, 521], [403, 616], [], [453, 566], [323, 696], [], [], [], [246, 773], [413, 606], [279, 740], [], [], [20, 999], [], [164, 855], [], [264, 755], [288, 731], [176, 843], [], [], [], [295, 724], [497, 522], [], [67, 952], [], [], [437, 582], [], [], [103, 916], [], [], [], [], [59, 960], [38, 981], [475, 544], [137, 882], [], [], [], [], [424, 595], [98, 921], [244, 775], [190, 829], [87, 932], [496, 523], [], [], [], [21, 998], [117, 902], [], [], [266, 753], [161, 858], [81, 938], [], [203, 816], [], [], [179, 840], [340, 679], [], [108, 911], [], [], [], [398, 621], [337, 682], [430, 589], [50, 969], [381, 638], [343, 676], [495, 524], [208, 811], [366, 653], [], [444, 575], [385, 634], [], [229, 790], [462, 557], [], [418, 601], [], [], [], [], [], [242, 777], [198, 821], [], [22, 997], [334, 685], [], [359, 660], [377, 642], [], [], [], [], [346, 673], [268, 751], [494, 525], [474, 545], [93, 926], [281, 738], [], [320, 699], [307, 712], [39, 980], [], [452, 567], [148, 871], [], [220, 799], [158, 861], [389, 630], [], [], [], [302, 717], [], [], [182, 837], [], [], [], [141, 878], [], [], [], [], [], [], [493, 526], [331, 688], [23, 996], [75, 944], [], [], [213, 806], [], [], [240, 779], [], [], [312, 707], [349, 670], [113, 906], [290, 729], [60, 959], [], [373, 646], [], [], [68, 951], [], [], [270, 749], [], [], [], [], [], [], [], [], [], [492, 527], [436, 583], [51, 968], [], [193, 826], [], [], [473, 546], [461, 558], [], [407, 612], [], [], [], [297, 722], [24, 995], [], [], [227, 792], [393, 626], [40, 979], [], [], [], [], [], [], [155, 864], [328, 691], [412, 607], [126, 893], [], [], [], [], [130, 889], [491, 528], [185, 834], [238, 781], [], [443, 576], [402, 617], [], [423, 596], [352, 667], [], [283, 736], [], [], [82, 937], [88, 931], [362, 657], [], [], [], [272, 747], [], [122, 897], [], [451, 568], [429, 590], [], [], [], [25, 994], [104, 915], [317, 702], [], [], [99, 920], [], [], [134, 885], [369, 650], [490, 529], [], [], [], [], [], [], [472, 547], [], [], [145, 874], [], [], [], [], [218, 801], [], [], [], [], [], [], [206, 813], [], [417, 602], [201, 818], [], [41, 978], [], [61, 958], [], [52, 967], [460, 559], [325, 694], [], [236, 783], [], [109, 910], [], [], [489, 530], [26, 993], [118, 901], [], [], [], [76, 943], [], [397, 622], [94, 925], [69, 950], [152, 867], [292, 727], [355, 664], [274, 745], [], [], [], [], [225, 794], [], [], [], [188, 831], [], [], [], [138, 881], [], [211, 808], [], [304, 715], [], [], [171, 848], [435, 584], [168, 851], [], [196, 823], [309, 710], [], [], [488, 531], [471, 548], [], [384, 635], [380, 639], [], [], [285, 734], [174, 845], [], [], [], [27, 992], [], [165, 854], [], [], [], [442, 577], [], [], [450, 569], [], [], [], [], [], [], [42, 977], [], [], [299, 720], [234, 785], [], [388, 631], [], [], [376, 643], [365, 654], [], [], [], [177, 842], [], [487, 532], [], [], [], [322, 697], [], [459, 560], [114, 905], [162, 857], [276, 743], [53, 966], [314, 705], [], [], [83, 936], [], [406, 613], [422, 597], [], [], [], [], [428, 591], [28, 991], [], [411, 608], [62, 957], [89, 930], [358, 661], [], [], [], [339, 680], [], [], [470, 549], [], [342, 677], [], [], [216, 803], [149, 870], [142, 877], [], [], [336, 683], [486, 533], [], [], [], [180, 839], [], [], [392, 627], [], [191, 828], [223, 796], [401, 618], [372, 647], [], [345, 674], [], [], [70, 949], [159, 860], [], [], [255, 764], [100, 919], [43, 976], [253, 766], [], [257, 762], [77, 942], [105, 914], [232, 787], [333, 686], [], [], [294, 725], [29, 990], [251, 768], [], [127, 892], [416, 603], [259, 760], [], [], [287, 732], [], [], [], [], [], [485, 534], [204, 815], [131, 888], [449, 570], [278, 741], [434, 585], [249, 770], [348, 671], [123, 896], [], [], [], [261, 758], [], [458, 561], [], [441, 578], [], [95, 924], [], [], [469, 550], [], [54, 965], [199, 820], [319, 700], [183, 836], [], [209, 810], [], [], [330, 689], [], [247, 772], [], [], [110, 909], [], [], [], [], [263, 756], [], [], [156, 863], [30, 989], [], [135, 884], [], [], [484, 535], [], [306, 713], [361, 658], [396, 623], [], [], [63, 956], [], [119, 900], [], [368, 651], [44, 975], [], [], [], [351, 668], [], [245, 774], [], [], [], [], [], [301, 718], [], [230, 789], [], [265, 754], [], [311, 708], [146, 873], [], [], [], [], [], [84, 935], [], [], [], [], [427, 592], [221, 798], [], [], [], [194, 825], [327, 692], [421, 598], [], [280, 739], [483, 536], [468, 551], [], [214, 805], [31, 988], [], [], [], [71, 948], [243, 776], [90, 929], [], [186, 833], [], [], [383, 636], [457, 562], [], [], [], [], [267, 752], [139, 880], [448, 571], [379, 640], [289, 730], [], [410, 609], [405, 614], [], [55, 964], [], [78, 941], [], [153, 866], [], [], [], [387, 632], [], [115, 904], [354, 665], [], [], [296, 723], [], [], [], [], [45, 974], [], [], [440, 579], [], [482, 537], [433, 586], [316, 703], [], [], [], [241, 778]]
  , [417, 417, 417, 417, 417, 417, 167, 417, 167, 417, 417, 417, 417, 167, 417, 167, 417, 417, 417, 417, 167, 167, 417, 167, 167, 417, 417, 167, 167, 417, 417, 167, 167, 417, 417, 167, 167, 167, 417, 167, 417, 417, 417, 167, 417, 417, 417, 417, 417, 167, 417, 417, 167, 417, 417, 167, 417, 167, 167, 417, 417, 167, 417, 167, 167, 167, 417, 417, 417, 417, 417, 417, 417, 167, 167, 417, 417, 417, 417, 417, 417, 417, 417, 167, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 167, 167, 417, 167, 417, 417, 417, 417, 167, 167, 417, 167, 417, 167, 417, 167, 167, 417, 167, 417, 417, 417, 417, 417, 417, 417, 167, 417, 417, 417, 167, 417, 417, 417, 417, 417, 167, 417, 417, 167, 167, 417, 167, 417, 417, 417, 417, 417, 417, 417, 417, 167, 216, 167, 167, 167, 167, 417, 167, 417, 417, 167, 167, 417, 417, 417, 417, 167, 417, 417, 167, 167, 417, 167, 167, 417, 167, 167, 417, 417, 417, 417, 167, 167, 417, 167, 167, 417, 417, 167, 167, 167, 167, 167, 417, 417, 167, 417, 417, 417, 417, 167, 167, 167, 417, 417, 417, 417, 417, 167, 167, 167, 417, 417, 417, 417, 417, 167, 417, 216, 216, 417, 417, 417, 417, 417, 417, 417, 167, 167, 417, 417, 417, 417, 417, 167, 167, 167, 167, 417, 417, 417, 167, 417, 417, 417, 167, 167, 417, 417, 417, 417, 417, 417, 417, 167, 167, 167, 167, 167, 417, 417, 417, 167, 167, 167, 417, 417, 417, 417, 417, 167, 167, 167, 167, 167, 417, 417, 417, 417, 417, 167, 167, 417, 417, 167, 167, 417, 417, 417, 417, 417, 167, 417, 167, 417, 167, 417, 167, 417, 417, 167, 167, 417, 417, 417, 167, 167, 417, 417, 167, 167, 167, 417, 167, 167, 417, 417, 417, 417, 167, 167, 417, 167, 167, 167, 417, 167, 417, 417, 167, 167, 417, 417, 417, 167, 417, 417, 167, 417, 417, 417, 167, 167, 417, 417, 167, 167, 417, 417, 167, 417, 417, 417, 167, 167, 417, 167, 417, 417, 417, 417, 417, 167, 167, 417, 417, 167, 417, 417, 167, 417, 167, 417, 417, 167, 417, 417, 417, 417, 167, 167, 167, 417, 417, 167, 417, 167, 417, 417, 167, 417, 167, 167, 167, 417, 417, 417, 417, 417, 167, 167, 417, 417, 167, 167, 167, 417, 417, 417, 417, 417, 417, 417, 167, 167, 167, 417, 167, 167, 417, 417, 417, 417, 167, 417, 417, 167, 417, 417, 417, 167, 167, 167, 167, 167, 167, 167, 167, 167, 417, 417, 417, 417, 417, 167, 417, 417, 167, 417, 417, 417, 417, 417, 167, 417, 167, 167, 417, 167, 417, 216, 417, 167, 417, 167, 417, 417, 167, 167, 167, 417, 417, 417, 417, 417, 417, 167, 417, 417, 167, 417, 167, 417, 167, 417, 167, 167, 417, 417, 417, 417, 167, 417, 167, 417, 167, 417, 167, 417, 167, 417, 417, 417, 167, 167, 167, 417, 417, 167, 167, 417, 167, 167, 417, 167, 167, 417, 417, 167, 167, 167, 417, 417, 417, 167, 417, 167, 417, 167, 417, 167, 417, 167, 417, 417, 417, 417, 167, 167, 417, 167, 417, 167, 417, 167, 417, 417, 167, 417, 417, 417, 417, 417, 417, 167, 167, 167, 417, 417, 167, 417, 167, 417, 216, 417, 167, 417, 167, 167, 417, 167, 417, 417, 417, 417, 417, 167, 417, 417, 167, 417, 417, 417, 417, 417, 167, 167, 167, 167, 167, 167, 167, 167, 167, 417, 417, 417, 167, 417, 417, 167, 417, 417, 417, 417, 167, 167, 417, 167, 167, 167, 417, 417, 417, 417, 417, 417, 417, 167, 167, 167, 417, 417, 167, 167, 417, 417, 417, 417, 417, 167, 167, 167, 417, 167, 417, 417, 167, 417, 167, 417, 417, 167, 167, 167, 417, 417, 417, 417, 167, 417, 417, 167, 417, 167, 417, 417, 167, 417, 417, 167, 167, 417, 417, 417, 417, 417, 167, 417, 167, 167, 417, 417, 417, 167, 417, 417, 167, 167, 417, 417, 167, 167, 417, 417, 417, 167, 417, 417, 167, 417, 417, 417, 167, 167, 417, 417, 167, 417, 167, 167, 167, 417, 167, 167, 417, 417, 417, 417, 167, 167, 417, 167, 167, 167, 417, 417, 167, 167, 417, 417, 417, 167, 167, 417, 417, 167, 417, 167, 417, 167, 417, 167, 417, 417, 417, 417, 417, 167, 167, 417, 417, 167, 167, 417, 417, 417, 417, 417, 167, 167, 167, 167, 167, 417, 417, 417, 417, 417, 167, 167, 167, 417, 417, 417, 167, 167, 167, 167, 167, 417, 417, 417, 417, 417, 417, 417, 167, 167, 417, 417, 417, 167, 417, 417, 417, 167, 167, 167, 167, 417, 417, 417, 417, 417, 167, 167, 417, 417, 417, 417, 417, 417, 417, 216, 216, 417, 167, 417, 417, 417, 417, 417, 167, 167, 167, 417, 417, 417, 417, 417, 167, 167, 167, 417, 417, 417, 417, 167, 417, 417, 167, 167, 167, 167, 167, 417, 417, 167, 167, 417, 167, 167, 417, 417, 417, 417, 167, 167, 417, 167, 167, 417, 167, 167, 417, 417, 167, 417, 417, 417, 417, 167, 167, 417, 417, 167, 417, 167, 167, 167, 167, 216, 167, 417, 417, 417, 417, 417, 417, 417, 417, 167, 417, 167, 167, 417, 417, 167, 417, 417, 417, 417, 417, 167, 417, 417, 417, 167, 417, 417, 417, 417, 417, 417, 417, 167, 417, 167, 167, 417, 167, 417, 167, 417, 167, 167, 417, 417, 417, 417, 167, 417, 167, 167, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 167, 417, 417, 417, 417, 417, 417, 417, 417, 167, 167, 417, 417, 417, 417, 417, 417, 417, 167, 167, 167, 417, 167, 417, 417, 167, 167, 417, 167, 417, 417, 167, 417, 417, 167, 417, 417, 417, 417, 417, 167, 417, 417, 417, 167, 417, 167, 167, 167, 417, 417, 167, 167, 417, 417, 167, 167, 417, 417, 167, 167, 417, 167, 167, 417, 417, 417, 417, 167, 417, 167, 417, 417, 417, 417, 167, 417, 167, 417, 417, 417, 417, 417]
  , [17, 16, 15, 33, 5, 14, 23, 7, 20, 10, 32, 31, 30, 31, 23, 22, 18, 4, 28, 20, 1, 7, 24, 2, 7, 29, 13, 32, 34, 21, 37, 29, 24, 15, 17, 17, 30, 22, 32, 29, 2, 23, 27, 18, 32, 31, 37, 19, 4, 34, 6, 40, 15, 13, 11, 30, 41, 28, 18, 33, 17, 1, 24, 36, 8, 19, 22, 15, 31, 29, 24, 14, 42, 3, 11, 2, 21, 3, 22, 36, 40, 34, 9, 17, 22, 7, 18, 1, 21, 1, 41, 12, 12, 6, 38, 30, 38, 20, 16, 5, 30, 31, 6, 16, 29, 6, 35, 18, 3, 31, 21, 39, 27, 20, 14, 8, 34, 3, 36, 30, 36, 19, 30, 10, 13, 36, 16, 20, 35, 5, 11, 21, 7, 4, 24, 35, 10, 4, 16, 30, 10, 6, 6, 25, 4, 29, 10, 36, 26, 2, 18, 29, 26, 33, 26, 9, 31, 24, 14, 28, 17, 20, 26, 22, 16, 40, 33, 0, 0, 38, 30, 4, 18, 24, 19, 42, 21, 20, 39, 27, 17, 27, 2, 5, 2, 16, 35, 3, 17, 29, 4, 33, 28, 27, 23, 30, 5, 22, 0, 31, 1, 30, 32, 27, 27, 13, 23, 16, 9, 36, 33, 35, 32, 24, 19, 5, 0, 1, 8, 30, 11, 25, 29, 31, 34, 3, 21, 23, 19, 28, 1, 23, 3, 6, 33, 2, 33, 37, 42, 19, 9, 17, 9, 16, 19, 31, 33, 12, 33, 25, 13, 22, 21, 4, 17, 5, 12, 17, 9, 19, 0, 30, 33, 31, 17, 8, 34, 3, 24, 32, 9, 12, 27, 26, 21, 12, 34, 5, 29, 24, 25, 21, 19, 5, 32, 41, 6, 39, 19, 31, 3, 7, 41, 18, 40, 5, 5, 3, 27, 10, 21, 1, 36, 31, 2, 4, 40, 1, 17, 3, 40, 18, 0, 11, 34, 39, 15, 26, 20, 17, 16, 11, 5, 29, 2, 27, 2, 20, 14, 20, 8, 40, 25, 28, 37, 11, 33, 20, 4, 4, 26, 35, 12, 1, 5, 23, 30, 0, 32, 30, 26, 21, 14, 42, 1, 9, 22, 3, 29, 1, 18, 22, 19, 18, 33, 32, 19, 3, 7, 29, 10, 4, 32, 28, 22, 6, 18, 0, 4, 23, 4, 21, 10, 38, 28, 23, 32, 3, 4, 14, 10, 25, 28, 28, 31, 31, 32, 12, 23, 43, 29, 0, 26, 15, 21, 16, 18, 20, 8, 34, 18, 4, 4, 13, 14, 23, 25, 0, 3, 41, 15, 9, 10, 15, 25, 32, 31, 15, 3, 13, 8, 3, 27, 24, 15, 18, 3, 0, 27, 22, 11, 37, 6, 2, 31, 27, 33, 19, 33, 18, 26, 24, 36, 26, 25, 39, 2, 32, 3, 23, 22, 19, 7, 5, 20, 0, 22, 8, 18, 7, 30, 22, 19, 27, 6, 16, 2, 19, 29, 1, 19, 35, 8, 0, 21, 23, 36, 18, 0, 0, 39, 10, 33, 11, 29, 23, 28, 5, 5, 20, 31, 15, 0, 28, 7, 35, 25, 34, 10, 13, 13, 10, 34, 25, 35, 7, 28, 1, 15, 31, 20, 5, 5, 28, 23, 29, 11, 33, 10, 39, 1, 1, 18, 36, 23, 21, 1, 8, 35, 19, 0, 29, 19, 2, 16, 6, 27, 19, 22, 30, 7, 18, 8, 22, 1, 20, 5, 7, 19, 22, 23, 3, 32, 2, 39, 25, 26, 36, 24, 26, 18, 33, 19, 33, 27, 31, 2, 6, 37, 11, 22, 27, 1, 3, 18, 15, 24, 27, 3, 8, 13, 3, 15, 31, 32, 25, 15, 10, 9, 15, 41, 3, 1, 25, 23, 14, 13, 4, 4, 18, 34, 8, 20, 18, 16, 21, 15, 26, 1, 29, 43, 23, 12, 32, 31, 31, 28, 28, 25, 10, 14, 4, 3, 32, 23, 28, 38, 10, 21, 4, 23, 4, 1, 18, 6, 22, 28, 32, 4, 10, 29, 7, 3, 19, 32, 33, 18, 19, 22, 18, 0, 29, 3, 22, 9, 0, 42, 14, 21, 26, 30, 32, 1, 30, 23, 5, 0, 12, 35, 26, 4, 4, 20, 33, 11, 37, 28, 25, 40, 8, 20, 14, 20, 2, 27, 2, 29, 5, 11, 16, 17, 20, 26, 15, 39, 34, 11, 1, 18, 40, 3, 17, 0, 40, 4, 2, 31, 36, 0, 21, 10, 27, 3, 5, 5, 40, 18, 41, 7, 3, 31, 19, 39, 6, 41, 32, 5, 19, 21, 25, 24, 29, 5, 34, 12, 21, 26, 27, 12, 9, 32, 24, 3, 34, 8, 17, 31, 33, 30, 1, 19, 9, 17, 12, 5, 17, 4, 21, 22, 13, 25, 33, 12, 33, 31, 19, 16, 9, 17, 9, 19, 42, 37, 33, 2, 33, 6, 3, 23, 0, 28, 19, 23, 21, 3, 34, 31, 29, 25, 11, 30, 8, 0, 1, 5, 19, 24, 32, 35, 33, 36, 9, 16, 23, 13, 27, 27, 32, 30, 0, 31, 1, 22, 5, 30, 23, 27, 28, 33, 4, 29, 17, 3, 35, 16, 2, 5, 2, 27, 17, 27, 39, 20, 21, 42, 19, 24, 18, 4, 30, 38, 1, 1, 33, 40, 16, 22, 26, 20, 17, 28, 14, 24, 31, 9, 26, 33, 26, 29, 18, 2, 26, 36, 10, 29, 4, 25, 6, 6, 10, 30, 16, 4, 10, 35, 24, 4, 7, 21, 11, 5, 35, 20, 16, 36, 13, 10, 30, 19, 36, 30, 36, 3, 34, 8, 14, 20, 27, 39, 21, 31, 3, 18, 35, 6, 29, 16, 6, 31, 30, 5, 16, 20, 38, 30, 38, 6, 12, 12, 41, 0, 21, 0, 18, 7, 22, 17, 9, 34, 40, 36, 22, 3, 21, 2, 11, 3, 42, 14, 24, 29, 31, 15, 22, 19, 8, 36, 24, 0, 17, 33, 18, 28, 41, 30, 11, 13, 15, 40, 6, 34, 4, 19, 37, 31, 32, 18, 27, 23, 2, 29, 32, 22, 30, 17, 17, 15, 24, 29, 37, 21, 34, 32, 13, 29, 7, 2, 24, 7, 0, 20, 28, 4, 18, 22, 23, 31, 30, 31, 32, 10, 20, 7, 23, 14, 5, 33, 15, 16]
  , {417: 8, 167: 19, 216: 2}
  )


#]]]'''#'''



r'''[[[
group_,tab_: copy to:
e ../../python3_src/seed/helper/forest_tabulation5modular_func.py
#]]]'''#'''
from seed.helper.forest_tabulation5modular_func import group_, tab_
if 0:
  def group_(x2y, /):
    M = len(x2y)
    y2xs = [[] for x in range(M)]
    for x in range(M):
        y = x2y[x]
        y2xs[y].append(x)
    y2xs
    x2min_root = {}
    x2height = {}
    min_root2len_period = {}
    for x in range(M):
        if x in x2min_root:continue
        xs = [x]
        x2j = {x:0}
        for j in range(1,1+M):
            x = x2y[x]
            if x in x2min_root:break
            if x in x2j:break
            xs.append(x)
            x2j[x] = j
        else:
            raise Exception((M, xs[0]))
        x
        if x in x2min_root:
            min_root = x2min_root[x]
            height = x2height[x]
            extra = xs
            for x in xs:
                x2min_root[x] = min_root
            for height, x in enumerate(reversed(extra), 1+height):
                x2height[x] = height
            continue
        j = x2j[x]
        period = xs[j:]
        extra = xs[:j]
        min_root = min(period)
        min_root2len_period[min_root] = len(period)
        for x in xs:
            x2min_root[x] = min_root
        height = 0
        for x in period:
            x2height[x] = height
        for height, x in enumerate(reversed(extra), 1+height):
            x2height[x] = height
    x2min_root = [x2min_root[x] for x in range(M)]
    x2height = [x2height[x] for x in range(M)]
    y2num_xs = [*map(len, y2xs)]

    min_root2minmax_height = dict.fromkeys(min_root2len_period.keys(), (1+M, -1))
    for y, num_xs in enumerate(y2num_xs):
        if num_xs == 0:
            height = x2height[y]
            min_root = x2min_root[y]
            a, b = min_root2minmax_height[min_root]
            if b == -1:
                a = b = height
            elif height > b:
                assert a <= b < height
                b = height
            elif height < a:
                assert height < a <= b
                a = height
            else:
                assert a <= height <= b
                continue
            min_root2minmax_height[min_root] = (a, b)

    max_height = max(ht for _, ht in min_root2minmax_height.values())
    max_len_period = max(min_root2len_period.values())
    num_trees = len(min_root2len_period)
    return (y2num_xs, y2xs, x2min_root, x2height, min_root2len_period, min_root2minmax_height, (num_trees, max_len_period, max_height))

if 0:
  def tab_(f, M, /, *args):
    if M > 2**17:raise 000
    x2y = [None]*M
    for x in range(M):
        y = f(M, *args, x)
        x2y[x] = y
    x2y
    (y2num_xs, y2xs, x2min_root, x2height, min_root2len_period, min_root2minmax_height, (num_trees, max_len_period, max_height)) = group_(x2y)
    return (x2y, y2num_xs, y2xs, x2min_root, x2height, min_root2len_period, min_root2minmax_height, (num_trees, max_len_period, max_height))

def kMa2f_args_(k, M, a, /, *, ver=1):
    match ver:
        case 1:
            def f(M, a, k, vk, x, /):
                # [x1 =[%M]= x0*((1+vk) -a*vk*x0**k)]
                return x*((1+vk) -a*vk*pow(x, k, M)) %M
            vk = pow(k, -1, M)
            args = (a, k, vk)
        case -6669:
            #多设置几个驻点
            # [ver:=-6669] => [a值影响结果！]
            # 感觉无用
            assert k == 1
            def f(M, a, x, /):
                #return x*(2 -a*x) %M
                d = (1-a*x)
                ds = range(d, d+7*a, a)
                assert len(ds)&1 == 1 #附加部分数量是偶数
                return x*(1 +II_mod(M, ds)) %M
            args = (a,)
        case -6660:
            #多设置几个驻点
            # 环短树高，感觉无用
            assert k == 1
            step = a*(M//M.bit_length())
            sz = (M.bit_length() | 1)*step
            def f(M, a, sz, step, x, /):
                d = (1-a*x)
                ds = range(d, d+sz, step)
                assert len(ds)&1 == 1 #附加部分数量是偶数
                return x*(1 +II_mod(M, ds)) %M
            args = (a, sz, step)
        case -6661:
            #多设置几个驻点&&令[a值不重要]
            # [x1 == x0*(1+II[(1-a*(x0+u)) | [u:<-us]])]
            # [t*x1 == t*x0*(1+II[(1-(a/t)*(t*x0+t*u)) | [u:<-us]])]
            # => [us .* t == us]
            # [0 !<- us] => [len(us)%order_mod_(M;t) == 0]
            # [0 !<- us][len(us) > 0] => 然而t本来就是任选:[len(us) == phi(M)]
            #   不可行！
            raise 000
        case _:
            raise Exception(ver)

    return (f, args)
def try_tab__neg_kth_root_(k, M, a=1, /, *, ver=1):
    (f, args) = kMa2f_args_(k, M, a, ver=ver)
    tpl = tab_(f, M, *args)
    #print(tpl[-3:])
    return (tpl[-3:])
def try_tab__search_(M, b, ac, /, *, ver, simp=False, **kwds7ex):
    (f, args) = Mbac2f_args_(M, b, ac, ver=ver, simp=simp, **kwds7ex)
    tpl = tab_(f, M, *args)
    #print(tpl[-3:])
    return (tpl[-3:]) if not simp else (tpl[-1:])
def Mbac2f_args_(M, b, ac, /, *, ver, simp=False, u=0):
    check_int_ge(3, M)
    assert M&1 == 1
    b %= M
    ac %= M
    D = (b**2 -4*ac)%M
    j = Jacobi_symbol(M, D)
    if simp:
        print('+1' if j == 1 else j)
    else:
        print('#(M, D, b, Jacobi_symbol(M, D))', (M, D, b, j), sep='=')
    match ver:
        case -7770:
            # 逐步搜索
            def f(M, b, D, z0, /):
                # [z1 == (z0-b)/2 +D/(z0+b)/2][(D-b**2)%4 == 0]
                try:
                    v = pow(z0+b, -1, M)
                        # ^ValueError: base is not invertible for the given modulus
                except ValueError:
                    g = gcd(z0+b, M)
                    assert g > 1
                    if not simp:
                        print('#(M, D, b, z0, g)', (M, D, b, z0, g), sep='=')
                    return z0

                z1_mul2 = (z0-b +D*v) %M
                z1 = div2_mod_odd_(M, z1_mul2)
                return z1
            args = (b, D)
        case -7771:
            # 逐步搜索
            # 改进:调整比率: 1/2+1/2 --> 2/3+1/3...
            r3_M = M%3
            assert r3_M
            def f(M, b, D, z0, /):
                # [z1 == (z0-b)/2 +D/(z0+b)/2]
                # --> [z1 == (z0-b)*2/3 +D/(z0+b)/3]
                try:
                    v = pow(z0+b, -1, M)
                        # ^ValueError: base is not invertible for the given modulus
                except ValueError:
                    g = gcd(z0+b, M)
                    assert g > 1
                    if not simp:
                        print('#(M, D, b, z0, g)', (M, D, b, z0, g), sep='=')
                    return z0

                z1_mul3 = (2*(z0-b) +D*v) %M
                z1 = div3_mod_(M, r3_M, z1_mul3)
                return z1
            args = (b, D)


        case -7773:
            # 逐步搜索
            # 改进:调整比率: 1/2+1/2 --> (1-u) +u
            r3_M = M%3
            assert r3_M
            assert 1 < u < M or 1 < u+M < M
            def f(M, b, D, z0, /):
                # [z1 == (z0-b)/2 +D/(z0+b)/2]
                # --> [z1 == (z0-b)*(1-u) +u*D/(z0+b)]
                try:
                    v = pow(z0+b, -1, M)
                        # ^ValueError: base is not invertible for the given modulus
                except ValueError:
                    g = gcd(z0+b, M)
                    assert g > 1
                    if not simp:
                        print('#(M, D, b, z0, g)', (M, D, b, z0, g), sep='=')
                    return z0

                z1 = ((1-u)*(z0-b) +u*D*v) %M
                return z1
            args = (b, D)

        case -7772:
            # 逐步搜索:立方根
            assert b == 0
            r3_M = M%3
            assert r3_M
            def f(M, b, D, z0, /):
                # [z1 == (z0-b)/2 +D/(z0+b)/2]
                # --> [z1 == ((z0-b)*2 +D/(z0+b)**2)/3]
                try:
                    v = pow(z0+b, -1, M)
                        # ^ValueError: base is not invertible for the given modulus
                except ValueError:
                    g = gcd(z0+b, M)
                    assert g > 1
                    if not simp:
                        print('#(M, D, b, z0, g)', (M, D, b, z0, g), sep='=')
                    return z0

                z1_mul3 = (2*(z0-b) +D*v**2) %M
                z1 = div3_mod_(M, r3_M, z1_mul3)
                return z1
            args = (b, D)
        case _:
            raise Exception(ver)
    return (f, args)

def div2_mod_odd_(M, x, /):
    if x&1:
        x += M
    assert x&1 == 0
    x >>= 1
    x %= M
    return x

def div3_mod_(M, r3_M, x, /):
    assert r3_M
    x0 = x
    r3_x = x%3
    if r3_x:
        x += M << (r3_x == r3_M)
    x //= 3
    x %= M
    assert (x0 - 3*x)%M == 0
    return x



def iter_try_square__reciprocal_(M, a, /, *, ver=1):
    MM = M**2
    match ver:
        case 1:
            def f(x, /):
                x = (2-a*x)*x %MM
                return x
        case -1:
            def f(x, /):
                x = (2*a*x-1)*x %MM
                return x
        case 2:
            def f(x, /):
                x = (3-2*a*x)*x %MM
                return x
        case 3:
            def f(x, /):
                x = (4-3*a*x)*x %MM
                return x
        case 6:
            def f(x, /):
                x = (7-6*a*x)*x %MM
                return x
        case -3:
            def f(x, /):
                x = (2-(a*x)**3)*x %MM
                return x
        case -33:
            #多设置几个驻点:无效
            def f(x, /):
                #x = (1+(1-a*x)*(1-a*(x-1))*(1-a*(x+1)))*x %MM
                x = (1+(1-a*x)*(1-a*(x-M))*(1-a*(x+M)))*x %MM
                    #<==>:
                    # ?q :=> [a*x == 1+q*M]
                    # x = (1+(q*M)*(q*M+a*M)*(q*M-a*M))*x %MM
                    #<==>:
                    #x = x %MM
                return x
        case -333:
            #多设置几个驻点
            def f(x, /):
                #x = (1+(1-a*x)*(1-a*(x+3*M))*(1-a*(x+7*M))//MM)*x %MM
                q = (1-a*x)//M
                x = (1+M*q*(q-3*a)*(q-7*a))*x %MM
                return x
        case -666:
            #多设置几个驻点
            def f(x, /):
                q = (1-a*x)//M
                x = (1+M*q*(-1+pow(q, 1<<99, M)))*x %MM
                return x
        case -667:
            #多设置几个驻点
            e = 99
            ae = pow(a, 1<<e, M)
            def f(x, /):
                q = (1-a*x)//M
                x = (1+M*q*(-ae+pow(q, 1<<e, M)))*x %MM
                return x
        case -668:
            #多设置几个驻点
            def f(x, /):
                q = (1-a*x)//M
                x = (1+M*q*(q-3)*(q-7)*(q-15)*(q-31))*x %MM
                return x
        case -669:
            #多设置几个驻点
            def f(x, /):
                q = (1-a*x)//M
                x = (1+M*q*(q-3*a)*(q-7*a)*(q-15*a)*(q-31*a))*x %MM
                return x
        case -6666:
            #多设置几个驻点:看来这条路也不对
            #也许得偶数而非奇数
            def f(x, /):
                q = (1-a*x)//M
                x = (1+M*q*(q-3*a)*(q-7*a)*(q-15*a)*(q-31*a)*(q-63*a)*(q-127*a)*(q-255*a)*(q-511*a)*(q-1023*a))*x %MM
                return x
        case -6667:
            #多设置几个驻点:还行
            #偶数:3,5;15,31;63,127;255,511;1023,2047;
            def f(x, /):
                q = (1-a*x)//M
                x = (1+M*(q*(q-3*a)*(q-7*a)%M*(q-15*a)*(q-31*a)%M*(q-63*a)*(q-127*a)%M*(q-255*a)*(q-511*a)%M*(q-1023*a)*(q-2047*a)%M))*x %MM
                return x
        case _:
            raise Exception(ver)
    f

    x0 = va = pow(a, -1, M)
    return iter_try_squareT_(M, x0, f)
def iter_try_square__search_(M, x0, h0, /, *, ver):
    #逐步搜索

    #森林结构只有两种:假设[M素数]:
    #    [x1 == x0/2 +Dn/x0/2][Dn%4 < 2][Jacobi_symbol(M; Dn) == -1]
    #    [x1 == x0/2 +Dp/x0/2][Dp%4 < 2][Jacobi_symbol(M; Dp) == +1]

    # Dp = (x0/2)**2%M
    assert 0 < x0 < M
    assert 0 <= h0 < M
    MM = M**2
    #half_x0 = div2_mod_odd_(MM, x0)
    #bug:Dp = pow(half_x0, 2, M)
    #bug:raw_Dp = half_x0**2
    #raw_Dp = x0**2
    #bug:b = raw_Dp%4
    b = 0
    Dp = pow(h0*M+x0, 2, MM)
    ac = ((Dp-b**2)*pow(-4,-1,MM))%MM
    assert 0 <= b < 2
    assert b == b**2
    assert (b**2 -4*ac)%MM == Dp



    (_f, args) = Mbac2f_args_(MM, b, ac, ver=ver, simp=True)
    assert (b, Dp) == args, (args, (b, Dp))
    def f(x, /):
        return _f(MM, *args, x)
    f
    return iter_try_squareT_(M, x0, f)
def iter_try_squareT_(M, x0, f, /):
    #MM = M**2
    assert 0 <= x0 < M
    xs = []
    x2j = {}
    x = x0
    for j in count(0):
        #print(j, x, sep=':')
        yield x
        if x in x2j:
            i = x2j[x]
            yield (i, j, j-i, x)
            break
        xs.append(x)
        x2j[x] = j
        #x = (2-a*x)*x %MM
        x = f(x)
        assert x%M == x0, (M, x0, x%M, x)

def iter_try_MN_(M, N, a, /, *, ver=1):
    match ver:
        case 1:
            def f(x, /):
                x = (2-a*x)*x %MN
                return x
        case _:
            raise Exception(ver)
    f

    x0 = va = pow(a, -1, N)
    MN = M*N
    xs = []
    x2j = {}
    x = x0
    for j in count(0):
        #print(j, x, sep=':')
        yield x
        if x in x2j:
            i = x2j[x]
            yield (i, j, j-i, x)
            break
        xs.append(x)
        x2j[x] = j
        #x = (2-a*x)*x %MN
        x = f(x)
        assert x%N == x0


__all__
from script.整数分解牜尸方法牜吸引子 import *
