#__all__:goto
r'''[[[
e script/整数分解牜允许快速求值的多根多项式.py
平方累聚型多根多项式:甲型、乙型
尝试一:构造:甲型平方累聚型多根多项式@ZZ
尝试二:构造:甲型平方累聚型多根多项式@(ZZ%p)
尝试三:构造:乙型平方累聚型多根多项式@ZZ
公式牜上升期牜自由变量讠高层根:goto

script.整数分解牜允许快速求值的多根多项式
py -m nn_ns.app.debug_cmd   script.整数分解牜允许快速求值的多根多项式 -x # -off_defs
py -m nn_ns.app.doctest_cmd script.整数分解牜允许快速求值的多根多项式:__doc__ -ht # -ff -df
#######

[[
尝试三:构造:乙型平方累聚型多根多项式@ZZ
乙型:(...((((a+b)*x)**2 -(x**2+ab)**2)**2-(???)**2)...)
    (...(((x+/-a)*(x+/-b))**2-(???)**2)...)
    [X:=(x**2-b**2)]
    [A:=(u*x**2+v*x+w)]
    [B:=((x**2-a**2)-A)]
    [(A+B)==(x**2-a**2)]
    (...(((A+B)*X)**2-(???)**2)...)
    (...(((A+B)*X)**2-(X**2+A*B)**2)...)
    (...(((X+/-A)*(X+/-B))**2)...)
    (...((((x**2-b**2)+/-(u*x**2+v*x+w))*((x**2-b**2)+/-((x**2-a**2)-A)))**2)...)
[(x-a)*(x-b) == (x**2+a*b) -(a+b)*x]
[(x+a)*(x+b) == (x**2+a*b) +(a+b)*x]
[(x**2-a**2)*(x**2-b**2) == ((x**2+a*b)**2 -((a+b)*x)**2)]
[((x**2+a*b)**2 -((a+b)*x)**2) ...]
[X:=(x**2+a*b)]
[A:=((a+b)*x)]
[B:=((a/c+b*c)*x)]
[(X**2 -A**2)*(X**2 -B**2) ...]
[(X**2-A**2)*(X**2-B**2) == ((X**2+A*B)**2 -((A+B)*X)**2)]
    感觉可以！
    但是由于x参与参数构造，这个多项式既不恒等，而又计算费时
        违背『允许快速求值』的原则！
            也许没这么糟
    由于(a*b)恒等，[gcd(n,a*b)==1] 所有根与n互素！不过还行，反正求gcd(n,x-b*c*C...)
[XX:=(X**2+A*B)]
[AA:=((A+B)*X)]
[BB:=((A/C+B*C)*X)]
==>>:
[AA==((A+B)*X) == ((a+b)*x+(a/c+b*c)*x)*(x**2+a*b)]
[BB==((A/C+B*C)*X) == ((a+b)*x/C+(a/c+b*c)*x*C)*(x**2+a*b) == ((a/C+b/C)*x+(a/c*C+b*c*C)*x)*(x**2+a*b) =]
    病蛊:[(a/C)*(b/C) =!= (a*b)]
        (a/C+b/C)*x显然无效！
        bug:here
[(a/C-uuu)*(b/C+uuu) == (a*b)]:
    [(a-C*uuu)*(b+C*uuu) == C*(a*b)]
    [((C-1)*a*b -(a-b)*C*uuu +(C*uuu)**2)) == 0]
    [sqrt(((a-b)*C)**2 -4*C**2*(C-1)*a*b)
    == C*sqrt((a-b)**2 -4*(C-1)*a*b)
    == C*sqrt((a+b)**2 -4*C*a*b)
    == C*Du
    ]
    [Du**2 == ((a+b)**2 -4*C*a*b)]
    [C == ((a+b)**2 -Du**2)/(4*a*b)]
    [uuu
    == ((a-b)*C +/- C*Du)/(4*C**2)
    == ((a-b) +/- Du)/(4*C)
    == (a*b)*((a-b) +/- Du)/((a+b)**2 -Du**2)
    ]
    [uuu == (a*b)*((a-b) +/- Du)/((a+b)**2 -Du**2)]
    [C*(4*a*b) == ((a+b)**2 -Du**2)]
[(a/c*C-vvv)*(b/c*C+vvv) == (a*b)]:
    11111:
        [c/C == ((a+b)**2 -Dv**2)/(4*a*b)]
        [c == C*((a+b)**2 -Dv**2)/(4*a*b)]
        [c == ((a+b)**2 -Du**2)/(4*a*b)*((a+b)**2 -Dv**2)/(4*a*b)]
        这样不行:需要根据后面的C{许多不同值}计算c

    22222:
        [C*(4*a*b) == ((a/c+b*c)**2 -_Dv**2)]
        [((a+b)**2 -Du**2) == ((a/c+b*c)**2 -_Dv**2)]
        [((a+b)**2 -(a/c+b*c)**2) == (Du**2 -_Dv**2)]
        [((a+b) +/- (a/c+b*c)) == (Du +/- _Dv)]
        [(Du+_Dv) == t*((a+b) + (a/c+b*c))]
        [(Du-_Dv) == 1/t*((a+b) - (a/c+b*c))]
        自由度1，后续还有许多更高层的C作用于此，还是得全盘考虑，全盘待定系数
            既然如此，那就重新考量 甲型


整数分解牜乙型平方累聚型多项式求值牜原理错扌:goto

[p%4==1]:
    ?i => [i**2 %p == p-1]
    [(x**2**k - y**2**k)
    == (x**2**(k-1) - y**2**(k-1))*(x**2**(k-1) - i**2*y**2**(k-1))
    == (x**2**(k-1) - y**2**(k-1))*(x**2**(k-2) - i*y**2**(k-2))*(x**2**(k-2) + i*y**2**(k-2))
    ]
    => 费马数 其实很容易分解？
    [n==1+2**2**e][n%p == 0]:
        [p%2**(2+e) == 1]
        [try:gcd(n, -1+x**2**(2+e))]
            rho:...
            其实已有相应的 尸方法
]]

[[
尝试一:构造:甲型平方累聚型多根多项式@ZZ
甲型:(...(((x**2-u0)**2-u1)**2-u2)...)
[(x-a)*(x-b) == ((x-c)**2-d**2)]
[-a == -c-d][-b == -c+d]
[c == (a+b)/2]
[d == (a-b)/2]
[(x-a)*(x-b) == ((x-((a+b)/2))**2-((a-b)/2)**2)]
[(x-u)*(x-v) == ((x-((u+v)/2))**2-((u-v)/2)**2)]
let [(a+b)/2 == (u+v)/2]
    [X := (x-((a+b)/2))**2]
    [A := ((a-b)/2)**2]
    [B := ((u-v)/2)**2]

[f([a,b,u,v];x) == (x-a)*(x-b)*(x-u)*(x-v) == (X-A)*(X-B) == ((X-((A+B)/2))**2-((A-B)/2)**2)]
[f([a,b,u,v];x) == ((X-((A+B)/2))**2-((A-B)/2)**2)]
[f([p,q,s,t];x) == ((X-((A+B)/2))**2-((U-V)/2)**2)]
let [(A+B)/2 == (U+V)/2]
    [X == (x-((p+q)/2))**2]
        ie:[(p+q)/2 == (a+b)/2]
let [(p+q)/2 == (s+t)/2]
    [U := ((p-q)/2)**2]
    [V := ((s-t)/2)**2]

[(a+b) == (u+v)]
[ua := (u-a)]
[u == (a+ua)]
[v == (b-ua)]
[(u-v) == (a-b)+2*ua]
[(u-v)/2 == (a-b)/2+ua]
[(x-u)*(x-v) == (X-B) == (X-((a-b)/2+ua)**2) == ((x-c)**2 -(d+ua)**2)]
[(x-u)*(x-v) == ((x-c)**2 -(d+ua)**2)]
[pa := (p-a)]
[sa := (s-a)]
[aa := (a-a)]
[(x-p)*(x-q) == ((x-c)**2 -(d+pa)**2)]
[(x-s)*(x-t) == ((x-c)**2 -(d+sa)**2)]
[(x-a)*(x-b) == ((x-c)**2-(d+aa)**2)]
[(x-u)*(x-v) == ((x-c)**2 -(d+ua)**2)]


let [C := ((A+B)/2)]
    [D := ((A-B)/2)]
[AA := (A-A)]
[UA := (U-A)]
[UA == ((p-q)/2)**2 -((a-b)/2)**2]
!! [f([a,b,u,v];x) == ((X-((A+B)/2))**2-((A-B)/2)**2)]
!! [f([p,q,s,t];x) == ((X-((A+B)/2))**2-((U-V)/2)**2)]
[f([a,b,u,v];x) == ((X-C)**2-(D+AA)**2)]
[f([p,q,s,t];x) == ((X-C)**2-(D+UA)**2)]

!! [(A+B) == (U+V)]
!! [A := ((a-b)/2)**2]
!! [B := ((u-v)/2)**2]
!! [U := ((p-q)/2)**2]
!! [V := ((s-t)/2)**2]
[((a-b)/2)**2 + ((u-v)/2)**2 == ((p-q)/2)**2 + ((s-t)/2)**2]
[(d+aa)**2 + (d+ua)**2 == (d+pa)**2 + (d+sa)**2]
let [M := (d+aa)**2 + (d+ua)**2]
    显然，为了凑够大量的四根多项式，要求M包含许多不同的(1+4*k)型素数，M增长速度超快，好在用于(ZZ%n)也无妨...
let [ps := [p for p in primes if p%4==1]]
    [M == II(ps[:L])]
    [ps[j] == odds[j]**2 + evens[j]**2]
    [(d+xa)**2 + (d+ya)**2 == M]
    [gxy := gcd((d+xa)**2, (d+ya)**2)]
[M%gxy == 0]
[gxy == 1] # if M squarefree
[M == (d+xa)**2 - 1j**2*(d+ya)**2 == norm_((d+xa) -1j*(d+ya)) == norm_(II[(odds[j] + g[j]*1j*evens[j]) | [j:<-[0..<L]]])]
    where [g[j] :<- {+1,-1}]
    这样一来，感觉要无限增长会有难度...

乙型 重回 甲型:全盘待定系数:
    于 整数环ZZ，确实难，但是 考虑 有理数域 或者 整数剩余环(ZZ%n)，则 容易些
    但由于不通用，还是得 每个n重算一次
        ？有理数域？可能 非常大
[(d+aa)**2 + (d+ua)**2 == (d+pa)**2 + (d+sa)**2]
[(d+aa)**2 - (d+sa)**2 == (d+pa)**2 - (d+ua)**2]
[(aa-sa)*(2*d+aa+sa) == (pa-ua)*(2*d+pa+ua)]
? t{pa,sa} =>
    [(pa-ua) == t{pa,sa}*(aa-sa)]
    [t{pa,sa}*(2*d+pa+ua) == (2*d+aa+sa)]
[tps:=t{pa,sa}] #待定系数
[pua:=(pa-ua)]
[pa == pua+ua]
[pua == tps*(aa-sa)]
[tps*(2*d+pua+2*ua) == (2*d+aa+sa)]
[tps*(2*d+tps*(aa-sa)+2*ua) == (2*d+aa+sa)]
[sa == (tps*(tps*aa+2*(d+ua)) -(2*d+aa)) / (1+tps_tps)]

最低层:
    前四个只需:[(a+b) == (u+v)]
        # ua:(a,b) --> (u,v)
    后面1个待定系数 对应 4个根
        # tps:(aa,ua) --> (pa,sa)
        # tps:(a,b,u,v) --> (p,q,s,t)
更高层 还有 待定系数:
    前四个只需:[(A+B) == (U+V)]
        由低一层的tps校准
    后面1个待定系数 对应 4个根 # tPS:(A,B,U,V) --> (P,Q,S,T)
        这里 待定系数 共有:
            #最低层 根:8+8=16个
            ua型:4+4=8个 # 其中[aa===0]
            tps型:2个#低层 => 非首ua型3个
            tPS型:1个#高层 => UA型 # 与低层冲突 或者说 联立约束
        晕死...理不清好乱

系统化命名:
    『0;』-表示 层次高度
    ua --> dr[0;...]
    a,b,... --> r[0;...]
    tps --> t[0;...]

常量:c
    [@k. [c[0] == c == (r[0;0+2*k]+r[0;1+2*k])/2]]
dr[0;k] -> (r[0;0+2*k], r[0;1+2*k])
    !! [(a+b) == (u+v)]
    [(r[0;0+2*k]+r[0;1+2*k]) == (a+b) == 2*c#头部常量]
    [r[0;0+2*k] == c+dr[0;k]]
    [r[0;1+2*k] == c-dr[0;k]]
    [dr[0;k] == (r[0;0+2*k]-r[0;1+2*k])/2]
    [(x-r[0;0+2*k])*(x-r[0;1+2*k])
    == (x-(r0+r1)/2)**2 -((r0-r1)/2)**2
    == (x-c)**2 -dr[0;k]**2
    ]
    [(x-r[0;0+2*k])*(x-r[0;1+2*k]) == ((x-c)**2 -dr[0;k]**2)]
    [r[1;k] == dr[0;k]**2]
    ==>>:
    [@k. [c[h] == (r[h;0+2*k]+r[h;1+2*k])/2]]
        # 定义:c[]
        # 2**(ht-1-h)约束每c[h]
    [dr[h;k] == (r[h;0+2*k]-r[h;1+2*k])/2]
        # 定义:dr[]
        # 1约束每dr
    [r[1+h;k] == dr[h;k]**2]
        # 定义:非底层r[]
        # 1约束每 非底层r
    ==>>:
    [r[h;0+2*k] == c[h]+dr[h;k]]
    [r[h;1+2*k] == c[h]-dr[h;k]]
t[0;k] -> (dr[0;0+4*k], dr[0;1+4*k]) -> (dr[0;2+4*k], dr[0;3+4*k])
    [(r[1+h;0+2*k]+r[1+h;1+2*k]) == 2*c[1+h] == (r[1+h;0+2*j]+r[1+h;1+2*j])]
    [(dr[h;0+2*k]**2+dr[h;1+2*k]**2) == (dr[h;0+2*j]**2+dr[h;1+2*j]**2)]
    [(dr[h;0+2*k]**2-dr[h;1+2*j]**2) == (dr[h;0+2*j]**2-dr[h;1+2*k]**2)]
    [(dr[h;0+2*k]-dr[h;1+2*j])*(dr[h;0+2*k]+dr[h;1+2*j]) == (dr[h;0+2*j]-dr[h;1+2*k])*(dr[h;0+2*j]+dr[h;1+2*k])]
    [(dr[h;0+2*k]-dr[h;1+2*j])/(dr[h;0+2*j]+dr[h;1+2*k]) == (dr[h;0+2*j]-dr[h;1+2*k])/(dr[h;0+2*k]+dr[h;1+2*j])]
    # [(k,j):=(0+2*k,1+2*k)]
    [t[h;k] == (dr[h;0+4*k]-dr[h;3+4*k])/(dr[h;2+4*k]+dr[h;1+4*k]) == (dr[h;2+4*k]-dr[h;1+4*k])/(dr[h;0+4*k]+dr[h;3+4*k])]
        #定义:待定系数
        #   注意:为了对称性，此处定义 与上面的tps 不同！
        # 2约束每t #但是 其实源自c[h]约束

td[h;k]:尝试:使用比率替换c[1:]
    !! [(dr[h;0+2*k]**2+dr[h;1+2*k]**2) == (dr[h;0+2*j]**2+dr[h;1+2*j]**2)]
    # [j:=0]
    [(dr[h;0+2*k]**2+dr[h;1+2*k]**2) == (dr[h;0]**2+dr[h;1]**2)]
    [(dr[h;0+2*k]**2-dr[h;0]**2) == -(dr[h;1+2*k]**2-dr[h;1]**2)]

    [td[h;k] == (dr[h;0+2*k]+dr[h;0])/(dr[h;1+2*k]-dr[h;1]) == -(dr[h;1+2*k]+dr[h;1])/(dr[h;0+2*k]-dr[h;0])]
        #定义:td[h;k]
        #源自c[h]约束
        #   但形式与t[h;k]不同，且数量更多:分隔点:2*k而非4*k
    [td == (x0+d0)/(x1-d1) == -(x1+d1)/(x0-d0)]
    [x0+d0 == td*(x1-d1)]
    [x1+d1 == -td*(x0-d0)]
    =>:
    [x0-td*x1 == -(+d0+td*d1)]
    [td*x0+x1 == -(-td*d0+d1)]
    =>:
    :> [E:=td]
    [[1,-E;E,1]*[x0;x1] == -[1,E;-E,1]*[d0;d1]]
    !! [[1,-E;E,1]*[1,E;-E,1] == (1+E**2)*[1,0;0;1]]
    [[x0;x1] == -1/(1+E**2) * [1,E;-E,1]**2 * [d0;d1]]
    [[x0;x1] == -1/(1+E**2) * [1-E*E,2*E;-2*E,1-E*E] * [d0;d1]]

    #更高层往下看:
    [td[h+1;k] == (dr[h+1;0+2*k]+dr[h+1;0])/(dr[h+1;1+2*k]-dr[h+1;1]) == -(dr[h+1;1+2*k]+dr[h+1;1])/(dr[h+1;0+2*k]-dr[h+1;0])]

    !! [dr[h;k] == (r[h;0+2*k]-r[h;1+2*k])/2]
    [dr[h+1;k] == (r[h+1;0+2*k]-r[h+1;1+2*k])/2]
    =>:
    [dr[h+1;0+2*k] == (r[h+1;0+4*k]-r[h+1;1+4*k])/2]
    [dr[h+1;1+2*k] == (r[h+1;2+4*k]-r[h+1;3+4*k])/2]
    =>:
    [dr[h+1;0] == (r[h+1;0]-r[h+1;1])/2]
    [dr[h+1;1] == (r[h+1;2]-r[h+1;3])/2]

    !! [r[1+h;k] == dr[h;k]**2]
    [dr[h+1;0+2*k] == (dr[h;0+4*k]**2-dr[h;1+4*k]**2)/2]
    [dr[h+1;1+2*k] == (dr[h;2+4*k]**2-dr[h;3+4*k]**2)/2]
    =>:
    [dr[h+1;0] == (dr[h;0]**2-dr[h;1]**2)/2]
    [dr[h+1;1] == (dr[h;2]**2-dr[h;3]**2)/2]

    [td[h+1;k]

    == ((dr[h;0+4*k]**2-dr[h;1+4*k]**2)+(dr[h;0]**2-dr[h;1]**2))/((dr[h;2+4*k]**2-dr[h;3+4*k]**2)-(dr[h;2]**2-dr[h;3]**2))
        == -((dr[h;2+4*k]**2-dr[h;3+4*k]**2)+(dr[h;2]**2-dr[h;3]**2))/((dr[h;0+4*k]**2-dr[h;1+4*k]**2)-(dr[h;0]**2-dr[h;1]**2))

    == (dr[h;0+4*k]**2-dr[h;1]**2)/(dr[h;2+4*k]**2-dr[h;2]**2)
        == -(dr[h;2+4*k]**2-dr[h;3]**2)/(dr[h;0+4*k]**2-dr[h;0]**2)

        == (r[h+1;0+4*k]-r[h+1;1])/(r[h+1;2+4*k]-r[h+1;2])
            == -(r[h+1;2+4*k]-r[h+1;3])/(r[h+1;0+4*k]-r[h+1;0])

    !! [td[h;k] == (dr[h;0+2*k]+dr[h;0])/(dr[h;1+2*k]-dr[h;1]) == -(dr[h;1+2*k]+dr[h;1])/(dr[h;0+2*k]-dr[h;0])]
    ???...TODO
    == (dr[h;0+4*k]**2-dr[h;1]**2)/(dr[h;2+4*k]**2-dr[h;2]**2)
        == -(dr[h;2+4*k]**2-dr[h;3]**2)/(dr[h;0+4*k]**2-dr[h;0]**2)

    ]
    [(r[h+1;0+4*k]-r[h+1;0])*(r[h+1;0+4*k]-r[h+1;1]) == -(r[h+1;2+4*k]-r[h+1;2])*(r[h+1;2+4*k]-r[h+1;3])]
    []

ht
    [h:<-[0..=ht]]
    ===
    c[h]
        [h:<-[0..=-1+ht]]
        [len(c[*]) == ht]
    ===
    r[h;k]
        [h:<-[0..=ht]]
        [h:<-[0..=ht]][k:<-[0..<2**(ht-h)]]
        [len(r[ht;*]) == 1]
        [[h:<-[0..=-1+ht]] -> [len(r[h;*]) == 2*len(r[1+h;*])]]
        [len(r[0;*]) == 2**ht]
        [[h:<-[0..=ht]] -> [len(r[h;*]) == 2**(ht-h)]]
    ===
    dr[h;k]
        [h:<-[0..=-1+ht]]
        [h:<-[0..=-1+ht]][k:<-[0..<2**(ht-1-h)]]
        [[h:<-[0..=-1+ht]] -> [len(r[h;*]) == 2*len(dr[h;*])]]
        [[h:<-[0..=-1+ht]] -> [len(r[1+h;*]) == len(dr[h;*])]]
    ===
    t[h;k]
        [h:<-[0..=-3+ht]]
        [h:<-[0..=-3+ht]][k:<-[0..<2**(ht-3-h)]]
        [[h:<-[0..=-3+ht]] -> [len(r[h;*]) == 8*len(t[h;*])]]
        [[h:<-[0..=-3+ht]] -> [len(dr[h;*]) == 4*len(t[h;*])]]

    ===
    !! 2**(ht-1-h)约束每c[h]
    !! 1约束每 非底层r
    !! 1约束每dr
    # !! 2约束每t #但是 其实源自 c[h]约束
        #另: dr 以及 非底层r:都是 人为中间变量，可无视
    [总数纟约束 == 3*(-1+2**ht)]
    [总数纟变量 == (ht +(-1+2**(1+ht)) +(-1+2**ht))]
    [自由度 == 总数纟变量-总数纟约束 == (1+ht)]
        即:首根+c[*]
        自由度 挺高？
        但是如何线性化取值过程？
            #公式牜上升期牜自由变量讠高层根:goto


[h:<-[0..=ht]][k:<-[0..<2**(ht-h)]]:
    [eval_rhk_(c[:h];r[0;0+k*2**h]) =[def]= r[h;k]]

[eval_rhk_(c[:h];r[0;0+k*2**h]) == r[h;k]]
[eval_rhk_(c[n:h];r[n;0+k*2**(h-n)]) == r[h;k]]
[r[h;k] == eval_rhk_(c[n:h];r[n;0+k*2**(h-n)])]


[eval_rhk_(c[h:h+g];r[h;0+k*2**g]) == r[h+g;k]]
[eval_rhk_(c[h:h];r[h;k]) == r[h;k]]
[eval_rhk_(c[h:h+1];r[h;0+k*2])
    == r[h+1;k]
    == dr[h;k]**2
    == (r[h;0+2*k]-c[h])**2
    ]
[eval_rhk_(c[h:h+1];r[h;0+k*2]) == (r[h;0+2*k]-c[h])**2]
[r[h+1;k] == (r[h;0+2*k]-c[h])**2]

[eval_rhk_(c[h:h+2];r[h;0+k*2**2])
    == r[h+2;k]
    == eval_rhk_(c[h+1:h+2];r[h+1;0+k*2])
    == (r[h+1;0+2*k]-c[h+1])**2
    == (eval_rhk_(c[h:h+1];r[h;0+(2*k)*2])-c[h+1])**2
    == ((r[h;0+4*k]-c[h])**2-c[h+1])**2
    == ((r[h;0+k*2**2]-c[h])**2-c[h+1])**2
    ]
[eval_rhk_(c[h:h+2];r[h;0+k*2**2]) == ((r[h;0+k*2**2]-c[h])**2-c[h+1])**2]

!! [r[h+1;k] == (r[h;0+2*k]-c[h])**2]
!! [r[h+2;k] == ((r[h;0+k*2**2]-c[h])**2-c[h+1])**2]
[r[h;k]
    == (r[h-1;0+k*2**1]-c[h-1])**2
    == ((r[h-2;0+k*2**2]-c[h-2])**2-c[h-1])**2
    == (((r[h-3;0+k*2**3]-c[h-3])**2-c[h-2])**2-c[h-1])**2
    == 平方纟甲型平方累聚型多根多项式{c[n:h];r[n;0+k*2**(h-n)]}
    ]
[r[h;k] == 平方纟甲型平方累聚型多根多项式{c[n:h];r[n;0+k*2**(h-n)]}]
    #注意:平方但不作用于退化情形
    #公式牜上升期牜自由变量讠高层根:here

!! [r[h+1;k] == (r[h;0+2*k]-c[h])**2]
[r[h;0+2*k] == (r[h+1;k]**/2+c[h])]
    但是:下降期 需要开平方，未必是 有理数
    !! 需求:幂增
    => (1+ht)的自由度怕是不够用
可以构造一个必然可以开方的乘法群:
    比如:
    bug:[u*n%2==1][gcd(u,n)==1]:
        [GG:=(1%u+u*ZZ%(u*n))]
        [x:<-GG]:
            [x%u == 1]
        bug:因为含有不可逆元素:(1%u,0%n) (1%u,noncoprime4n%n)
            [len(GG) == n]
            [sqrt_(GG;u) := u**((1+n)///2) %(u*n)]
        %7 => 1,2=3**2,4=2**2
            3,5,6 平方非剩余
        %21 10,19,13
        >>> pow(10,4,21)
        4
        >>> pow(10,8,21) #并不返回10
        16
        >>> pow(10,6,21)
        1
        >>> pow(10,7,21)
        10

    [u*n%2==1][gcd(u,n)==1]:
        # eg:[u==1]
        [GG:=(1%(u*n)+(u*n)*ZZ%(u*n)**2)]
        [x:<-GG]:
            [x%(u*n) == 1]
        [len(GG) == u*n]
        [sqrt_(GG;u) := u**((1+u*n)///2) %(u*n)**2]
        %7 => 1,2=3**2,4=2**2
            3,5,6 平方非剩余
        %21 10,19,13
            !! %7 =!= 1
            不在GG中
        >>> 21**2
        441
        >>> 22**21%441
        1
        >>> 22**11%441
        232
        >>> 232**2%441
        22

        由于[GG%n == 1]，GG中的元素并不适合通过gcd用来分解n
        但是 平方根 总是存在，虽然在GG里只有一个，但是GG本来也不是环，只是乘法群，在(ZZ%(u*n)**2)中至少2个根(u>1时更多)
        !! [r[h;0+2*k] == (r[h+1;k]**/2+c[h])]
        let [r[h;k] <- GG]
        [r[h;0+2*k] <- GG]
        [r[h+1;k] <- GG]
        [r[h+1;k]**/2 <- GG]
        [c[h] %(u*n) == 0]
        但是:
        [2*c[h] == (r[h;0+2*k]+r[h;1+2*k])]
        [c[h] %(u*n) == 1]
        [c[h] <- GG]
        _L

[z**2**e == -1]:
    [(x**2**k - y**2**k)
    == (x**2**(k-1) - y**2**(k-1))*(x**2**(k-1) + y**2**(k-1))
    == (x**2**(k-1) - y**2**(k-1))*(x**2**(k-1) - z**2**e*y**2**(k-1))
    == (x**2**(k-1) - y**2**(k-1))*(x**2**(k-1) - (z**2**(e+1-k)*y)**2**(k-1))
    ]
    [bb**2**e == pw] # 可能调整一下？
]]

[[
@20260705
允许快速求值的多根多项式
e script/整数分解牜允许快速求值的多根多项式.py

型如:(...(x**2+a)**2+b...)方便快速计算并且有2**k个整数根！
  强化:view ../../python3_src/seed/math/factor_pint/factor_pint__7batch_gcd_IIdiffs.py

'Prime numbers-A Computational Perspective(2ed)(2005)(Pomerance).pdf'
page315[325/604]
6.6 Research problems
6.17.Investigate the following idea for forging a subexponential factoring algorithm.
    Observe first the amusing algebraic identity [Crandall 1996a]
        F(x) = ((x**2 − 85)**2− 4176)**2− 2880**2 = (x − 13)(x − 11)(x − 7)(x − 1)(x + 1)(x + 7)(x + 11)(x + 13)


+-sqrt(85 +-sqrt(4176 +-2880))
  -sqrt(85 -sqrt(4176 -2880))
    -7
  -sqrt(85 -sqrt(4176 +2880))
    -1
  -sqrt(85 +sqrt(4176 -2880))
    -11
  -sqrt(85 +sqrt(4176 +2880))
    -13
  +sqrt(85 -sqrt(4176 -2880))
    +7
  +sqrt(85 -sqrt(4176 +2880))
    +1
  +sqrt(85 +sqrt(4176 -2880))
    +11
  +sqrt(85 +sqrt(4176 +2880))
    +13

%3:
  sqrt(0) -> 0
  sqrt(1) -> 1,2
  sqrt(2) -> _L
  [{a+b,a-b} <= {0,1}]
  [b%3 == 0]:
    [a <- {0,1}]
    [a==0]:
      [sqrt(a+b) == 0]
      [sqrt(a-b) == 0]
    [a==1]:
      [sqrt(a+b) == 1]
      [sqrt(a-b) == 1]
  [b%3 == 1]:
    [a == 2]
    [sqrt(a+b) == 0]
    [sqrt(a-b) == 1]
  [b%3 == 2]:
    [a == 2]
    [sqrt(a+b) == 1]
    [sqrt(a-b) == 0]

  b -> sqrt(a+/-b)
  0 -> 0|1
  1 -> 0,1
  2 -> 0,1

  考虑无限长序列:
    排除2
    1 总是 引入0
    然而 0->0 很难持久，不可能支持无限长序列
    1 -> 0,1 -> 1 -> 0,1 -> ...循环

for p in [2,3,5,7,11,13,17,19]: print(p, [c%p for c in [85, 4176, 2880]], sep=':')
    # [a2,a1,b0]
    2:[1, 0, 0]
    3:[1, 0, 0]
    5:[0, 1, 0]
    7:[1, 4, 3]
    11:[8, 7, 9]
    13:[7, 3, 7]
    17:[0, 11, 7]
    19:[9, 15, 11]

from math import isqrt
for p in [2,3,5,7,11,13,17,19]:
    b = 2880
    bs = [2880]
    print(p, [c%p for c in bs], sep=':')
    for a in [4176, 85]:
        _bs = [_b for b in bs for _b in [isqrt(a-b), isqrt(a+b)]]
        bs = _bs
        print(p, [c%p for c in bs], sep=':')
    2:[0]
    2:[0, 0]
    2:[1, 1, 1, 1]
    3:[0]
    3:[0, 0]
    3:[1, 2, 1, 1]
    5:[0]
    5:[1, 4]
    5:[2, 1, 1, 3]
    7:[3]
    7:[1, 0]
    7:[0, 4, 1, 6]
    11:[9]
    11:[3, 7]
    11:[7, 0, 1, 2]
    13:[7]
    13:[10, 6]
    13:[7, 11, 1, 0]
    17:[7]
    17:[2, 16]
    17:[7, 11, 1, 13]
    19:[11]
    19:[17, 8]
    19:[7, 11, 1, 13]


]]
[[
]]

'#'; __doc__ = r'#'
>>>



[[
奇数:中心对称:典型见:%5
    ABCDDCB
    [+b -> (a+/-b)]
    [-b -> (a+/-b)]
偶数:半周期循环对称:典型见:%6
    ABCDCBABCDCB
    [+b -> (a+/-b)]
    [-b -> (a+/-b)]
    [H+b -> ((H+a)+/-(H+b))==(a+/-b)]
    [H-b -> ((H+a)+/-(H-b))==(a+/-b)]

===
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @制表冫平方剩余中点乊剩余环扌 =3
    [((0,), (1,)), ((0, 1),), ((0, 1),)]

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =5
    0:((0,), (1,), (4,))
    1:((1, 4),)
    2:((0, 1), (0, 4))
    3:((0, 1), (0, 4))
    4:((1, 4),)
%5: 1,4 -> 1,4

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =6
    0:((0,), (1,), (3,), (4,))
    1:((0, 4), (1, 3))
    2:((0, 4), (1, 3))
    3:((0,), (1,), (3,), (4,))
    4:((0, 4), (1, 3))
    5:((0, 4), (1, 3))
%6: 4 -> 1,3 -> 1,3,4
    %6 --> %30:
    1,7,13,19,25
    3,9,15,21,27
    4,10,16,22,28

%5: 1,4 -> 1,4
    %5 --> %30:
    1,19
    9,21
    4,16

%30:
    1 -> 19,21
    4 -> 1,9
    9 -> 1,19 | 4,16 | 9,21
    16 -> 19,21
    19 -> 1,9
    21 -> 1,19 | 4,16 | 9,21
    半周期循环对称
py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =30
    0:((0,), (1,), (4,), (6,), (9,), (10,), (15,), (16,), (19,), (21,), (24,), (25,))
    1:((4, 6), (19, 21))
    2:((0, 4), (6, 10), (15, 19), (21, 25))
    3:((0, 6), (0, 24), (1, 25), (4, 10), (9, 15), (10, 16), (15, 21), (19, 25))
    4:((1, 9), (16, 24))
    5:((0, 10), (1, 21), (4, 24), (6, 16), (9, 19), (15, 25))
    6:((1, 19), (4, 16), (6, 24), (9, 21))
    7:((0, 16), (1, 15), (9, 25), (10, 24))
    8:((0, 16), (1, 15), (9, 25), (10, 24))
    9:((1, 19), (4, 16), (6, 24), (9, 21))
    10:((0, 10), (1, 21), (4, 24), (6, 16), (9, 19), (15, 25))
    11:((1, 9), (16, 24))
    12:((0, 6), (0, 24), (1, 25), (4, 10), (9, 15), (10, 16), (15, 21), (19, 25))
    13:((0, 4), (6, 10), (15, 19), (21, 25))
    14:((4, 6), (19, 21))
    15:((0,), (1,), (4,), (6,), (9,), (10,), (15,), (16,), (19,), (21,), (24,), (25,))
    16:((4, 6), (19, 21))
    17:((0, 4), (6, 10), (15, 19), (21, 25))
    18:((0, 6), (0, 24), (1, 25), (4, 10), (9, 15), (10, 16), (15, 21), (19, 25))
    19:((1, 9), (16, 24))
    20:((0, 10), (1, 21), (4, 24), (6, 16), (9, 19), (15, 25))
    21:((1, 19), (4, 16), (6, 24), (9, 21))
    22:((0, 16), (1, 15), (9, 25), (10, 24))
    23:((0, 16), (1, 15), (9, 25), (10, 24))
    24:((1, 19), (4, 16), (6, 24), (9, 21))
    25:((0, 10), (1, 21), (4, 24), (6, 16), (9, 19), (15, 25))
    26:((1, 9), (16, 24))
    27:((0, 6), (0, 24), (1, 25), (4, 10), (9, 15), (10, 16), (15, 21), (19, 25))
    28:((0, 4), (6, 10), (15, 19), (21, 25))
    29:((4, 6), (19, 21))








py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =2
    0:((0,), (1,))
    1:((0,), (1,))

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =3
    0:((0,), (1,))
    1:((0, 1),)
    2:((0, 1),)

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =7
    0:((0,), (1,), (2,), (4,))
    1:((0, 2), (2, 4))
    2:((0, 4), (1, 4))
    3:((0, 1), (1, 2))
    4:((0, 1), (1, 2))
    5:((0, 4), (1, 4))
    6:((0, 2), (2, 4))
%7: 1 -> 2,4 -> 1,2,4 -> 1,2,4



py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =11
    0:((0,), (1,), (3,), (4,), (5,), (9,))
    1:((0, 9), (1, 3), (3, 5))
    2:((0, 4), (1, 5), (5, 9))
    3:((0, 5), (3, 9), (4, 9))
    4:((0, 3), (1, 4), (1, 9))
    5:((0, 1), (3, 4), (4, 5))
    6:((0, 1), (3, 4), (4, 5))
    7:((0, 3), (1, 4), (1, 9))
    8:((0, 5), (3, 9), (4, 9))
    9:((0, 4), (1, 5), (5, 9))
    10:((0, 9), (1, 3), (3, 5))
%11: 1 -> !3 -> !9 -> !5 -> !4 -> !1


py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =13
    0:((0,), (1,), (3,), (4,), (9,), (10,), (12,))
    1:((1, 3), (1, 12), (10, 12))
    2:((0, 4), (0, 9), (1, 10), (3, 12))
    3:((3, 9), (3, 10), (4, 10))
    4:((1, 9), (4, 9), (4, 12))
    5:((0, 3), (0, 10), (1, 4), (9, 12))
    6:((0, 1), (0, 12), (3, 4), (9, 10))
    7:((0, 1), (0, 12), (3, 4), (9, 10))
    8:((0, 3), (0, 10), (1, 4), (9, 12))
    9:((1, 9), (4, 9), (4, 12))
    10:((3, 9), (3, 10), (4, 10))
    11:((0, 4), (0, 9), (1, 10), (3, 12))
    12:((1, 3), (1, 12), (10, 12))
%13: 1,12 -> 1,12
%13: 3,10 -> 3,10
%13: 4,9 -> 4,9


py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =17
    0:((0,), (1,), (2,), (4,), (8,), (9,), (13,), (15,), (16,))
    1:((0, 2), (0, 15), (1, 16), (2, 4), (13, 15))
    2:((0, 4), (0, 13), (2, 15), (4, 8), (9, 13))
    3:((2, 8), (2, 13), (4, 15), (9, 15))
    4:((0, 8), (0, 9), (1, 9), (4, 13), (8, 16))
    5:((1, 8), (2, 9), (8, 15), (9, 16))
    6:((1, 13), (4, 9), (4, 16), (8, 13))
    7:((1, 4), (1, 15), (2, 16), (13, 16))
    8:((0, 1), (0, 16), (1, 2), (8, 9), (15, 16))
    9:((0, 1), (0, 16), (1, 2), (8, 9), (15, 16))
    10:((1, 4), (1, 15), (2, 16), (13, 16))
    11:((1, 13), (4, 9), (4, 16), (8, 13))
    12:((1, 8), (2, 9), (8, 15), (9, 16))
    13:((0, 8), (0, 9), (1, 9), (4, 13), (8, 16))
    14:((2, 8), (2, 13), (4, 15), (9, 15))
    15:((0, 4), (0, 13), (2, 15), (4, 8), (9, 13))
    16:((0, 2), (0, 15), (1, 16), (2, 4), (13, 15))
%17: 1,16 -> 1,16
%17: 2,15 -> 2,15
%17: 4,13 -> 4,13
%17: 8,9 -> 8,9












































]]

[[
随机构造果然不行
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜甲型平方累聚型多项式求值扌  +to_show6trivial_factor  ='(-1+2**67)' ='[(range(j, j+40), range(j, j+2**8)) for j in range(1,5)]'
    trivial factor: (147573952589676412927, 147573952589676412927, (0, range(1, 41)), (0, 1), (78066429901769270384, 0))
    False
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜甲型平方累聚型多项式求值扌  +to_show6trivial_factor  ='(-1+2**67)' ='[(range(j, j+60), range(j, j+2**10)) for j in range(5,29)]'
    False
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜甲型平方累聚型多项式求值扌  +to_show6trivial_factor  ='(-1+2**67)' ='[(range(j, j+600), range(j, j+2**7)) for j in range(5,29)]'
    False

++kw:to_square_us
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜甲型平方累聚型多项式求值扌 +to_square_us +to_show6trivial_factor  ='(-1+2**67)' ='[(range(j+600, j+650), range(j, j+2**7)) for j in range(29,40)]'
    False

reversed
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜甲型平方累聚型多项式求值扌 +to_square_us +to_show6trivial_factor  ='(-1+2**67)' ='[(range(j+600, j+650)[::-1], range(j, j+2**7)) for j in range(29,40)]'
    False
]]
[[
===
平方和的乘积依然是平方和:
    [det([a,b;-b,a]) == (a**2+b**2)]
    [[a,b;-b,a]*[c,d;-d,c] == [(a*c-b*d),(a*d+b*c);(a*d+b*c),(a*c-b*d)]]
    [(a**2+b**2)*(c**2+d**2) == ((a*c-b*d)**2+(a*d+b*c)**2)]
===
见下面:[碰撞规模纟非零 ~ (p/8)]
求得 一些 平方碰撞:
from seed.math.GaussInteger import find_Gauss_integer_factor_coeffs_of_4k1_prime, find_sqrt_neg1_of_4k1_prime
[p::prime][p%4==1][n%p=!=0][?k -> [is_prime_(4*k*n+p)]]:
    [(odd1, even1):=find_Gauss_integer_factor_coeffs_of_4k1_prime(p)]
    [(odd2, even2):=find_Gauss_integer_factor_coeffs_of_4k1_prime(4*k*n+p)]
    [(odd1**2 + even1**2) =[%n]= p =[%n]= (odd2**2 + even2**2)]
    [(odd1**2 + even1**2) =[%n]= (odd2**2 + even2**2)]
[d:=((1+2*a)**2+(2*b)**2)][gcd(n,d) == 1][?k -> [is_prime_(4*k*n+d)]]:
    [d%4==1]
    [(4*k*n+d)%4==1]
    [(odd, even):=find_Gauss_integer_factor_coeffs_of_4k1_prime(4*k*n+d)]
    [((1+2*a)**2+(2*b)**2) =[%n]= (odd**2 + even**2)]
[a*b=[%n]=c*d]:
    [4*a*b == ((a+b)**2-(a-b)**2)]
    [4*c*d == ((c+d)**2-(c-d)**2)]
    [((a+b)**2-(a-b)**2) =[%n]= ((c+d)**2-(c-d)**2)]
    [((a+b)**2+(c-d)**2) =[%n]= ((c+d)**2+(a-b)**2)]
[gcd(n,a*b*c) == 1]:
    [d := a*b*c**-1 %n]
    [a*b=[%n]=c*d]
    [((a+b)**2+(c-d)**2) =[%n]= ((c+d)**2+(a-b)**2)]
    [((a+b)**2+(c-d)**2) =[%n]= ((c+d)**2+(a-b)**2) =[%n]= (a**2+b**2+c**2+d**2)]
定点求平方碰撞:
    上面p版就已经是特化版定点求平方碰撞
    考虑是否可以凑巧出现[d==a**2+b**2==a**2+c**2]
[n%2==1][gcd(n,d) == 1]:
    [(t*n+d)%4==1]:
        [t*n%4 == (1-d)]
        [t%4 == n**-1%4*(1-d)]
    [t := n**-1%4 * (1-d) %4]
    [(t*n+d)%4==1]

    !! [gcd(n,d) == 1]
    ?k :=> [is_prime_(4*k*n+t*n+d)]
    [(4*k*n+t*n+d)%4==1]
    [(odd, even):=find_Gauss_integer_factor_coeffs_of_4k1_prime(4*k*n+t*n+d)]
    [d =[%n]= (odd**2 + even**2)]
    vs: binary quadratic form
        [n == a*x**2 + b*x*y + c*y**2]
        [k*n == x**2 + y**2 -d]
        TODO

[n%2==1][?(a,b) :=> [(a**2+b**2) =[%n]= -1]]:
    # 根据上面算法，容易找到[p =[%(4*n)]= (-1+2*n)]，从而得到(a,b)
    #   但感觉不合理？其实搞错了:不是[a**2==-1]而是[a**2+b**2==-1]

[w == u**2 + v**2][u == a**2 + b**2][v == c**2 + d**2]:
    [2*w == (a**2+b**2+c**2+d**2) =?= ((a+b)**2+(c-d)**2)]
    [a*b=[%n]=c*d]
        [2*w == ((a+b)**2+(c-d)**2)]
反之:
[w == u**2 + v**2][c:=(v+d)%n][gcd(n,u*v*d*c) == 1]:
    [D := (u**2-4*c*d)][欤平方剩余扌(n;D)]:
        !! [欤平方剩余扌(n;D)]
        ?a,b :=> [u=[%n]=a+b][c*d=[%n]=a*b]
        [u=[%n]=a+b][v=[%n]=c-d]
        [w == ((a+b)**2+(c-d)**2)]
        [w == (a**2+b**2+c**2+d**2)]

<<==:
]]
[[
尝试二:构造:甲型平方累聚型多根多项式@(ZZ%p)
!! [碰撞规模纟非零{p} ~ (p/8)]
=> 可以考虑在(ZZ%p)里构造 甲型平方累聚型多根多项式
    复合到(ZZ%(p*q))
    [f(n)%(p*q) == 0][f(n)%p =!= 0][f(n)%q =!= 0]:
        _L
        不可能
    [f(n)%p == 0][f(n)%q == 0]:
        不行
<<==:
猜想牜均匀分布牜碰撞规模纟平方剩余牜非零:
    e others/数学/我的猜想.txt
猜想:[(ZZ%p) => [(碰撞规模纟平方剩余牜非零-碰撞规模纟平方非剩余)<-{0,1}]]
    这个规模约(p/8)...
猜想:[(ZZ%p) => [碰撞规模纟非零{p%2==1} == (p+4+1*(-1)**[p%4==1]+[p%8<-{1,7}]*-4*(-1)**欤平方剩余)///8]]
    [H:=(p-1)///2] #half
    [T:=C(2+H;2)[#aa>=bb>=0#] = (H+2)*(H+1)///2] #total
    [p%4 == 1]:
        !! [0 --> aa + (-aa)]
        [碰撞规模 ~ (T-(1+H/2)[#aa>=bb==-aa>=0#])/(p-1) == ((H+2)*(H+1)/2 - (1+H/2))/(2*H) == (H+2)/4 == (p+3)/8]
        [碰撞规模 ~ (p+3)/8]
        [p%8 == 5]:
            猜想:[碰撞规模纟非零 == (p+3)///8]
        [p%8 == 1]:
            猜想:[碰撞规模纟平方剩余牜非零 == (p+7)///8]
            猜想:[碰撞规模纟平方非剩余 == (p-1)///8]

        猜想:[碰撞规模纟非零{p%4==1} == (p+3+[p%8==1]*-4*(-1)**欤平方剩余)///8]

    [p%4 == 3]:
        !! [aa=!=0] => [0 -!-> aa + (-aa)]
        [碰撞规模 ~ (T-1)/(p-1) == ((H+2)*(H+1)/2 - 1)/(2*H) == (H+3)/4 == (p+5)/8]
        [碰撞规模 ~ (p+5)/8]
        [p%8 == 3]:
            猜想:[碰撞规模纟非零 == (p+5)///8]
        [p%8 == 7]:
            猜想:[碰撞规模纟平方剩余牜非零 == (p+9)///8]
            猜想:[碰撞规模纟平方非剩余 == (p+1)///8]
        猜想:[碰撞规模纟非零{p%4==3} == (p+5+[p%8==7]*-4*(-1)**欤平方剩余)///8]
    猜想:[碰撞规模纟非零{p%2==1} == (p+4+1*(-1)**[p%4==1]+[p%8<-{1,7}]*-4*(-1)**欤平方剩余)///8]
===
定理:
(ZZ%p) => 应当分成3+3类:
    * 0:
        * [p==2]:
            (2, [(0, 0), (1, 1)])
        * [p%4==1]:
            ((p+1)///2, [(0, 0), (p-aa, aa)...])
        * [p%4==3]:
            (1, [(0, 0)])
    * 平方剩余牜非零aa:
        quadratic residue
        [aa == bb + cc]
        [gg*aa == gg*bb + gg*cc]
            => 此类 相同规模
        [bb <- {aa, ...}]
        [cc <- {0, ...}]
    * 平方非剩余h:
        quadratic nonresidue
        [h == bb + cc]
        [gg*h == gg*bb + gg*cc]
            => 此类 相同规模
        [bb =!= h]
        [cc =!= 0]
===
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =2
    (2, [(0, 0), (1, 1)])
    (1, [(1, 0)])
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =3
    (1, [(0, 0)])
    (1, [(1, 0)])
    (1, [(1, 1)])

py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =5
    (2, [(0, 0), (4, 1)])
    (1, [(1, 0)])
    (1, [(1, 1)])
    (1, [(4, 4)])
    (1, [(4, 0)])


py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =7
    (1, [(0, 0)])
    (2, [(1, 0), (4, 4)])
    (2, [(1, 1), (2, 0)])
    (1, [(2, 1)])
    (2, [(2, 2), (4, 0)])
    (1, [(4, 1)])
    (1, [(4, 2)])

py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =11
    (1, [(0, 0)])
    (2, [(1, 0), (9, 3)])
    (2, [(1, 1), (9, 4)])
    (2, [(3, 0), (9, 5)])
    (2, [(3, 1), (4, 0)])
    (2, [(4, 1), (5, 0)])
    (2, [(3, 3), (5, 1)])
    (2, [(4, 3), (9, 9)])
    (2, [(4, 4), (5, 3)])
    (2, [(5, 4), (9, 0)])
    (2, [(5, 5), (9, 1)])

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =13
    0:(4, [(0, 0), (9, 4), (10, 3), (12, 1)])
    1:(2, [(1, 0), (10, 4)])
    2:(2, [(1, 1), (12, 3)])
    3:(2, [(3, 0), (12, 4)])
    4:(2, [(3, 1), (4, 0)])
    5:(2, [(4, 1), (9, 9)])
    6:(2, [(3, 3), (10, 9)])
    7:(2, [(4, 3), (10, 10)])
    8:(2, [(4, 4), (12, 9)])
    9:(2, [(9, 0), (12, 10)])
    10:(2, [(9, 1), (10, 0)])
    11:(2, [(10, 1), (12, 12)])
    12:(2, [(9, 3), (12, 0)])


py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =17
    0:(5, [(0, 0), (9, 8), (13, 4), (15, 2), (16, 1)])
    1:(3, [(1, 0), (9, 9), (16, 2)])
    2:(3, [(1, 1), (2, 0), (15, 4)])
    3:(2, [(2, 1), (16, 4)])
    4:(3, [(2, 2), (4, 0), (13, 8)])
    5:(2, [(4, 1), (13, 9)])
    6:(2, [(4, 2), (15, 8)])
    7:(2, [(15, 9), (16, 8)])
    8:(3, [(4, 4), (8, 0), (16, 9)])
    9:(3, [(8, 1), (9, 0), (13, 13)])
    10:(2, [(8, 2), (9, 1)])
    11:(2, [(9, 2), (15, 13)])
    12:(2, [(8, 4), (16, 13)])
    13:(3, [(9, 4), (13, 0), (15, 15)])
    14:(2, [(13, 1), (16, 15)])
    15:(3, [(13, 2), (15, 0), (16, 16)])
    16:(3, [(8, 8), (15, 1), (16, 0)])


py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =19
    0:(1, [(0, 0)])
    1:(3, [(1, 0), (11, 9), (16, 4)])
    2:(3, [(1, 1), (16, 5), (17, 4)])
    3:(3, [(11, 11), (16, 6), (17, 5)])
    4:(3, [(4, 0), (16, 7), (17, 6)])
    5:(3, [(4, 1), (5, 0), (17, 7)])
    6:(3, [(5, 1), (6, 0), (16, 9)])
    7:(3, [(6, 1), (7, 0), (17, 9)])
    8:(3, [(4, 4), (7, 1), (16, 11)])
    9:(3, [(5, 4), (9, 0), (17, 11)])
    10:(3, [(5, 5), (6, 4), (9, 1)])
    11:(3, [(6, 5), (7, 4), (11, 0)])
    12:(3, [(6, 6), (7, 5), (11, 1)])
    13:(3, [(7, 6), (9, 4), (16, 16)])
    14:(3, [(7, 7), (9, 5), (17, 16)])
    15:(3, [(9, 6), (11, 4), (17, 17)])
    16:(3, [(9, 7), (11, 5), (16, 0)])
    17:(3, [(11, 6), (16, 1), (17, 0)])
    18:(3, [(9, 9), (11, 7), (17, 1)])

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =23
    0:(1, [(0, 0)])
    1:(4, [(1, 0), (12, 12), (16, 8), (18, 6)])
    2:(4, [(1, 1), (2, 0), (13, 12), (16, 9)])
    3:(4, [(2, 1), (3, 0), (13, 13), (18, 8)])
    4:(4, [(2, 2), (3, 1), (4, 0), (18, 9)])
    5:(3, [(3, 2), (4, 1), (16, 12)])
    6:(4, [(3, 3), (4, 2), (6, 0), (16, 13)])
    7:(3, [(4, 3), (6, 1), (18, 12)])
    8:(4, [(4, 4), (6, 2), (8, 0), (18, 13)])
    9:(4, [(6, 3), (8, 1), (9, 0), (16, 16)])
    10:(3, [(6, 4), (8, 2), (9, 1)])
    11:(3, [(8, 3), (9, 2), (18, 16)])
    12:(4, [(6, 6), (8, 4), (9, 3), (12, 0)])
    13:(4, [(9, 4), (12, 1), (13, 0), (18, 18)])
    14:(3, [(8, 6), (12, 2), (13, 1)])
    15:(3, [(9, 6), (12, 3), (13, 2)])
    16:(4, [(8, 8), (12, 4), (13, 3), (16, 0)])
    17:(3, [(9, 8), (13, 4), (16, 1)])
    18:(4, [(9, 9), (12, 6), (16, 2), (18, 0)])
    19:(3, [(13, 6), (16, 3), (18, 1)])
    20:(3, [(12, 8), (16, 4), (18, 2)])
    21:(3, [(12, 9), (13, 8), (18, 3)])
    22:(3, [(13, 9), (16, 6), (18, 4)])

































































































===
]]
[[
乙型:
整数分解牜乙型平方累聚型多项式求值牜原理错扌
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜乙型平方累聚型多项式求值牜原理错扌 ='(-1+2**67)' =20 =3 =5
    (False, 1)
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜乙型平方累聚型多项式求值牜原理错扌 ='(-1+2**67)' =60 =3 =5
    (False, 1)
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜乙型平方累聚型多项式求值牜原理错扌 ='(-1+2**67)' =67 =3 =5
    (False, 1)
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜乙型平方累聚型多项式求值牜原理错扌 ='(-1+2**67)' =6 =3 =9
    (False, 1)
        bug???
            是，但是原理性错误，见上面

]]











py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @f
from script.整数分解牜允许快速求值的多根多项式 import *
]]]'''#'''
__all__ = r'''
'''.split()#'''
__all__
___begin_mark_of_excluded_global_names__0___ = ...
#.#################################
from seed.helper.lazy_import__func7context import mk_ctx4lazy_import4funcs_ #NOTE:not support "as"
with mk_ctx4lazy_import4funcs_(__name__):
    from seed.tiny_.check import check_type_is, check_int_ge, check_callable
    from math import gcd
#.    from itertools import islice
#.#################################
___end_mark_of_excluded_global_names__0___ = ...

def 制表冫平方和碰撞分布乊剩余环扌(M, /, *, to_zip=False):
    u2sqrts = 制表冫平方根乊剩余环扌(M)
    sqs = [u for u in range(M) if u2sqrts[u]]
    u2pts = [[] for u in range(M)]
    for aa in sqs:
        for bb in sqs:
            if bb > aa:break
            # [aa >= bb]
            c = (aa+bb)%M
            u2pts[c].append((aa,bb))
    u2num_pts = list(map(len, u2pts))
    r = (u2num_pts, u2pts)
    return r if not to_zip else list(zip(*r))

def 制表冫平方根乊剩余环扌(M, /):
    check_int_ge(1, M)
    u2sqrts = [[] for u in range(M)]
    for rt in range(M):
        u = pow(rt, 2, M)
        u2sqrts[u].append(rt)
    u2sqrts = tuple(map(tuple, u2sqrts))
    return u2sqrts
def 制表冫平方剩余中点乊剩余环扌(M, /):
    u2sqrts = 制表冫平方根乊剩余环扌(M)
    #for b, a in product(range(M), repeat=2):
    b2cds = []
    for b in range(M):
        cds6b = set()
        for a in range(M):
            c = (a-b)%M
            d = (a+b)%M
            if not (u2sqrts[c] and u2sqrts[d]):
                continue
            #print(f'{b} -> {c},{d}')
            cds6b.add(tuple(sorted({c,d})))
        cds6b
        b2cds.append(tuple(sorted(cds6b)))
    return b2cds


def 甲型平方累聚型多项式求值乊整数模扌(n, us, x, /):
    x %= n
    y = 1 if x == 0 else x
    for u in us:
        x = (x**2 -u) %n
        y = y*x %n
    return (x, y)
def 整数分解牜甲型平方累聚型多项式求值扌(n, paramss_or_mk_paramss_, /, *args4mk_paramss_, to_show6trivial_factor=False, to_square_us=False):
    check_int_ge(1, n)
    if callable(paramss_or_mk_paramss_):
        mk_paramss_ = paramss_or_mk_paramss_
    elif type(paramss_or_mk_paramss_) is str:
        nm4mk_paramss_ = paramss_or_mk_paramss_
        mk_paramss_ = globals()[nm4mk_paramss_]
        check_callable(mk_paramss_)
    else:
        paramss = iter(paramss_or_mk_paramss_)
        if args4mk_paramss_:raise TypeError(us, args4mk_paramss_)
        mk_paramss_ = iter
        args4mk_paramss_ = (paramss,)
    paramss = iter(mk_paramss_(*args4mk_paramss_))
    for j4us, params in enumerate(paramss):
        (us, xs) = params
        assert len(us)
        for j4x, x0 in enumerate(xs):
            it = iter(us)
            if to_square_us:
                it = (u**2 for u in us)
            (r, y) = 甲型平方累聚型多项式求值乊整数模扌(n, it, x0)
            g = gcd(n, y)
            if 1 == g: continue
            if not g == n:
                assert 1 < g < n
                return (n, g, (j4us, us), (j4x, x0), (r, y))
            assert g == n
            if to_show6trivial_factor:
                print('trivial factor:', (n, g, (j4us, us), (j4x, x0), (r, y)))
            g = gcd(n, r)
            if 1 == g: continue
            if not g == n:
                assert 1 < g < n
                return (n, g, (j4us, us), (j4x, x0), (r, y))
            assert g == n
            continue
    return False

def 整数分解牜乙型平方累聚型多项式求值牜原理错扌(n, sz, c, x0, /):
    check_int_ge(1, n)
    check_int_ge(1, sz)
    x = x0%n
    c = c%n
    inv4c = pow(c, -1, n)
    a = b = 1
    # [X:=(x**2+a*b)]
    # [A:=((a+b)*x)]
    # [B:=((a/c+b*c)*x)]
    for _ in range(sz):
        xx = pow(x,2,n)
        ab = a*b %n
        X = (xx+ab) %n
        A = (a+b)*x %n
        B = ((a*inv4c+b*c)%n)*x %n
        C = pow(c,2,n)
        inv4C = pow(inv4c,2,n)
        x,a,b,c,inv4c = (X,A,B,C,inv4C)
    x,a,b,c,inv4c
    g = gcd(n, (x-a)*(x-b))
    return (1<g<n, g)


__all__
from script.整数分解牜允许快速求值的多根多项式 import *
