#__all__:goto
#TODO:goto
r'''[[[
e script/整数分解牜允许快速求值的多根多项式.py
平方累聚型多根多项式:甲型、乙型
尝试一:构造:甲型平方累聚型多根多项式@ZZ
尝试二:构造:甲型平方累聚型多根多项式@(ZZ%p)
尝试三:构造:乙型平方累聚型多根多项式@ZZ
公式牜上升期牜自由变量讠高层根:goto

script.整数分解牜允许快速求值的多根多项式
py -m nn_ns.app.debug_cmd   script.整数分解牜允许快速求值的多根多项式 -x # -off_defs
py -m nn_ns.app.doctest_cmd script.整数分解牜允许快速求值的多根多项式:__doc__ -ht # -ff -df
#######

[[
尝试三:构造:乙型平方累聚型多根多项式@ZZ
乙型:(...((((a+b)*x)**2 -(x**2+ab)**2)**2-(???)**2)...)
    (...(((x+/-a)*(x+/-b))**2-(???)**2)...)
    [X:=(x**2-b**2)]
    [A:=(u*x**2+v*x+w)]
    [B:=((x**2-a**2)-A)]
    [(A+B)==(x**2-a**2)]
    (...(((A+B)*X)**2-(???)**2)...)
    (...(((A+B)*X)**2-(X**2+A*B)**2)...)
    (...(((X+/-A)*(X+/-B))**2)...)
    (...((((x**2-b**2)+/-(u*x**2+v*x+w))*((x**2-b**2)+/-((x**2-a**2)-A)))**2)...)
[(x-a)*(x-b) == (x**2+a*b) -(a+b)*x]
[(x+a)*(x+b) == (x**2+a*b) +(a+b)*x]
[(x**2-a**2)*(x**2-b**2) == ((x**2+a*b)**2 -((a+b)*x)**2)]
[((x**2+a*b)**2 -((a+b)*x)**2) ...]
[X:=(x**2+a*b)]
[A:=((a+b)*x)]
[B:=((a/c+b*c)*x)]
[(X**2 -A**2)*(X**2 -B**2) ...]
[(X**2-A**2)*(X**2-B**2) == ((X**2+A*B)**2 -((A+B)*X)**2)]
    感觉可以！
    但是由于x参与参数构造，这个多项式既不恒等，而又计算费时
        违背『允许快速求值』的原则！
            也许没这么糟
    由于(a*b)恒等，[gcd(n,a*b)==1] 所有根与n互素！不过还行，反正求gcd(n,x-b*c*C...)
[XX:=(X**2+A*B)]
[AA:=((A+B)*X)]
[BB:=((A/C+B*C)*X)]
==>>:
[AA==((A+B)*X) == ((a+b)*x+(a/c+b*c)*x)*(x**2+a*b)]
[BB==((A/C+B*C)*X) == ((a+b)*x/C+(a/c+b*c)*x*C)*(x**2+a*b) == ((a/C+b/C)*x+(a/c*C+b*c*C)*x)*(x**2+a*b) =]
    病蛊:[(a/C)*(b/C) =!= (a*b)]
        (a/C+b/C)*x显然无效！
        bug:here
[(a/C-uuu)*(b/C+uuu) == (a*b)]:
    [(a-C*uuu)*(b+C*uuu) == C*(a*b)]
    [((C-1)*a*b -(a-b)*C*uuu +(C*uuu)**2)) == 0]
    [sqrt(((a-b)*C)**2 -4*C**2*(C-1)*a*b)
    == C*sqrt((a-b)**2 -4*(C-1)*a*b)
    == C*sqrt((a+b)**2 -4*C*a*b)
    == C*Du
    ]
    [Du**2 == ((a+b)**2 -4*C*a*b)]
    [C == ((a+b)**2 -Du**2)/(4*a*b)]
    [uuu
    == ((a-b)*C +/- C*Du)/(4*C**2)
    == ((a-b) +/- Du)/(4*C)
    == (a*b)*((a-b) +/- Du)/((a+b)**2 -Du**2)
    ]
    [uuu == (a*b)*((a-b) +/- Du)/((a+b)**2 -Du**2)]
    [C*(4*a*b) == ((a+b)**2 -Du**2)]
[(a/c*C-vvv)*(b/c*C+vvv) == (a*b)]:
    11111:
        [c/C == ((a+b)**2 -Dv**2)/(4*a*b)]
        [c == C*((a+b)**2 -Dv**2)/(4*a*b)]
        [c == ((a+b)**2 -Du**2)/(4*a*b)*((a+b)**2 -Dv**2)/(4*a*b)]
        这样不行:需要根据后面的C{许多不同值}计算c

    22222:
        [C*(4*a*b) == ((a/c+b*c)**2 -_Dv**2)]
        [((a+b)**2 -Du**2) == ((a/c+b*c)**2 -_Dv**2)]
        [((a+b)**2 -(a/c+b*c)**2) == (Du**2 -_Dv**2)]
        [((a+b) +/- (a/c+b*c)) == (Du +/- _Dv)]
        [(Du+_Dv) == t*((a+b) + (a/c+b*c))]
        [(Du-_Dv) == 1/t*((a+b) - (a/c+b*c))]
        自由度1，后续还有许多更高层的C作用于此，还是得全盘考虑，全盘待定系数
            既然如此，那就重新考量 甲型


整数分解牜乙型平方累聚型多项式求值牜原理错扌:goto

[p%4==1]:
    ?i => [i**2 %p == p-1]
    [(x**2**k - y**2**k)
    == (x**2**(k-1) - y**2**(k-1))*(x**2**(k-1) - i**2*y**2**(k-1))
    == (x**2**(k-1) - y**2**(k-1))*(x**2**(k-2) - i*y**2**(k-2))*(x**2**(k-2) + i*y**2**(k-2))
    ]
    => 费马数 其实很容易分解？
    [n==1+2**2**e][n%p == 0]:
        [p%2**(2+e) == 1]
        [try:gcd(n, -1+x**2**(2+e))]
            rho:...
            其实已有相应的 尸方法
]]

[[
尝试一:构造:甲型平方累聚型多根多项式@ZZ
甲型:(...(((x**2-u0)**2-u1)**2-u2)...)
[(x-a)*(x-b) == ((x-c)**2-d**2)]
[-a == -c-d][-b == -c+d]
[c == (a+b)/2]
[d == (a-b)/2]
[(x-a)*(x-b) == ((x-((a+b)/2))**2-((a-b)/2)**2)]
[(x-u)*(x-v) == ((x-((u+v)/2))**2-((u-v)/2)**2)]
let [(a+b)/2 == (u+v)/2]
    [X := (x-((a+b)/2))**2]
    [A := ((a-b)/2)**2]
    [B := ((u-v)/2)**2]

[f([a,b,u,v];x) == (x-a)*(x-b)*(x-u)*(x-v) == (X-A)*(X-B) == ((X-((A+B)/2))**2-((A-B)/2)**2)]
[f([a,b,u,v];x) == ((X-((A+B)/2))**2-((A-B)/2)**2)]
[f([p,q,s,t];x) == ((X-((A+B)/2))**2-((U-V)/2)**2)]
let [(A+B)/2 == (U+V)/2]
    [X == (x-((p+q)/2))**2]
        ie:[(p+q)/2 == (a+b)/2]
let [(p+q)/2 == (s+t)/2]
    [U := ((p-q)/2)**2]
    [V := ((s-t)/2)**2]

[(a+b) == (u+v)]
[ua := (u-a)]
[u == (a+ua)]
[v == (b-ua)]
[(u-v) == (a-b)+2*ua]
[(u-v)/2 == (a-b)/2+ua]
[(x-u)*(x-v) == (X-B) == (X-((a-b)/2+ua)**2) == ((x-c)**2 -(d+ua)**2)]
[(x-u)*(x-v) == ((x-c)**2 -(d+ua)**2)]
[pa := (p-a)]
[sa := (s-a)]
[aa := (a-a)]
[(x-p)*(x-q) == ((x-c)**2 -(d+pa)**2)]
[(x-s)*(x-t) == ((x-c)**2 -(d+sa)**2)]
[(x-a)*(x-b) == ((x-c)**2-(d+aa)**2)]
[(x-u)*(x-v) == ((x-c)**2 -(d+ua)**2)]


let [C := ((A+B)/2)]
    [D := ((A-B)/2)]
[AA := (A-A)]
[UA := (U-A)]
[UA == ((p-q)/2)**2 -((a-b)/2)**2]
!! [f([a,b,u,v];x) == ((X-((A+B)/2))**2-((A-B)/2)**2)]
!! [f([p,q,s,t];x) == ((X-((A+B)/2))**2-((U-V)/2)**2)]
[f([a,b,u,v];x) == ((X-C)**2-(D+AA)**2)]
[f([p,q,s,t];x) == ((X-C)**2-(D+UA)**2)]

!! [(A+B) == (U+V)]
!! [A := ((a-b)/2)**2]
!! [B := ((u-v)/2)**2]
!! [U := ((p-q)/2)**2]
!! [V := ((s-t)/2)**2]
[((a-b)/2)**2 + ((u-v)/2)**2 == ((p-q)/2)**2 + ((s-t)/2)**2]
[(d+aa)**2 + (d+ua)**2 == (d+pa)**2 + (d+sa)**2]
let [M := (d+aa)**2 + (d+ua)**2]
    显然，为了凑够大量的四根多项式，要求M包含许多不同的(1+4*k)型素数，M增长速度超快，好在用于(ZZ%n)也无妨...
let [ps := [p for p in primes if p%4==1]]
    [M == II(ps[:L])]
    [ps[j] == odds[j]**2 + evens[j]**2]
    [(d+xa)**2 + (d+ya)**2 == M]
    [gxy := gcd((d+xa)**2, (d+ya)**2)]
[M%gxy == 0]
[gxy == 1] # if M squarefree
[M == (d+xa)**2 - 1j**2*(d+ya)**2 == norm_((d+xa) -1j*(d+ya)) == norm_(II[(odds[j] + g[j]*1j*evens[j]) | [j:<-[0..<L]]])]
    where [g[j] :<- {+1,-1}]
    这样一来，感觉要无限增长会有难度...

乙型 重回 甲型:全盘待定系数:
    于 整数环ZZ，确实难，但是 考虑 有理数域 或者 整数剩余环(ZZ%n)，则 容易些
    但由于不通用，还是得 每个n重算一次
        ？有理数域？可能 非常大
[(d+aa)**2 + (d+ua)**2 == (d+pa)**2 + (d+sa)**2]
[(d+aa)**2 - (d+sa)**2 == (d+pa)**2 - (d+ua)**2]
[(aa-sa)*(2*d+aa+sa) == (pa-ua)*(2*d+pa+ua)]
? t{pa,sa} =>
    [(pa-ua) == t{pa,sa}*(aa-sa)]
    [t{pa,sa}*(2*d+pa+ua) == (2*d+aa+sa)]
[tps:=t{pa,sa}] #待定系数
[pua:=(pa-ua)]
[pa == pua+ua]
[pua == tps*(aa-sa)]
[tps*(2*d+pua+2*ua) == (2*d+aa+sa)]
[tps*(2*d+tps*(aa-sa)+2*ua) == (2*d+aa+sa)]
[sa == (tps*(tps*aa+2*(d+ua)) -(2*d+aa)) / (1+tps_tps)]

最低层:
    前四个只需:[(a+b) == (u+v)]
        # ua:(a,b) --> (u,v)
    后面1个待定系数 对应 4个根
        # tps:(aa,ua) --> (pa,sa)
        # tps:(a,b,u,v) --> (p,q,s,t)
更高层 还有 待定系数:
    前四个只需:[(A+B) == (U+V)]
        由低一层的tps校准
    后面1个待定系数 对应 4个根 # tPS:(A,B,U,V) --> (P,Q,S,T)
        这里 待定系数 共有:
            #最低层 根:8+8=16个
            ua型:4+4=8个 # 其中[aa===0]
            tps型:2个#低层 => 非首ua型3个
            tPS型:1个#高层 => UA型 # 与低层冲突 或者说 联立约束
        晕死...理不清好乱

系统化命名:
    『0;』-表示 层次高度
    ua --> dr[0;...]
    a,b,... --> r[0;...]
    tps --> t[0;...]

常量:c
    [@k. [c[0] == c == (r[0;0+2*k]+r[0;1+2*k])/2]]
dr[0;k] -> (r[0;0+2*k], r[0;1+2*k])
    !! [(a+b) == (u+v)]
    [(r[0;0+2*k]+r[0;1+2*k]) == (a+b) == 2*c#头部常量]
    [r[0;0+2*k] == c+dr[0;k]]
    [r[0;1+2*k] == c-dr[0;k]]
    [dr[0;k] == (r[0;0+2*k]-r[0;1+2*k])/2]
    [(x-r[0;0+2*k])*(x-r[0;1+2*k])
    == (x-(r0+r1)/2)**2 -((r0-r1)/2)**2
    == (x-c)**2 -dr[0;k]**2
    ]
    [(x-r[0;0+2*k])*(x-r[0;1+2*k]) == ((x-c)**2 -dr[0;k]**2)]
    [r[1;k] == dr[0;k]**2]
    ==>>:
    [@k. [c[h] == (r[h;0+2*k]+r[h;1+2*k])/2]]
        # 定义:c[]
        # 2**(ht-1-h)约束每c[h]
    [dr[h;k] == (r[h;0+2*k]-r[h;1+2*k])/2]
        # 定义:dr[]
        # 1约束每dr
    [r[1+h;k] == dr[h;k]**2]
        # 定义:非底层r[]
        # 1约束每 非底层r
    ==>>:
    [r[h;0+2*k] == c[h]+dr[h;k]]
    [r[h;1+2*k] == c[h]-dr[h;k]]
t[0;k] -> (dr[0;0+4*k], dr[0;1+4*k]) -> (dr[0;2+4*k], dr[0;3+4*k])
    [(r[1+h;0+2*k]+r[1+h;1+2*k]) == 2*c[1+h] == (r[1+h;0+2*j]+r[1+h;1+2*j])]
    [(dr[h;0+2*k]**2+dr[h;1+2*k]**2) == (dr[h;0+2*j]**2+dr[h;1+2*j]**2)]
    [(dr[h;0+2*k]**2-dr[h;1+2*j]**2) == (dr[h;0+2*j]**2-dr[h;1+2*k]**2)]
    [(dr[h;0+2*k]-dr[h;1+2*j])*(dr[h;0+2*k]+dr[h;1+2*j]) == (dr[h;0+2*j]-dr[h;1+2*k])*(dr[h;0+2*j]+dr[h;1+2*k])]
    [(dr[h;0+2*k]-dr[h;1+2*j])/(dr[h;0+2*j]+dr[h;1+2*k]) == (dr[h;0+2*j]-dr[h;1+2*k])/(dr[h;0+2*k]+dr[h;1+2*j])]
    # [(k,j):=(0+2*k,1+2*k)]
    [t[h;k] == (dr[h;0+4*k]-dr[h;3+4*k])/(dr[h;2+4*k]+dr[h;1+4*k]) == (dr[h;2+4*k]-dr[h;1+4*k])/(dr[h;0+4*k]+dr[h;3+4*k])]
        #定义:待定系数
        #   注意:为了对称性，此处定义 与上面的tps 不同！
        # 2约束每t #但是 其实源自c[h]约束

td[h;k]:尝试:使用比率替换c[1:]
    !! [(dr[h;0+2*k]**2+dr[h;1+2*k]**2) == (dr[h;0+2*j]**2+dr[h;1+2*j]**2)]
    # [j:=0]
    [(dr[h;0+2*k]**2+dr[h;1+2*k]**2) == (dr[h;0]**2+dr[h;1]**2)]
    [(dr[h;0+2*k]**2-dr[h;0]**2) == -(dr[h;1+2*k]**2-dr[h;1]**2)]

    [td[h;k] == (dr[h;0+2*k]+dr[h;0])/(dr[h;1+2*k]-dr[h;1]) == -(dr[h;1+2*k]+dr[h;1])/(dr[h;0+2*k]-dr[h;0])]
        #定义:td[h;k]
        #源自c[h]约束
        #   但形式与t[h;k]不同，且数量更多:分隔点:2*k而非4*k
    [td == (x0+d0)/(x1-d1) == -(x1+d1)/(x0-d0)]
    [x0+d0 == td*(x1-d1)]
    [x1+d1 == -td*(x0-d0)]
    =>:
    [x0-td*x1 == -(+d0+td*d1)]
    [td*x0+x1 == -(-td*d0+d1)]
    =>:
    :> [E:=td]
    [[1,-E;E,1]*[x0;x1] == -[1,E;-E,1]*[d0;d1]]
    !! [[1,-E;E,1]*[1,E;-E,1] == (1+E**2)*[1,0;0;1]]
    [[x0;x1] == -1/(1+E**2) * [1,E;-E,1]**2 * [d0;d1]]
    [[x0;x1] == -1/(1+E**2) * [1-E*E,2*E;-2*E,1-E*E] * [d0;d1]]

    #更高层往下看:
    [td[h+1;k] == (dr[h+1;0+2*k]+dr[h+1;0])/(dr[h+1;1+2*k]-dr[h+1;1]) == -(dr[h+1;1+2*k]+dr[h+1;1])/(dr[h+1;0+2*k]-dr[h+1;0])]

    !! [dr[h;k] == (r[h;0+2*k]-r[h;1+2*k])/2]
    [dr[h+1;k] == (r[h+1;0+2*k]-r[h+1;1+2*k])/2]
    =>:
    [dr[h+1;0+2*k] == (r[h+1;0+4*k]-r[h+1;1+4*k])/2]
    [dr[h+1;1+2*k] == (r[h+1;2+4*k]-r[h+1;3+4*k])/2]
    =>:
    [dr[h+1;0] == (r[h+1;0]-r[h+1;1])/2]
    [dr[h+1;1] == (r[h+1;2]-r[h+1;3])/2]

    !! [r[1+h;k] == dr[h;k]**2]
    [dr[h+1;0+2*k] == (dr[h;0+4*k]**2-dr[h;1+4*k]**2)/2]
    [dr[h+1;1+2*k] == (dr[h;2+4*k]**2-dr[h;3+4*k]**2)/2]
    =>:
    [dr[h+1;0] == (dr[h;0]**2-dr[h;1]**2)/2]
    [dr[h+1;1] == (dr[h;2]**2-dr[h;3]**2)/2]

    [td[h+1;k]

    == ((dr[h;0+4*k]**2-dr[h;1+4*k]**2)+(dr[h;0]**2-dr[h;1]**2))/((dr[h;2+4*k]**2-dr[h;3+4*k]**2)-(dr[h;2]**2-dr[h;3]**2))
        == -((dr[h;2+4*k]**2-dr[h;3+4*k]**2)+(dr[h;2]**2-dr[h;3]**2))/((dr[h;0+4*k]**2-dr[h;1+4*k]**2)-(dr[h;0]**2-dr[h;1]**2))

    == (dr[h;0+4*k]**2-dr[h;1]**2)/(dr[h;2+4*k]**2-dr[h;2]**2)
        == -(dr[h;2+4*k]**2-dr[h;3]**2)/(dr[h;0+4*k]**2-dr[h;0]**2)

        == (r[h+1;0+4*k]-r[h+1;1])/(r[h+1;2+4*k]-r[h+1;2])
            == -(r[h+1;2+4*k]-r[h+1;3])/(r[h+1;0+4*k]-r[h+1;0])

    !! [td[h;k] == (dr[h;0+2*k]+dr[h;0])/(dr[h;1+2*k]-dr[h;1]) == -(dr[h;1+2*k]+dr[h;1])/(dr[h;0+2*k]-dr[h;0])]
    ???...TODO
    == (dr[h;0+4*k]**2-dr[h;1]**2)/(dr[h;2+4*k]**2-dr[h;2]**2)
        == -(dr[h;2+4*k]**2-dr[h;3]**2)/(dr[h;0+4*k]**2-dr[h;0]**2)

    ]
    [(r[h+1;0+4*k]-r[h+1;0])*(r[h+1;0+4*k]-r[h+1;1]) == -(r[h+1;2+4*k]-r[h+1;2])*(r[h+1;2+4*k]-r[h+1;3])]
    []

ht
    [h:<-[0..=ht]]
    ===
    c[h]
        [h:<-[0..=-1+ht]]
        [len(c[*]) == ht]
    ===
    r[h;k]
        [h:<-[0..=ht]]
        [h:<-[0..=ht]][k:<-[0..<2**(ht-h)]]
        [len(r[ht;*]) == 1]
        [[h:<-[0..=-1+ht]] -> [len(r[h;*]) == 2*len(r[1+h;*])]]
        [len(r[0;*]) == 2**ht]
        [[h:<-[0..=ht]] -> [len(r[h;*]) == 2**(ht-h)]]
    ===
    dr[h;k]
        [h:<-[0..=-1+ht]]
        [h:<-[0..=-1+ht]][k:<-[0..<2**(ht-1-h)]]
        [[h:<-[0..=-1+ht]] -> [len(r[h;*]) == 2*len(dr[h;*])]]
        [[h:<-[0..=-1+ht]] -> [len(r[1+h;*]) == len(dr[h;*])]]
    ===
    t[h;k]
        [h:<-[0..=-3+ht]]
        [h:<-[0..=-3+ht]][k:<-[0..<2**(ht-3-h)]]
        [[h:<-[0..=-3+ht]] -> [len(r[h;*]) == 8*len(t[h;*])]]
        [[h:<-[0..=-3+ht]] -> [len(dr[h;*]) == 4*len(t[h;*])]]

    ===
    !! 2**(ht-1-h)约束每c[h]
    !! 1约束每 非底层r
    !! 1约束每dr
    # !! 2约束每t #但是 其实源自 c[h]约束
        #另: dr 以及 非底层r:都是 人为中间变量，可无视
    [总数纟约束 == 3*(-1+2**ht)]
    [总数纟变量 == (ht +(-1+2**(1+ht)) +(-1+2**ht))]
    [自由度 == 总数纟变量-总数纟约束 == (1+ht)]
        即:首根+c[*]
        自由度 挺高？
        但是如何线性化取值过程？
            #公式牜上升期牜自由变量讠高层根:goto


[h:<-[0..=ht]][k:<-[0..<2**(ht-h)]]:
    [eval_rhk_(c[:h];r[0;0+k*2**h]) =[def]= r[h;k]]

[eval_rhk_(c[:h];r[0;0+k*2**h]) == r[h;k]]
[eval_rhk_(c[n:h];r[n;0+k*2**(h-n)]) == r[h;k]]
[r[h;k] == eval_rhk_(c[n:h];r[n;0+k*2**(h-n)])]


[eval_rhk_(c[h:h+g];r[h;0+k*2**g]) == r[h+g;k]]
[eval_rhk_(c[h:h];r[h;k]) == r[h;k]]
[eval_rhk_(c[h:h+1];r[h;0+k*2])
    == r[h+1;k]
    == dr[h;k]**2
    == (r[h;0+2*k]-c[h])**2
    ]
[eval_rhk_(c[h:h+1];r[h;0+k*2]) == (r[h;0+2*k]-c[h])**2]
[r[h+1;k] == (r[h;0+2*k]-c[h])**2]

[eval_rhk_(c[h:h+2];r[h;0+k*2**2])
    == r[h+2;k]
    == eval_rhk_(c[h+1:h+2];r[h+1;0+k*2])
    == (r[h+1;0+2*k]-c[h+1])**2
    == (eval_rhk_(c[h:h+1];r[h;0+(2*k)*2])-c[h+1])**2
    == ((r[h;0+4*k]-c[h])**2-c[h+1])**2
    == ((r[h;0+k*2**2]-c[h])**2-c[h+1])**2
    ]
[eval_rhk_(c[h:h+2];r[h;0+k*2**2]) == ((r[h;0+k*2**2]-c[h])**2-c[h+1])**2]

!! [r[h+1;k] == (r[h;0+2*k]-c[h])**2]
!! [r[h+2;k] == ((r[h;0+k*2**2]-c[h])**2-c[h+1])**2]
[r[h;k]
    == (r[h-1;0+k*2**1]-c[h-1])**2
    == ((r[h-2;0+k*2**2]-c[h-2])**2-c[h-1])**2
    == (((r[h-3;0+k*2**3]-c[h-3])**2-c[h-2])**2-c[h-1])**2
    == 平方纟甲型平方累聚型多根多项式{c[n:h];r[n;0+k*2**(h-n)]}
    ]
[r[h;k] == 平方纟甲型平方累聚型多根多项式{c[n:h];r[n;0+k*2**(h-n)]}]
    #注意:平方但不作用于退化情形
    #公式牜上升期牜自由变量讠高层根:here

!! [r[h+1;k] == (r[h;0+2*k]-c[h])**2]
[r[h;0+2*k] == (r[h+1;k]**/2+c[h])]
    但是:下降期 需要开平方，未必是 有理数
    !! 需求:幂增
    => (1+ht)的自由度怕是不够用
可以构造一个必然可以开方的乘法群:
    比如:
    bug:[u*n%2==1][gcd(u,n)==1]:
        [GG:=(1%u+u*ZZ%(u*n))]
        [x:<-GG]:
            [x%u == 1]
        bug:因为含有不可逆元素:(1%u,0%n) (1%u,noncoprime4n%n)
            [len(GG) == n]
            [sqrt_(GG;u) := u**((1+n)///2) %(u*n)]
        %7 => 1,2=3**2,4=2**2
            3,5,6 平方非剩余
        %21 10,19,13
        >>> pow(10,4,21)
        4
        >>> pow(10,8,21) #并不返回10
        16
        >>> pow(10,6,21)
        1
        >>> pow(10,7,21)
        10

    [u*n%2==1][gcd(u,n)==1]:
        # eg:[u==1]
        [GG:=(1%(u*n)+(u*n)*ZZ%(u*n)**2)]
        [x:<-GG]:
            [x%(u*n) == 1]
        [len(GG) == u*n]
        [sqrt_(GG;u) := u**((1+u*n)///2) %(u*n)**2]
        %7 => 1,2=3**2,4=2**2
            3,5,6 平方非剩余
        %21 10,19,13
            !! %7 =!= 1
            不在GG中
        >>> 21**2
        441
        >>> 22**21%441
        1
        >>> 22**11%441
        232
        >>> 232**2%441
        22

        由于[GG%n == 1]，GG中的元素并不适合通过gcd用来分解n
        但是 平方根 总是存在，虽然在GG里只有一个，但是GG本来也不是环，只是乘法群，在(ZZ%(u*n)**2)中至少2个根(u>1时更多)
        !! [r[h;0+2*k] == (r[h+1;k]**/2+c[h])]
        let [r[h;k] <- GG]
        [r[h;0+2*k] <- GG]
        [r[h+1;k] <- GG]
        [r[h+1;k]**/2 <- GG]
        [c[h] %(u*n) == 0]
        但是:
        [2*c[h] == (r[h;0+2*k]+r[h;1+2*k])]
        [c[h] %(u*n) == 1]
        [c[h] <- GG]
        _L

[z**2**e == -1]:
    [(x**2**k - y**2**k)
    == (x**2**(k-1) - y**2**(k-1))*(x**2**(k-1) + y**2**(k-1))
    == (x**2**(k-1) - y**2**(k-1))*(x**2**(k-1) - z**2**e*y**2**(k-1))
    == (x**2**(k-1) - y**2**(k-1))*(x**2**(k-1) - (z**2**(e+1-k)*y)**2**(k-1))
    ]
    [bb**2**e == pw] # 可能调整一下？
]]

[[
@20260705
允许快速求值的多根多项式
e script/整数分解牜允许快速求值的多根多项式.py

型如:(...(x**2+a)**2+b...)方便快速计算并且有2**k个整数根！
  强化:view ../../python3_src/seed/math/factor_pint/factor_pint__7batch_gcd_IIdiffs.py

'Prime numbers-A Computational Perspective(2ed)(2005)(Pomerance).pdf'
page315[325/604]
6.6 Research problems
6.17.Investigate the following idea for forging a subexponential factoring algorithm.
    Observe first the amusing algebraic identity [Crandall 1996a]
        F(x) = ((x**2 − 85)**2− 4176)**2− 2880**2 = (x − 13)(x − 11)(x − 7)(x − 1)(x + 1)(x + 7)(x + 11)(x + 13)


+-sqrt(85 +-sqrt(4176 +-2880))
  -sqrt(85 -sqrt(4176 -2880))
    -7
  -sqrt(85 -sqrt(4176 +2880))
    -1
  -sqrt(85 +sqrt(4176 -2880))
    -11
  -sqrt(85 +sqrt(4176 +2880))
    -13
  +sqrt(85 -sqrt(4176 -2880))
    +7
  +sqrt(85 -sqrt(4176 +2880))
    +1
  +sqrt(85 +sqrt(4176 -2880))
    +11
  +sqrt(85 +sqrt(4176 +2880))
    +13

%3:
  sqrt(0) -> 0
  sqrt(1) -> 1,2
  sqrt(2) -> _L
  [{a+b,a-b} <= {0,1}]
  [b%3 == 0]:
    [a <- {0,1}]
    [a==0]:
      [sqrt(a+b) == 0]
      [sqrt(a-b) == 0]
    [a==1]:
      [sqrt(a+b) == 1]
      [sqrt(a-b) == 1]
  [b%3 == 1]:
    [a == 2]
    [sqrt(a+b) == 0]
    [sqrt(a-b) == 1]
  [b%3 == 2]:
    [a == 2]
    [sqrt(a+b) == 1]
    [sqrt(a-b) == 0]

  b -> sqrt(a+/-b)
  0 -> 0|1
  1 -> 0,1
  2 -> 0,1

  考虑无限长序列:
    排除2
    1 总是 引入0
    然而 0->0 很难持久，不可能支持无限长序列
    1 -> 0,1 -> 1 -> 0,1 -> ...循环

for p in [2,3,5,7,11,13,17,19]: print(p, [c%p for c in [85, 4176, 2880]], sep=':')
    # [a2,a1,b0]
    2:[1, 0, 0]
    3:[1, 0, 0]
    5:[0, 1, 0]
    7:[1, 4, 3]
    11:[8, 7, 9]
    13:[7, 3, 7]
    17:[0, 11, 7]
    19:[9, 15, 11]

from math import isqrt
for p in [2,3,5,7,11,13,17,19]:
    b = 2880
    bs = [2880]
    print(p, [c%p for c in bs], sep=':')
    for a in [4176, 85]:
        _bs = [_b for b in bs for _b in [isqrt(a-b), isqrt(a+b)]]
        bs = _bs
        print(p, [c%p for c in bs], sep=':')
    2:[0]
    2:[0, 0]
    2:[1, 1, 1, 1]
    3:[0]
    3:[0, 0]
    3:[1, 2, 1, 1]
    5:[0]
    5:[1, 4]
    5:[2, 1, 1, 3]
    7:[3]
    7:[1, 0]
    7:[0, 4, 1, 6]
    11:[9]
    11:[3, 7]
    11:[7, 0, 1, 2]
    13:[7]
    13:[10, 6]
    13:[7, 11, 1, 0]
    17:[7]
    17:[2, 16]
    17:[7, 11, 1, 13]
    19:[11]
    19:[17, 8]
    19:[7, 11, 1, 13]


]]
[[
]]

'#'; __doc__ = r'#'
>>>



[[
奇数:中心对称:典型见:%5
    ABCDDCB
    [+b -> (a+/-b)]
    [-b -> (a+/-b)]
偶数:半周期循环对称:典型见:%6
    ABCDCBABCDCB
    [+b -> (a+/-b)]
    [-b -> (a+/-b)]
    [H+b -> ((H+a)+/-(H+b))==(a+/-b)]
    [H-b -> ((H+a)+/-(H-b))==(a+/-b)]

===
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @制表冫平方剩余中点乊剩余环扌 =3
    [((0,), (1,)), ((0, 1),), ((0, 1),)]

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =5
    0:((0,), (1,), (4,))
    1:((1, 4),)
    2:((0, 1), (0, 4))
    3:((0, 1), (0, 4))
    4:((1, 4),)
%5: 1,4 -> 1,4

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =6
    0:((0,), (1,), (3,), (4,))
    1:((0, 4), (1, 3))
    2:((0, 4), (1, 3))
    3:((0,), (1,), (3,), (4,))
    4:((0, 4), (1, 3))
    5:((0, 4), (1, 3))
%6: 4 -> 1,3 -> 1,3,4
    %6 --> %30:
    1,7,13,19,25
    3,9,15,21,27
    4,10,16,22,28

%5: 1,4 -> 1,4
    %5 --> %30:
    1,19
    9,21
    4,16

%30:
    1 -> 19,21
    4 -> 1,9
    9 -> 1,19 | 4,16 | 9,21
    16 -> 19,21
    19 -> 1,9
    21 -> 1,19 | 4,16 | 9,21
    半周期循环对称
py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =30
    0:((0,), (1,), (4,), (6,), (9,), (10,), (15,), (16,), (19,), (21,), (24,), (25,))
    1:((4, 6), (19, 21))
    2:((0, 4), (6, 10), (15, 19), (21, 25))
    3:((0, 6), (0, 24), (1, 25), (4, 10), (9, 15), (10, 16), (15, 21), (19, 25))
    4:((1, 9), (16, 24))
    5:((0, 10), (1, 21), (4, 24), (6, 16), (9, 19), (15, 25))
    6:((1, 19), (4, 16), (6, 24), (9, 21))
    7:((0, 16), (1, 15), (9, 25), (10, 24))
    8:((0, 16), (1, 15), (9, 25), (10, 24))
    9:((1, 19), (4, 16), (6, 24), (9, 21))
    10:((0, 10), (1, 21), (4, 24), (6, 16), (9, 19), (15, 25))
    11:((1, 9), (16, 24))
    12:((0, 6), (0, 24), (1, 25), (4, 10), (9, 15), (10, 16), (15, 21), (19, 25))
    13:((0, 4), (6, 10), (15, 19), (21, 25))
    14:((4, 6), (19, 21))
    15:((0,), (1,), (4,), (6,), (9,), (10,), (15,), (16,), (19,), (21,), (24,), (25,))
    16:((4, 6), (19, 21))
    17:((0, 4), (6, 10), (15, 19), (21, 25))
    18:((0, 6), (0, 24), (1, 25), (4, 10), (9, 15), (10, 16), (15, 21), (19, 25))
    19:((1, 9), (16, 24))
    20:((0, 10), (1, 21), (4, 24), (6, 16), (9, 19), (15, 25))
    21:((1, 19), (4, 16), (6, 24), (9, 21))
    22:((0, 16), (1, 15), (9, 25), (10, 24))
    23:((0, 16), (1, 15), (9, 25), (10, 24))
    24:((1, 19), (4, 16), (6, 24), (9, 21))
    25:((0, 10), (1, 21), (4, 24), (6, 16), (9, 19), (15, 25))
    26:((1, 9), (16, 24))
    27:((0, 6), (0, 24), (1, 25), (4, 10), (9, 15), (10, 16), (15, 21), (19, 25))
    28:((0, 4), (6, 10), (15, 19), (21, 25))
    29:((4, 6), (19, 21))








py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =2
    0:((0,), (1,))
    1:((0,), (1,))

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =3
    0:((0,), (1,))
    1:((0, 1),)
    2:((0, 1),)

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =7
    0:((0,), (1,), (2,), (4,))
    1:((0, 2), (2, 4))
    2:((0, 4), (1, 4))
    3:((0, 1), (1, 2))
    4:((0, 1), (1, 2))
    5:((0, 4), (1, 4))
    6:((0, 2), (2, 4))
%7: 1 -> 2,4 -> 1,2,4 -> 1,2,4



py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =11
    0:((0,), (1,), (3,), (4,), (5,), (9,))
    1:((0, 9), (1, 3), (3, 5))
    2:((0, 4), (1, 5), (5, 9))
    3:((0, 5), (3, 9), (4, 9))
    4:((0, 3), (1, 4), (1, 9))
    5:((0, 1), (3, 4), (4, 5))
    6:((0, 1), (3, 4), (4, 5))
    7:((0, 3), (1, 4), (1, 9))
    8:((0, 5), (3, 9), (4, 9))
    9:((0, 4), (1, 5), (5, 9))
    10:((0, 9), (1, 3), (3, 5))
%11: 1 -> !3 -> !9 -> !5 -> !4 -> !1


py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =13
    0:((0,), (1,), (3,), (4,), (9,), (10,), (12,))
    1:((1, 3), (1, 12), (10, 12))
    2:((0, 4), (0, 9), (1, 10), (3, 12))
    3:((3, 9), (3, 10), (4, 10))
    4:((1, 9), (4, 9), (4, 12))
    5:((0, 3), (0, 10), (1, 4), (9, 12))
    6:((0, 1), (0, 12), (3, 4), (9, 10))
    7:((0, 1), (0, 12), (3, 4), (9, 10))
    8:((0, 3), (0, 10), (1, 4), (9, 12))
    9:((1, 9), (4, 9), (4, 12))
    10:((3, 9), (3, 10), (4, 10))
    11:((0, 4), (0, 9), (1, 10), (3, 12))
    12:((1, 3), (1, 12), (10, 12))
%13: 1,12 -> 1,12
%13: 3,10 -> 3,10
%13: 4,9 -> 4,9


py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方剩余中点乊剩余环扌 =17
    0:((0,), (1,), (2,), (4,), (8,), (9,), (13,), (15,), (16,))
    1:((0, 2), (0, 15), (1, 16), (2, 4), (13, 15))
    2:((0, 4), (0, 13), (2, 15), (4, 8), (9, 13))
    3:((2, 8), (2, 13), (4, 15), (9, 15))
    4:((0, 8), (0, 9), (1, 9), (4, 13), (8, 16))
    5:((1, 8), (2, 9), (8, 15), (9, 16))
    6:((1, 13), (4, 9), (4, 16), (8, 13))
    7:((1, 4), (1, 15), (2, 16), (13, 16))
    8:((0, 1), (0, 16), (1, 2), (8, 9), (15, 16))
    9:((0, 1), (0, 16), (1, 2), (8, 9), (15, 16))
    10:((1, 4), (1, 15), (2, 16), (13, 16))
    11:((1, 13), (4, 9), (4, 16), (8, 13))
    12:((1, 8), (2, 9), (8, 15), (9, 16))
    13:((0, 8), (0, 9), (1, 9), (4, 13), (8, 16))
    14:((2, 8), (2, 13), (4, 15), (9, 15))
    15:((0, 4), (0, 13), (2, 15), (4, 8), (9, 13))
    16:((0, 2), (0, 15), (1, 16), (2, 4), (13, 15))
%17: 1,16 -> 1,16
%17: 2,15 -> 2,15
%17: 4,13 -> 4,13
%17: 8,9 -> 8,9












































]]

[[
随机构造果然不行
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜甲型平方累聚型多项式求值扌  +to_show6trivial_factor  ='(-1+2**67)' ='[(range(j, j+40), range(j, j+2**8)) for j in range(1,5)]'
    trivial factor: (147573952589676412927, 147573952589676412927, (0, range(1, 41)), (0, 1), (78066429901769270384, 0))
    False
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜甲型平方累聚型多项式求值扌  +to_show6trivial_factor  ='(-1+2**67)' ='[(range(j, j+60), range(j, j+2**10)) for j in range(5,29)]'
    False
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜甲型平方累聚型多项式求值扌  +to_show6trivial_factor  ='(-1+2**67)' ='[(range(j, j+600), range(j, j+2**7)) for j in range(5,29)]'
    False

++kw:to_square_us
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜甲型平方累聚型多项式求值扌 +to_square_us +to_show6trivial_factor  ='(-1+2**67)' ='[(range(j+600, j+650), range(j, j+2**7)) for j in range(29,40)]'
    False

reversed
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜甲型平方累聚型多项式求值扌 +to_square_us +to_show6trivial_factor  ='(-1+2**67)' ='[(range(j+600, j+650)[::-1], range(j, j+2**7)) for j in range(29,40)]'
    False
]]
[[
===
平方和的乘积依然是平方和:
    [det([a,b;-b,a]) == (a**2+b**2)]
    [[a,b;-b,a]*[c,d;-d,c] == [(a*c-b*d),(a*d+b*c);(a*d+b*c),(a*c-b*d)]]
    [(a**2+b**2)*(c**2+d**2) == ((a*c-b*d)**2+(a*d+b*c)**2)]
矩乘冫平方和乊剩余环扌
矩乘平方冫平方和乊剩余环扌
    [(a**2+b**2)**2 == ((a**2-b**2)**2+(2*a*b)**2)]
===
见下面:[碰撞规模纟非零 ~ (p/8)]
求得 一些 平方碰撞:
===
from seed.math.GaussInteger import find_Gauss_integer_factor_coeffs_of_4k1_prime, find_sqrt_neg1_of_4k1_prime
[p::prime][p%4==1][n%p=!=0][?k -> [is_prime_(4*k*n+p)]]:
    [(odd1, even1):=find_Gauss_integer_factor_coeffs_of_4k1_prime(p)]
    [(odd2, even2):=find_Gauss_integer_factor_coeffs_of_4k1_prime(4*k*n+p)]
    [(odd1**2 + even1**2) =[%n]= p =[%n]= (odd2**2 + even2**2)]
    [(odd1**2 + even1**2) =[%n]= (odd2**2 + even2**2)]
===
[d:=((1+2*a)**2+(2*b)**2)][gcd(n,d) == 1][?k -> [is_prime_(4*k*n+d)]]:
    [d%4==1]
    [(4*k*n+d)%4==1]
    [(odd, even):=find_Gauss_integer_factor_coeffs_of_4k1_prime(4*k*n+d)]
    [((1+2*a)**2+(2*b)**2) =[%n]= (odd**2 + even**2)]
===
[a*b=[%n]=c*d]:
    [4*a*b == ((a+b)**2-(a-b)**2)]
    [4*c*d == ((c+d)**2-(c-d)**2)]
    [((a+b)**2-(a-b)**2) =[%n]= ((c+d)**2-(c-d)**2)]
    [((a+b)**2+(c-d)**2) =[%n]= ((c+d)**2+(a-b)**2)]
===
[gcd(n,a*b*c) == 1]:
    [d := a*b*c**-1 %n]
    [a*b=[%n]=c*d]
    [((a+b)**2+(c-d)**2) =[%n]= ((c+d)**2+(a-b)**2)]
    [((a+b)**2+(c-d)**2) =[%n]= ((c+d)**2+(a-b)**2) =[%n]= (a**2+b**2+c**2+d**2)]
===
定点求平方碰撞:
    上面p版就已经是特化版定点求平方碰撞
    考虑是否可以凑巧出现[d==a**2+b**2==a**2+c**2]
[n%2==1][gcd(n,d) == 1]:
    [(t*n+d)%4==1]:
        [t*n%4 == (1-d)]
        [t%4 == n**-1%4*(1-d)]
    [t := n**-1%4 * (1-d) %4]
    [(t*n+d)%4==1]

    !! [gcd(n,d) == 1]
    ?k :=> [is_prime_(4*k*n+t*n+d)]
    [(4*k*n+t*n+d)%4==1]
    [(odd, even):=find_Gauss_integer_factor_coeffs_of_4k1_prime(4*k*n+t*n+d)]
    [d =[%n]= (odd**2 + even**2)]
    vs: binary quadratic form
        [n == a*x**2 + b*x*y + c*y**2]
        [k*n == x**2 + y**2 -d]
        TODO

[n%2==1][?(a,b) :=> [(a**2+b**2) =[%n]= -1]]:
    # 根据上面算法，容易找到[p =[%(4*n)]= (-1+2*n)]，从而得到(a,b)
    #   但感觉不合理？其实搞错了:不是[a**2==-1]而是[a**2+b**2==-1]

===
[w == u**2 + v**2][u == a**2 + b**2][v == c**2 + d**2]:
    [2*w == (a**2+b**2+c**2+d**2) =?= ((a+b)**2+(c-d)**2)]
    [a*b=[%n]=c*d]
        [2*w == ((a+b)**2+(c-d)**2)]
反之:
[w == u**2 + v**2][c:=(v+d)%n][gcd(n,u*v*d*c) == 1]:
    [D := (u**2-4*c*d)][欤平方剩余扌(n;D)]:
        !! [欤平方剩余扌(n;D)]
        ?a,b :=> [u=[%n]=a+b][c*d=[%n]=a*b]
        [u=[%n]=a+b][v=[%n]=c-d]
        [w == ((a+b)**2+(c-d)**2)]
        [w == (a**2+b**2+c**2+d**2)]

===
幂增组合:概念性生成:
    [w[j] == u[j,k]**2 + v[j,k]**2]
        # 甚至可以 直接使用(p*q)两者都是(1+4k)型素数
    [IIws == II[w[j] | j]]
    则IIws的可能候选分解数量达到:II[len(ks[j]) | j]
简化:
    [ps := [p | [p::prime][p%4==1]]]
    [IIws:=II(ps[:L])]
    则IIws的可能候选分解数量达到:2**(L-1)
        而[IIws%n分解规模只有(p/8)]
    bug:
        除非gcd，否则即使 ZZ%p上发生碰撞，ZZ%n也未必，除非ZZ%p ZZ%q... 同时有 达到+/-sqrt 才能发现 碰撞
    xxx:随机碰撞发生规模为O(p**/2)
        也就是说分解合数耗时O(n**/4)
        #类似 尸方法，不过 确定性更强+可控性更强
        #   可是对比 随机平方碰撞(random-squares method)又能好到哪去？仅仅x**2%n 是难以有效利用的，得尝试smooth分解，最后再类似QS平方筛 解线性方程组
    此处碰撞指:[u0**2=[%n]=u1**2][(v0+v1)%n=!=0][(v0-v1)%n=!=0][(u0**2+v0**2)=[%n]=IIws=[%n]=(u1**2+v1**2)]
        => [v0**2=[%n]=v1**2]
        => [1 < gcd(n, v0+v1) < n]
格雷码
view ../../python3_src/seed/math/Gray_code.py
===
TODO:
!! 平方和的乘积依然是平方和
[u**2 + v**2 =[%n]= 1] 构成一个 (幺正？)矩阵乘法群
    规模O(p/8)
  [u,v;-v,u]的阶的规模是？
构造通过:(IIps)**2 /(IIps)**2
  [U**2+V**2 =[%n]= (IIps)**2]
  [(U/IIps)**2+(V/IIps)**2 =[%n]= 1]
[(3/5)**2 + (4/5)**2 =[%n]= 1]
考察冫二维幺正矩阵乊剩余环扌:goto
    结论:可以作为 减一分解法 的 补充，只要 合数的小素数 是(3+4k)型 [#1/2可能性#]

===
进一步:
    高斯整数 --> ZZ[X]%{n,f(X)}
    幺正 --> [norm(g(X)) == 1]
[f(X) == X**2+1]:
    高斯整数
[f(X) == (X**2+A*X+B)]:
    [b=!=0]:
        [norm(a+b*X)
        == (a+b*x0)*(a+b*x1)
        == b**2*(-a/b-x0)*(-a/b-x1)
        == b**2*f(-a/b)
        == b**2*(-a/b)**2+b**2*A*(-a/b)+b**2*B
        == (a**2-A*a*b+B*b**2)
        ]
    [norm(a+b*X) == if b==0 then a**2 else b**2*f(-a/b)]
    [norm(a+b*X) == (a**2-A*a*b+B*b**2)]
    [b=!=0][norm(a+b*X) == 1]:
        [f(-a/b) == (1/b)**2]
        # 找出(x,y) :=> [f(x) == y**2]
        # 或者 反过来 待定系数B
        #   ??怎么感觉有点像 ECC椭圆曲线？
    [g(X) == (a+b*X)][h(X) == (c+d*X)]:
        [g(X)*h(X)
        == (a+b*X)*(c+d*X)
        == (a*c+(b*c+a*d)*X+b*d*X**2)
        == (a*c+(b*c+a*d)*X-b*d*(A*X+B))
        == ((a*c-b*d*B)+(b*c+a*d-b*d*A)*X)
        ]
    [(a+b*X)*(c+d*X) == ((a*c-b*d*B)+(b*c+a*d-b*d*A)*X)]

? ?gcdext
    gcdext(x,y): returns [u,v,d] such that d=gcd(x,y) and u*x+v*y=d.
? ?polresultantext
    polresultantext(A,B,{v}): return [U,V,R] such that R=polresultant(A,B,v) and U*A+V*B = R, where A and B are polynomials.
      [resultant(f,g):=(LC(g)**deg(f)*LC(f)**deg(g))**II[(r4g-r4f) | [r4g:<-roots_of(g(X))][r4f:<-roots_of(f(X))]]]
        #注意:f,g次序:针对g，求norm(g)%f
polresultantext(A*X+B, a+b*X, 'X)
    [-b, A, a*A - b*B]
polresultantext(a+b*X, A*X+B, 'X)
    [-A, b, -a*A + b*B]
polresultantext(X^2+A*X+B, a+b*X, 'X)
    [b^2, -b*X + (-b*A + a), -b*a*A + (b^2*B + a^2)]
polresultantext(a+b*X, X^2+A*X+B, 'X)
    [-b*X + (-b*A + a), b^2, -b*a*A + (b^2*B + a^2)]

polresultantext(X^3+A*X+B, a+b*X+c*X^2, 'X)
    [(-c^3*A + (a*c^2 - b^2*c))*X + (-b*c^2*A + (c^3*B + (2*b*a*c - b^3)))
    , (c^2*A + (-a*c + b^2))*X^2 + (-c^2*B - b*a)*X + (c^2*A^2 + (-2*a*c + b^2)*A + (b*c*B + a^2))
    , a*c^2*A^2 + (-b*c^2*B + (-2*a^2*c + b^2*a))*A + (c^3*B^2 + (3*b*a*c - b^3)*B + a^3)
    ]
polresultantext(A+B*X+C*X^2+X^3, a+b*X+c*X^2, 'X)
    [(-c^3*B + ((a + C*b)*c^2 - b^2*c))*X + (c^3*A + (-b*c^2*B + (-C*a*c^2 + (2*b*a + C*b^2)*c - b^3)))
    , (c^2*B + ((-a - C*b)*c + b^2))*X^2 + (-c^2*A + (C*c^2*B + (-C^2*b*c + (-b*a + C*b^2))))*X + ((-C*c^2 + b*c)*A + (c^2*B^2 + ((-2*a - C*b)*c + b^2)*B + (C^2*a*c + (a^2 - C*b*a))))
    , c^3*A^2 + (-b*c^2*B + (-2*C*a*c^2 + (3*b*a + C*b^2)*c - b^3))*A + (a*c^2*B^2 + ((-2*a^2 - C*b*a)*c + b^2*a)*B + (C^2*a^2*c + (a^3 - C*b*a^2)))
    ]
TODO:阶规模是？
    二维:估计是 O(p**(2-1))
    三维:估计是 O(p**(3-1))
        3:(a,b,c)
        1:[norm==1]
        (数量纟自由变量-数量纟约束)
        椭圆曲线: O(p**(2-1))
考察冫环乘阶纟幺正点乊随机二维剩余环扌:goto
    二维:阶规模是[2*p,(p+1),(p-1)]
        相应于Jacobi_symbol(M;D)
        ???vs:Lucas-seq???
异阶本原根组合:goto


==>>:
猜想:[[p::prime][p%2==1] -> [规模纟幺正点集乊二维剩余环{ZZ[X]%{p,(X**2+A*X+B)}} == let [D:=(A**2-4*B)%p][J:=Jacobi_symbol(p;D)] in (1+[0==J])*(p-J)]]
    ???vs:Lucas-seq???
    似乎没太大区别
    其实就是 FF(p;1)[X]%(X**2+A*X+B) 的[norm==1]乘法子群
    [RR:=FF(p;1)[X]%(X**2+A*X+B)]
    [UU:=乘法子群{RR;[norm==1]}]
    [1 =[%p]= norm(a+b*X) =[%p]= (a**2-A*a*b+B*b**2)]
    [1=[%p]= norm(+/-1+0*X)]
    [[c:<-ZZ%p][c=!=+/-1] -> [norm(c+0*X)%p == c**2 %p =!= 1]]
    [(ZZ%p)/-\UU =[%p]= {+1,-1}]
    [-1 == Jacobi_symbol(p;D)]:
        [RR ~=~ FF(p;2)]
        [len(RR) == p**2]
        [len(ZZ%p) == p]
        [(-1+len(RR))%len(UU) == 0]
        [gcd((-1+len(ZZ%p)),len(UU)) == 2]
        [gcd(-1+p,len(UU)) == 2]
        [(-1+p**2)%len(UU) == 0]
        [gcd(-1+p**2,len(UU)) == len(UU)]
        [gcd(2*(1+p),len(UU)) == len(UU)]
        ?g :=> [g<-RR][mul_order_(g) == (-1+len(RR))]
        [h:=g**((p-1)///2)]
        [mul_order_(h) == 2*(1+p)]
            #此路不通，改道:
        [good_bs := {b | [b:<-ZZ%p][-1 =!= Jacobi_symbol(p;(4+D*b**2))]}]
            # {0,+1}
        [@a,b -> [1 =[%p]= norm(a+b*X)]]:
            [1 =[%p]= (a**2-A*a*b+B*b**2)]
            [1 =[%p]= norm((A*b-a)+b*X)]
            [A*b-a==a]:
                [a==A*b/2]
                [4 =[%p]= ((A*b)**2-2*A*(A*b)*b+4*B*b**2)]
                [4 =[%p]= (-A**2+4*B)*b**2]
                [D =[%p]= -4/b**2]
                [-1 == Jacobi_symbol(p;D) == Jacobi_symbol(p;-1)]
                [p%4 == 3]
                [b**2 =[%p]= -4/D]
                [+/-b =[%p]= 2/sqrt(-D)]
            [p%4 == 1]:
                [A*b-a=!=a]
                one b --> two {a,A*b-a}
                [len(UU) == 2*len(good_bs)]
            [p%4 == 3]:
                if [+/-b =[%p]= 2/sqrt(-D)]:
                    one b --> one {a}
                else:
                    one b --> two {a,A*b-a}
                [len(UU) == -2+2*len(good_bs)]
            [len(UU) == [p%4 == 3]*-2+2*len(good_bs)]

        [?b -> @a -> [1 =!= norm(a+b*X)]]:
            [b=!=0]
            [1 =!= (a**2-A*a*b+B*b**2)]
            [0 =!= (a**2-A*a*b+(B-1/b**2)*b**2)]
            [_D := A**2-4*(B-1/b**2)]
            [_D == (D+4/b**2)]
            [-1 == Jacobi_symbol(p;_D)]
            [-1 == Jacobi_symbol(p;(D+4/b**2))]
            [-1 == Jacobi_symbol(p;(4+D*b**2))]
        [?b -> @a -> [1 =!= norm(a+b*X)]]:
            <==> [b=!=0][-1 == Jacobi_symbol(p;(D+4/b**2))]
            <==> [-1 == Jacobi_symbol(p;(4+D*b**2))]
        [bad_bs := {b | [b:<-ZZ%p][-1 == Jacobi_symbol(p;(4+D*b**2))]}]
        猜想:均匀分布:[len(bad_bs) == (p-1)///2 -[p%4==3] == p//4*2]
            [p:=3][D:=2]:
                [bad_bs=={}]
            [p:=5][D:=2]:
                [bad_bs=={2,3}]
            [len(good_bs) == p-len(bad_bs) == (p+1)///2 +[p%4==3]]
            [len(UU) == [p%4 == 3]*-2+2*len(good_bs) == (p+1)]
            [len(UU) == (p+1)]
    [[-1 == Jacobi_symbol(p;D)]&&猜想 => [len(UU) == (p+1)]]


e ../../python3_src/seed/math/factor_pint/factor_pint__smooth_group_order_method.py

===
可以继续推广:
    但意义不大，见下面: polcyclo(k>2,p)几乎没有smooth_number

推广一:单变量+素数维度:FF(p;q)
    ...

推广二:合数维度:FF(p;k0*k1):
推广二.甲:双变量+合数维度:FF(p;k0*k1):

    以前一个prevRR为系数，构造更大的RR
    #无需:[gcd(k1,k2)==1]
    [(RR:=(prevRR:=FF(p;1)[X]%(X^k0+...))[Y]%(Y^k1+...)) ~=~ FF(p;k0*k1)]
    重点在于:
        1:[pt0 <- RR\-\prevRR] #初始 幺正点pt0 不在prevRR 中 <==> 高维系数非全零
        2:[norm :: RR -> prevRR]
            #其实，每个变量X都可以有norm{X}，也就是最多可有num_prime_factors_of(k0*k1)个约束，但是 [最小自由度==(k0*k1)-num_prime_factors_of(k0*k1)]还是增长太快，不实用
            [norm(x) := resultant(Y;(Y^k1+...);x)] #消Y，但保留X
            [UU := {x | [x:<-RR][norm(x) == 1]}]
            [(x \\\ y) =[def]= [y%x == 0]]
            [g:=len(UU/-\prevRR)]
            [g == gcd(k1,(-1+len(prevRR)))]
                # [LC(x)**deg((Y^k1+...)) == 1]
            [(-1+len(RR)) == len(UU)*(-1+len(prevRR))///g]
            [len(UU) == g*(-1+len(RR))///(-1+len(prevRR))]
            [len(UU) == gcd(k1,(-1+len(prevRR)))*(-1+len(RR))///(-1+len(prevRR))]
            [len(UU) == gcd(k1,(-1+p**k0))*((-1+p**(k0*k1))///(-1+p**k0))]
            [len(UU) == gcd(k1,(-1+p**k0))*???]
                ??不是polcyclo(k1,p**k0)
                ??不是polcyclo(k0*k1,p)
                双变量X,Y表现相当糟糕:((-1+p**(k0*k1))///(-1+p**k0)) 几乎 包含了 polcyclo(k1,p)*polcyclo(k1*k0,p)，肯定不如 单变量 素数维度
                #k0*k1相当小，分解整数时必是smooth_number可忽略不计
推广二.乙:单变量+合数维度:FF(p;k0*k1):
    如何 构造初始 幺正点？
    如何 定义 norm()使得只有polcyclo(k0*k1,p)起作用
    ???[len(UU) \\\ 2*k0*k1*polcyclo(k0*k1,p)]
所用 乘法群规模len(UU)一直在改变！
    缺点是 随着phi_(k0*k1)增长，维度越来越高，效率越来越低，而且随着p增大,polcyclo(k0*k1,p)是smooth_number的概率也变得低，事实上，从一开始就很低:
factor(polcyclo(3,127))~
    [3,5419;1,1]
factor(polcyclo(5,127))~
    [262209281;1]
factor(polcyclo(7,127))~
    [7,43,86353,162709;1,1,1,1]
polcyclo(k>2,p)几乎没有smooth_number
    view ../../python3_src/seed/math/factor_pint/database4factors4cyclotomic_numbers.py.default.db
===
PARI-GP:
? polcyclo(4,'p)
p^2 + 1
? polcyclo(3,'p)
p^2 + p + 1
? polcyclo(6,'p)
p^2 - p + 1
? polcyclo(5,'p)
p^4 + p^3 + p^2 + p + 1
? polcyclo(12,'p)
p^4 - p^2 + 1
? polcyclo(9,'p)
p^6 + p^3 + 1
? polcyclo(8,'p)
p^4 + 1
? polcyclo(10,'p)
p^4 - p^3 + p^2 - p + 1
===
view ../../python3_src/seed/math/polynomial/eval_polynomial/cyclotomic_polynomial.py
py_adhoc_call { +lineno }  seed.math.polynomial.eval_polynomial.cyclotomic_polynomial   ,stable_repr.20:iter_cyclotomic_polynomials__sorted_by_ ='{}' -degree_vs_order +with_degree +with_order +with_factorization4order -squarefree_order_only
1:(1, 1, {}, (-1, 1))
2:(1, 2, {2: 1}, (1, 1))
3:(2, 3, {3: 1}, (1, 1, 1))
4:(2, 4, {2: 2}, (1, 0, 1))
5:(2, 6, {2: 1, 3: 1}, (1, -1, 1))
6:(4, 5, {5: 1}, (1, 1, 1, 1, 1))
7:(4, 8, {2: 3}, (1, 0, 0, 0, 1))
8:(4, 10, {2: 1, 5: 1}, (1, -1, 1, -1, 1))
9:(4, 12, {2: 2, 3: 1}, (1, 0, -1, 0, 1))
10:(6, 7, {7: 1}, (1, 1, 1, 1, 1, 1, 1))
11:(6, 9, {3: 2}, (1, 0, 0, 1, 0, 0, 1))
12:(6, 14, {2: 1, 7: 1}, (1, -1, 1, -1, 1, -1, 1))
13:(6, 18, {2: 1, 3: 2}, (1, 0, 0, -1, 0, 0, 1))
14:(8, 15, {3: 1, 5: 1}, (1, -1, 0, 1, -1, 1, 0, -1, 1))
15:(8, 16, {2: 4}, (1, 0, 0, 0, 0, 0, 0, 0, 1))
16:(8, 20, {2: 2, 5: 1}, (1, 0, -1, 0, 1, 0, -1, 0, 1))
17:(8, 24, {2: 3, 3: 1}, (1, 0, 0, 0, -1, 0, 0, 0, 1))
18:(8, 30, {2: 1, 3: 1, 5: 1}, (1, 1, 0, -1, -1, -1, 0, 1, 1))
19:(10, 11, {11: 1}, (1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1))
20:(10, 22, {2: 1, 11: 1}, (1, -1, 1, -1, 1, -1, 1, -1, 1, -1, 1))
===
]]
[[
尝试二:构造:甲型平方累聚型多根多项式@(ZZ%p)
!! [碰撞规模纟非零{p} ~ (p/8)]
=> 可以考虑在(ZZ%p)里构造 甲型平方累聚型多根多项式
    复合到(ZZ%(p*q))
    [f(n)%(p*q) == 0][f(n)%p =!= 0][f(n)%q =!= 0]:
        _L
        不可能
    [f(n)%p == 0][f(n)%q == 0]:
        不行
<<==:
猜想牜均匀分布牜碰撞规模纟平方剩余牜非零:
    e others/数学/我的猜想.txt
猜想:[(ZZ%p) => [(碰撞规模纟平方剩余牜非零-碰撞规模纟平方非剩余)<-{0,1}]]
    这个规模约(p/8)...
猜想:[(ZZ%p) => [碰撞规模纟非零{p%2==1} == (p+4+1*(-1)**[p%4==1]+[p%8<-{1,7}]*-4*(-1)**欤平方剩余)///8]]
    [H:=(p-1)///2] #half
    [T:=C(2+H;2)[#aa>=bb>=0#] = (H+2)*(H+1)///2] #total
    [p%4 == 1]:
        !! [0 --> aa + (-aa)]
        [碰撞规模 ~ (T-(1+H/2)[#aa>=bb==-aa>=0#])/(p-1) == ((H+2)*(H+1)/2 - (1+H/2))/(2*H) == (H+2)/4 == (p+3)/8]
        [碰撞规模 ~ (p+3)/8]
        [p%8 == 5]:
            猜想:[碰撞规模纟非零 == (p+3)///8]
        [p%8 == 1]:
            猜想:[碰撞规模纟平方剩余牜非零 == (p+7)///8]
            猜想:[碰撞规模纟平方非剩余 == (p-1)///8]

        猜想:[碰撞规模纟非零{p%4==1} == (p+3+[p%8==1]*-4*(-1)**欤平方剩余)///8]

    [p%4 == 3]:
        !! [aa=!=0] => [0 -!-> aa + (-aa)]
        [碰撞规模 ~ (T-1)/(p-1) == ((H+2)*(H+1)/2 - 1)/(2*H) == (H+3)/4 == (p+5)/8]
        [碰撞规模 ~ (p+5)/8]
        [p%8 == 3]:
            猜想:[碰撞规模纟非零 == (p+5)///8]
        [p%8 == 7]:
            猜想:[碰撞规模纟平方剩余牜非零 == (p+9)///8]
            猜想:[碰撞规模纟平方非剩余 == (p+1)///8]
        猜想:[碰撞规模纟非零{p%4==3} == (p+5+[p%8==7]*-4*(-1)**欤平方剩余)///8]
    猜想:[碰撞规模纟非零{p%2==1} == (p+4+1*(-1)**[p%4==1]+[p%8<-{1,7}]*-4*(-1)**欤平方剩余)///8]
===
定理:
(ZZ%p) => 应当分成3+3类:
    * 0:
        * [p==2]:
            (2, [(0, 0), (1, 1)])
        * [p%4==1]:
            ((p+1)///2, [(0, 0), (p-aa, aa)...])
        * [p%4==3]:
            (1, [(0, 0)])
    * 平方剩余牜非零aa:
        quadratic residue
        [aa == bb + cc]
        [gg*aa == gg*bb + gg*cc]
            => 此类 相同规模
        [bb <- {aa, ...}]
        [cc <- {0, ...}]
    * 平方非剩余h:
        quadratic nonresidue
        [h == bb + cc]
        [gg*h == gg*bb + gg*cc]
            => 此类 相同规模
        [bb =!= h]
        [cc =!= 0]
===
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =2
    (2, [(0, 0), (1, 1)])
    (1, [(1, 0)])
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =3
    (1, [(0, 0)])
    (1, [(1, 0)])
    (1, [(1, 1)])

py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =5
    (2, [(0, 0), (4, 1)])
    (1, [(1, 0)])
    (1, [(1, 1)])
    (1, [(4, 4)])
    (1, [(4, 0)])


py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =7
    (1, [(0, 0)])
    (2, [(1, 0), (4, 4)])
    (2, [(1, 1), (2, 0)])
    (1, [(2, 1)])
    (2, [(2, 2), (4, 0)])
    (1, [(4, 1)])
    (1, [(4, 2)])

py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =11
    (1, [(0, 0)])
    (2, [(1, 0), (9, 3)])
    (2, [(1, 1), (9, 4)])
    (2, [(3, 0), (9, 5)])
    (2, [(3, 1), (4, 0)])
    (2, [(4, 1), (5, 0)])
    (2, [(3, 3), (5, 1)])
    (2, [(4, 3), (9, 9)])
    (2, [(4, 4), (5, 3)])
    (2, [(5, 4), (9, 0)])
    (2, [(5, 5), (9, 1)])

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =13
    0:(4, [(0, 0), (9, 4), (10, 3), (12, 1)])
    1:(2, [(1, 0), (10, 4)])
    2:(2, [(1, 1), (12, 3)])
    3:(2, [(3, 0), (12, 4)])
    4:(2, [(3, 1), (4, 0)])
    5:(2, [(4, 1), (9, 9)])
    6:(2, [(3, 3), (10, 9)])
    7:(2, [(4, 3), (10, 10)])
    8:(2, [(4, 4), (12, 9)])
    9:(2, [(9, 0), (12, 10)])
    10:(2, [(9, 1), (10, 0)])
    11:(2, [(10, 1), (12, 12)])
    12:(2, [(9, 3), (12, 0)])


py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =17
    0:(5, [(0, 0), (9, 8), (13, 4), (15, 2), (16, 1)])
    1:(3, [(1, 0), (9, 9), (16, 2)])
    2:(3, [(1, 1), (2, 0), (15, 4)])
    3:(2, [(2, 1), (16, 4)])
    4:(3, [(2, 2), (4, 0), (13, 8)])
    5:(2, [(4, 1), (13, 9)])
    6:(2, [(4, 2), (15, 8)])
    7:(2, [(15, 9), (16, 8)])
    8:(3, [(4, 4), (8, 0), (16, 9)])
    9:(3, [(8, 1), (9, 0), (13, 13)])
    10:(2, [(8, 2), (9, 1)])
    11:(2, [(9, 2), (15, 13)])
    12:(2, [(8, 4), (16, 13)])
    13:(3, [(9, 4), (13, 0), (15, 15)])
    14:(2, [(13, 1), (16, 15)])
    15:(3, [(13, 2), (15, 0), (16, 16)])
    16:(3, [(8, 8), (15, 1), (16, 0)])


py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =19
    0:(1, [(0, 0)])
    1:(3, [(1, 0), (11, 9), (16, 4)])
    2:(3, [(1, 1), (16, 5), (17, 4)])
    3:(3, [(11, 11), (16, 6), (17, 5)])
    4:(3, [(4, 0), (16, 7), (17, 6)])
    5:(3, [(4, 1), (5, 0), (17, 7)])
    6:(3, [(5, 1), (6, 0), (16, 9)])
    7:(3, [(6, 1), (7, 0), (17, 9)])
    8:(3, [(4, 4), (7, 1), (16, 11)])
    9:(3, [(5, 4), (9, 0), (17, 11)])
    10:(3, [(5, 5), (6, 4), (9, 1)])
    11:(3, [(6, 5), (7, 4), (11, 0)])
    12:(3, [(6, 6), (7, 5), (11, 1)])
    13:(3, [(7, 6), (9, 4), (16, 16)])
    14:(3, [(7, 7), (9, 5), (17, 16)])
    15:(3, [(9, 6), (11, 4), (17, 17)])
    16:(3, [(9, 7), (11, 5), (16, 0)])
    17:(3, [(11, 6), (16, 1), (17, 0)])
    18:(3, [(9, 9), (11, 7), (17, 1)])

py_adhoc_call { -lineno }  script.整数分解牜允许快速求值的多根多项式   ,制表冫平方和碰撞分布乊剩余环扌 +to_zip =23
    0:(1, [(0, 0)])
    1:(4, [(1, 0), (12, 12), (16, 8), (18, 6)])
    2:(4, [(1, 1), (2, 0), (13, 12), (16, 9)])
    3:(4, [(2, 1), (3, 0), (13, 13), (18, 8)])
    4:(4, [(2, 2), (3, 1), (4, 0), (18, 9)])
    5:(3, [(3, 2), (4, 1), (16, 12)])
    6:(4, [(3, 3), (4, 2), (6, 0), (16, 13)])
    7:(3, [(4, 3), (6, 1), (18, 12)])
    8:(4, [(4, 4), (6, 2), (8, 0), (18, 13)])
    9:(4, [(6, 3), (8, 1), (9, 0), (16, 16)])
    10:(3, [(6, 4), (8, 2), (9, 1)])
    11:(3, [(8, 3), (9, 2), (18, 16)])
    12:(4, [(6, 6), (8, 4), (9, 3), (12, 0)])
    13:(4, [(9, 4), (12, 1), (13, 0), (18, 18)])
    14:(3, [(8, 6), (12, 2), (13, 1)])
    15:(3, [(9, 6), (12, 3), (13, 2)])
    16:(4, [(8, 8), (12, 4), (13, 3), (16, 0)])
    17:(3, [(9, 8), (13, 4), (16, 1)])
    18:(4, [(9, 9), (12, 6), (16, 2), (18, 0)])
    19:(3, [(13, 6), (16, 3), (18, 1)])
    20:(3, [(12, 8), (16, 4), (18, 2)])
    21:(3, [(12, 9), (13, 8), (18, 3)])
    22:(3, [(13, 9), (16, 6), (18, 4)])

































































































===
]]
[[
乙型:
整数分解牜乙型平方累聚型多项式求值牜原理错扌
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜乙型平方累聚型多项式求值牜原理错扌 ='(-1+2**67)' =20 =3 =5
    (False, 1)
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜乙型平方累聚型多项式求值牜原理错扌 ='(-1+2**67)' =60 =3 =5
    (False, 1)
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜乙型平方累聚型多项式求值牜原理错扌 ='(-1+2**67)' =67 =3 =5
    (False, 1)
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @整数分解牜乙型平方累聚型多项式求值牜原理错扌 ='(-1+2**67)' =6 =3 =9
    (False, 1)
        bug???
            是，但是原理性错误，见上面

]]
[[
@20260709
考察冫二维幺正矩阵乊剩余环扌
e others/数学/我的猜想.txt
    其实就是 高斯整数
    !! (a,b) ~ (+/-a,+/-b),(b,a)
    # [a==0] => (0,+/-1),(+/-1,0)
    # [a==b] => (+/-a,+/-a)
    [二维幺正群规模%4==0]
    [p%4==1]:
        [1j <- ZZ%p]
        猜想:[二维幺正群规模==(p-1)]
    [p%4==3]:
        [1j <- (ZZ%p)[I]%(1+I**2)]
        猜想:[二维幺正群规模==(p+1)]
猜想:[二维幺正群规模%p==(p+(-1)**[p%4==1])]
    !! 猜想:[碰撞规模纟非零{p%2==1} == (p+4+1*(-1)**[p%4==1]+[p%8<-{1,7}]*-4*(-1)**欤平方剩余)///8]
    => [[p%8==1] -> [p-1==二维幺正群规模==(p+7)///8*8-4*2][#ie:1=[%p]=(2*X**2)#]] #另一是(0,+/-1) 必然包含
        # [+2是 平方剩余%p]
    => [[p%8==5] -> [p-1==二维幺正群规模==(p+3)///8*8-4*1]]
        qfbsolve(Qbf(2,0,-1),p,3)无解
        # [+2非 平方剩余%p]
    => [[p%8==3] -> [p+1==二维幺正群规模==(p+5)///8*8-4*1]]
        qfbsolve(Qbf(2,0,-1),p,3)无解
        # [+2非 平方剩余%p]
    => [[p%8==7] -> [p+1==二维幺正群规模==(p+9)///8*8-4*2]]
        # [+2是 平方剩余%p]

还行，可以作为 减一分解法 的 补充，只要 合数的小素数 是(3+4k)型 [#1/2可能性#]

===
deprecate:++kw:to_std
===
? 257%8
1
? 263%8
7
? 269%8
5
? 271%8
7
? 277%8
5
? 271%8
7
? 281%8
1
? 283%8
3

%8:1,5
%4:1
257-->(p-1)
269-->(p-1)
281-->(p-1)

%8:3,7
%4:3
263-->(p+1)
283-->(p+1)
===
py_adhoc_call { +lineno }  script.整数分解牜允许快速求值的多根多项式   ,考察冫二维幺正矩阵乊剩余环扌   =257
    1:((1, 0), 1)
    2:((30, 30), 8)
    3:((52, 102), 256)
    4:((69, 61), 32)
    5:((81, 76), 256)
    6:((44, 11), 256)
    7:((59, 115), 128)
    8:((107, 84), 256)
    9:((12, 63), 16)
    10:((71, 10), 128)
    11:((38, 108), 256)
    12:((13, 54), 256)
    13:((106, 79), 256)
    14:((31, 117), 128)
    15:((14, 24), 128)
    16:((35, 33), 128)
    17:((55, 46), 256)
    18:((126, 109), 256)
    19:((86, 40), 256)
    20:((112, 43), 128)
    21:((42, 6), 256)
    22:((123, 99), 64)
    23:((45, 17), 32)
    24:((22, 51), 64)
    25:((75, 95), 256)
    26:((80, 119), 128)
    27:((122, 58), 64)
    28:((39, 104), 256)
    29:((92, 77), 256)
    30:((64, 70), 256)
    31:((111, 4), 256)
    32:((121, 3), 64)
    33:((16, 60), 128)

===
py_adhoc_call { +lineno }  script.整数分解牜允许快速求值的多根多项式   ,考察冫二维幺正矩阵乊剩余环扌   =263
    1:((1, 0), 1)
    2:((55, 55), 8)
    3:((98, 91), 66)
    4:((107, 85), 132)
    5:((77, 11), 66)
    6:((102, 88), 44)
    7:((68, 30), 44)
    8:((122, 125), 264)
    9:((62, 75), 264)
    10:((70, 19), 88)
    11:((13, 44), 264)
    12:((31, 108), 44)
    13:((121, 80), 44)
    14:((21, 127), 132)
    15:((60, 95), 132)
    16:((112, 9), 88)
    17:((42, 128), 22)
    18:((106, 52), 264)
    19:((79, 129), 24)
    20:((14, 130), 88)
    21:((120, 131), 12)
    22:((48, 8), 132)
    23:((27, 18), 88)
    24:((90, 37), 264)
    25:((74, 92), 132)
    26:((84, 109), 264)
    27:((22, 116), 33)
    28:((15, 61), 66)
    29:((93, 89), 264)
    30:((105, 40), 264)
    31:((118, 4), 88)
    32:((76, 96), 264)
    33:((16, 43), 66)
    34:((28, 100), 264)
===
py_adhoc_call { +lineno }  script.整数分解牜允许快速求值的多根多项式   ,考察冫二维幺正矩阵乊剩余环扌   =269
    1:((1, 0), 1)
    2:((120, 76), 268)
    3:((12, 113), 268)
    4:((35, 11), 268)
    5:((42, 89), 268)
    6:((107, 53), 134)
    7:((48, 103), 268)
    8:((112, 10), 67)
    9:((119, 108), 268)
    10:((56, 30), 268)
    11:((98, 9), 268)
    12:((65, 34), 268)
    13:((27, 50), 134)
    14:((63, 41), 268)
    15:((133, 55), 67)
    16:((118, 123), 268)
    17:((132, 84), 268)
    18:((88, 70), 268)
    19:((80, 47), 268)
    20:((131, 104), 134)
    21:((22, 18), 268)
    22:((111, 79), 134)
    23:((32, 44), 67)
    24:((73, 66), 67)
    25:((15, 109), 268)
    26:((54, 115), 268)
    27:((129, 24), 67)
    28:((46, 87), 268)
    29:((75, 5), 134)
    30:((28, 37), 134)
    31:((49, 57), 134)
    32:((16, 52), 134)
    33:((110, 116), 134)
    34:((105, 126), 134)
===
py_adhoc_call { +lineno }  script.整数分解牜允许快速求值的多根多项式   ,考察冫二维幺正矩阵乊剩余环扌   =283
    1:((1, 0), 1)
    2:((133, 78), 284)
    3:((85, 64), 284)
    4:((116, 107), 284)
    5:((52, 134), 71)
    6:((27, 11), 284)
    7:((122, 76), 71)
    8:((80, 26), 284)
    9:((99, 117), 284)
    10:((131, 88), 71)
    11:((40, 74), 284)
    12:((55, 70), 142)
    13:((106, 59), 71)
    14:((22, 138), 284)
    15:((130, 9), 142)
    16:((115, 139), 284)
    17:((87, 140), 71)
    18:((110, 97), 284)
    19:((28, 42), 284)
    20:((15, 25), 284)
    21:((129, 118), 284)
    22:((71, 51), 142)
    23:((69, 30), 284)
    24:((73, 7), 284)
    25:((33, 45), 284)
    26:((67, 48), 71)
    27:((23, 86), 284)
    28:((75, 6), 71)
    29:((120, 113), 284)
    30:((16, 126), 142)
    31:((114, 56), 71)
    32:((77, 79), 284)
    33:((105, 101), 284)
    34:((29, 3), 71)
    35:((109, 17), 284)
    36:((89, 2), 284)
===
py_adhoc_call { +lineno }  script.整数分解牜允许快速求值的多根多项式   ,考察冫二维幺正矩阵乊剩余环扌   =281
    1:((1, 0), 1)
    2:((66, 66), 8)
    3:((12, 104), 280)
    4:((83, 74), 280)
    5:((76, 72), 280)
    6:((88, 94), 280)
    7:((57, 113), 140)
    8:((43, 20), 280)
    9:((125, 127), 140)
    10:((32, 35), 140)
    11:((14, 128), 280)
    12:((117, 9), 14)
    13:((124, 19), 20)
    14:((22, 109), 40)
    15:((103, 114), 56)
    16:((139, 120), 28)
    17:((80, 8), 70)
    18:((93, 25), 280)
    19:((137, 79), 7)
    20:((96, 45), 280)
    21:((15, 30), 35)
    22:((90, 98), 280)
    23:((47, 130), 56)
    24:((33, 6), 70)
    25:((99, 63), 140)
    26:((23, 92), 280)
    27:((116, 95), 40)
    28:((44, 34), 140)
    29:((134, 121), 280)
    30:((71, 115), 70)
    31:((69, 110), 35)
    32:((122, 65), 10)
    33:((58, 3), 70)
    34:((67, 17), 140)
    35:((106, 75), 56)
    36:((53, 132), 280)
===
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @矩乘幂冫平方和乊剩余环扌 =281 ='(66,66)' =8
    (1, 0)
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @矩乘幂冫平方和乊剩余环扌 =281 ='(66,66)' =4
    (280, 0)

===
]]
[[
===
考察冫环乘阶纟幺正点乊随机二维剩余环扌
    [2*p,(p+1),(p-1)]
    相应于Jacobi_symbol(M;D)
    ???vs:Lucas-seq???
===
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,stable_repr.考察冫环乘阶纟幺正点乊随机二维剩余环扌 ='257'  ='[(a,b,A) for a in range(10) for b in range(1,11) for A in range(10)]' +only_exps +to_show_Jacobi_symbol
    [514, 258, 256]
    {frozenset({-1}): {3, 6, 43, 86, 129, 258}, frozenset({0}): {257, 514}, frozenset({1}): {4, 8, 16, 32, 64, 128, 256}}
===
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,stable_repr.考察冫环乘阶纟幺正点乊随机二维剩余环扌 ='281'  ='[(a,b,A) for a in range(10) for b in range(1,11) for A in range(10)]' +only_exps +to_show_Jacobi_symbol
    [562, 282, 280]
    {frozenset({-1}): {3, 6, 47, 94, 141, 282}, frozenset({0}): {281, 562}, frozenset({1}): {4, 5, 7, 10, 14, 20, 28, 35, 40, 56, 70, 140, 280}}
===
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,stable_repr.考察冫环乘阶纟幺正点乊随机二维剩余环扌 ='283'  ='[(a,b,A) for a in range(10) for b in range(1,11) for A in range(10)]' +only_exps +to_show_Jacobi_symbol
    [566, 284, 282]
    {frozenset({-1}): {4, 71, 142, 284}, frozenset({0}): {283, 566}, frozenset({1}): {3, 6, 47, 94, 141, 282}}
===
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,stable_repr.考察冫环乘阶纟幺正点乊随机二维剩余环扌 ='269'  ='[(a,b,A) for a in range(10) for b in range(1,11) for A in range(10)]' +only_exps +to_show_Jacobi_symbol
    [538, 270, 268]
    {frozenset({-1}): {3, 5, 6, 10, 15, 18, 27, 30, 45, 90, 135, 270}, frozenset({0}): {269, 538}, frozenset({1}): {4, 67, 134, 268}}
===
py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   ,stable_repr.考察冫环乘阶纟幺正点乊随机二维剩余环扌 ='263'  ='[(a,b,A) for a in range(10) for b in range(1,11) for A in range(10)]' +only_exps +to_show_Jacobi_symbol
    [526, 264, 262]
    {frozenset({-1}): {3, 4, 6, 11, 12, 24, 33, 44, 66, 88, 132, 264}, frozenset({0}): {263, 526}, frozenset({1}): {131, 262}}
===
===
===
===
]]
[[
异阶本原根组合:here
    失败@20260712
    原本是打算 构造2个 幂方模板:
        [g0(x)**(p+d0) =[%f(x)]= h0(x)]
        [g1(x)**(p+d1) =[%f(x)]= h1(x)]
    嵌套:
        # [x:=inv4g0(x)]
        [g0(inv4g0(x))**(p+d0) =[%f(inv4g0(x))]= h0(inv4g0(x))]
        [x**(p+d0) =[%f(inv4g0(x))]= h0(inv4g0(x))]
        !! 假设:[f(inv4g0(x)) == f(+/-x**(+/-1))]
        [x**(p+d0) =[%f(+/-x**(+/-1))]= h0(inv4g0(x))]
        # [x:=(+/-x**(+/-1))]
        [(+/-x**(+/-1))**(p+d0) =[%f(x)]= h0(inv4g0((+/-x**(+/-1))))]
        [x**(p+d0) =[%f(x)]= +/-h0(inv4g0((+/-x**(+/-1))))**(+/-1)]
            模板1
    再嵌套:
        # [x:=h1(x)]
        [h1(x)**(p+d0) =[%f(h1(x))]= +/-h0(inv4g0((+/-h1(x)**(+/-1))))**(+/-1)]
        !! 假设:[f(h1(x)) == f(x)]
        [h1(x)**(p+d0) =[%f(x)]= +/-h0(inv4g0((+/-h1(x)**(+/-1))))**(+/-1)]
        !! [g1(x)**(p+d1) =[%f(x)]= h1(x)]
        [g1(x)**((p+d0)*(p+d1)) =[%f(x)]= +/-h0(inv4g0((+/-h1(x)**(+/-1))))**(+/-1)]
            模板2
    但是发现没用:
        [[deg(f(X)) == 2][p-1 == mul_order_{ZZ%(p,f(X));g(X)}] -> [deg(g(x)) == 0]]

二维:阶规模是[2*p,(p+1),(p-1)]
    考察冫环乘阶纟幺正点乊随机二维剩余环扌:goto

观察到:
    [4 == mul_order_{ZZ%(p,X**2+1);X}] #即虚数1j的环乘阶必然是4
    [3 == mul_order_{ZZ%(p,X**2+X+1);X}]
    这是因为:
    [polcyclo(4) == X**2+1]
    [polcyclo(3) == X**2+X+1]
    [(-1+X**4)%polcyclo(4) == 0]
    [(-1+X**3)%polcyclo(3) == 0]
    [D{polcyclo(4)} == -4]
    [D{polcyclo(3)} == -3]
    !! 猜想
    [(1+[p==2])*(p-Jacobi_symbol(p;-4))%4 == 0]
    [(1+[p==3])*(p-Jacobi_symbol(p;-3))%3 == 0]
    ==>>:
    [(1+3*[p==2])*(p-Jacobi_symbol(p;-1))%4 == 0]
    [(p-Jacobi_symbol(p;-3))%3 == 0]
    ==>>:
    [[p%4==1] -> [Jacobi_symbol(p;-1) == +1]]
    [[p%4==3] -> [Jacobi_symbol(p;-1) == -1]]
    [[p%6==1] -> [Jacobi_symbol(p;-3) == +1]]
    [[p%6==5] -> [Jacobi_symbol(p;-3) == -1]]
假设:
    [order_mod_({p,f(X)};X) == (p-1)]
    [order_mod_({q,f(X)};X) == (q-1)]
    [order_mod_({p,g(X)};X) == (p+1)]
    [order_mod_({q,g(X)};X) == (q+1)]
    ==>>:
    [order_mod_({p*q,f(X)*g(X)};X) == lcm(-1+p**2,-1+q**2)///2]
    [(-1+p**2)*(-1+q**2)
    == (1 -(p**2+q**2) +(p*q)**2)
    == (1 -(p+q)**2 +2*p*q +(p*q)**2)
    :> [n:=p*q]
    == (1 -(p+q)**2 +2*n +n**2)
    == (n+1)**2 -(p+q)**2
    ]
    [X**n =[%[p,f(X)]]= X**q]
    [X**n =[%[p,g(X)]]= X**-q]
    [X**n =[%[q,f(X)]]= X**p]
    [X**n =[%[q,g(X)]]= X**-p]

    [X**n =[%[n,f(X)]]= X**q]


假设:
    [order_mod_({p,f(X)};X+c0) == (p-1)]
    [order_mod_({p,f(X)};X+c1) == (p+1)]
    [order_mod_({p,f(X)};X+c2) == (p-1)]
    [order_mod_({p,f(X)};X+c3) == (p+1)]
    [order_mod_({q,f(X)};X+c0) == (q-1)]
    [order_mod_({q,f(X)};X+c1) == (q-1)]
    [order_mod_({q,f(X)};X+c2) == (q+1)]
    [order_mod_({q,f(X)};X+c3) == (q+1)]
    组合数:4:(p+/-1,q+/-1)

假设:
    [f(X)==(C+B*X+X**2)]
    [k0==+/-1]
    [k1==+/-1]
    [f(u+v*X) == f(k0*X**k1)*X**(1-k1)]
    [f(u+v*X)
    == C+B*(u+v*X)+(u+v*X)**2
    == C+(B*u+B*v*X)+(u**2+2*u*v*X+v**2*X**2)
    == (C+B*u+u**2)+(2*u+B)*v*X+(v**2*X**2)
    ]
    [f(k0*X**k1)*X**(1-k1)
    == (C+B*(k0*X**k1)+(k0*X**k1)**2)*X**(1-k1)
    == (C+(k0*B*X**k1)+X**(2*k1))*X**(1-k1)
    == (C*X**(1-k1)+(k0*B)*X+X**(1+k1))
    ]
    [(2*u+B)*v == (k0*B)]
    [k1==+1][v**2 == 1][(C+B*u+u**2) == C]
    [k1==-1][v**2 == C][(C+B*u+u**2) == 1]
    [k1==+1]:
        !! [(C+B*u+u**2) == C]
        [(B+u)*u == 0]
        [[u == 0]or[u == -B]]
        [(2*u+B) == +/-B]
        [u == 0]:
            !! [(2*u+B)*v == (k0*B)]
            [B*(k0-v) == 0]
            [[B==0]or[k0==+v]]
        [u == -B]:
            !! [(2*u+B)*v == (k0*B)]
            [B*(k0+v) == 0]
            [[B==0]or[k0==-v]]
        [[u==B==0]or[k0==+v][u==0]or[k0==-v][u==-B]]
    [k1==-1]:
        !! [(2*u+B)*v == (k0*B)]
        [(2*u*v+B*v) == (k0*B)]
        [(2*u*v) == (k0-v)*B]
        [k0==v]:
            [u*v==0]
        [k0=!=v]:
            [B == (2*u*v)/(k0-v)]

        !! [v**2 == C]
        [C == v**2]
        !! [(C+B*u+u**2) == 1]
        [(v**2+B*u+u**2) == 1]
        [B*u == (1-u**2-v**2)]
        [u==0]:
            [0 == (1-v**2)]
            [C == v**2 == 1]
            !! [(2*u*v) == (k0-v)*B]
            [B*(k0-v) == 0]
            [[B==0]or[k0==+v]]
        [u=!=0]:
            [B == (1-u**2-v**2)/u]
            !! [(2*u*v) == (k0-v)*B]
            [[k0=!=+v]or[k0==+v==0]]
            [k0=!=+v]:
                !! [B == (2*u*v)/(k0-v)]
                [(1-u**2-v**2)/u == (2*u*v)/(k0-v)]
                [(1-u**2-v**2)*(k0-v) == (2*u*v)*u]
                [(1-uu-vv)*(k0-v) == 2*uuv]
                [(1-uu-vv)*k0 == (1+uu-vv)*v]
[x=%=(a+b*x)**2]
[x=%=(aa+2abx+bb*xx)]
[x=%=(aa+2abx-bb*(Bx+C))]
[x=%=(aa-bbC)+(2a-bB)*bx]
[0=%=(aa-bbC)+(-1+2ab-bbB)*x]
[0=%=(cc-C)+(-1/bb+2c-B)*x]
[cc==C][2c-1==B]
[xx+(2c-1)x+cc == (x+c)**2-x]
[f(x) == (x+c)**2-x == xx+(2c-1)x+cc]
[1==norm(c+x) == cc-(2c-1)c+cc == +c]
[f(x) == xx+x+1]
[(x+1)*x%f(x) == -1]
[(x+1)**2%f(x) == x]
[(x+1)**6%f(x) == x**3%f(x) == 1]

[(x+w)**2 -(-B-x) == xx+(2w+1)x+(ww+B)]
[B==1+2w]
[(x+w)**2 -(-B-x) == xx+(2w+1)x+(ww+B) == xx+Bx+(w+1)**2 == (x+(1+w))**2 -x]
[1==norm(-B-x) == BB-BB+(1+w)**2 == (1+w)**2]
[w==0|-2]
[B==1|-3]
[fff==xx+(1|-3)x+1]
[g==xx+x+1]
    D=-3
    %5,11,17,23,29...
    [znorder(Mod(-3,7)) == 3]
    [znorder(Mod(-3,13)) == 6]
[f==xx-3x+1]
    D=5
    %3,7,13,17,23... (5k+/-2)
    [znorder(Mod(5,7)) == 6]
    [znorder(Mod(5,11)) == 5]
    [znorder(Mod(5,13)) == 4]
    19,31 both +1
    17,23 both -1
g = 'x^2 + 'x + 1
r4g = -1 - 'x
g17=Mod(g,17)
r4g17=Mod(r4g,g17)
r4g17^3
    x^3=%=1
    (-1-x)=%=x^2
    (-1-x)^3=%=x^6=%=1
    useless

f= 'x^2 - 3*'x + 1
r4f= 3 - 'x
f7=Mod(f,7)
r4f7=Mod(r4f,f7)
r4f7^8
    Mod(Mod(1, 7), Mod(1, 7)*x^2 + Mod(4, 7)*x + Mod(1, 7))
r4f7^4
    Mod(Mod(6, 7), Mod(1, 7)*x^2 + Mod(4, 7)*x + Mod(1, 7))
    有用！
f17=Mod(f,17)
r4f17=Mod(r4f,f17)
r4f17^18
Mod(Mod(1, 17), Mod(1, 17)*x^2 + Mod(14, 17)*x + Mod(1, 17))
r4f17^9
    Mod(Mod(16, 17), Mod(1, 17)*x^2 + Mod(14, 17)*x + Mod(1, 17))
    有用！

[r4f(X)^(p+1) %{p,f(X)} == 1]
[c^(p-1) %p == 1]
[(c/r4f(X))^(p+1) =[%{p,f(X)}]= c**2]
[(c/r4f(X))^(p-1) =[%{p,f(X)}]= r4f(X)**2]
[X*r4f(X) =[%{p,f(X)}]= 1]
[1/r4f(X) =[%{p,f(X)}]= X]
[X^(p+1) %{p,f(X)} == 1]
[r4f(X)^p %{p,f(X)} == X]
[(c*X)^(p+1) =[%{p,f(X)}]= c**2]
[(c*X)^(p-1) =[%{p,f(X)}]= r4f(X)**2]
[(c*X)^((p-1)///2) =[%{p,f(X)}]= +/-r4f(X)]
[(c*X)^((p+1)///2) =[%{p,f(X)}]= +/-r4f(X)*(c*X) =%= +/-c]
[(c*X)^(p+1) =[%{p,f(X)}]= c**2]
[(c*+/-r4f(X))^(p+1) =[%{p,f(r4f(X))}]= c**2]
[(c*(c*X)^((p-1)///2))^(p+1) =[%{p,f(3-X)}]= c**2]
[(c^(p+1)*(c*X)^((p**2-1)///2)) =[%{p,f(3-X)}]= c**2]
[((c*X)^((p**2-1)///2)) =[%{p,f(3-X)}]= 1]



尝试冫直接构造异阶本原根:here
    h**(p-1)
    g**(p+1)
[f(x):=xx+Bx+1]
[g(x):=(-B-x)]
[x*g(x) =[%f(x)]= 1]
[g(x)**-1 =[%f(x)]= x]
[norm(g(x)) %f(x) == 1/norm(x) == 1/(0-0+1) == 1]
[norm(g(x)) %f(x) == ((-B)**2-B*(-B)*(-1)+1*(-1)**2) == 1]
[g(x)**(p+1) =[%f(x)]= 1]
[x**(p+1) =[%f(x)]= 1]

[h(x):=(2*x+B)]
[4*f(x)==(2*x+B)**2+(4-BB) == h(x)**2-D]
[h(x)**2 =[%f(x)]= D]
[h(x)**(2*(p-1)) =[%f(x)]= D**(p-1) =[%p]= 1]
[h(x)**(2*(p-1)) =[%{p,f(x)}]= 1]
[h(x)**-1 =[%f(x)]= h(x)/D]

[(g(x)*h(x))**(2*(p+1)) =[%{p,f(x)}]= h(x)**(2p-2+4) =[%{p,f(x)}]= h(x)**4 =[%{p,f(x)}]= D**2]
[(g(x)*h(x))**(2*(p-1)) =[%{p,f(x)}]= g(x)**(2p+2-4) =[%{p,f(x)}]= g(x)**-4 =[%{p,f(x)}]= x**4]
==>>:
[(g(x)*h(x))**(p+1) =[%{p,f(x)}]= +/-D]
[(g(x)*h(x))**(p-1) =[%{p,f(x)}]= +/-x**2 =%= +/-(Bx+1)]
==>>:
[(g(x)*h(x))**(p+1) =[%{p,f(x)}]= (h(x)**2)**((p+1)///2) =[%{p,f(x)}]= D**(1+(p-1)///2) =[%{p,f(x)}]= D*Jacobi_symbol(p;D)]
[(g(x)*h(x))**(p-1) =[%{p,f(x)}]= g(x)**-2 * Jacobi_symbol(p;D) =%= x**2 * Jacobi_symbol(p;D) =%= -(Bx+1)*Jacobi_symbol(p;D)]
==>>:
[(g(x)*h(x))**(p+1) =[%{p,f(x)}]= D*Jacobi_symbol(p;D)]
[(g(x)*h(x))**(p-1) =[%{p,f(x)}]= -(Bx+1)*Jacobi_symbol(p;D)]
[h(x)**(p-1) =[%{p,f(x)}]= Jacobi_symbol(p;D)]
[h(x)**(p*q) =[%{p,f(x)}]= Jacobi_symbol(p;D)**q * h(x)**q =%= J * D**(q-1)///2) * h(x)]
[h(x)**(p*q-1) =[%{p,f(x)}]= Jacobi_symbol(p;D) * D**(q-1)///2)]
[D**(p*q-1) =[%{p,f(x)}]= D**(q-1)]


[(g(x)*h(x)) == (-B-x)*(2*x+B) == -(2xx+3Bx+BB) =[%{p,f(x)}]= -(Bx+BB-2)]
[(g(x)*h(x))**-1 =[%{p,f(x)}]= x*(2*x+B)/D == (2xx+2Bx-Bx)/D =%= -(Bx+2)/D]
[D*Jacobi_symbol(p;D) =%= (g(x)*h(x))**(p+1) == (g(x)*h(x))**(p-1) * (g(x)*h(x))**2 =[%{p,f(x)}]= -(Bx+1)*Jacobi_symbol(p;D) * (x+B)**2 * D =%= -(Bx+1)*(x+B)**2*D*Jacobi_symbol(p;D)]
[-1 =[%f(x)]= (Bx+1)*(x+B)**2]

[n:=p*q][n-1==s*t][B:=s-t]:
    [f(t) == tt+(s-t)*t+1 == s*t+1 == n]
    [f(-s) == ss+(s-t)*-s+1 == s*t+1 == n]
    [f(t)%n == 0]
    [f(-s)%n == 0]
    [f(x) =[%n]= (x-t)*(x+s)]
    [D==B**2-4 == (s-t)**2-4 == (s+t)**2 -4*(s*t+1) == (s+t)**2 -4*n]
    [D%n == (s+t)**2]
    [Jacobi_symbol(n;D) == +1]
[n:=p*q][(s*t+1)%p == 0][B:=s-t]:
    [f(t) == tt+(s-t)*t+1 == s*t+1 =[%p]= 0]


假设:
    [f(X)==C+B*X+X**2]
    [order_mod_({p,f(X)};(b0*X+c0)) == (p-1)]
    [order_mod_({p,f(X)};(b1*X+c1)) == (p+1)]
    [Y:=((c0+b0*X)/(c1+b1*X))]
    [Y**(p-1) =[%f(X)]= (b1*X+c1)**-(p-1) =[%f(X)]= (b1*X+c1)**+2]
    [Y**(p+1) =[%f(X)]= (b0*X+c0)**+(p+1) =[%f(X)]= (b0*X+c0)**+2]
假设:
    [order_mod_({p,f(X)};(b0*X+c0)) == (p-1)]
        # [order_mod_({p,f(X)};-C) == (p-1)]
    [order_mod_({p,f(X)};(b1*X+c1)) == (p+1)]
        # [order_mod_({p,f(X)};X) == (p+1)]
        # [f(X)==C+B*X+X**2]
        # !! [norm(a+b*X) == (a**2-B*a*b+C*b**2)]
        # [norm(0+1*X) == C]
        # !! [order_mod_({p,f(X)};X) == (p+1)]
        # [C == 1][Jacobi_symbol(B**2-4*C) == -1]
        # [order_mod_({p,f(X)};-C) == <= 2 <= (p-1)]
        # _L
    [Y:=((c0+b0*X)/(c1+b1*X))]
        # -C/X
    [Y =[%f(X)]= (e+d*X)]
        # B+X
    [X == (c0-c1*Y)/(-b0+b1*Y)]
        # -C/Y
    [X =[%f(X)]= (Y-e)/d]
        # -B+Y
    [Y**(p-1) =[%f(X)]= (b1*X+c1)**-(p-1) =[%f(X)]= (b1*X+c1)**+2]
        # X**2
    [Y**(p+1) =[%f(X)]= (b0*X+c0)**+(p+1) =[%f(X)]= (b0*X+c0)**+2]
        # C**2
    [order_mod_({p,f(X)};Y) == (-1+p**2)///2]
        # [order_mod_({p,f(X)};X+B) == (-1+p**2)///2]
    let [(b1*X+c1) == (d1*Y+e1)]
        # [1*X+0 == 1*Y+-B]
    let [(b0*X+c0) == (d0*Y+e0)]
        # [0*X+-C == 0*Y+-C]
    [Y**(p-1) =[%f(X)]= (d1*Y+e1)**+2]
        # [Y**(p-1) =%= (Y-B)**2]
    [Y**(p+1) =[%f(X)]= (d0*Y+e0)**+2]
        # [Y**(p+1) =%= (-C)**2]

    [Y**(p-1) =[%f((Y-e)/d)]= (d1*Y+e1)**+2]
        # [Y**(p-1) =[%f(Y-B)]= (Y-B)**2]
    [f((Y-e)/d) == f(-k0*Y)][k0==+/-1]:
        [Y**(p-1) =[%f(-k0*Y)]= (d1*Y+e1)**+2]
            # [Y**(p-1) =[%f(-Y)]= (Y-B)**2]
        [(-k0*Y)**(p-1) =[%f(-k0*(-k0*Y))]= (d1*(-k0*Y)+e1)**+2]
        [Y**(p-1) =[%f(Y)]= (-k0*d1*Y+e1)**+2]
        [X**(p-1) =[%f(X)]= (-k0*d1*X+e1)**+2]
            # [X**(p-1) =[%f(X)]= (-X-B)**2]
        [X**(p+1) =[%f(X)]= ((-k0*d1*X+e1)*X)**+2]
            # [X**(p+1) =[%f(X)]= ((-X-B)*X)**2 =%= C**2]
        [(-k0*d1*X+e1)**(p+1) =[%f((-k0*d1*X+e1))]= ((-k0*d1*(-k0*d1*X+e1)+e1)*(-k0*d1*X+e1))**+2]
            # [(-X-B)**(p+1) =[%f((-X-B))]= ((-(-X-B)-B)*(-X-B))**2 =?= C**2]
        [f(-k0*d1*X+e1) == f(X)]:
            [(-k0*d1*X+e1)**(p+1) =[%f(X)]= ((-k0*d1*(-k0*d1*X+e1)+e1)*(-k0*d1*X+e1))**+2]
                # [(-X-B)**(p+1) =[%f(X)]= ((-(-X-B)-B)*(-X-B))**2 =?= C**2]
                # [(-X-B)**(p+1) =[%f(X)]= C**2]
            !! [X**(p-1) =[%f(X)]= (-k0*d1*X+e1)**+2]
                # [X**(p-1) =[%f(X)]= (-X-B)**2]
            [(X**(p-1))**((p+1)///2) =[%f(X)]= ((-k0*d1*(-k0*d1*X+e1)+e1)*(-k0*d1*X+e1))**2]
                # [X**((-1+p**2)///2) =[%f(X)]= C**2]
            [+/-1 =[%f(X)]= ((-k0*d1*(-k0*d1*X+e1)+e1)*(-k0*d1*X+e1))**2]
                # [+/-1 =[%f(X)]= C**2]
    [f((X-e)/d) == f(-k0*X)][f(-k0*d1*X+e1) == f(X)]:
        [+/-1 =[%f(X)]= ((-k0*d1*(-k0*d1*X+e1)+e1)*(-k0*d1*X+e1))**2]
        [f(X)==C+B*X+X**2]:
            [f(u+v*X)
            == C+B*(u+v*X)+(u+v*X)**2
            == C+(B*u+B*v*X)+(u**2+2*u*v*X+v**2*X**2)
            == (C+B*u+u**2)+(2*u+B)*v*X+(v**2*X**2)
            == f(+/-X)
            == C+(+/-1)*B*X+X**2
            == C+k*B*X+X**2
            == f(k*X)
            ]
            [v==+/-1]
            [k==+/-1]
            [k*B == (2*u+B)*v]
            [v==k]:
                [B == (2*u+B)]
                [u == 0]
                [(C+B*u+u**2) == C]
            [v==-k]:
                [-B == (2*u+B)]
                [u == -B]
                [(C+B*u+u**2) == C]
            [u==(0|-B)]
            [f(0+X) == f(+X)]
            [f(0-X) == f(-X)]
            [f(-B-X) == f(+X)]
            [f(-B+X) == f(-X)]
            !! [f((X-e)/d) == f(-k0*X)][f(-k0*d1*X+e1) == f(X)]
            [e1==-B][k0*d1==1]:or:[e1==0][k0*d1==-1]
            [d==k0][e==k0*B]:or:[d==-k0][e==0]
            !! [X =[%f(X)]= (Y-e)/d]
            [X =[%f(X)]= (k0*Y-B)|(-k0*Y)]
            [Y==k0*(X+B)|(-k0*X)]
            !! [(b1*X+c1) == (k0*d1*Y+e1)]
            [(b1*X+c1) == (k0*d1*(X+B)+e1)]
            [(b1*X+c1) == (1*(X+B)-B)]
            [b1 == 1]
            [c1 == 0]
            !! [Y:=((c0+b0*X)/(c1+b1*X))]
            [(X+B)=[%f(X)]=((c0+b0*X)/(0+1*X))]
            [(X**2+B*X)=[%f(X)]=((c0+b0*X))]
            [-C=[%f(X)]=((c0+b0*X))]
            !! [(b0*X+c0) == (d0*Y+e0)]
            [(b0*X+c0) == (d0*(X+B)+e0)]
            [-C == (d0*(X+B)+e0)]
            [d0==0]
            [e0==-C]
            [(b0*X+c0) == -C]
            [(b1*X+c1) == X]
            !! [+/-1 =[%f(X)]= ((-k0*d1*(-k0*d1*X+e1)+e1)*(-k0*d1*X+e1))]
            [+/-1 =[%f(X)]= ((-1*(-1*X-B)-B)*(-1*X-B))**2]
            [+/-1 =[%f(X)]= (((X+B)-B)*(-1*X-B))**2]
            [+/-1 =[%f(X)]= (X**2+B*X)**2]
            [+/-1 =[%f(X)]= C**2]
            [4%order_mod_({p,f(X)};-C) == 0]
            [order_mod_({p,f(X)};-C) <- {1,2,4}]
            !! [order_mod_({p,f(X)};-C) == (p+1)]
            _L

]]
[[
@20260713:
    结论:无用
见上面:尝试冫直接构造异阶本原根:goto
    [f(x):=xx+Bx+1]
    [h(x):=(2*x+B)]
    [D:=B**2-4]
    [h(x)**2 =[%f(x)]= D]
    [h(x)**(p-1) =[%{p,f(x)}]= Jacobi_symbol(p;D)]
    [D**(p*q-1) =[%p]= D**(q-1)]
        # [D**(p*q-1) =[%(p*q)]= CRT(D**(q-1)%p; D**(p-1)%q)]
    [h(x)**(p*q-1) =[%{p,f(x)}]= Jacobi_symbol(p;D) * D**(q-1)///2)]
==>>:
how:D --> -D
    [B**2-4==-(E**2-4)]
    [B**2+E**2 == 8]
    定点求平方碰撞:goto
D --> -D:
    [rhs:=Jacobi_symbol(p;D) * D**(q-1)///2)]
    rhs --> rhs*(-1)**[p%4==q%4]
    #无用:%p %q 同时变号
[p*q == 1+(1+2*k)*2**ez]:
    [h(x)**((p*q-1)///2**ez) == h(x)**(1+2*k) =[%{p,f(x)}]= h(x)*D**k]
        也无用

[(kp,rp):=divmod(e,p-1)][(ep,bp):=rp/%2]:
    [e == bp +2*ep +kp*(p-1)]
    [h(x)**e == h(x)**(rp+kp*(p-1)) =[%{p,f(x)}]= h(x)**bp * D**ep * Jacobi_symbol(p;D)**kr]
    D --> -D
    本质上就没用:[h**(2c) =%= D**c =%= D**(c%((p-1)///2)) * Jacobi_symbol(p;D)**(c//((p-1)///2))]

]]













py_adhoc_call   script.整数分解牜允许快速求值的多根多项式   @f
from script.整数分解牜允许快速求值的多根多项式 import *
]]]'''#'''
__all__ = r'''
'''.split()#'''
__all__
___begin_mark_of_excluded_global_names__0___ = ...
#.#################################
from seed.helper.lazy_import__func7context import mk_ctx4lazy_import4funcs_ #NOTE:not support "as"
with mk_ctx4lazy_import4funcs_(__name__):
    from seed.tiny_.check import check_type_is, check_int_ge, check_callable
    from math import gcd
    from seed.math.Jacobi_symbol import Jacobi_symbol
    from seed.tiny_.dict__add_fmap_filter import fmap4dict_value
    from seed.mapping_tools.dict_op import inv__k2v_to_v2ks
#.    from itertools import islice
#.#################################
___end_mark_of_excluded_global_names__0___ = ...
def 待定系数冫幺正点乊二维剩余环扌(MA, ab, /):
    # [1 == norm(a+b*X) == (a**2-A*a*b+B*b**2)]
    # [1+A*a*b-a**2 == B*b**2]
    # [1+(A*b-a)*a == B*b**2]
    # [(1+(A*b-a)*a)/b**2 == B]
    (M,A) = MA
    (a,b) = ab
    B = ((A*b-a)%M *a + 1) %M * pow(b, -2, M) %M
    return B
def 环范冫二维剩余环扌(MAB, ab, /):
    # [norm(a+b*X) == (a**2-A*a*b+B*b**2)]
    # [norm(a+b*X) == (a**2+b*(-A*a+B*b))]
    (M,A,B) = MAB
    (a,b) = ab
    aA_bB = (-A*a+B*b)%M
    return (a**2+b*aA_bB)%M

def 环乘冫二维剩余环扌(MAB, ab, cd, /):
    # ZZ[X]%(X**2+A*X+B)
    # [(a+b*X)*(c+d*X) == ((a*c-b*d*B)+(b*c+a*d-b*d*A)*X)]
    (M,A,B) = MAB
    (a,b) = ab
    (c,d) = cd
    bd = b*d%M
    ac_bdB = (a*c-bd*B)%M
    ad_bc_bdA = (a*d+b*c-bd*A)%M
    return (ac_bdB, ad_bc_bdA)
def 环幂冫二维剩余环扌(MAB, ab, e, /):
    def mul_(ab, cd, /, *, MAB=MAB):
        return 环乘冫二维剩余环扌(MAB, ab, cd)
    def sq_(ab, /):
        return mul_(ab, ab)
    pw = I = (1,0)
    for b in map(int, f'{e:b}'):
        pw = sq_(pw)
        if b:
            pw = mul_(ab, pw)
    return pw

def 环乘阶纟幺正点乊二维剩余环扌(MAx, ab, /, *, 欤待定系数):
    if 欤待定系数:
        MA = MAx
        B = 待定系数冫幺正点乊二维剩余环扌(MA, ab)
        MAB = (*MA,B)
    else:
        MAB = MAx
    MAB
    def mul_(ab, cd, /, *, MAB=MAB):
        return 环乘冫二维剩余环扌(MAB, ab, cd)
    I = (1,0)
    pw = I
    e = 0
    while 1:
        e += 1
        pw = mul_(ab, pw)
        #print(e, ab, pw)
        #if e > 1000:raise 000
        if pw == I:break
    return e if not 欤待定系数 else (e, B)

def Jacobi_symbol4discriminant5MAB_(MAB, /):
    (M,A,B) = MAB
    D = discriminant5MAB_(MAB)
    return Jacobi_symbol(M, D)
def discriminant5MAB_(MAB, /):
    # ZZ[X]%(X**2+A*X+B)
    (M,A,B) = MAB
    D = (A**2-4*B)%M
    return D
    ##bug:
    assert M&1
    D = (A**2-4*B)%M
    if D&1:
        D += M
    assert D&1 == 0
    D //= 2
    return D
def 考察冫环乘阶纟幺正点乊随机二维剩余环扌(M, abA_ls, /, *, only_exps=False, to_show_Jacobi_symbol=False):
    es = {1}
    if to_show_Jacobi_symbol:
        #e2Js = {1:{0}}
        e2Js = {}
    for (a,b,A) in abA_ls:
        a %= M
        b %= M
        A %= M
        MA = (M,A)
        ab = (a,b)
        (e,B) = 环乘阶纟幺正点乊二维剩余环扌(MA, ab, 欤待定系数=True)
        MAB = (M,A,B)
        if not only_exps:
            yield (e, MAB, ab)
        es.add(e)
        if to_show_Jacobi_symbol:
            J = Jacobi_symbol4discriminant5MAB_(MAB)
            Js = e2Js.setdefault(e, set())
            Js.add(J)
    _es = sorted(es)
    ls = []
    while _es:
        _e = _es.pop()
        if not any(e%_e == 0 for e in ls):
            ls.append(_e)
    es = ls
    yield es
    if to_show_Jacobi_symbol:
        #yield e2Js
        e2Js = fmap4dict_value(frozenset, e2Js)
        js2es = inv__k2v_to_v2ks(e2Js)
        yield js2es
    return





















def 矩乘冫平方和乊剩余环扌(M, ab, cd, /, *, to_std=False):
    # [(a**2+b**2)*(c**2+d**2) == ((a*c-b*d)**2+(a*d+b*c)**2)]
    (a,b) = ab
    (c,d) = cd
    ac_bd = a*c-b*d
    ad_bc = a*d+b*c
    (ac_bd, ad_bc) = _std(to_std, M, ac_bd, ad_bc)
    return (ac_bd, ad_bc)
def 矩乘平方冫平方和乊剩余环扌(M, ab, /, *, to_std=False):
    # [(a**2+b**2)**2 == ((a**2-b**2)**2+(2*a*b)**2)]
    return 矩乘冫平方和乊剩余环扌(M, ab, ab)
    (a,b) = ab
    P = (a+b)**2
    N = (a-b)**2
    a2_b2 = (P+N)//2 #bug!! == (a**2+b**2) =!= (a**2-b**2)
    ab2 = (P-N)//2
    (a2_b2, ab2) = _std(to_std, M, a2_b2, ab2)
    return (a2_b2, ab2)
def _std(to_std, M, ac_bd, ad_bc, /):
    if M:
        ac_bd %= M
        ad_bc %= M
    if to_std:
        M = abs(M)
        if M:
            ac_bd = min(ac_bd, M-ac_bd)
            ad_bc = min(ad_bc, M-ad_bc)
        else:
            ac_bd = abs(ac_bd)
            ad_bc = abs(ad_bc)
        (ac_bd, ad_bc) = sorted((ac_bd, ad_bc))

    return (ac_bd, ad_bc)
def 矩乘幂冫平方和乊剩余环扌(M, ab, e, /):
    def mul_(ab, cd, /, *, M=M):
        return 矩乘冫平方和乊剩余环扌(M, ab, cd)
    def sq_(ab, /, *, M=M):
        return 矩乘平方冫平方和乊剩余环扌(M, ab)
    pw = I = (1,0)
    for b in map(int, f'{e:b}'):
        pw = sq_(pw)
        if b:
            pw = mul_(ab, pw)
    return pw
def 矩乘阶纟平方和乊剩余环扌(M, ab, /, *, with_sqrt1=False, to_std=False):
    def mul_(ab, cd, /, *, M=M):
        return 矩乘冫平方和乊剩余环扌(M, ab, cd, to_std=to_std)
    I = (1,0)
    if 1:
        (a,b) = ab
        inv4ab = (a,-b)
        assert (uv:=mul_(ab, inv4ab)) == I, (ab, inv4ab, I, uv)
    pw = I
    e = 0
    while 1:
        e += 1
        pw = mul_(ab, pw)
        #print(e, ab, pw)
        #if e > 1000:raise 000
        if pw == I:break
    if with_sqrt1:
        if e&1:raise Exception('order not even:', e)
        eh = e//2
        sqrt1 = 矩乘幂冫平方和乊剩余环扌(M, ab, eh)
        assert ab == mul_(sqrt1, sqrt1)
    return e if not with_sqrt1 else (e, sqrt1)




def 考察冫二维幺正矩阵乊剩余环扌(M, /, *, to_std=False):
    if to_std:raise Exception('无效@分解合数')
    u2sqrts = 制表冫平方根乊剩余环扌(M)
    (u2num_pts, u2pts) = 制表冫平方和碰撞分布乊剩余环扌(M)
    ab_e_pairs = []
    for (aa, bb) in u2pts[1]:
        a = u2sqrts[aa][0]
        b = u2sqrts[bb][0]
        ab = (a,b)
        order4ab = 矩乘阶纟平方和乊剩余环扌(M, ab, to_std=to_std)
        ab_e_pairs.append((ab, order4ab))
    return ab_e_pairs

def 制表冫平方和碰撞分布乊剩余环扌(M, /, *, to_zip=False):
    u2sqrts = 制表冫平方根乊剩余环扌(M)
    sqs = [u for u in range(M) if u2sqrts[u]]
    u2pts = [[] for u in range(M)]
    for aa in sqs:
        for bb in sqs:
            if bb > aa:break
            # [aa >= bb]
            c = (aa+bb)%M
            u2pts[c].append((aa,bb))
    u2num_pts = list(map(len, u2pts))
    r = (u2num_pts, u2pts)
    return r if not to_zip else list(zip(*r))

def 制表冫平方根乊剩余环扌(M, /):
    check_int_ge(1, M)
    u2sqrts = [[] for u in range(M)]
    for rt in range(M):
        u = pow(rt, 2, M)
        u2sqrts[u].append(rt)
    u2sqrts = tuple(map(tuple, u2sqrts))
    return u2sqrts
def 制表冫平方剩余中点乊剩余环扌(M, /):
    u2sqrts = 制表冫平方根乊剩余环扌(M)
    #for b, a in product(range(M), repeat=2):
    b2cds = []
    for b in range(M):
        cds6b = set()
        for a in range(M):
            c = (a-b)%M
            d = (a+b)%M
            if not (u2sqrts[c] and u2sqrts[d]):
                continue
            #print(f'{b} -> {c},{d}')
            cds6b.add(tuple(sorted({c,d})))
        cds6b
        b2cds.append(tuple(sorted(cds6b)))
    return b2cds


def 甲型平方累聚型多项式求值乊整数模扌(n, us, x, /):
    x %= n
    y = 1 if x == 0 else x
    for u in us:
        x = (x**2 -u) %n
        y = y*x %n
    return (x, y)
def 整数分解牜甲型平方累聚型多项式求值扌(n, paramss_or_mk_paramss_, /, *args4mk_paramss_, to_show6trivial_factor=False, to_square_us=False):
    check_int_ge(1, n)
    if callable(paramss_or_mk_paramss_):
        mk_paramss_ = paramss_or_mk_paramss_
    elif type(paramss_or_mk_paramss_) is str:
        nm4mk_paramss_ = paramss_or_mk_paramss_
        mk_paramss_ = globals()[nm4mk_paramss_]
        check_callable(mk_paramss_)
    else:
        paramss = iter(paramss_or_mk_paramss_)
        if args4mk_paramss_:raise TypeError(us, args4mk_paramss_)
        mk_paramss_ = iter
        args4mk_paramss_ = (paramss,)
    paramss = iter(mk_paramss_(*args4mk_paramss_))
    for j4us, params in enumerate(paramss):
        (us, xs) = params
        assert len(us)
        for j4x, x0 in enumerate(xs):
            it = iter(us)
            if to_square_us:
                it = (u**2 for u in us)
            (r, y) = 甲型平方累聚型多项式求值乊整数模扌(n, it, x0)
            g = gcd(n, y)
            if 1 == g: continue
            if not g == n:
                assert 1 < g < n
                return (n, g, (j4us, us), (j4x, x0), (r, y))
            assert g == n
            if to_show6trivial_factor:
                print('trivial factor:', (n, g, (j4us, us), (j4x, x0), (r, y)))
            g = gcd(n, r)
            if 1 == g: continue
            if not g == n:
                assert 1 < g < n
                return (n, g, (j4us, us), (j4x, x0), (r, y))
            assert g == n
            continue
    return False

def 整数分解牜乙型平方累聚型多项式求值牜原理错扌(n, sz, c, x0, /):
    check_int_ge(1, n)
    check_int_ge(1, sz)
    x = x0%n
    c = c%n
    inv4c = pow(c, -1, n)
    a = b = 1
    # [X:=(x**2+a*b)]
    # [A:=((a+b)*x)]
    # [B:=((a/c+b*c)*x)]
    for _ in range(sz):
        xx = pow(x,2,n)
        ab = a*b %n
        X = (xx+ab) %n
        A = (a+b)*x %n
        B = ((a*inv4c+b*c)%n)*x %n
        C = pow(c,2,n)
        inv4C = pow(inv4c,2,n)
        x,a,b,c,inv4c = (X,A,B,C,inv4C)
    x,a,b,c,inv4c
    g = gcd(n, (x-a)*(x-b))
    return (1<g<n, g)


__all__
from script.整数分解牜允许快速求值的多根多项式 import *
