#__all__:goto
#TODO:debugging:推导冫推论牜靶值分类牜阳爻数小于五:goto
#   !! bug:由于乘法进位导致因数分解型加链的总小步数可能降低
#   TODO:update:e ../../python3_src/seed/math/power/addition_chain/common/README-formula.txt
#   TODO:启用:『#xx:』标记的代码:验证冫推论牜靶值分类牜阳爻数小于五扌()
r'''[[[
e script/最短加链相关牜数据统计巛靶值讠最小显链长.py

script.最短加链相关牜数据统计巛靶值讠最小显链长
py -m nn_ns.app.debug_cmd   script.最短加链相关牜数据统计巛靶值讠最小显链长 -x # -off_defs
py -m nn_ns.app.doctest_cmd script.最短加链相关牜数据统计巛靶值讠最小显链长:__doc__ -ht # -ff -df
#######

[[
已有数据:靶值讠最小显链长
输出:
    靶值集牜加一型最短加链
    靶值集牜因数分解型最短加链
    阳爻数讠总小步数讠靶值集
]]


'#'; __doc__ = r'#'
>>>



[[
py_adhoc_call   script.最短加链相关牜数据统计巛靶值讠最小显链长   ,str.筛选冫靶值集牜加一型最短加链扌 +to_iter +with_header | more
    #20138/100001
    2
    3
    5
    7
    9
    11
    13
    ...

]]
[[
py_adhoc_call   script.最短加链相关牜数据统计巛靶值讠最小显链长   ,str.筛选冫靶值集牜加二型最短加链扌 +to_iter +with_header | more
    #17342/100001
    4
    5
    6
    7
    10
    11
    14
    ...

]]
[[
py_adhoc_call   script.最短加链相关牜数据统计巛靶值讠最小显链长   ,str.筛选冫靶值讠最小最大因数牜因数分解型最短加链扌 +to_iter +with_header | more
    #74241/100001
    4==2*2
    6==2*3
    8==2*4
    9==3*3
    10==2*5
    12==2*6
    14==2*7
    15==3*5
    16==2*8
    18==2*9
    ...

]]
[[
py_adhoc_call   script.最短加链相关牜数据统计巛靶值讠最小显链长   ,str.归组冫阳爻数讠总小步数讠靶值集扌 +to_iter +with_header --limit4show=10
#{1: {0: 17}, 2: {1: 136}, 3: {2: 676}, 4: {2: 644, 3: 1686}, 5: {3: 4996, 4: 901}, 6: {3: 5364, 4: 5952, 5: 16}, 7: {4: 15308, 3: 1201, 5: 359}, 8: {3: 1019, 4: 16915, 5: 1752}, 9: {4: 12960, 5: 5145}, 10: {4: 7990, 5: 5112}, 11: {5: 4951, 4: 2440}, 12: {4: 935, 5: 2251, 6: 1}, 13: {5: 954, 4: 60, 6: 1}, 14: {5: 212, 4: 13}, 15: {5: 27, 4: 4}, 16: {4: 1, 5: 1}}/100001
#1:{0: 17}/100001
,0:[1, 2, 4, 8, 16, 32, 64, 128, 256, 512, ...]#17
#2:{1: 136}/100001
,1:[3, 5, 6, 9, 10, 12, 17, 18, 20, 24, ...]#136
#3:{2: 676}/100001
,2:[7, 11, 13, 14, 19, 21, 22, 25, 26, 28, ...]#676
#4:{2: 644, 3: 1686}/100001
,2:[15, 23, 27, 30, 39, 43, 45, 46, 51, 54, ...]#644
,3:[29, 53, 57, 58, 71, 89, 101, 105, 106, 113, ...]#1686
#5:{3: 4996, 4: 901}/100001
,3:[31, 47, 55, 59, 61, 62, 79, 87, 91, 93, ...]#4996
,4:[465, 789, 913, 929, 930, 1425, 1557, 1573, 1577, 1578, ...]#901
#6:{3: 5364, 4: 5952, 5: 16}/100001
,3:[63, 95, 111, 119, 123, 125, 126, 159, 175, 183, ...]#5364
,4:[235, 237, 407, 427, 461, 467, 469, 470, 473, 474, ...]#5952
,5:[24745, 29761, 49429, 49490, 59457, 59521, 59522, 98473, 98581, 98633, ...]#16
#7:{4: 15308, 3: 1201, 5: 359}/100001
,3:[319, 351, 367, 375, 381, 382, 415, 575, 623, 631, ...]#1201
,4:[127, 191, 223, 239, 247, 251, 253, 254, 379, 431, ...]#15308
,5:[7243, 12381, 12445, 12459, 13387, 14411, 14441, 14483, 14486, 14897, ...]#359
#8:{3: 1019, 4: 16915, 5: 1752}/100001
,3:[255, 447, 495, 510, 639, 735, 759, 765, 879, 891, ...]#1019
,4:[383, 479, 503, 507, 509, 703, 751, 763, 766, 831, ...]#16915
,5:[3691, 3755, 3763, 3787, 6319, 6331, 6491, 6703, 7247, 7261, ...]#1752
#9:{4: 12960, 5: 5145}/100001
,4:[511, 767, 895, 959, 991, 1007, 1015, 1019, 1021, 1022, ...]#12960
,5:[1903, 1979, 3709, 3767, 3791, 3806, 3821, 3833, 3899, 3931, ...]#5145
#10:{4: 7990, 5: 5112}/100001
,4:[1023, 1535, 1791, 1919, 1983, 2015, 2031, 2039, 2043, 2045, ...]#7990
,5:[3775, 3823, 3831, 3837, 4029, 4061, 6879, 6909, 7007, 7087, ...]#5112
#11:{5: 4951, 4: 2440}/100001
,4:[3071, 5119, 5631, 5887, 6015, 6079, 6111, 6127, 6135, 6139, ...]#2440
,5:[2047, 3583, 3839, 3967, 4031, 4063, 4079, 4087, 4091, 4093, ...]#4951
#12:{4: 935, 5: 2251, 6: 1}/100001
,4:[4095, 6143, 7167, 7679, 7935, 8127, 8175, 8187, 8190, 10239, ...]#935
,5:[8063, 8159, 8183, 8189, 12271, 12279, 12283, 13823, 14303, 14327, ...]#2251
,6:[65131]#1
#13:{5: 954, 4: 60, 6: 1}/100001
,4:[22527, 24319, 39935, 40703, 40943, 40955, 43007, 44991, 45054, 48095, ...]#60
,5:[8191, 12287, 14335, 15359, 15871, 16127, 16255, 16319, 16351, 16367, ...]#954
,6:[65231]#1
#14:{5: 212, 4: 13}/100001
,4:[48127, 49149, 57279, 77823, 80895, 81855, 81903, 86015, 94205, 96253, ...]#13
,5:[16383, 24575, 28671, 30719, 31743, 32255, 32511, 32639, 32703, 32735, ...]#212
#15:{5: 27, 4: 4}/100001
,4:[90111, 94207, 96255, 98175]#4
,5:[32767, 49151, 57343, 61439, 63487, 64511, 65023, 65279, 65407, 65471, ...]#27
#16:{4: 1, 5: 1}/100001
,4:[65535]#1
,5:[98303]#1


==>>:
阳爻数4=>总小步数:2,3
    #4:{2: 644, 3: 1686}/100001
    ,2:[15, 23, 27, 30, 39, 43, 45, 46, 51, 54, ...]#644
    ,3:[29, 53, 57, 58, 71, 89, 101, 105, 106, 113, ...]#1686
>>> from nn_ns.math_nn.numbers.shortest_addition_chain__the_max_one import pint2max_shortest_addition_chain, pint2arbitrary_shortest_addition_chain
>>> ls=pint2max_shortest_addition_chain
>>> ls[29] # 29==2*14+1
(1, 2, 4, 8, 16, 24, 28, 29)
>>> ls[53] # 53==2*26+1
(1, 2, 4, 8, 16, 32, 48, 52, 53)
>>> ls[14]
(1, 2, 4, 8, 12, 14)
>>> ls[26]
(1, 2, 4, 8, 16, 24, 26)

>>> ls[15] # 15==5*3; 27==9*3; 30==10*3; 39==13*3
(1, 2, 4, 5, 10, 15)
>>> ls[23]
(1, 2, 4, 5, 9, 18, 23)
>>> ls[43]
(1, 2, 4, 8, 9, 17, 34, 43)
>>> bin(43) # 43==2**(0<1<3<5{==1+1+3})
'0b101011'
>>> bin(23) # 23==2**(0<1<2<4{==1+1+2})
'0b10111'

TODO:debugging:推导冫推论牜靶值分类牜阳爻数小于五:here
    !! bug:由于乘法进位导致因数分解型加链的总小步数可能降低
==>>:
#xx:非因数分解型:两小步四阳爻:1,...,2**a,[小步]2**a+2**b,2**(a+1)+2**b,...,[小步]2**x*(2**(a+1)+2**b)+(2**a+2**b),...
#xx:  2**x*(2**(d+1)+1)+(2**d+1)
#xx:  2**k*2**(0<d<x<1+x+d) or 2**k*2**(0<x<d<1+x+d)
#xx:  即 2**k*2**(0<u<v<1+u+v)
#xx:  即 2**(i<j<k<1+j+k-i)
#xx:因数分解型:两小步四阳爻:1,...,2**a,[小步]2**a+2**b,...,[小步](2**x+1)*(2**a+2**b),...
#xx:  2**k*(2**x+1)*(2**y+1)
#xx:  2**k*2**(0<u<v<u+v)
#xx:  即 2**(i<j<k<j+k-i)
#xx:#vs:非因数分解型:两小步三阳爻:1,...,2**a,[小步]2**a+2**b,...,[小步]2**x*(2**a+2**b)+2**c,...
#xx:  即 2**(i<j<k)
#xx:#vs:因数分解型:两小步三阳爻:1,...,2**a,[小步]2**a+2**b,...,[小步]2**x*(2**a+2**b)**2,...
#xx:  2**k*2**(0<1+u<2*u)
#xx:  即 2**(i<j<2*j-2-i)
#xx:#vs:因数分解型:一小步两阳爻:1,...,2**a,[小步]2**a+2**b,...,[小步]2**x*(2**a+2**b)**2,...
#xx:  2**k*2**(0<1+u==2*u)
#xx:  2**k*2**(0<2+u{==2*u+1==3})
#xx:  即 2**k*9
#xx:
#xx:==>>:
#xx:  ===
#xx:  [[n:<-[1..]] -> [v(n) < 4] -> [(ℓ(n) - λ(n)) == v(n) - 1]]
#xx:    #二进制拆分是可行解之一
#xx:  [[n:<-[1..]] -> [v(n) == 4] -> [(ℓ(n) - λ(n)) <- {2,3}]]
#xx:  #总小步数:
#xx:  [[n:<-[1..]] -> [(ℓ(n) - λ(n)) == 0] -> [v(n) == 1]]
#xx:  [[n:<-[1..]] -> [(ℓ(n) - λ(n)) == 1] -> [v(n) == 2]]
#xx:    [n==2**k*9] <==> 因数分解型最短加链{阳爻数==2}
#xx:      # 3**2
#xx:    [n==2**k*2**(0<,u)] <<== 非因数分解型最短加链{阳爻数==2}
#xx:      #二进制拆分是可行解之一
#xx:  [[n:<-[1..]] -> [(ℓ(n) - λ(n)) == 2] -> [v(n) <- {3,4}]]
#xx:    [n==2**k*2**(0<,u<,2*u-2)] <==> 因数分解型最短加链{阳爻数==3}
#xx:      # 2**(0<,u-1)**2 == (2**0+2**(u-1))**2 == 2**0 + 2**u + 2**(2*u-2)
#xx:    [n==2**k*2**(0<,u<,v)] <<== 非因数分解型最短加链{阳爻数==3}
#xx:      #二进制拆分是可行解之一
#xx:    [n==2**k*2**(0<,u<,v<,u+v)] <==> 因数分解型最短加链{阳爻数==4}{总小步数==2}
#xx:      # 2**(0<,u)*2**(0<,v{v>u})
#xx:    [n==2**k*2**(0<,u<,v<,1+u+v)] <==> 非因数分解型最短加链{阳爻数==4}{总小步数==2}
#xx:      #注意:二进制拆分非可行解:
#xx:      # 1,...,2**u,[小步]2**(0,u),2**(0,1+u),...,2**(v,1+u+v),[小步]2**(0,u,v,1+u+v)
#xx:    [n==2**k*2**(0<,u<,v<,w{(u+v-w) <- [0,-1]})] <<== 非因数分解型最短加链{阳爻数==4}{总小步数==3}
#xx:      #二进制拆分是可行解之一
#xx:    [n==2**k*2**(?六况态?)] <==> 因数分解型最短加链{阳爻数==4}{总小步数==3}
#xx:      # (?六况态?) == 六况态:([u>=2](0,1+u,1+2*u,3*u)|[u>=3](0,2+u,2*u,1+2*u)|[v>=4](0,3,v,1+v)|[v>=3](0,1,2+v,2*v)|[u>=2](0,1,u,3+u)|(0,1,2,7)@135)
#xx:      #     (0,1,2+v,2*v)\-/(0,1,u,3+u) => 2**(0,1,7,10)==1155==35*11*3 ==2**(0,1,5)*2**(0,5)==35*33 ==2**(0,7,8)*2**(0,1)==385*3
#xx:      #     (0,1+u,1+2*u,3*u)\-/(0,3,v,1+v) => 2**(0,3,5,6)==105==5*7*3 ==2**(0,2,4)*2**(0,2)==21*5 ==2**(0,1,5)*2**(0,1)==35*3
#xx:      #     (0,1+u,1+2*u,3*u)\-/(0,2+_u,2*_u,1+2*_u) => _L
#xx:      # <<==:
#xx:      # 两大类:2**(0<,u<,v)*2**(0<,w) or 2**(0<,u)*2**(0<,v)*2**(0<,w)
#xx:      # *[0<u<v][0<w]: 2**(0<,u<,v)*2**(0<,w) == 2**(0,u,v,w,w+u,w+v)
#xx:      #     * [u==w][v==w+u][1+v<w+v]:[w==u][v==2*u][u>=2]:2**(0,u,2*u)*2**(0,u) == 2**(0,1+u,1+2*u,3*u)
#xx:      #     * [u==w][v==1+u][1+v<w+u]:[w==u][v==1+u][u>=3]:2**(0,u,1+u)*2**(0,u) == 2**(0,2+u,2*u,1+2*u)
#xx:      #     * [u==w][w+u==1+u][2+u !<- {v,w+v}]:[w==u==1][v>=4]:2**(0,1,v)*2**(0,1) == 2**(0,3,v,1+v)
#xx:      #     * [u<w][v==w][1+w==w+u][1+w+u<w+v]:[w==v][u==1][v>=3]:2**(0,1,v)*2**(0,v) == 2**(0,1,2+v,2*v)
#xx:      #     * [u<w][v==w+u][1+v==w+v]:[u<w][w==1][v==1+u][0<u<1==w]:_L
#xx:      #     * [u>w][v==w+u][1+v==w+v]:[w==1][u>=2][v==1+u]:2**(0,u,1+u)*2**(0,1) == 2**(0,1,u,3+u)
#xx:      # *[0<u<=v<=w]: 2**(0<,u)*2**(0<,v)*2**(0<,w)
#xx:      #     * [u==v]or[v==w]:3爻*2爻:归结到上面
#xx:      #     * [u<v<w]:4爻*2爻:2**(0,u,v,u+v,w,w+u,w+v,w+u+v):[u+v==w][1+w==w+u][2+w==w+v][3+w==w+u+v]:[u==1][v==2][w==3]:3*5*9==135==0b10000111==2**(0,1,2,7)
#xx:  #待证明:[[n:<-[1..]] -> [(ℓ(n) - λ(n)) == 3] -> [v(n) <- {4,5,6,7,8}]]
#xx:  ===
#xx:  # 验证冫推论牜靶值分类牜阳爻数小于五扌()
]]
[[
===
py_adhoc_call   script.最短加链相关牜数据统计巛靶值讠最小显链长   ,str.识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌 +to_iter +with_header > /sdcard/0my_files/tmp/out4py/script.最短加链相关牜数据统计巛靶值讠最小显链长..识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌.out.txt
du -h /sdcard/0my_files/tmp/out4py/script.最短加链相关牜数据统计巛靶值讠最小显链长..识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌.out.txt
    1.7M
view /sdcard/0my_files/tmp/out4py/script.最短加链相关牜数据统计巛靶值讠最小显链长..识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌.out.txt
    # grep-只有因数分解型:
    [(7, 17)]#119
    [(7, 41)]#287

    [(5, 17)]#85
    [(5, 19)]#95

    [(3, 5)]#15
    [(3, 9)]#27

    [(2, 23)]#46
    [(2, 43)]#86


===
grep -F '[2]' /sdcard/0my_files/tmp/out4py/script.最短加链相关牜数据统计巛靶值讠最小显链长..识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌.out.txt | lineno1 >  /sdcard/0my_files/tmp/out4py/script.最短加链相关牜数据统计巛靶值讠最小显链长..识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌.out.grep-只有加二型.txt
view /sdcard/0my_files/tmp/out4py/script.最短加链相关牜数据统计巛靶值讠最小显链长..识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌.out.grep-只有加二型.txt
    1:[2]#283
    2:[2]#893
    3:[2]#1099
    4:[2]#1643
    ... ...
    ... ...
    638:[2]#99767
    639:[2]#99829
    640:[2]#99899
    641:[2]#99941
du -h /sdcard/0my_files/tmp/out4py/script.最短加链相关牜数据统计巛靶值讠最小显链长..识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌.out.grep-只有加二型.txt
    12K

===
grep -F '[]' /sdcard/0my_files/tmp/out4py/script.最短加链相关牜数据统计巛靶值讠最小显链长..识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌.out.txt | lineno1 >  /sdcard/0my_files/tmp/out4py/script.最短加链相关牜数据统计巛靶值讠最小显链长..识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌.out.grep-empty.txt
view /sdcard/0my_files/tmp/out4py/script.最短加链相关牜数据统计巛靶值讠最小显链长..识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌.out.grep-empty.txt
    1:[]#23
    2:[]#43
    3:[]#59
    4:[]#77
    ... ...
    ... ...
    1669:[]#12499
    1670:[]#12503
    1671:[]#12509
    1672:[]#12517
    1673:[]#12521
    ... ...
    ... ...
    15926:[]#99977
    15927:[]#99979
    15928:[]#99981
    15929:[]#99985
du -h /sdcard/0my_files/tmp/out4py/script.最短加链相关牜数据统计巛靶值讠最小显链长..识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌.out.grep-empty.txt
    224K

===
]]


from script.最短加链相关牜数据统计巛靶值讠最小显链长 import *
]]]'''#'''
__all__ = r'''
筛选冫靶值集牜加一型最短加链扌
    筛选冫靶值集牜加二型最短加链扌
筛选冫靶值讠最小最大因数牜因数分解型最短加链扌

归组冫阳爻数讠总小步数讠靶值集扌

识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌
'''.split()#'''
__all__
___begin_mark_of_excluded_global_names__0___ = ...
#.from itertools import islice
#.from seed.tiny_.check import check_type_is, check_int_ge
___end_mark_of_excluded_global_names__0___ = ...
def _靶值讠最小显链长_():
    from seed.math.power.addition_chain.data.target_uint2may_len_optimal_addition_chain import target_uint2may_len_optimal_addition_chain, 靶值讠最小显链长
    return 靶值讠最小显链长


def _mk_result4array_(L, j2m, /, *, to_iter, with_header):
    assert L >= 1
    assert len(j2m) == L
    num_bads = sum(not m for m in j2m)
    num_knowns = L -num_bads
    num_unknowns = num_bads -1
    assert L == 1 +num_knowns +num_unknowns
    szs = (1, num_knowns, num_unknowns)
    if not to_iter:
        if not with_header:
            return j2m
        return (L, szs, j2m)
    def _iter():
        if with_header:
            yield f'#{szs}/{L}'
        #yield from j2m
        for j, m in enumerate(j2m):
            yield f'{m}#{j}'
    return _iter()

def _mk_result4v2s2us_(L, v2s2us, /, *, to_iter, with_header, limit4show):
    if limit4show == -1 or limit4show > L:
        limit4show = L
    assert 0 <= limit4show <= L

    v2s2sz = {v:{s:len(us) for s, us in s2us.items()} for v, s2us in v2s2us.items()}
    max_sz = max((sz for v, s2sz in v2s2sz.items() for sz in s2sz.values()), default=0)
    if limit4show < max_sz:
        from seed.helper.ConstantRepr import repr_as_3dot
    _v2s2us = {v:{s:us if len(us) <= limit4show else [*us[:limit4show], repr_as_3dot] for s, us in s2us.items()} for v, s2us in v2s2us.items()} if limit4show < max_sz else v2s2us

    if not to_iter:
        if not with_header:
            return _v2s2us
        return (L, v2s2sz, _v2s2us)
    def _iter():
        if with_header:
            yield f'#{v2s2sz}/{L}'
        for v, _s2us in sorted(_v2s2us.items()):
            if with_header:
                yield f'#{v}:{v2s2sz[v]}/{L}'
            for s, _us in sorted(_s2us.items()):
                yield f',{s}:{_us}#{v2s2sz[v][s]}'
    return _iter()

def _mk_result4dict_(L, d, /, *, to_iter, with_header):
    sz = len(d)
    if not to_iter:
        if not with_header:
            return d
        return (L, sz, d)
    def _iter():
        if with_header:
            yield f'#{sz}/{L}'
        for u, (a, b) in sorted(d.items()):
            yield f'{u}=={a}*{b}'
    return _iter()

def _mk_result4list_(L, ns, /, *, to_iter, with_header):
    sz = len(ns)
    if not to_iter:
        if not with_header:
            return ns
        return (L, sz, ns)
    def _iter():
        if with_header:
            yield f'#{sz}/{L}'
        yield from ns
    return _iter()

def 筛选冫靶值集牜加一型最短加链扌(to_iter=False, with_header=False):
    靶值讠最小显链长 = _靶值讠最小显链长_()
    L = len(靶值讠最小显链长)
    靶值集牜加一型最短加链 = [靶值 for 靶值 in range(1+1, L) if 靶值讠最小显链长[靶值-1]+1 == 靶值讠最小显链长[靶值]]
    return _mk_result4list_(L, 靶值集牜加一型最短加链, to_iter=to_iter, with_header=with_header)

def 筛选冫靶值集牜加二型最短加链扌(to_iter=False, with_header=False):
    靶值讠最小显链长 = _靶值讠最小显链长_()
    L = len(靶值讠最小显链长)
    靶值集牜加二型最短加链 = [靶值 for 靶值 in range(1+2, L) if 靶值讠最小显链长[靶值-2]+1 == 靶值讠最小显链长[靶值]]
    return _mk_result4list_(L, 靶值集牜加二型最短加链, to_iter=to_iter, with_header=with_header)

#def 筛选冫靶值集牜因数分解型最短加链扌():
def 筛选冫靶值讠最小最大因数牜因数分解型最短加链扌(to_iter=False, with_header=False):
    from seed.math.prime_gens import tabulate_may_factorization4uint_lt_
    from seed.math.all_factors_of_ import 有序列表冫所有因数巛因数分解扌
    靶值讠最小显链长 = _靶值讠最小显链长_()
    L = len(靶值讠最小显链长)
    靶值讠因数分解 = tabulate_may_factorization4uint_lt_(L)
    靶值讠最小最大因数牜因数分解型最短加链 = {}
    for 靶值 in range(1, L):
        for (小因数, 大因数) in _枚举冫因数分解型巛靶值扌(靶值讠最小显链长, 靶值讠因数分解, 有序列表冫所有因数巛因数分解扌, 靶值):
            靶值讠最小最大因数牜因数分解型最短加链[靶值] = (小因数, 大因数)
            break
    return _mk_result4dict_(L, 靶值讠最小最大因数牜因数分解型最短加链, to_iter=to_iter, with_header=with_header)
def _枚举冫因数分解型巛靶值扌(靶值讠最小显链长, 靶值讠因数分解, 有序列表冫所有因数巛因数分解扌, 靶值, /):
    最小显链长 = 靶值讠最小显链长[靶值]
    p2e = 靶值讠因数分解[靶值]
    fs = 有序列表冫所有因数巛因数分解扌(p2e)
    # 2:1,2:fs[1:1]
    # 25:1,5,25:fs[1:2]
    # 6:1,2,3,6:fs[1:2]
    #for 小因数 in fs[1:-1]:
    for 小因数 in fs[1:(len(fs)+1)//2]:
        大因数 = 靶值//小因数
        if not 大因数 >= 小因数:
            break
        if 靶值讠最小显链长[小因数] + 靶值讠最小显链长[大因数] == 最小显链长:
            yield (小因数, 大因数)


def 归组冫阳爻数讠总小步数讠靶值集扌(to_iter=False, with_header=False, limit4show=-1):
    靶值讠最小显链长 = _靶值讠最小显链长_()
    L = len(靶值讠最小显链长)
    #阳爻数讠总小步数讠靶值集 = [[] for 阳爻数 in range(1+L.bit_length())]
    阳爻数讠总小步数讠靶值集 = {}
    for 靶值 in range(1, L):
        最小显链长 = 靶值讠最小显链长[靶值]
        首爻位 = 靶值.bit_length() -1
        总小步数 = 最小显链长 -首爻位
        阳爻数 = 靶值.bit_count()
        阳爻数讠总小步数讠靶值集.setdefault(阳爻数, {}).setdefault(总小步数, []).append(靶值)

    阳爻数讠总小步数讠靶值集
    #v2s2us
    return _mk_result4v2s2us_(L, 阳爻数讠总小步数讠靶值集, to_iter=to_iter, with_header=with_header, limit4show=limit4show)


def 识别冫靶值讠种型牜加一型丶加二型丶因数分解型丶阳爻数小于四扌(to_iter=False, with_header=False):
    #阳爻数讠总小步数讠靶值集 = 归组冫阳爻数讠总小步数讠靶值集扌()
    靶值讠最小最大因数牜因数分解型最短加链 = 筛选冫靶值讠最小最大因数牜因数分解型最短加链扌()
    靶值集牜加二型最短加链 = 筛选冫靶值集牜加二型最短加链扌()
    靶值集牜加一型最短加链 = 筛选冫靶值集牜加一型最短加链扌()

    靶值讠最小显链长 = _靶值讠最小显链长_()
    L = len(靶值讠最小显链长)
    assert L >= 1

    靶值讠种型 = [[] for 靶值 in range(L)]
    靶值讠种型[0] = None
    for 靶值 in 靶值集牜加一型最短加链:
        靶值讠种型[靶值].append(1)
    for 靶值 in 靶值集牜加二型最短加链:
        靶值讠种型[靶值].append(2)
    for 靶值, 最小最大因数 in 靶值讠最小最大因数牜因数分解型最短加链.items():
        靶值讠种型[靶值].append(最小最大因数)

    for 靶值 in range(1, L):
        阳爻数 = 靶值.bit_count()
        if 阳爻数 < 4:
            靶值讠种型[靶值].append(f'{阳爻数}<4')


    if 0b000:
        from seed.helper.ConstantRepr import repr_as_3dot
        for 靶值 in range(1, L):
            if not 靶值讠种型[靶值]:
                靶值讠种型[靶值] = repr_as_3dot

    return _mk_result4array_(L, 靶值讠种型, to_iter=to_iter, with_header=with_header)


#xx:def 验证冫推论牜靶值分类牜阳爻数小于五扌():
#xx:    #推导冫推论牜靶值分类牜阳爻数小于五:goto
#xx:    from seed.math.prime_gens import tabulate_may_factorization4uint_lt_
#xx:    from seed.math.all_factors_of_ import 有序列表冫所有因数巛因数分解扌
#xx:    from seed.math.max_power_of_base_as_factor_of_ import factor_pint_out_power_of_base_
#xx:    靶值讠最小显链长 = _靶值讠最小显链长_()
#xx:    L = len(靶值讠最小显链长)
#xx:    靶值讠因数分解 = tabulate_may_factorization4uint_lt_(L)
#xx:    for 靶值 in range(1, L):
#xx:        阳爻数 = 靶值.bit_count()
#xx:        if not 阳爻数 < 5:
#xx:            continue
#xx:        (阴爻数目, 奇部纟靶值) = factor_pint_out_power_of_base_(2, 靶值)
#xx:        列表纟阳爻位纟靶值奇部 = [ez for ez, bit in enumerate(reversed(bin(奇部纟靶值)[2:])) if bit=='1']
#xx:        assert len(列表纟阳爻位纟靶值奇部) == 阳爻数
#xx:        assert 列表纟阳爻位纟靶值奇部[0] == 0
#xx:        assert 靶值 == sum(map((1).__lshift__, 列表纟阳爻位纟靶值奇部))
#xx:        [*列表纟因数分解型] = _枚举冫因数分解型巛靶值扌(靶值讠最小显链长, 靶值讠因数分解, 有序列表冫所有因数巛因数分解扌, 靶值)
#xx:
#xx:        首爻位 = 靶值.bit_length() -1
#xx:        最小显链长 = 靶值讠最小显链长[靶值]
#xx:        总小步数 = 最小显链长 -首爻位
#xx:        err_msg = (靶值, 阳爻数, 首爻位, 最小显链长, 总小步数, 奇部纟靶值, 列表纟阳爻位纟靶值奇部)
#xx:        match 阳爻数:
#xx:            case 1:
#xx:                assert 总小步数 == 0, err_msg
#xx:            case 2:
#xx:                assert 总小步数 == 1, err_msg
#xx:                _验证冫推论牜靶值牜阳爻数等于二扌(靶值, 阳爻数, 首爻位, 最小显链长, 总小步数, 奇部纟靶值, 列表纟阳爻位纟靶值奇部, 列表纟因数分解型)
#xx:            case 3:
#xx:                assert 总小步数 == 2, err_msg
#xx:                _验证冫推论牜靶值牜阳爻数等于三扌(靶值, 阳爻数, 首爻位, 最小显链长, 总小步数, 奇部纟靶值, 列表纟阳爻位纟靶值奇部, 列表纟因数分解型)
#xx:            case 4:
#xx:                assert 总小步数 in (2,3), err_msg
#xx:                _验证冫推论牜靶值牜阳爻数等于四扌(靶值, 阳爻数, 首爻位, 最小显链长, 总小步数, 奇部纟靶值, 列表纟阳爻位纟靶值奇部, 列表纟因数分解型)
#xx:    return
#xx:
#xx:
#xx:def _验证冫推论牜靶值牜阳爻数等于二扌(靶值, 阳爻数, 首爻位, 最小显链长, 总小步数, 奇部纟靶值, 列表纟阳爻位纟靶值奇部, 列表纟因数分解型, /):
#xx:    r'''[[[
#xx:    [n==2**k*9] <==> 因数分解型最短加链{阳爻数==2}
#xx:    #]]]'''#'''
#xx:    assert 阳爻数 == 2
#xx:    assert 总小步数 == 1
#xx:    assert (靶值 == 9) is bool(列表纟因数分解型) is (列表纟因数分解型==[(3,3)]), (靶值, 列表纟因数分解型)
#xx:    return
#xx:
#xx:def _验证冫推论牜靶值牜阳爻数等于三扌(靶值, 阳爻数, 首爻位, 最小显链长, 总小步数, 奇部纟靶值, 列表纟阳爻位纟靶值奇部, 列表纟因数分解型, /):
#xx:    r'''[[[
#xx:    [n==2**k*2**(0<,u<,2*u-2)] <==> 因数分解型最短加链{阳爻数==3}
#xx:      # 2**(0<,u-1)**2 == (2**0+2**(u-1))**2 == 2**0 + 2**u + 2**(2*u-2)
#xx:    #]]]'''#'''
#xx:    assert 阳爻数 == 3
#xx:    assert 总小步数 == 2
#xx:    [_0, u, v] = 列表纟阳爻位纟靶值奇部
#xx:    assert 列表纟因数分解型 == ([(1+2**(u-1),)*2] if 2*u-2 == v else []), (靶值, 列表纟因数分解型)
#xx:    return
#xx:
#xx:
#xx:def _验证冫推论牜靶值牜阳爻数等于四扌(靶值, 阳爻数, 首爻位, 最小显链长, 总小步数, 奇部纟靶值, 列表纟阳爻位纟靶值奇部, 列表纟因数分解型, /):
#xx:    r'''[[[
#xx:    [n==2**k*2**(0<,u<,v<,u+v)] <==> 因数分解型最短加链{阳爻数==4}{总小步数==2}
#xx:      # 2**(0<,u)*2**(0<,v{v>u})
#xx:    [n==2**k*2**(0<,u<,v<,1+u+v)] <==> 非因数分解型最短加链{阳爻数==4}{总小步数==2}
#xx:      #注意:二进制拆分非可行解:
#xx:      # 1,...,2**u,[小步]2**(0,u),2**(0,1+u),...,2**(v,1+u+v),[小步]2**(0,u,v,1+u+v)
#xx:    [n==2**k*2**(0<,u<,v<,w{(u+v-w) <- [0,-1]})] <<== 非因数分解型最短加链{阳爻数==4}{总小步数==3}
#xx:      #二进制拆分是可行解之一
#xx:    [n==2**k*2**(?六况态?)] <==> 因数分解型最短加链{阳爻数==4}{总小步数==3}
#xx:      # (?六况态?) == 六况态:([u>=2](0,1+u,1+2*u,3*u)|[u>=3](0,2+u,2*u,1+2*u)|[v>=4](0,3,v,1+v)|[v>=3](0,1,2+v,2*v)|[u>=2](0,1,u,3+u)|(0,1,2,7)@135)
#xx:      #     (0,1,2+v,2*v)\-/(0,1,u,3+u) => 2**(0,1,7,10)==1155==35*11*3 ==2**(0,1,5)*2**(0,5)==35*33 ==2**(0,7,8)*2**(0,1)==385*3
#xx:      #     (0,1+u,1+2*u,3*u)\-/(0,3,v,1+v) => 2**(0,3,5,6)==105==5*7*3 ==2**(0,2,4)*2**(0,2)==21*5 ==2**(0,1,5)*2**(0,1)==35*3
#xx:      #     (0,1+u,1+2*u,3*u)\-/(0,2+_u,2*_u,1+2*_u) => _L
#xx:
#xx:    #]]]'''#'''
#xx:    assert 阳爻数 == 4
#xx:    assert 总小步数 in (2,3)
#xx:    [_0, a, b, c] = 列表纟阳爻位纟靶值奇部
#xx:    if 总小步数==2:
#xx:        d = c -(a+b)
#xx:        assert d in (0,1), (靶值, 列表纟因数分解型)
#xx:        if d == 0:
#xx:            assert 列表纟因数分解型 == [(1+2**a,1+2**b)], (靶值, 列表纟因数分解型)
#xx:        elif d == 1:
#xx:            assert 列表纟因数分解型 == [], (靶值, 列表纟因数分解型)
#xx:        else:
#xx:            raise 000
#xx:    elif 总小步数==3:
#xx:        # (?六况态?) == 六况态:([u>=2](0,1+u,1+2*u,3*u)|[u>=3](0,2+u,2*u,1+2*u)|[v>=4](0,3,v,1+v)|[v>=3](0,1,2+v,2*v)|[u>=2](0,1,u,3+u)|(0,1,2,7)@135)
#xx:        for j, _is_caseJ_ in enumerate(_fs):
#xx:            if _is_caseJ_(a, b, c):
#xx:                cases.append(j)
#xx:
#xx:        assert len(cases) in (0,1,2), (靶值, 列表纟因数分解型, cases)
#xx:        assert bool(cases) is bool(列表纟因数分解型), (靶值, 列表纟因数分解型, cases)
#xx:        assert (len(cases)==2) is (靶值 in (1155,105)), (靶值, 列表纟因数分解型, cases)
#xx:        assert (靶值 == 135) is (5 in cases) is (cases == [5])
#xx:        assert (靶值 == 1155) is (cases == [3,4])
#xx:        assert (靶值 == 105) is (cases == [0,2])
#xx:        match cases:
#xx:            case []:
#xx:                pass
#xx:            case [5]:
#xx:                assert 靶值 == 135 == 3*5*9
#xx:                assert 列表纟阳爻位纟靶值奇部 == [0,1,2,7]
#xx:                assert 最小显链长 == 9 == 7+2 == 首爻位+总小步数 == 2+3+4
#xx:                pass
#xx:            case [3,4]:
#xx:                assert 靶值 == 1155
#xx:                assert 列表纟因数分解型 == [(3,385), (33 35)]
#xx:            case [0,2]:
#xx:                assert 靶值 == 105
#xx:                assert 列表纟因数分解型 == [(3,35), (5 21)]
#xx:    else:
#xx:        raise 000
#xx:    return
#xx:def _is_case0_(a, b, c, /):
#xx:    # [u>=2](0,1+u,1+2*u,3*u)
#xx:    u = a-1
#xx:    return u>=2 and a==1+u and b==1+2*u and c==3*u
#xx:def _is_case1_(a, b, c, /):
#xx:    # [u>=3](0,2+u,2*u,1+2*u)
#xx:    u = a-2
#xx:    return u>=3 and a==2+u and b==2*u and c==1+2*u
#xx:def _is_case2_(a, b, c, /):
#xx:    # [v>=4](0,3,v,1+v)
#xx:    v = b
#xx:    return v>=4 and a==3 and b==v and c==1+v
#xx:def _is_case3_(a, b, c, /):
#xx:    # [v>=3](0,1,2+v,2*v)
#xx:    v = b-2
#xx:    return v>=3 and a==1 and b==2+v and c==2*v
#xx:def _is_case4_(a, b, c, /):
#xx:    # [u>=2](0,1,u,3+u)
#xx:    u = b
#xx:    return u>=2 and a==1 and b==u and c==3+u
#xx:def _is_case5_(a, b, c, /):
#xx:    # (0,1,2,7)@135
#xx:    return a==1 and b==2 and c==7
#xx:_fs = [_is_case0_, _is_case1_, _is_case2_, _is_case3_, _is_case4_, _is_case5_]

__all__
from script.最短加链相关牜数据统计巛靶值讠最小显链长 import *
