#__all__:goto
r'''[[[
e script/hz/打印字符区.py
:cmds:goto

The Unicode Standard, Version 13.0
[[[
===
:U2E80.pdf:
字根:扩充
[2E80..=2EF3]\-\{2E9A}
===
:U2F00.pdf:
字根:康熙字典
[2F00..=2FD5]
===
:U2FF0.pdf:
字型布局符号
[2FF0..=2FFB]
===
:U3100.pdf:
[3105..=312F]
注音符号
===
:U31A0.pdf:
[31A0..=31BF]
注音符号:扩充
===
:U31C0.pdf:
[31C0..=31E3]
笔划(+例字)
===
U3400.pdf::[3400..=4DBF] CJK Unified Ideographs Extension A
U4E00.pdf::[4E00..=9FFC] CJK Unified Ideographs
UF900.pdf::[F900..=FAFF] CJK Compatibility Ideographs
===
]]]


:cmds
script.hz.打印字符区
py -m nn_ns.app.debug_cmd   script.hz.打印字符区 -x
py -m nn_ns.app.doctest_cmd script.hz.打印字符区:__doc__ -ff -v
from script.hz.打印字符区 import *


[[[
PUA_GB私用区国标
私用区国标 很多字符 在系统字体中没有字形
===
当前手机系统汉语字体:
 24M NotoSerifCJK-Regular.ttc
 22M SysSans-Hans-Regular.ttf
 20M NotoSansCJK-Regular.ttc
 11M SysSans-Hant-Regular.ttf
===
ls /system/fonts/ -S -1 -s -h
===
total 111M
 24M NotoSerifCJK-Regular.ttc
 22M SysSans-Hans-Regular.ttf
 20M NotoSansCJK-Regular.ttc
 11M SysSans-Hant-Regular.ttf
9.3M NotoColorEmoji.ttf
3.8M DroidSansFallback.ttf
696K NotoSansSymbols-Regular-Subsetted.ttf
496K NotoSansEgyptianHieroglyphs-Regular.ttf
492K NotoSansCuneiform-Regular.ttf
396K NotoSansTibetan-Regular.ttf
368K NotoSansTibetan-Bold.ttf
328K RobotoCondensed-LightItalic.ttf
328K Roboto-LightItalic.ttf
328K Roboto-BoldItalic.ttf
324K Roboto-MediumItalic.ttf
324K RobotoCondensed-BoldItalic.ttf
324K Roboto-BlackItalic.ttf
324K RobotoCondensed-MediumItalic.ttf
324K Roboto-ThinItalic.ttf
324K RobotoCondensed-Italic.ttf
324K Roboto-Italic.ttf
324K SysSans-En-Regular.ttf
304K Roboto-Thin.ttf
300K Roboto-Light.ttf
300K Roboto-Bold.ttf
300K Roboto-Medium.ttf
300K Roboto-Black.ttf
300K Roboto-Regular.ttf
300K RobotoCondensed-Bold.ttf
300K RobotoCondensed-Medium.ttf
296K RobotoCondensed-Light.ttf
296K RobotoCondensed-Regular.ttf
288K SourceSansPro-Regular.ttf
288K SourceSansPro-SemiBold.ttf
288K SourceSansPro-Bold.ttf
260K FZZWXBTOT_Uni.ttf
260K NotoSerif-BoldItalic.ttf
256K XType-Bold.otf
244K NotoSerif-Italic.ttf
244K NotoSerif-Bold.ttf
244K NotoSerif-Regular.ttf
216K XType-Regular.otf
148K NotoSerifTelugu-Regular.ttf
148K NotoSerifTelugu-Bold.ttf
144K NotoSansKhmer-VF.ttf
144K NotoSansEthiopic-Bold.ttf
140K NotoSansEthiopic-Regular.ttf
136K NotoSerifMyanmar-Regular.otf
136K NotoSerifMyanmar-Bold.otf
132K NotoSansAnatolianHieroglyphs-Regular.otf
132K NotoSansBamum-Regular.ttf
128K NotoSerifEthiopic-Bold.otf
124K NotoSansYi-Regular.ttf
124K NotoSansDevanagari-Medium.otf
120K NotoNaskhArabicUI-Regular.ttf
120K NotoSansGujarati-Regular.ttf
120K NotoNaskhArabicUI-Bold.ttf
116K NotoSansDevanagari-Bold.otf
116K NotoSerifBengali-Regular.ttf
116K NotoSansGujaratiUI-Regular.ttf
116K NotoSerifBengali-Bold.ttf
116K NotoSansMyanmarUI-Medium.otf
116K NotoSansGujarati-Bold.ttf
116K NotoNaskhArabic-Regular.ttf
116K DancingScript-Regular.ttf
116K NotoNaskhArabic-Bold.ttf
116K NotoSansMyanmar-Medium.otf
116K DancingScript-Bold.ttf
116K NotoSansDevanagari-Regular.otf
112K NotoSansGujaratiUI-Bold.ttf
112K NotoSansMongolian-Regular.ttf
112K NotoSansMyanmarUI-Bold.otf
112K NotoSerifEthiopic-Regular.otf
112K NotoSansMyanmarUI-Regular.otf
112K NotoSansTeluguUI-Regular.ttf
112K NotoSansDevanagariUI-Medium.otf
112K NotoSansTeluguUI-Bold.ttf
112K NotoSansTelugu-Regular.ttf
108K NotoSansMyanmar-Bold.otf
108K NotoSansTelugu-Bold.ttf
108K NotoSansMyanmar-Regular.otf
108K NotoSansDevanagariUI-Bold.otf
108K DroidSansMono.ttf
104K NotoSansDevanagariUI-Regular.otf
104K NotoSansAdlam-VF.ttf
104K SourceSansPro-Italic.ttf
104K SourceSansPro-SemiBoldItalic.ttf
104K SourceSansPro-BoldItalic.ttf
100K NotoSansLepcha-Regular.ttf
100K NotoSansBhaiksuki-Regular.otf
 92K NotoSerifKannada-Regular.ttf
 92K NotoSansSinhalaUI-Medium.otf
 92K NotoSansSinhala-Medium.otf
 92K NotoSerifKannada-Bold.ttf
 88K NotoSansBengali-Medium.otf
 88K NotoSansBengaliUI-Medium.otf
 88K NotoSansJavanese-Regular.otf
 84K NotoSerifSinhala-Bold.otf
 84K NotoSansOriya-Regular.ttf
 84K NotoSansOriya-Bold.ttf
 84K NotoSansSinhalaUI-Bold.otf
 84K NotoSansSinhala-Bold.otf
 84K NotoSansSinhalaUI-Regular.otf
 84K NotoSansSinhala-Regular.otf
 84K NotoSansKannada-Regular.ttf
 84K NotoSansBengali-Bold.otf
 80K NotoSansBengaliUI-Bold.otf
 80K NotoSansKannadaUI-Regular.ttf
 80K NotoSansKannada-Bold.ttf
 80K NotoSansOriyaUI-Regular.ttf
 80K NotoSerifGeorgian-VF.ttf
 80K NotoSansOriyaUI-Bold.ttf
 80K NotoSansBengali-Regular.otf
 80K NotoSansBengaliUI-Regular.otf
 80K NotoSansKannadaUI-Bold.ttf
 80K NotoSerifDevanagari-Bold.ttf
 80K NotoSerifDevanagari-Regular.ttf
 76K NotoSerifSinhala-Regular.otf
 68K CutiveMono.ttf
 68K NotoSansGeorgian-VF.ttf
 68K NotoSansNewa-Regular.otf
 64K NotoSerifGujarati-Regular.ttf
 64K NotoSansVai-Regular.ttf
 64K NotoSansMarchen-Regular.otf
 64K NotoSerifGujarati-Bold.ttf
 60K NotoSansKaithi-Regular.ttf
 60K ComingSoon.ttf
 60K NotoSansCherokee-Regular.ttf
 60K NotoSansLinearB-Regular.ttf
 56K NotoSansMalayalam-Medium.otf
 56K NotoSansMalayalamUI-Medium.otf
 52K NotoSansSyriacWestern-Regular.ttf
 52K NotoSansSyriacEastern-Regular.ttf
 52K NotoSerifMalayalam-Bold.ttf
 52K NotoSerifMalayalam-Regular.ttf
 48K NotoSerifKhmer-Bold.otf
 48K NotoSansTaiTham-Regular.ttf
 48K NotoSansMalayalam-Regular.otf
 48K NotoSansMalayalam-Bold.otf
 48K NotoSansMalayalamUI-Regular.otf
 48K NotoSansMalayalamUI-Bold.otf
 48K NotoSansCanadianAboriginal-Regular.ttf
 48K NotoSansSyriacEstrangela-Regular.ttf
 40K NotoSerifKhmer-Regular.otf
 40K CarroisGothicSC-Regular.ttf
 40K NotoSansKhmerUI-Regular.ttf
 36K MyanmarZg.ttf
 36K NotoSansKhmerUI-Bold.ttf
 36K NotoSansLinearA-Regular.otf
 36K NotoSansTamilUI-Medium.otf
 36K NotoSansTamil-Medium.otf
 36K NotoSansSymbols-Regular-Subsetted2.ttf
 32K NotoSansGurmukhiUI-Bold.ttf
 32K NotoSansGunjalaGondi-Regular.otf
 32K NotoSansGurmukhiUI-Regular.ttf
 32K NotoSansBalinese-Regular.ttf
 32K NotoSansGurmukhi-Regular.ttf
 32K NotoSerifTamil-Bold.otf
 32K NotoSansGurmukhi-Bold.ttf
 32K NotoSerifTamil-Regular.otf
 32K NotoSansTamilUI-Bold.otf
 32K NotoSansTamilUI-Regular.otf
 32K NotoSansTamil-Bold.otf
 32K NotoSansTamil-Regular.otf
 32K NotoSerifLao-Regular.ttf
 32K NotoSansLaoUI-Regular.ttf
 32K NotoSansLao-Regular.ttf
 32K NotoSerifLao-Bold.ttf
 32K NotoSerifGurmukhi-Bold.otf
 32K NotoSansChakma-Regular.otf
 32K NotoSansLaoUI-Bold.ttf
 32K NotoSansLao-Bold.ttf
 28K NotoSansPhagsPa-Regular.ttf
 28K NotoSansSharada-Regular.otf
 28K NotoSerifGurmukhi-Regular.otf
 28K NotoSansKhojki-Regular.otf
 28K NotoSansTifinagh-Regular.otf
 24K NotoSansBrahmi-Regular.ttf
 24K NotoSansMasaramGondi-Regular.otf
 24K NotoSansMiao-Regular.otf
 24K NotoSansCham-Bold.ttf
 24K NotoSansCham-Regular.ttf
 24K NotoSansThaiUI-Regular.ttf
 24K NotoSansCoptic-Regular.ttf
 24K NotoSansKharoshthi-Regular.ttf
 24K NotoSansThai-Regular.ttf
 24K NotoSansWarangCiti-Regular.otf
 20K NotoSansMeroitic-Regular.otf
 20K NotoSerifThai-Regular.ttf
 20K NotoSansThaiUI-Bold.ttf
 20K NotoSansSaurashtra-Regular.ttf
 20K NotoSansNKo-Regular.ttf
 20K NotoSerifThai-Bold.ttf
 20K NotoSansThai-Bold.ttf
 20K NotoSansHebrew-Bold.ttf
 20K NotoSansHebrew-Regular.ttf
 20K NotoSerifHebrew-Bold.ttf
 20K NotoSerifHebrew-Regular.ttf
 20K NotoSansManichaean-Regular.otf
 16K NotoSansTaiViet-Regular.ttf
 16K NotoSansGlagolitic-Regular.ttf
 16K NotoSansMandaic-Regular.ttf
 16K NotoSansNewTaiLue-Regular.ttf
 16K NotoSansArmenian-Medium.otf
 16K NotoSansSylotiNagri-Regular.ttf
 16K NotoSansArmenian-Bold.otf
 16K NotoSansArmenian-Regular.otf
 16K NotoSansThaana-Bold.ttf
 16K NotoSansThaana-Regular.ttf
 16K NotoSansWancho-Regular.otf
 16K NotoSansMeeteiMayek-Regular.ttf
 16K NotoSansAhom-Regular.otf
 16K NotoSerifArmenian-Regular.otf
 16K NotoSansHanifiRohingya-Regular.otf
 16K NotoSansPahawhHmong-Regular.otf
 16K NotoSansBatak-Regular.ttf
 16K NotoSansOldPersian-Regular.ttf
 12K NotoSerifArmenian-Bold.otf
 12K NotoSansAvestan-Regular.ttf
 12K NotoSansLimbu-Regular.ttf
 12K NotoSansOsage-Regular.ttf
 12K NotoSansDeseret-Regular.ttf
 12K NotoSansSundanese-Regular.ttf
 12K NotoSansTaiLe-Regular.ttf
 12K NotoSansSamaritan-Regular.ttf
 12K NotoSansElbasan-Regular.otf
 12K NotoSansOldPermic-Regular.otf
 12K NotoSansPalmyrene-Regular.otf
 12K NotoSansRunic-Regular.ttf
 12K NotoSansPauCinHau-Regular.otf
8.0K NotoSansKayahLi-Regular.ttf
8.0K NotoSansCypriot-Regular.ttf
8.0K NotoSansOldTurkic-Regular.ttf
8.0K NotoSansBuginese-Regular.ttf
8.0K NotoSansMultani-Regular.otf
8.0K OplusOSUI-XThin.ttf
8.0K NotoSansOlChiki-Regular.ttf
8.0K NotoSansInscriptionalParthian-Regular.ttf
8.0K NotoSansOsmanya-Regular.ttf
8.0K NotoSansUgaritic-Regular.ttf
8.0K NotoSansHanunoo-Regular.ttf
8.0K NotoSansNabataean-Regular.otf
8.0K NotoSansRejang-Regular.ttf
8.0K NotoSansSoraSompeng-Regular.otf
8.0K NotoSansBassaVah-Regular.otf
8.0K NotoSansOldNorthArabian-Regular.otf
8.0K NotoSansCarian-Regular.ttf
8.0K NotoSansGothic-Regular.ttf
8.0K NotoSansShavian-Regular.ttf
8.0K NotoSansMro-Regular.otf
8.0K NotoSansLisu-Regular.ttf
8.0K NotoSansInscriptionalPahlavi-Regular.ttf
8.0K NotoSansTagalog-Regular.ttf
8.0K NotoSansImperialAramaic-Regular.ttf
8.0K NotoSansTagbanwa-Regular.ttf
8.0K NotoSansPhoenician-Regular.ttf
8.0K NotoSansOldItalic-Regular.ttf
8.0K NotoSansBuhid-Regular.ttf
8.0K NotoSansOldSouthArabian-Regular.ttf
8.0K AndroidClock.ttf
8.0K NotoSansOgham-Regular.ttf
8.0K NotoSansHatran-Regular.otf
8.0K NotoSansLycian-Regular.ttf
8.0K NotoSansLydian-Regular.ttf
   0 SysFont-MediumItalic.ttf
   0 SysFont-BlackItalic.ttf
   0 SysFont-LightItalic.ttf
   0 SysFont-BoldItalic.ttf
   0 SysFont-ThinItalic.ttf
   0 SysFont-Myanmar.ttf
   0 SysFont-Regular.ttf
   0 SysFont-Italic.ttf
   0 SysFont-Medium.ttf
   0 SysFont-Black.ttf
   0 SysFont-Light.ttf
   0 SysFont-Bold.ttf
   0 SysFont-Thin.ttf
   0 NotoSansHans.ttc
   0 DroidSans.ttf
   0 DroidSans-Bold.ttf
]]]

[[[
TODO:PUA_GB私用区囗国标囗中文字符
    e82b vs 龶
===
py_adhoc_call   script.hz.打印字符区   @打印字符区囗 =0xe000 =0xf8ff >  ../../../tmp/out4py/script.hz.打印字符区..打印字符区囗带笔顺码囗.基本面私用区.out.txt
view ../../../tmp/out4py/script.hz.打印字符区..打印字符区囗带笔顺码囗.基本面私用区.out.txt
===
view ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/单字_笔顺码_29685个.txt
  PUA(GBK)部件	81字	E815-E86F
    [\ue815-\ue86f]
    80个在本笔顺码文件中出现
  部件扩展	452字	E400-E5E8
    0个
  PUA增补	207字	E600-E6CF
    0个
  〇	1字	3007
    0个
===
grep $'[\ue815-\ue86f]'   ../../../tmp/out4py/script.hz.打印字符区..打印字符区囗带笔顺码囗.基本面私用区.out.txt
    只有部分在系统字体中
grep $'[\ue400-\ue5e8]'   ../../../tmp/out4py/script.hz.打印字符区..打印字符区囗带笔顺码囗.基本面私用区.out.txt
    全部不在系统字体中
grep $'[\ue600-\ue6cf]'   ../../../tmp/out4py/script.hz.打印字符区..打印字符区囗带笔顺码囗.基本面私用区.out.txt
    全部不在系统字体中
===
grep $'[\ue815-\ue86f]'    '../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/单字_笔顺码_29685个.txt'
    80个
grep $'[\ue400-\ue5e8]'    '../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/单字_笔顺码_29685个.txt'
    0个
grep $'[\ue600-\ue6cf]'    '../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/单字_笔顺码_29685个.txt'
    0个
grep $'〇'    '../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/单字_笔顺码_29685个.txt'
    0个
===
grep $'[\ue815-\ue86f]'    '../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/单字_笔顺码_29685个.txt'
.,.+80s/  *\d\d\d$//
.,.+80s/  */:/
===
:1112342522112154
:111234252215425113535
:11134
:1121
:1121251135451
:1212534
:121324111213241112154
:12144115
:121534
:1215454
:1221
:1224453453
:12251112
:12342534
:125235451
:13
:135341134
:13542235451
:1354251212534
:215315352512113134
:215315352512144443134
:2344
:243
:24345
:25111134435451
:251113411212511
:25111431234531
:251125113434121
:25112511355112
:2512121
:2512511251151221113134
:2512512534
:25142551221113134
:253411212511
:31
:3111512212132511
:311151523
:3111525111251113241112154
:31115431112431251
:311154513541541
:3111553544
:3113
:3121
:3123454134333
:314314
:3235511
:323552335523
:33
:332153153535451
:341124314513541541
:35
:35111154
:351143113435251211
:35251211111342511
:3525121135152
:35251211431253511
:4111251554444554444
:41343435451
:4253434121
:425355112
:431113
:431121
:431134
:4334433445
:441134454
:44235511
:4423552335523
:451221251211354444
:45234251212511134
:45234251212534
:453312
:4535
:5
:5
:51121
:513251414311235451
:52121
:54
:55
:55125121
===
grep $'[\ue815-\ue86f]'   ../../../tmp/out4py/script.hz.打印字符区..打印字符区囗带笔顺码囗.基本面私用区.out.txt
===
E815:
E816:
E817:
E818:
E819:
E81A:
E81B:
E81C:
E81D:
E81E:
E81F:
E820:
E821:
E822:
E823:
E824:
E825:
E826:
E827:
E828:
E829:
E82A:
E82B:
E82C:
E82D:
E82E:
E82F:
E830:
E831:
E832:
E833:
E834:
E835:
E836:
E837:
E838:
E839:
E83A:
E83B:
E83C:
E83D:
E83E:
E83F:
E840:
E841:
E842:
E843:
E844:
E845:
E846:
E847:
E848:
E849:
E84A:
E84B:
E84C:
E84D:
E84E:
E84F:
E850:
E851:
E852:
E853:
E854:
E855:
E856:
E857:
E858:
E859:
E85A:
E85B:
E85C:
E85D:
E85E:
E85F:
E860:
E861:
E862:
E863:
E864:
E865:
E866:
E867:
E868:
E869:
E86A:
E86B:
E86C:
E86D:
E86E:
E86F:
]]]

[[[
view ../../python3_src/nn_ns/CJK/CJK_data/raw/Unicode私人使用区PUA.txt
===
Private Use Areas
范围	U+E000...U+F8FF(6400 代码位)
分配	6400 个码位
===
Supplementary PUA-A
范围	U+F0000...U+FFFFF(65536 代码位)
分配	65534 个码位
2 non-characters
===
Supplementary PUA-B
U+100000...U+10FFFF(65536 代码位)
分配	65534 个码位
2 non-characters
===
  PUA(GBK)部件	81字	E815-E86F
  部件扩展	452字	E400-E5E8
  PUA增补	207字	E600-E6CF
  〇	1字	3007
===
国标码码表中私有区码位的演变GB 字节串	Unicode 码位		
GBK 1.0	GB 18030-2005	Unicode 4.1	
===105个:
A6D9		E78D ()	FE10 (︐)
A6DA		E78E ()	FE12 (︒)
A6DB		E78F ()	FE11 (︑)
A6DC		E790 ()	FE13 (︓)
A6DD		E791 ()	FE14 (︔)
A6DE		E792 ()	FE15 (︕)
A6DF		E793 ()	FE16 (︖)
A6EC		E794 ()	FE17 (︗)
A6ED		E795 ()	FE18 (︘)
A6F3		E796 ()	FE19 (︙)
A8BC	E7C7 ()	1E3F (ḿ)	1E3F (ḿ)
A8BF	E7C8 ()	01F9 (ǹ)	01F9 (ǹ)
A989	E7E7 ()	303E (〾)	303E (〾)
A98A	E7E8 ()	2FF0 (⿰)	2FF0 (⿰)
A98B	E7E9 ()	2FF1 (⿱)	2FF1 (⿱)
A98C	E7EA ()	2FF2 (⿲)	2FF2 (⿲)
A98D	E7EB ()	2FF3 (⿳)	2FF3 (⿳)
A98E	E7EC ()	2FF4 (⿴)	2FF4 (⿴)
A98F	E7ED ()	2FF5 (⿵)	2FF5 (⿵)
A990	E7EE ()	2FF6 (⿶)	2FF6 (⿶)
A991	E7EF ()	2FF7 (⿷)	2FF7 (⿷)
A992	E7F0 ()	2FF8 (⿸)	2FF8 (⿸)
A993	E7F1 ()	2FF9 (⿹)	2FF9 (⿹)
A994	E7F2 ()	2FFA (⿺)	2FFA (⿺)
A995	E7F3 ()	2FFB (⿻)	2FFB (⿻)
FE50	E815 ()	2E81 (⺁)	2E81 (⺁)
FE51	E816 ()	E816 ()	20087 (𠂇)
FE52	E817 ()	E817 ()	20089 (𠂉)
FE53	E818 ()	E818 ()	200CC (𠃌)
FE54	E819 ()	2E84 (⺄)	2E84 (⺄)
FE55	E81A ()	3473 (㑳)	3473 (㑳)
FE56	E81B ()	3447 (㑇)	3447 (㑇)
FE57	E81C ()	2E88 (⺈)	2E88 (⺈)
FE58	E81D ()	2E8B (⺋)	2E8B (⺋)
FE59	E81E ()	E81E ()	9FB4 (龴)
FE5A	E81F ()	359E (㖞)	359E (㖞)
FE5B	E820 ()	361A (㘚)	361A (㘚)
FE5C	E821 ()	360E (㘎)	360E (㘎)
FE5D	E822 ()	2E8C (⺌)	2E8C (⺌)
FE5E	E823 ()	2E97 (⺗)	2E97 (⺗)
FE5F	E824 ()	396E (㥮)	396E (㥮)
FE60	E825 ()	3918 (㤘)	3918 (㤘)
FE61	E826 ()	E826 ()	9FB5 (龵)
FE62	E827 ()	39CF (㧏)	39CF (㧏)
FE63	E828 ()	39DF (㧟)	39DF (㧟)
FE64	E829 ()	3A73 (㩳)	3A73 (㩳)
FE65	E82A ()	39D0 (㧐)	39D0 (㧐)
FE66	E82B ()	E82B ()	9FB6 (龶)
FE67	E82C ()	E82C ()	9FB7 (龷)
FE68	E82D ()	3B4E (㭎)	3B4E (㭎)
FE69	E82E ()	3C6E (㱮)	3C6E (㱮)
FE6A	E82F ()	3CE0 (㳠)	3CE0 (㳠)
FE6B	E830 ()	2EA7 (⺧)	2EA7 (⺧)
FE6C	E831 ()	E831 ()	215D7 (𡗗)
FE6D	E832 ()	E832 ()	9FB8 (龸)
FE6E	E833 ()	2EAA (⺪)	2EAA (⺪)
FE6F	E834 ()	4056 (䁖)	4056 (䁖)
FE70	E835 ()	415F (䅟)	415F (䅟)
FE71	E836 ()	2EAE (⺮)	2EAE (⺮)
FE72	E837 ()	4337 (䌷)	4337 (䌷)
FE73	E838 ()	2EB3 (⺳)	2EB3 (⺳)
FE74	E839 ()	2EB6 (⺶)	2EB6 (⺶)
FE75	E83A ()	2EB7 (⺷)	2EB7 (⺷)
FE76	E83B ()	E83B ()	2298F (𢦏)
FE77	E83C ()	43B1 (䎱)	43B1 (䎱)
FE78	E83D ()	43AC (䎬)	43AC (䎬)
FE79	E83E ()	2EBB (⺻)	2EBB (⺻)
FE7A	E83F ()	43DD (䏝)	43DD (䏝)
FE7B	E840 ()	44D6 (䓖)	44D6 (䓖)
FE7C	E841 ()	4661 (䙡)	4661 (䙡)
FE7D	E842 ()	464C (䙌)	464C (䙌)
FE7E	E843 ()	E843 ()	9FB9 (龹)
FE80	E844 ()	4723 (䜣)	4723 (䜣)
FE81	E845 ()	4729 (䜩)	4729 (䜩)
FE82	E846 ()	477C (䝼)	477C (䝼)
FE83	E847 ()	478D (䞍)	478D (䞍)
FE84	E848 ()	2ECA (⻊)	2ECA (⻊)
FE85	E849 ()	4947 (䥇)	4947 (䥇)
FE86	E84A ()	497A (䥺)	497A (䥺)
FE87	E84B ()	497D (䥽)	497D (䥽)
FE88	E84C ()	4982 (䦂)	4982 (䦂)
FE89	E84D ()	4983 (䦃)	4983 (䦃)
FE8A	E84E ()	4985 (䦅)	4985 (䦅)
FE8B	E84F ()	4986 (䦆)	4986 (䦆)
FE8C	E850 ()	499F (䦟)	499F (䦟)
FE8D	E851 ()	499B (䦛)	499B (䦛)
FE8E	E852 ()	49B7 (䦷)	49B7 (䦷)
FE8F	E853 ()	49B6 (䦶)	49B6 (䦶)
FE90	E854 ()	E854 ()	9FBA (龺)
FE91	E855 ()	E855 ()	241FE (𤇾)
FE92	E856 ()	4CA3 (䲣)	4CA3 (䲣)
FE93	E857 ()	4C9F (䲟)	4C9F (䲟)
FE94	E858 ()	4CA0 (䲠)	4CA0 (䲠)
FE95	E859 ()	4CA1 (䲡)	4CA1 (䲡)
FE96	E85A ()	4C77 (䱷)	4C77 (䱷)
FE97	E85B ()	4CA2 (䲢)	4CA2 (䲢)
FE98	E85C ()	4D13 (䴓)	4D13 (䴓)
FE99	E85D ()	4D14 (䴔)	4D14 (䴔)
FE9A	E85E ()	4D15 (䴕)	4D15 (䴕)
FE9B	E85F ()	4D16 (䴖)	4D16 (䴖)
FE9C	E860 ()	4D17 (䴗)	4D17 (䴗)
FE9D	E861 ()	4D18 (䴘)	4D18 (䴘)
FE9E	E862 ()	4D19 (䴙)	4D19 (䴙)
FE9F	E863 ()	4DAE (䶮)	4DAE (䶮)
FEA0	E864 ()	E864 ()	9FBB (龻)
===
]]]


py_adhoc_call   script.hz.打印字符区   @show_data_txts
py_adhoc_call   script.hz.打印字符区   ,_iter_parse4U2E80_pdf_U2F00_pdf
py_adhoc_call   script.hz.打印字符区   ,_iter_parse4radical2stroke_number_code

[[[数据更正之前:
py_adhoc_call   script.hz.打印字符区   @_helper4check__radical2stroke_number_code
===
===xxx:
2E95 ⺕ 522 [('舝', '5215554554152'), ('屮', '522'), ('㞢', '5221')]
    xxx
2EA6 ⺦ 312 [('㲱', '3115555253415445445'), ('千', '312'), ('壬', '3121')]
    xxx
2EDF ⻟ 34451153 [('䢢', '3445113251454'), ('食', '344511534')]
    xxx
2EE7 ⻧ 2126341 [('卨', '2125525251'), ('豳', '21353334135333452')]
    xxx
2F12 ⼒ 35 [('鸧', '345535451'), ('几', '35'), ('儿', '35'), ('九', '35'), ('匕', '35'), ('勹', '35'), ('\ue81c', '35'), ('𠂊', '35'), ('𠘨', '35'), ('𠤎', '35'), ('⺈', '35'), ('月', '3511')]
    xxx
2F2C ⼬ 252 [('咝', '25155551'), ('山', '252'), ('巾', '252'), ('円', '2521')]
    xxx
2F4F ⽏ 5513 [('驷', '55125351'), ('纤', '551312')]
    xxx
2F55 ⽕ 4434 [('鼡', '44335112'), ('黉', '4434512212512134')]
    xxx
2F68 ⽨ 54433 [('蚤', '544251214'), ('㕚', '5444')]
    xxx
2F87 ⾇ 354125 [('条', '3541234'), ('𦢊', '3541251112213424134')]
    xxx
2F96 ⾖ 1252431 [('䴓', '125235451'), ('雨', '12524444')]
    xxx
2F9C ⾜ 2522134 [('罛', '2522133544'), ('罖', '25221344')]
    xxx
2FA6 ⾦ 34112143 [('𠓾', '341121341121341121'), ('舍', '34112251')]
    xxx
2FBB ⾻ 1512452511 [('车', '1512'), ('连', '1512454')]
    xxx
2FBB ⾻ 155452511 [('邷', '155452'), ('巠', '1555121')]
    xxx
===
/[⺕⺦⻟⻧⼒⼬⽏⽕⽨⾇⾖⾜⾦⾻⾻]
===
]]]
[[[数据更正之后:
py_adhoc_call   script.hz.打印字符区   @_helper4check__radical2stroke_number_code
===
2E80 ⺀ 44 [('為', '435554444'), ('氵', '441')]
2E81 ⺁ 33 [('儠', '32555253415445445'), ('\ue815', '33'), ('𠂆', '33'), ('⺁', '33'), ('乕', '3311252')]
2E82 ⺂ 5 [('𠖎', '4554545454'), ('乙', '5'), ('乛', '5'), ('乚', '5'), ('\ue818', '5'), ('\ue819', '5'), ('𠃊', '5'), ('𠃋', '5'), ('𠃌', '5'), ('𠃍', '5'), ('𠃑', '5'), ('𠄌', '5'), ('𠄎', '5'), ('𡿨', '5'), ('⺄', '5'), ('刁', '51')]
2E83 ⺃ 5 [('𠖎', '4554545454'), ('乙', '5'), ('乛', '5'), ('乚', '5'), ('\ue818', '5'), ('\ue819', '5'), ('𠃊', '5'), ('𠃋', '5'), ('𠃌', '5'), ('𠃍', '5'), ('𠃑', '5'), ('𠄌', '5'), ('𠄎', '5'), ('𡿨', '5'), ('⺄', '5'), ('刁', '51')]
2E84 ⺄ 5 [('𠖎', '4554545454'), ('乙', '5'), ('乛', '5'), ('乚', '5'), ('\ue818', '5'), ('\ue819', '5'), ('𠃊', '5'), ('𠃋', '5'), ('𠃌', '5'), ('𠃍', '5'), ('𠃑', '5'), ('𠄌', '5'), ('𠄎', '5'), ('𡿨', '5'), ('⺄', '5'), ('刁', '51')]
2E85 ⺅ 32 [('㶗', '3155414554234325112534'), ('亻', '32'), ('仁', '3211')]
2E86 ⺆ 35 [('鸧', '345535451'), ('几', '35'), ('儿', '35'), ('九', '35'), ('匕', '35'), ('勹', '35'), ('\ue81c', '35'), ('𠂊', '35'), ('𠘨', '35'), ('𠤎', '35'), ('⺈', '35'), ('月', '3511')]
2E87 ⺇ 35 [('鸧', '345535451'), ('几', '35'), ('儿', '35'), ('九', '35'), ('匕', '35'), ('勹', '35'), ('\ue81c', '35'), ('𠂊', '35'), ('𠘨', '35'), ('𠤎', '35'), ('⺈', '35'), ('月', '3511')]
2E88 ⺈ 35 [('鸧', '345535451'), ('几', '35'), ('儿', '35'), ('九', '35'), ('匕', '35'), ('勹', '35'), ('\ue81c', '35'), ('𠂊', '35'), ('𠘨', '35'), ('𠤎', '35'), ('⺈', '35'), ('月', '3511')]
2E89 ⺉ 22 [('㢟', '21554'), ('刂', '22'), ('临', '223142521')]
2E8A ⺊ 21 [('亅', '2'), ('丄', '21'), ('上', '211')]
2E8B ⺋ 55 [('絫', '545454554234'), ('乜', '55'), ('巜', '55'), ('\ue81d', '55'), ('㔾', '55'), ('⺋', '55'), ('马', '551')]
2E8C ⺌ 243 [('盀', '2425221'), ('\ue822', '243'), ('⺌', '243'), ('光', '243135')]
2E8D ⺍ 443 [('惱', '442555325341'), ('兴', '443134')]
2E8E ⺎ 135 [('厺', '13454'), ('兀', '135'), ('尢', '135'), ('兀', '135'), ('𡯁', '135'), ('㝼', '135112')]
2E8F ⺏ 3435 [('爸', '34345215'), ('仑', '3435'), ('尣', '3435'), ('乥', '3435'), ('𡯂', '3435'), ('尩', '34351121')]
2E90 ⺐ 135 [('厺', '13454'), ('兀', '135'), ('尢', '135'), ('兀', '135'), ('𡯁', '135'), ('㝼', '135112')]
2E91 ⺑ 3435 [('爸', '34345215'), ('仑', '3435'), ('尣', '3435'), ('乥', '3435'), ('𡯂', '3435'), ('尩', '34351121')]
2E92 ⺒ 515 [('㞋', '51354'), ('已', '515'), ('己', '515'), ('弓', '515'), ('巳', '515'), ('弖', '5151')]
2E93 ⺓ 554 [('郷', '5535115452'), ('幺', '554'), ('盭', '55412143112313425221')]
2E94 ⺔ 551 [('⺋', '55'), ('马', '551'), ('纟', '551'), ('彑', '551'), ('绑', '551111352')]
2E95 ⺕ 511 [('刁', '51'), ('彐', '511'), ('聿', '511112')]
2E96 ⺖ 442 [('灉', '441555251521532411121'), ('忄', '442'), ('懳', '442111211125114544')]
2E97 ⺗ 2444 [('㓥', '24351122'), ('\ue823', '2444'), ('⺗', '2444'), ('冂', '25')]
2E98 ⺘ 121 [('丅', '12'), ('工', '121'), ('土', '121'), ('士', '121'), ('扌', '121'), ('㠪', '1211')]
2E99 ⺙ 3134 [('谸', '3133434251'), ('夭', '3134'), ('攵', '3134'), ('呑', '3134251')]
2E9B ⺛ 1535 [('迈', '153454'), ('比', '1535'), ('旡', '1535'), ('兂', '1535'), ('毕', '153512')]
2E9C ⺜ 2511 [('囗', '251'), ('日', '2511'), ('曰', '2511'), ('冃', '2511'), ('冄', '2511'), ('旦', '25111')]
2E9D ⺝ 2511 [('囗', '251'), ('日', '2511'), ('曰', '2511'), ('冃', '2511'), ('冄', '2511'), ('旦', '25111')]
2E9E ⺞ 21354 [('𠧧', '21353541'), ('歺', '21354'), ('韰', '2135454211121111')]
2E9F ⺟ 55414 [('盭', '55412143112313425221'), ('母', '55414'), ('䳇', '5541432511154444')]
2EA0 ⺠ 51515 [('㢬', '5151354'), ('民', '51515'), ('䪸', '51515132511134')]
2EA1 ⺡ 441 [('為', '435554444'), ('氵', '441'), ('沣', '4411112')]
2EA2 ⺢ 24134 [('卜', '24'), ('氺', '24134'), ('㒯', '241351221122112')]
2EA3 ⺣ 4444 [('労', '4434553'), ('灬', '4444'), ('宀', '445')]
2EA4 ⺤ 3443 [('𧈛', '3441345225543321531535'), ('爫', '3443'), ('𨿸', '3443113432411121')]
2EA5 ⺥ 3324 [('垼', '3323554121'), ('爪', '3324'), ('𧗠', '33241112')]
2EA6 ⺦ 412 [('𠗊', '411555121'), ('丬', '412'), ('䥆', '412111211134112431')]
2EA7 ⺧ 3121 [('千', '312'), ('壬', '3121'), ('牜', '3121'), ('\ue830', '3121'), ('𡈼', '3121'), ('⺧', '3121'), ('乍', '31211')]
2EA8 ⺨ 353 [('烉', '3525344334'), ('犭', '353'), ('猰', '353111253134')]
2EA9 ⺩ 1121 [('亍', '112'), ('王', '1121'), ('\ue82b', '1121'), ('𤣩', '1121'), ('龶', '1121'), ('玤', '11211112')]
2EAA ⺪ 52121 [('䦺', '5212'), ('\ue833', '52121'), ('𤴔', '52121'), ('⺪', '52121'), ('隢', '52121121121135')]
2EAB ⺫ 25221 [('𦉫', '2522'), ('皿', '25221'), ('罒', '25221'), ('冊', '25221'), ('䍏', '25221'), ('囬', '2522111')]
2EAC ⺬ 11234 [('鳱', '11232511154444'), ('未', '11234'), ('末', '11234'), ('示', '11234'), ('祘', '1123411234')]
2EAD ⺭ 4524 [('𧝞', '45234554554134534'), ('讣', '4524'), ('礻', '4524'), ('㓀', '4524'), ('禊', '4524111253134')]
2EAE ⺮ 314314 [('叐', '31354'), ('\ue836', '314314'), ('𥫗', '314314'), ('⺮', '314314'), ('竺', '31431411')]
2EAF ⺯ 554444 [('𢇃', '5543455434'), ('糹', '554444'), ('䋘', '554444111234')]
2EB0 ⺰ 551 [('⺋', '55'), ('马', '551'), ('纟', '551'), ('彑', '551'), ('绑', '551111352')]
2EB1 ⺱ 2634 [('䫜', '255455452132511134'), ('丿', '3')]
2EB2 ⺲ 25431 [('囥', '2541351'), ('𦉰', '25431'), ('圏', '254311345151')]
2EB3 ⺳ 4535 [('讼', '453454'), ('讥', '4535'), ('冗', '4535'), ('冘', '4535'), ('\ue838', '4535'), ('⺳', '4535'), ('调', '4535121251')]
2EB4 ⺴ 4535 [('讼', '453454'), ('讥', '4535'), ('冗', '4535'), ('冘', '4535'), ('\ue838', '4535'), ('⺳', '4535'), ('调', '4535121251')]
2EB5 ⺵ 2522 [('㼙', '2521554'), ('𦉫', '2522'), ('皿', '25221')]
2EB6 ⺶ 431113 [('鄯', '43111243125152'), ('\ue839', '431113'), ('⺶', '431113'), ('䍪', '43111311234')]
2EB7 ⺷ 431121 [('半', '43112'), ('\ue83a', '431121'), ('𦍌', '431121'), ('⺷', '431121'), ('美', '431121134')]
2EB8 ⺸ 2121112 [('㐀', '21211'), ('芈', '2121112'), ('𦍋', '2121112'), ('歵', '212111212511134')]
2EB9 ⺹ 1213 [('搰', '121255452511'), ('耂', '1213'), ('揿', '121311153534')]
2EBA ⺺ 5112 [('㚑', '511134'), ('肀', '5112'), ('丮', '5112'), ('\ue83e', '51121')]
2EBB ⺻ 51121 [('丮', '5112'), ('\ue83e', '51121'), ('⺻', '51121'), ('䀆', '51121433425221')]
2EBC ⺼ 3541 [('夊', '354'), ('丹', '3541'), ('匀', '3541'), ('夆', '3541112')]
2EBD ⺽ 3211511 [('㐾', '321135'), ('𦥑', '3211511'), ('伟', '321152')]
2EBE ⺾ 122 [('紥', '1215554234'), ('艹', '122'), ('卄', '122'), ('廿', '1221')]
2EBF ⺿ 1212 [('挳', '1211555121'), ('𠥼', '1212'), ('正', '12121')]
2EC0 ⻀ 2121 [('忐', '2114544'), ('止', '2121'), ('卝', '2121'), ('㐀', '21211')]
2EC1 ⻁ 21531535 [('𠮏', '21531534342511154'), ('虎', '21531535'), ('䖈', '21531535'), ('甝', '2153153512211')]
2EC2 ⻂ 45234 [('㐧', '4523'), ('衤', '45234'), ('褉', '45234111253134')]
2EC3 ⻃ 125221 [('再', '125211'), ('襾', '125221'), ('覀', '125221'), ('票', '12522111234')]
2EC4 ⻄ 125351 [('邴', '1253452'), ('西', '125351'), ('酉', '1253511')]
2EC5 ⻅ 2535 [('沀', '25345452'), ('见', '2535'), ('𦉪', '2535'), ('四', '25351')]
2EC6 ⻆ 3535112 [('册', '35351'), ('角', '3535112'), ('觟', '3535112121121')]
2EC7 ⻇ 35353434 [('狓', '35353254'), ('𧢲', '35353434'), ('匇', '35354')]
2EC8 ⻈ 45 [('實', '44555212511134'), ('冖', '45'), ('讠', '45'), ('诓', '45111215')]
2EC9 ⻉ 2534 [('𡈁', '253251111211'), ('水', '2534'), ('内', '2534'), ('贝', '2534'), ('冈', '2534'), ('內', '2534'), ('罓', '2534'), ('𠔿', '2534'), ('囚', '25341')]
2ECA ⻊ 2512121 [('毘', '251211535'), ('\ue848', '2512121'), ('𧾷', '2512121'), ('⻊', '2512121'), ('囸', '25121211')]
2ECB ⻋ 1512 [('郪', '1511253152'), ('车', '1512'), ('连', '1512454')]
2ECC ⻌ 454 [('设', '453554'), ('之', '454'), ('辶', '454'), ('㓃', '454111251315')]
2ECD ⻍ 4454 [('惌', '445354554544'), ('㝘', '4454111251')]
2ECE ⻎ 454 [('设', '453554'), ('之', '454'), ('辶', '454'), ('㓃', '454111251315')]
2ECF ⻏ 52 [('強', '51554251214'), ('了', '52'), ('阝', '52'), ('卩', '52'), ('丩', '52'), ('凵', '52'), ('子', '521')]
2ED0 ⻐ 31115 [('𠂉', '31'), ('钅', '31115'), ('锲', '31115111253134')]
2ED1 ⻑ 12111534 [('扝', '121115'), ('長', '12111534'), ('坛', '1211154')]
2ED2 ⻒ 1211154 [('長', '12111534'), ('坛', '1211154'), ('抟', '1211154'), ('抎', '1211154'), ('镸', '1211154'), ('䦋', '12111541121533134')]
2ED3 ⻓ 3154 [('㩿', '3153134'), ('长', '3154'), ('迄', '315454')]
2ED4 ⻔ 425 [('牽', '41554453112'), ('门', '425'), ('闩', '4251')]
2ED5 ⻕ 32515151 [('追', '325151454'), ('𨸏', '32515151'), ('㷗', '3251515154334')]
2ED6 ⻖ 52 [('強', '51554251214'), ('了', '52'), ('阝', '52'), ('卩', '52'), ('丩', '52'), ('凵', '52'), ('子', '521')]
2ED7 ⻗ 14524444 [('匾', '14513251225'), ('䨮', '1452444411121112511')]
2ED8 ⻘ 11212511 [('珰', '1121243511'), ('青', '11212511'), ('珇', '112125111')]
2ED9 ⻙ 1152 [('亐', '115'), ('韦', '1152'), ('韨', '115213544')]
2EDA ⻚ 132534 [('𠡳', '1325251153'), ('页', '132534'), ('厕', '13253422')]
2EDB ⻛ 3534 [('狍', '35335515'), ('风', '3534'), ('欠', '3534'), ('勽', '3534'), ('匁', '3534'), ('𠘰', '3534'), ('𧘇', '3534'), ('狺', '3534111251')]
2EDC ⻜ 534 [('㚉', '53354354'), ('飞', '534'), ('刃', '534'), ('刄', '534'), ('乆', '534'), ('丒', '5341')]
2EDD ⻝ 344511534 [('䢢', '3445113251454'), ('食', '344511534'), ('侌', '34451154')]
2EDE ⻞ 344511211 [('今', '3445'), ('𩙿', '344511211'), ('飮', '3445112113534')]
2EDF ⻟ 34451154 [('食', '344511534'), ('侌', '34451154'), ('飠', '34451154'), ('䬻', '34451154111534')]
2EE0 ⻠ 355 [('妴', '35455531'), ('饣', '355'), ('㐇', '355'), ('乌', '3551')]
2EE1 ⻡ 5551325111 [('巛', '555'), ('𩠐', '5551325111'), ('煭', '5551354224444')]
2EE2 ⻢ 551 [('⺋', '55'), ('马', '551'), ('纟', '551'), ('彑', '551'), ('绑', '551111352')]
2EE3 ⻣ 255452511 [('圎', '255425111341'), ('骨', '255452511'), ('骭', '255452511112')]
2EE4 ⻤ 325113554 [('卽', '325113552'), ('鬼', '325113554'), ('魅', '32511355411234')]
2EE5 ⻥ 35251211 [('甸', '3525121'), ('鱼', '35251211'), ('\ue858', '35251211111342511')]
2EE6 ⻦ 35451 [('詧', '3544544111251'), ('鸟', '35451'), ('鹱', '354511223241112154')]
2EE7 ⻧ 2125341 [('贞', '212534'), ('卤', '2125341'), ('禼', '21253412554')]
2EE8 ⻨ 1121354 [('珋', '112135352'), ('麦', '1121354'), ('玖', '1121354'), ('玓', '1121354'), ('㺬', '1121354'), ('玬', '11213541')]
2EE9 ⻩ 12212512134 [('䔅', '1221251212512'), ('黄', '12212512134'), ('黊', '12212512134121121')]
2EEA ⻪ 25125115 [('𠹵', '2512511445531'), ('黾', '25125115'), ('呺', '25125115'), ('㕺', '25125115'), ('𨕬', '2512511523454')]
2EEB ⻫ 41343211 [('齐', '413432'), ('斉', '41343211'), ('剤', '4134321122')]
2EEC ⻬ 413432 [('㡿', '413431523'), ('齐', '413432'), ('斉', '41343211')]
2EED ⻭ 212143123452 [('㱖', '212141343412'), ('歯', '212143123452'), ('𪘚', '2121431234521251251')]
2EEE ⻮ 21213452 [('㱓', '212134454'), ('齿', '21213452'), ('龉', '212134521251251')]
2EEF ⻯ 4143125115 [('鷾', '414312511454432511154444'), ('竜', '4143125115'), ('韷', '41431251152252')]
2EF0 ⻰ 13534 [('匢', '135335'), ('龙', '13534'), ('戊', '13534'), ('䶭', '135341121')]
2EF1 ⻱ 32511255115115341 [('㣐', '325112534333'), ('龜', '32511255115115341'), ('䶰', '325112551151153413115')]
2EF2 ⻲ 35251125115 [('鷆', '352511153432511154444'), ('亀', '35251125115'), ('䪷', '35251132511134')]
2EF3 ⻳ 3525115 [('迿', '352511454'), ('龟', '3525115'), ('郇', '35251152')]
2F00 ⼀ 1 [('一', '1'), ('二', '11')]
2F01 ⼁ 2 [('勁', '155512153'), ('丨', '2'), ('亅', '2'), ('丄', '21')]
2F02 ⼂ 4 [('匘', '35555325341'), ('丶', '4'), ('乁', '4'), ('乀', '4'), ('冫', '41')]
2F03 ⼃ 3 [('䫜', '255455452132511134'), ('丿', '3'), ('\ue817', '31')]
2F04 ⼄ 5 [('𠖎', '4554545454'), ('乙', '5'), ('乛', '5'), ('乚', '5'), ('\ue818', '5'), ('\ue819', '5'), ('𠃊', '5'), ('𠃋', '5'), ('𠃌', '5'), ('𠃍', '5'), ('𠃑', '5'), ('𠄌', '5'), ('𠄎', '5'), ('𡿨', '5'), ('⺄', '5'), ('刁', '51')]
2F05 ⼅ 2 [('勁', '155512153'), ('丨', '2'), ('亅', '2'), ('丄', '21')]
2F06 ⼆ 11 [('一', '1'), ('二', '11'), ('三', '111')]
2F07 ⼇ 21 [('亅', '2'), ('丄', '21'), ('上', '211')]
2F07 ⼇ 41 [('乀', '4'), ('冫', '41'), ('亠', '41'), ('㓗', '41111253554234')]
2F08 ⼈ 34 [('㼖', '33544551353334251214251214'), ('人', '34'), ('八', '34'), ('入', '34'), ('乂', '34'), ('㐅', '34'), ('𠆢', '34'), ('亼', '341')]
2F09 ⼉ 35 [('鸧', '345535451'), ('几', '35'), ('儿', '35'), ('九', '35'), ('匕', '35'), ('勹', '35'), ('\ue81c', '35'), ('𠂊', '35'), ('𠘨', '35'), ('𠤎', '35'), ('⺈', '35'), ('月', '3511')]
2F0A ⼊ 34 [('㼖', '33544551353334251214251214'), ('人', '34'), ('八', '34'), ('入', '34'), ('乂', '34'), ('㐅', '34'), ('𠆢', '34'), ('亼', '341')]
2F0B ⼋ 34 [('㼖', '33544551353334251214251214'), ('人', '34'), ('八', '34'), ('入', '34'), ('乂', '34'), ('㐅', '34'), ('𠆢', '34'), ('亼', '341')]
2F0C ⼌ 25 [('⺗', '2444'), ('冂', '25'), ('口', '251')]
2F0D ⼍ 45 [('實', '44555212511134'), ('冖', '45'), ('讠', '45'), ('诓', '45111215')]
2F0E ⼎ 41 [('乀', '4'), ('冫', '41'), ('亠', '41'), ('㓗', '41111253554234')]
2F0F ⼏ 35 [('鸧', '345535451'), ('几', '35'), ('儿', '35'), ('九', '35'), ('匕', '35'), ('勹', '35'), ('\ue81c', '35'), ('𠂊', '35'), ('𠘨', '35'), ('𠤎', '35'), ('⺈', '35'), ('月', '3511')]
2F10 ⼐ 52 [('強', '51554251214'), ('了', '52'), ('阝', '52'), ('卩', '52'), ('丩', '52'), ('凵', '52'), ('子', '521')]
2F11 ⼑ 53 [('乸', '52555414'), ('力', '53'), ('刀', '53'), ('乃', '53'), ('女', '531')]
2F12 ⼒ 53 [('乸', '52555414'), ('力', '53'), ('刀', '53'), ('乃', '53'), ('女', '531')]
2F13 ⼓ 35 [('鸧', '345535451'), ('几', '35'), ('儿', '35'), ('九', '35'), ('匕', '35'), ('勹', '35'), ('\ue81c', '35'), ('𠂊', '35'), ('𠘨', '35'), ('𠤎', '35'), ('⺈', '35'), ('月', '3511')]
2F14 ⼔ 35 [('鸧', '345535451'), ('几', '35'), ('儿', '35'), ('九', '35'), ('匕', '35'), ('勹', '35'), ('\ue81c', '35'), ('𠂊', '35'), ('𠘨', '35'), ('𠤎', '35'), ('⺈', '35'), ('月', '3511')]
2F15 ⼕ 15 [('忒', '1454454'), ('七', '15'), ('匚', '15'), ('匸', '15'), ('丂', '15'), ('与', '151')]
2F16 ⼖ 15 [('忒', '1454454'), ('七', '15'), ('匚', '15'), ('匸', '15'), ('丂', '15'), ('与', '151')]
2F17 ⼗ 12 [('迃', '115454'), ('十', '12'), ('丁', '12'), ('丅', '12'), ('工', '121')]
2F18 ⼘ 24 [('帰', '2351145252'), ('卜', '24'), ('氺', '24134')]
2F19 ⼙ 52 [('強', '51554251214'), ('了', '52'), ('阝', '52'), ('卩', '52'), ('丩', '52'), ('凵', '52'), ('子', '521')]
2F1A ⼚ 13 [('丏', '1255'), ('厂', '13'), ('丆', '13'), ('\ue816', '13'), ('𠂇', '13'), ('𠩐', '13111534')]
2F1B ⼛ 54 [('发', '53544'), ('又', '54'), ('厶', '54'), ('廴', '54'), ('乄', '54'), ('\ue81e', '54'), ('龴', '54'), ('习', '541')]
2F1C ⼜ 54 [('发', '53544'), ('又', '54'), ('厶', '54'), ('廴', '54'), ('乄', '54'), ('\ue81e', '54'), ('龴', '54'), ('习', '541')]
2F1D ⼝ 251 [('冂', '25'), ('口', '251'), ('囗', '251'), ('日', '2511')]
2F1E ⼞ 251 [('冂', '25'), ('口', '251'), ('囗', '251'), ('日', '2511')]
2F1F ⼟ 121 [('丅', '12'), ('工', '121'), ('土', '121'), ('士', '121'), ('扌', '121'), ('㠪', '1211')]
2F20 ⼠ 121 [('丅', '12'), ('工', '121'), ('土', '121'), ('士', '121'), ('扌', '121'), ('㠪', '1211')]
2F21 ⼡ 354 [('㺁', '353555325341'), ('及', '354'), ('久', '354'), ('凡', '354'), ('么', '354'), ('夕', '354'), ('丸', '354'), ('勺', '354'), ('夂', '354'), ('夊', '354'), ('丹', '3541')]
2F22 ⼢ 354 [('㺁', '353555325341'), ('及', '354'), ('久', '354'), ('凡', '354'), ('么', '354'), ('夕', '354'), ('丸', '354'), ('勺', '354'), ('夂', '354'), ('夊', '354'), ('丹', '3541')]
2F23 ⼣ 354 [('㺁', '353555325341'), ('及', '354'), ('久', '354'), ('凡', '354'), ('么', '354'), ('夕', '354'), ('丸', '354'), ('勺', '354'), ('夂', '354'), ('夊', '354'), ('丹', '3541')]
2F24 ⼤ 134 [('厎', '1335154'), ('大', '134'), ('丈', '134'), ('夳', '13411')]
2F25 ⼥ 531 [('乃', '53'), ('女', '531'), ('妦', '5311112')]
2F26 ⼦ 521 [('凵', '52'), ('子', '521'), ('卫', '521'), ('孑', '521'), ('孒', '521'), ('丑', '5211')]
2F27 ⼧ 245 [('⺗', '2444'), ('冂', '25')]
2F27 ⼧ 445 [('灬', '4444'), ('宀', '445'), ('㝉', '4451')]
2F28 ⼨ 124 [('怷', '123544544'), ('下', '124'), ('寸', '124'), ('求', '1241344')]
2F29 ⼩ 234 [('帅', '23252'), ('小', '234'), ('尘', '234121')]
2F2A ⼪ 135 [('厺', '13454'), ('兀', '135'), ('尢', '135'), ('兀', '135'), ('𡯁', '135'), ('㝼', '135112')]
2F2B ⼫ 513 [('叏', '51254'), ('尸', '513'), ('尉', '51311234124')]
2F2C ⼬ 522 [('舝', '5215554554152'), ('屮', '522'), ('㞢', '5221')]
2F2D ⼭ 252 [('咝', '25155551'), ('山', '252'), ('巾', '252'), ('円', '2521')]
2F2E ⼮ 555 [('𢇁', '5545544444'), ('巛', '555'), ('𩠐', '5551325111')]
2F2F ⼯ 121 [('丅', '12'), ('工', '121'), ('土', '121'), ('士', '121'), ('扌', '121'), ('㠪', '1211')]
2F30 ⼰ 515 [('㞋', '51354'), ('已', '515'), ('己', '515'), ('弓', '515'), ('巳', '515'), ('弖', '5151')]
2F31 ⼱ 252 [('咝', '25155551'), ('山', '252'), ('巾', '252'), ('円', '2521')]
2F32 ⼲ 112 [('弍', '11154'), ('于', '112'), ('干', '112'), ('亍', '112'), ('王', '1121')]
2F33 ⼳ 554 [('郷', '5535115452'), ('幺', '554'), ('盭', '55412143112313425221')]
2F34 ⼴ 213 [('卨', '2125525251'), ('豳', '21353334135333452')]
2F34 ⼴ 413 [('㓏', '412534251'), ('广', '413'), ('緳', '413111253554234')]
2F35 ⼵ 54 [('发', '53544'), ('又', '54'), ('厶', '54'), ('廴', '54'), ('乄', '54'), ('\ue81e', '54'), ('龴', '54'), ('习', '541')]
2F36 ⼶ 132 [('㕄', '131554'), ('丌', '132'), ('廾', '132'), ('厞', '1321112111')]
2F37 ⼷ 154 [('㿫', '153553254'), ('弋', '154'), ('夨', '154'), ('𠫓', '154'), ('至', '154121')]
2F38 ⼸ 515 [('㞋', '51354'), ('已', '515'), ('己', '515'), ('弓', '515'), ('巳', '515'), ('弖', '5151')]
2F39 ⼹ 511 [('刁', '51'), ('彐', '511'), ('聿', '511112')]
2F3A ⼺ 333 [('衟', '3325551325111112'), ('彡', '333'), ('䫠', '3331324251132511134')]
2F3B ⼻ 332 [('卮', '33155'), ('彳', '332'), ('𢔓', '33211134112')]
2F3C ⼼ 4544 [('邲', '4543452'), ('心', '4544'), ('吢', '4544251')]
2F3D ⼽ 1534 [('虿', '153251214'), ('戈', '1534'), ('戔', '15341534')]
2F3E ⼾ 3351 [('凢', '335'), ('戶', '3351'), ('甪', '335112')]
2F3E ⼾ 4513 [('读', '4512544134'), ('户', '4513'), ('㧁', '451312154')]
2F3F ⼿ 3112 [('镴', '31115555253415445445'), ('手', '3112'), ('牛', '3112'), ('午', '3112'), ('生', '31121')]
2F40 ⽀ 1254 [('協', '12535353'), ('支', '1254'), ('麗', '1254125441352211535')]
2F41 ⽁ 2154 [('虏', '21531553'), ('攴', '2154'), ('㢟', '21554')]
2F42 ⽂ 2134 [('卨', '2125525251'), ('豳', '21353334135333452')]
2F42 ⽂ 4134 [('庖', '41335515'), ('文', '4134'), ('六', '4134'), ('疒', '41341')]
2F43 ⽃ 4412 [('湽', '441155525121'), ('斗', '4412'), ('渄', '44121112111')]
2F44 ⽄ 3312 [('逓', '3311252454'), ('斤', '3312'), ('頎', '3312132511134')]
2F45 ⽅ 2153 [('鸬', '2151335451'), ('𥈠', '21531343425111')]
2F45 ⽅ 4153 [('㠵', '415252'), ('方', '4153'), ('𣄃', '415312211134')]
2F46 ⽆ 1135 [('邞', '113452'), ('元', '1135'), ('无', '1135'), ('㒬', '11351121')]
2F47 ⽇ 2511 [('囗', '251'), ('日', '2511'), ('曰', '2511'), ('冃', '2511'), ('冄', '2511'), ('旦', '25111')]
2F48 ⽈ 2511 [('囗', '251'), ('日', '2511'), ('曰', '2511'), ('冃', '2511'), ('冄', '2511'), ('旦', '25111')]
2F49 ⽉ 3511 [('⺈', '35'), ('月', '3511'), ('勻', '3511'), ('肨', '35111112')]
2F4A ⽊ 1234 [('鼒', '123251115132125'), ('木', '1234'), ('朩', '1234'), ('𣎴', '1234'), ('本', '12341')]
2F4B ⽋ 3534 [('狍', '35335515'), ('风', '3534'), ('欠', '3534'), ('勽', '3534'), ('匁', '3534'), ('𠘰', '3534'), ('𧘇', '3534'), ('狺', '3534111251')]
2F4C ⽌ 2121 [('忐', '2114544'), ('止', '2121'), ('卝', '2121'), ('㐀', '21211')]
2F4D ⽍ 1354 [('尥', '135354'), ('友', '1354'), ('尤', '1354'), ('歹', '1354'), ('厷', '1354'), ('殝', '13541113431234')]
2F4E ⽎ 3554 [('饱', '35535515'), ('勾', '3554'), ('凤', '3554'), ('殳', '3554'), ('厹', '3554'), ('饺', '355413434')]
2F4F ⽏ 5521 [('缁', '55155525121'), ('毌', '5521'), ('貫', '55212511134')]
2F4F ⽏ 5531 [('乡', '553'), ('毋', '5531'), ('鄊', '55312211152')]
2F50 ⽐ 1535 [('迈', '153454'), ('比', '1535'), ('旡', '1535'), ('兂', '1535'), ('毕', '153512')]
2F51 ⽑ 3115 [('䂕', '31134551353334'), ('气', '3115'), ('毛', '3115'), ('氰', '311511212511')]
2F52 ⽒ 3515 [('匉', '3514312'), ('氏', '3515'), ('氒', '351512')]
2F53 ⽓ 3115 [('䂕', '31134551353334'), ('气', '3115'), ('毛', '3115'), ('氰', '311511212511')]
2F54 ⽔ 2534 [('𡈁', '253251111211'), ('水', '2534'), ('内', '2534'), ('贝', '2534'), ('冈', '2534'), ('內', '2534'), ('罓', '2534'), ('𠔿', '2534'), ('囚', '25341')]
2F55 ⽕ 4334 [('䎖', '432524312511541541'), ('火', '4334'), ('炐', '43341112')]
2F56 ⽖ 3324 [('垼', '3323554121'), ('爪', '3324'), ('𧗠', '33241112')]
2F57 ⽗ 3434 [('㐱', '34333'), ('从', '3434'), ('父', '3434'), ('爻', '3434'), ('仌', '3434'), ('丛', '34341')]
2F58 ⽘ 3434 [('㐱', '34333'), ('从', '3434'), ('父', '3434'), ('爻', '3434'), ('仌', '3434'), ('丛', '34341')]
2F59 ⽙ 5213 [('䧈', '52125351'), ('爿', '5213'), ('陙', '521311534')]
2F5A ⽚ 3215 [('儒', '3214524444132522'), ('片', '3215'), ('臼', '321511')]
2F5B ⽛ 1523 [('匩', '152211215'), ('牙', '1523'), ('䪵', '1523132511134')]
2F5C ⽜ 3112 [('镴', '31115555253415445445'), ('手', '3112'), ('牛', '3112'), ('午', '3112'), ('生', '31121')]
2F5D ⽝ 1344 [('奓', '134354354'), ('太', '1344'), ('犬', '1344'), ('𠀋', '1344'), ('㹜', '13441344')]
2F5E ⽞ 21554 [('攴', '2154'), ('㢟', '21554'), ('刂', '22')]
2F5E ⽞ 41554 [('饔', '4155332411121344511534'), ('玄', '41554'), ('𣫺', '415541441542511')]
2F5F ⽟ 11214 [('𤣻', '11213554'), ('玉', '11214'), ('玊', '11214'), ('琂', '11214111251')]
2F60 ⽠ 33544 [('䑡', '335414544'), ('瓜', '33544'), ('瓥', '335441353334251214251214')]
2F61 ⽡ 1554 [('袃', '1553413534'), ('瓦', '1554'), ('瓧', '155412')]
2F62 ⽢ 12211 [('龷', '1221'), ('甘', '12211'), ('耳', '122111')]
2F63 ⽣ 31121 [('午', '3112'), ('生', '31121'), ('玍', '31121'), ('年', '311212')]
2F64 ⽤ 35112 [('脛', '35111555121'), ('用', '35112'), ('腓', '351121112111')]
2F65 ⽥ 25121 [('中', '2512'), ('由', '25121'), ('田', '25121'), ('畴', '251211113124')]
2F66 ⽦ 52134 [('䊢', '52133544124431234'), ('疋', '52134'), ('陓', '52134115')]
2F67 ⽧ 21341 [('卨', '2125525251'), ('豳', '21353334135333452')]
2F67 ⽧ 41341 [('六', '4134'), ('疒', '41341'), ('瘈', '41341111253134')]
2F68 ⽨ 54334 [('鳮', '5432511154444'), ('癶', '54334'), ('癷', '54334112')]
2F69 ⽩ 32511 [('亿', '325'), ('白', '32511'), ('自', '325111')]
2F6A ⽪ 53254 [('盁', '5325221'), ('皮', '53254'), ('皯', '53254112')]
2F6B ⽫ 25221 [('𦉫', '2522'), ('皿', '25221'), ('罒', '25221'), ('冊', '25221'), ('䍏', '25221'), ('囬', '2522111')]
2F6C ⽬ 25111 [('冄', '2511'), ('旦', '25111'), ('目', '25111'), ('且', '25111'), ('盽', '251111112')]
2F6D ⽭ 54523 [('预', '5452132534'), ('矛', '54523'), ('矠', '5452312212511')]
2F6E ⽮ 31134 [('掰', '311334533112'), ('矢', '31134'), ('失', '31134'), ('䂒', '31134121251')]
2F6F ⽯ 13251 [('冇', '1325'), ('右', '13251'), ('石', '13251'), ('百', '132511')]
2F70 ⽰ 11234 [('鳱', '11232511154444'), ('未', '11234'), ('末', '11234'), ('示', '11234'), ('祘', '1123411234')]
2F71 ⽱ 2554 [('囡', '255311'), ('禸', '2554'), ('囜', '25541')]
2F72 ⽲ 31234 [('歃', '3123215113534'), ('禾', '31234'), ('尓', '31234'), ('稧', '31234111253134')]
2F73 ⽳ 24534 [('⺗', '2444'), ('冂', '25')]
2F73 ⽳ 44534 [('寙', '4453354433544'), ('穴', '44534'), ('窫', '44534111253134')]
2F74 ⽴ 21431 [('㛑', '2135454531'), ('㕢', '21451251113454')]
2F74 ⽴ 41431 [('㓍', '41415435'), ('立', '41431'), ('𨐌', '41431112')]
2F75 ⽵ 312312 [('𦧊', '3122515435'), ('竹', '312312'), ('臿', '312321511')]
2F76 ⽶ 431234 [('㠮', '431224312511121'), ('米', '431234'), ('精', '43123411212511')]
2F77 ⽷ 554234 [('毑', '55414525'), ('糸', '554234'), ('㡫', '554251135345')]
2F78 ⽸ 311252 [('迕', '3112454'), ('缶', '311252'), ('䍂', '311252112')]
2F79 ⽹ 253434 [('贩', '25343354'), ('网', '253434'), ('肉', '253434'), ('氼', '253434'), ('䍑', '253434112')]
2F7A ⽺ 431112 [('兰', '43111'), ('羊', '431112'), ('譱', '43111241112514111251')]
2F7B ⽻ 533533 [('鳭', '5332511154444'), ('㚉', '53354354')]
2F7B ⽻ 541541 [('戏', '541534'), ('羽', '541541'), ('𦒄', '54154111121112511')]
2F7C ⽼ 121335 [('挀', '121333534'), ('老', '121335'), ('耋', '121335154121')]
2F7D ⽽ 132522 [('𨚲', '13252152'), ('而', '132522'), ('面', '132522111')]
2F7E ⽾ 311234 [('犇', '311231213112'), ('朱', '311234'), ('㦵', '3112341534')]
2F7E ⽾ 111234 [('劻', '11121553'), ('耒', '111234'), ('耫', '11123411212511134')]
2F7F ⽿ 122111 [('甘', '12211'), ('耳', '122111'), ('聽', '1221111121122522114544')]
2F80 ⾀ 511112 [('彐', '511'), ('聿', '511112'), ('䀌', '51111213251113251125221')]
2F81 ⾁ 253434 [('贩', '25343354'), ('网', '253434'), ('肉', '253434'), ('氼', '253434'), ('䍑', '253434112')]
2F82 ⾂ 125125 [('蟗', '125124552252251214'), ('臣', '125125'), ('㐓', '125125'), ('𦣝', '125125'), ('吾', '1251251')]
2F83 ⾃ 325111 [('白', '32511'), ('自', '325111'), ('㿤', '32511111342511')]
2F84 ⾄ 154121 [('𠫓', '154'), ('至', '154121'), ('臻', '1541211113431234')]
2F85 ⾅ 321511 [('片', '3215'), ('臼', '321511'), ('毁', '3215111213554')]
2F86 ⾆ 112251 [('匶', '1122324111213215115'), ('盂', '11225221')]
2F86 ⾆ 312251 [('㔞', '3122113553'), ('舌', '312251'), ('舔', '31225111342444')]
2F87 ⾇ 354152 [('匄', '35415'), ('舛', '354152'), ('夅', '354152'), ('䢷', '354152'), ('㘶', '354152121')]
2F88 ⾈ 335412 [('反', '3354'), ('舟', '335414')]
2F88 ⾈ 335414 [('反', '3354'), ('舟', '335414'), ('䑶', '33541411212511')]
2F89 ⾉ 511534 [('䢜', '51145252454'), ('艮', '511534'), ('垦', '511534121')]
2F8A ⾊ 355215 [('䢳', '3552'), ('色', '355215'), ('芻', '3552335523')]
2F8B ⾋ 523522 [('阺', '5235154'), ('艸', '523522'), ('陥', '523522511')]
2F8C ⾌ 215315 [('𥈠', '21531343425111'), ('虍', '215315'), ('䖉', '215315112')]
2F8D ⾍ 251214 [('㽤', '2512135431234'), ('虫', '251214'), ('蚌', '2512141112')]
2F8E ⾎ 325221 [('偦', '32521342511'), ('血', '325221'), ('睾', '32522112143112')]
2F8F ⾏ 332112 [('𢔓', '33211134112'), ('行', '332112'), ('彺', '3321121')]
2F90 ⾐ 213534 [('豳', '21353334135333452'), ('𠧧', '21353541')]
2F90 ⾐ 413534 [('𠖳', '413533'), ('衣', '413534'), ('次', '413534'), ('䘚', '41353412')]
2F91 ⾑ 125221 [('再', '125211'), ('襾', '125221'), ('覀', '125221'), ('票', '12522111234')]
2F92 ⾒ 2511135 [('贂', '251113454545434333'), ('見', '2511135'), ('呒', '2511135'), (' 㫕', '2511135'), ('眀', '251113511')]
2F93 ⾓ 3535121 [('卿', '3535115452'), ('猳', '353512115154')]
2F93 ⾓ 3535112 [('册', '35351'), ('角', '3535112'), ('觟', '3535112121121')]
2F94 ⾔ 1111251 [('亖', '1111'), ('弎', '111154')]
2F94 ⾔ 4111251 [('凊', '4111212511'), ('言', '4111251'), ('訁', '4111251'), ('譿', '4111251111211125114544')]
2F95 ⾕ 3434251 [('睂', '343421325111'), ('谷', '3434251'), ('俎', '343425111')]
2F96 ⾖ 1251431 [('吏', '125134'), ('豆', '1251431'), ('豇', '1251431121')]
2F97 ⾗ 1353334 [('匫', '1353325115'), ('豕', '1353334'), ('尨', '1353334'), ('豣', '1353334113112')]
2F98 ⾘ 3443533 [('㼏', '344353133544'), ('豸', '3443533'), ('䝟', '3443533111253134')]
2F99 ⾙ 2511134 [('眅', '251113354'), ('貝', '2511134'), ('吴', '2511134'), ('呋', '2511134'), ('旲', '2511134'), ('𧸐', '2511134111251113454')]
2F9A ⾚ 1213234 [('拰', '121323121'), ('赤', '1213234'), ('䞑', '1213234121')]
2F9B ⾛ 1212134 [('鴊', '1212132511154444'), ('走', '1212134'), ('赶', '1212134112')]
2F9C ⾜ 2512134 [('畖', '2512133544'), ('足', '2512134'), ('㽗', '2512134'), ('畭', '251213411234')]
2F9D ⾝ 3251113 [('𧑉', '325111251214251214'), ('身', '3251113'), ('躼', '325111312111534')]
2F9E ⾞ 1251112 [('亘', '125111'), ('車', '1251112'), ('轊', '125111211121112511')]
2F9F ⾟ 2143112 [('㛑', '2135454531'), ('㕢', '21451251113454')]
2F9F ⾟ 4143112 [('靖', '4143111212511'), ('辛', '4143112'), ('冸', '4143112'), ('竍', '4143112'), ('𥪯', '41431121121121135')]
2FA0 ⾠ 1311534 [('悘', '13113454544'), ('辰', '1311534'), ('辱', '1311534124')]
2FA1 ⾡ 3332134 [('頿', '333212135132511134'), ('辵', '3332134'), ('䫇', '3332511132511134')]
2FA2 ⾢ 2515215 [('𡃴', '25152131212511454'), ('吧', '2515215'), ('吼', '2515215'), ('邑', '2515215'), ('𨚼', '2515215132511')]
2FA3 ⾣ 1253511 [('西', '125351'), ('酉', '1253511'), ('酐', '1253511112')]
2FA4 ⾤ 3431234 [('乎', '34312'), ('釆', '3431234'), ('䎹', '3431234122111')]
2FA5 ⾥ 2511211 [('叿', '251121'), ('里', '2511211'), ('囯', '2511211'), ('㫔', '2511211'), ('暃', '251121112111')]
2FA6 ⾦ 34112431 [('叙', '341123454'), ('金', '34112431'), ('釒', '34112431'), ('鏏', '3411243111121112511')]
2FA7 ⾧ 12111534 [('扝', '121115'), ('長', '12111534'), ('坛', '1211154')]
2FA8 ⾨ 25112511 [('㕶', '2511251'), ('昌', '25112511'), ('門', '25112511'), ('昍', '25112511'), ('冐', '25112511'), ('冒', '251125111')]
2FA9 ⾩ 32515112 [('𠂤', '325151'), ('阜', '32515112'), ('顊', '32515112132511134')]
2FAA ⾪ 51124134 [('䏋', '5112344544515'), ('录', '51124134'), ('隶', '51124134'), ('㪖', '511241342154')]
2FAB ⾫ 32311121 [('傦', '32255452511'), ('件', '323112')]
2FAB ⾫ 32411121 [('係', '323554234'), ('隹', '32411121'), ('隼', '3241112112')]
2FAC ⾬ 12524444 [('䴓', '125235451'), ('雨', '12524444'), ('迊', '1252454')]
2FAD ⾭ 11212521 [('𤨒', '11212513414544'), ('靑', '11212521'), ('珃', '112125211')]
2FAE ⾮ 31112111 [('𠂉', '31'), ('钅', '31115')]
2FAE ⾮ 21112111 [('上', '211'), ('非', '21112111'), ('韭', '211121111')]
2FAF ⾯ 132522111 [('而', '132522'), ('面', '132522111'), ('䩏', '13252211112225221134534')]
2FB0 ⾰ 122125112 [('㔮', '122125111345425113535'), ('革', '122125112'), ('䩬', '12212511211134112')]
2FB1 ⾱ 521251152 [('陠', '521251124'), ('韋', '521251152'), ('韝', '5212511521122125211')]
2FB2 ⾲ 211121111 [('非', '21112111'), ('韭', '211121111'), ('㻗', '2111211111214')]
2FB3 ⾳ 114312511 [('兘', '113554251'), ('忈', '114544')]
2FB3 ⾳ 414312511 [('咅', '41431251'), ('音', '414312511'), ('章', '41431251112')]
2FB4 ⾴ 132511134 [('𤾩', '132511132511132511'), ('頁', '132511134'), ('砆', '132511134'), ('顨', '132511134132511134132')]
2FB5 ⾵ 351251214 [('匍', '351251124'), ('匐', '35125125121')]
2FB5 ⾵ 353251214 [('㹱', '3532512134'), ('独', '353251214'), ('風', '353251214'), ('𩗴', '35325121411134112')]
2FB6 ⾶ 534335342 [('丒', '5341'), ('飛', '534335342'), ('𢞵', '53433534245434')]
2FB7 ⾷ 341511534 [('仺', '34151'), ('侴', '341521122')]
2FB7 ⾷ 344511534 [('䢢', '3445113251454'), ('食', '344511534'), ('侌', '34451154')]
2FB8 ⾸ 431325111 [('遒', '431253511454'), ('首', '431325111'), ('馘', '43132511112511534')]
2FB9 ⾹ 312342511 [('㕿', '31234251'), ('香', '312342511'), ('租', '3123425111')]
2FBA ⾺ 1211254444 [('𢫮', '121125441'), ('馬', '1211254444'), ('騞', '1211254444111213251')]
2FBB ⾻ 2512452511 [('嚐', '25124345251352511'), ('迚', '2512454')]
2FBB ⾻ 255452511 [('圎', '255425111341'), ('骨', '255452511'), ('骭', '255452511112')]
2FBC ⾼ 2125125251 [('頥', '2125125132511134'), ('觇', '212512535')]
2FBC ⾼ 4125125251 [('㖜', '4125125135'), ('高', '4125125251'), ('㙜', '4125125251121')]
2FBD ⾽ 1211154333 [('镺', '12111543134'), ('髟', '1211154333'), ('鬊', '1211154333111342511')]
2FBE ⾾ 2112111212 [('翡', '21112111541541'), ('鬥', '2112111212'), ('鬨', '2112111212122134')]
2FBF ⾿ 3444445235 [('仒', '3444'), ('鬯', '3444445235'), ('今', '3445')]
2FC0 ⿀ 1251253512 [('朢', '12512535111121'), ('𤍥', '125125352514444')]
2FC0 ⿀ 1251254312 [('䛗', '1251254111251'), ('鬲', '1251254312'), ('鞷', '1251254312122125112')]
2FC1 ⿁ 3251213554 [('假', '32512115154'), ('䖝', '3251214')]
2FC1 ⿁ 325113554 [('卽', '325113552'), ('鬼', '325113554'), ('魅', '32511355411234')]
2FC2 ⿂ 35251214444 [('鲻', '3525121155525121'), ('魚', '35251214444'), ('䰷', '352512144441112')]
2FC3 ⿃ 32511154444 [('裊', '3251115413534'), ('鳥', '32511154444'), ('𪀚', '32511154444113534')]
2FC4 ⿄ 21253444441 [('㮚', '2125343411234'), ('鹵', '21253444441'), ('鹹', '21253444441131251534')]
2FC5 ⿅ 21352211535 [('卨', '2125525251'), ('豳', '21353334135333452')]
2FC5 ⿅ 41352211535 [('鄜', '4135221151552'), ('鹿', '41352211535'), ('塵', '41352211535121')]
2FC6 ⿆ 12343434354 [('鶆', '1234343432511154444'), ('麥', '12343434354'), ('䴲', '1234343435411234')]
2FC7 ⿇ 21312321235 [('卨', '2125525251'), ('豳', '21353334135333452')]
2FC7 ⿇ 41312341234 [('㡷', '41312341'), ('麻', '41312341234'), ('塺', '41312341234121')]
2FC8 ⿈ 122112512134 [('𦮖', '122112354'), ('黃', '122112512134'), ('䗣', '12211251214251214')]
2FC9 ⿉ 312343424134 [('䄻', '31234341534'), ('黍', '312343424134'), ('䵔', '31234342413412511234')]
2FCA ⿊ 254312114444 [('㸃', '25431211212514444'), ('黑', '254312114444'), ('䵟', '254312114444112')]
2FCB ⿋ 224314325232 [('凿', '224314311252'), ('黹', '224314325234')]
2FCB ⿋ 224314325234 [('凿', '224314311252'), ('黹', '224314325234'), ('黼', '2243143252341251124')]
2FCC ⿌ 2511251211511 [('呵', '25112512'), ('黽', '2511251211511'), ('鄳', '251125121151152')]
2FCD ⿍ 251115132125 [('瞰', '2511151221113134'), ('鼎', '251115132125'), ('䵻', '25111513212511121112511')]
2FCE ⿎ 1212514311254 [('尌', '121251431124'), ('鼓', '1212514311254'), ('鼚', '121251431125412111534')]
2FCF ⿏ 3215115445445 [('毇', '3215114312343554'), ('鼠', '3215115445445'), ('鼱', '321511544544511212511')]
2FD0 ⿐ 32511125121132 [('𤾸', '32511122344335554444'), ('鼻', '32511125121132'), ('鼾', '32511125121132112')]
2FD1 ⿑ 21432533543211 [('㛑', '2135454531'), ('㕢', '21451251113454')]
2FD1 ⿑ 41432533543211 [('䐡', '4143253354253434'), ('齊', '41432533543211'), ('齏', '41432533543211211121111')]
2FD2 ⿒ 212134341343452 [('歬', '2121335414'), ('齒', '212134341343452'), ('䶦', '21213434134345211212511134')]
2FD3 ⿓ 1143125111515111 [('兘', '113554251'), ('忈', '114544')]
2FD3 ⿓ 4143125111515111 [('𩐳', '414312511132511134'), ('龍', '4143125111515111'), ('龒', '414312511151511111234')]
2FD4 ⿔ 3525112551515134 [('亀', '35251125115'), ('䪷', '35251132511134')]
2FD4 ⿔ 32511255115115341 [('㣐', '325112534333'), ('龜', '32511255115115341'), ('䶰', '325112551151153413115')]
2FD5 ⿕ 34125125125125122 [('𦒈', '34125125122541541'), ('龠', '34125125125125122'), (' 龥', '34125125125125122132511134')]
===
===
^[^,]*,[^,]*,[^,]*,[^,]*$
===
2E80 ⺀ 44 [('為', '435554444'), ('氵', '441')]
2E8D ⺍ 443 [('惱', '442555325341'), ('兴', '443134')]
2EB1 ⺱ 2634 [('䫜', '255455452132511134'), ('丿', '3')]
2ECD ⻍ 4454 [('惌', '445354554544'), ('㝘', '4454111251')]
2ED7 ⻗ 14524444 [('匾', '14513251225'), ('䨮', '1452444411121112511')]
2F00 ⼀ 1 [('一', '1'), ('二', '11')]
2F27 ⼧ 245 [('⺗', '2444'), ('冂', '25')]
2F34 ⼴ 213 [('卨', '2125525251'), ('豳', '21353334135333452')]
2F42 ⽂ 2134 [('卨', '2125525251'), ('豳', '21353334135333452')]
2F45 ⽅ 2153 [('鸬', '2151335451'), ('𥈠', '21531343425111')]
2F67 ⽧ 21341 [('卨', '2125525251'), ('豳', '21353334135333452')]
2F73 ⽳ 24534 [('⺗', '2444'), ('冂', '25')]
2F74 ⽴ 21431 [('㛑', '2135454531'), ('㕢', '21451251113454')]
2F7B ⽻ 533533 [('鳭', '5332511154444'), ('㚉', '53354354')]
2F86 ⾆ 112251 [('匶', '1122324111213215115'), ('盂', '11225221')]
2F88 ⾈ 335412 [('反', '3354'), ('舟', '335414')]
2F90 ⾐ 213534 [('豳', '21353334135333452'), ('𠧧', '21353541')]
2F93 ⾓ 3535121 [('卿', '3535115452'), ('猳', '353512115154')]
2F94 ⾔ 1111251 [('亖', '1111'), ('弎', '111154')]
2F9F ⾟ 2143112 [('㛑', '2135454531'), ('㕢', '21451251113454')]
2FAB ⾫ 32311121 [('傦', '32255452511'), ('件', '323112')]
2FAE ⾮ 31112111 [('𠂉', '31'), ('钅', '31115')]
2FB3 ⾳ 114312511 [('兘', '113554251'), ('忈', '114544')]
2FB5 ⾵ 351251214 [('匍', '351251124'), ('匐', '35125125121')]
2FB7 ⾷ 341511534 [('仺', '34151'), ('侴', '341521122')]
2FBB ⾻ 2512452511 [('嚐', '25124345251352511'), ('迚', '2512454')]
2FBC ⾼ 2125125251 [('頥', '2125125132511134'), ('觇', '212512535')]
2FC0 ⿀ 1251253512 [('朢', '12512535111121'), ('𤍥', '125125352514444')]
2FC1 ⿁ 3251213554 [('假', '32512115154'), ('䖝', '3251214')]
2FC5 ⿅ 21352211535 [('卨', '2125525251'), ('豳', '21353334135333452')]
2FC7 ⿇ 21312321235 [('卨', '2125525251'), ('豳', '21353334135333452')]
2FCB ⿋ 224314325232 [('凿', '224314311252'), ('黹', '224314325234')]
2FD1 ⿑ 21432533543211 [('㛑', '2135454531'), ('㕢', '21451251113454')]
2FD3 ⿓ 1143125111515111 [('兘', '113554251'), ('忈', '114544')]
2FD4 ⿔ 3525112551515134 [('亀', '35251125115'), ('䪷', '35251132511134')]
===
]]]



[[[
py_adhoc_call   script.hz.打印字符区   @打印字符区囗带笔顺码囗 =0x2E80 =0x2E99    =0x2E9B =0x2EF3    =0x2F00 =0x2FD5 >  ../../../tmp/out4py/script.hz.打印字符区..打印字符区囗带笔顺码囗.字根区.out.txt
view ../../../tmp/out4py/script.hz.打印字符区..打印字符区囗带笔顺码囗.字根区.out.txt
===
]]]

[[[
:U2E80.pdf:
CJK radicals supplement
The Unicode Standard, Version 13.0
===
CJK_Radicals_Supplement = '⺀⺁⺂⺃⺄⺅⺆⺇⺈⺉⺊⺋⺌⺍⺎⺏⺐⺑⺒⺓⺔⺕⺖⺗⺘⺙⺛⺜⺝⺞⺟⺠⺡⺢⺣⺤⺥⺦⺧⺨⺩⺪⺫⺬⺭⺮⺯⺰⺱⺲⺳⺴⺵⺶⺷⺸⺹⺺⺻⺼⺽⺾⺿⻀⻁⻂⻃⻄⻅⻆⻇⻈⻉⻊⻋⻌⻍⻎⻏⻐⻑⻒⻓⻔⻕⻖⻗⻘⻙⻚⻛⻜⻝⻞⻟⻠⻡⻢⻣⻤⻥⻦⻧⻨⻩⻪⻫⻬⻭⻮⻯⻰⻱⻲⻳'
    see:Kangxi_Radicals
===
data_txt4____Kangxi_Radicals___XXX___CJK_Radicals_Supplement
===Kangxi_Radicals___XXX___CJK_Radicals_Supplement=:
01:⼀⼁⼂⼃⼄[⺂⺃⺄]⼅
02:⼆⼇⼈[⺅]⼉⼊⼋⼌[⺆]⼍⼎{⺀}⼏[⺇]⼐⼑[⺈⺉]⼒⼓⼔⼕⼖⼗⼘[⺊]⼙[⺋]{⺒}⼚[⺁]⼛⼜
03:⼝⼞⼟⼠⼡⼢⼣⼤⼥⼦⼧⼨⼩[⺌⺍]⼪[⺎⺏⺐⺑]⼫⼬⼭⼮⼯⼰⼱⼲⼳[⺓]⼴⼵⼶⼷⼸⼹[⺔⺕]⼺⼻
04:⼼[⺖⺗]⼽⼾⼿[⺘]⽀⽁⽂[⺙]⽃⽄⽅⽆{⺛}⽇{⺜}⽈⽉[⺝]⽊⽋⽌⽍[⺞]⽎⽏{⺟}⽐⽑⽒{⺠}⽓⽔[⺡⺢]⽕[⺣]⽖[⺤⺥]⽗⽘⽙[⺦]⽚⽛⽜[⺧]⽝[⺨]
05:⽞⽟[⺩]⽠⽡⽢⽣⽤⽥⽦[⺪]⽧⽨⽩⽪⽫⽬[⺫]⽭⽮⽯⽰[⺬⺭]⽱⽲⽳⽴
06:⽵[⺮]⽶⽷[⺯⺰]⽸⽹[⺱⺲⺳⺴]{⺵}⽺[⺶⺷⺸]⽻⽼[⺹]⽽⽾⽿⾀[⺺⺻]⾁[⺼]⾂⾃⾄⾅[⺽]⾆⾇⾈⾉⾊⾋[⺾⺿⻀]⾌[⻁]⾍⾎⾏⾐[⻂]⾑[⻃⻄]
07:⾒[⻅]⾓[⻆⻇]⾔[⻈]⾕⾖⾗⾘⾙[⻉]⾚⾛⾜[⻊]⾝⾞[⻋]⾟⾠⾡[⻌⻍⻎]⾢[⻏]⾣⾤⾥
08:⾦[⻐]⾧[⻑⻒⻓]⾨[⻔]⾩[⻕⻖]⾪⾫⾬[⻗]⾭[⻘]⾮
09:⾯⾰⾱[⻙]⾲⾳⾴[⻚]⾵[⻛]⾶[⻜]⾷[⻝⻞⻟⻠]⾸[⻡]⾹
10:⾺[⻢]⾻[⻣]⾼⾽⾾⾿⿀⿁[⻤]
11:⿂[⻥]⿃[⻦]⿄[⻧]⿅⿆[⻨]⿇
12:⿈[⻩]⿉⿊⿋
13:⿌[⻪]⿍⿎⿏
14:⿐⿑[⻫⻬]
15:⿒[⻭⻮]
16:⿓[⻯⻰]⿔[⻱⻲⻳]
17:⿕
#NOTE:⼌[⺆]⼏[⺇]⼪[⺐]⼳[⺓]⼹[⺕]⾓[⻆]⾧[⻑]⾷[⻝]⾻[⻣]⿁[⻤]⿔[⻱]
#NOTE:2F0C⼌[2E86⺆]2F0F⼏[2E87⺇]2F2A⼪[2E90⺐]2F33⼳[2E93⺓]2F39⼹[2E95⺕]2F93⾓[2EC6⻆]2FA7⾧[2ED1⻑]2FB7⾷[2EDD⻝]2FBB⾻[2EE3⻣]2FC1⿁[2EE4⻤]2FD4⿔[2EF1⻱]
#NOTE:
#   2F35⼵:3画?2画#之？
#   2F71⽱:5画?4画#[底囗禹禺]？离禽
#   2F61⽡:5画?4画
#   2FCD⿍:13画?12画
===
%s/ \+$//g
%s/\%xa0\(.\)\%xa0$/\1/g
%s/\n→ /;->
%s/\n≈ /;\~\~
%s/\n• /;**
%s/^[0-9A-F]\{4}.\(CJK RADICAL \)\@=/\0;
===
2E9A[xxx]<reserved>
data_txt4____unicode_ver13_0__U2E80_pdf__115_CJK_Radicals_Supplement
===unicode_ver13_0:U2E80.pdf:115=16×7+4-1=len[2E80⺀..=2EF3⻳]\-\{2E9A}
2E80⺀;CJK RADICAL REPEAT
2E81⺁;CJK RADICAL CLIFF;->5382厂;->20086𠂆
2E82⺂;CJK RADICAL SECOND ONE;->4E5B乛
2E83⺃;CJK RADICAL SECOND TWO;->4E5A乚
2E84⺄;CJK RADICAL SECOND THREE;->4E59乙
2E85⺅;CJK RADICAL PERSON;**form used on left side;->4EBB亻
2E86⺆;CJK RADICAL BOX;->5182冂
2E87⺇;CJK RADICAL TABLE;->51E0几;->20628𠘨
2E88⺈;CJK RADICAL KNIFE ONE;**form used at top;->5200刀;->2008A𠂊
2E89⺉;CJK RADICAL KNIFE TWO;**form used on right side;->5202刂
2E8A⺊;CJK RADICAL DIVINATION;**form used at top;->535C卜
2E8B⺋;CJK RADICAL SEAL;**form used at bottom;->353E㔾
2E8C⺌;CJK RADICAL SMALL ONE;**form used at top;->5C0F小
2E8D⺍;CJK RADICAL SMALL TWO;**form used at top;->5C0F小;->2D544邵
2E8E⺎;CJK RADICAL LAME ONE;->5C22尢;->5140兀
2E8F⺏;CJK RADICAL LAME TWO;->5C23尣
2E90⺐;CJK RADICAL LAME THREE;->5C22尢
2E91⺑;CJK RADICAL LAME FOUR;->5C23尣;->21BC2𡯂
2E92⺒;CJK RADICAL SNAKE;->5DF3巳
2E93⺓;CJK RADICAL THREAD;->5E7A幺
2E94⺔;CJK RADICAL SNOUT ONE;->5F51彑
2E95⺕;CJK RADICAL SNOUT TWO;->5F50彐
2E96⺖;CJK RADICAL HEART ONE;**form used on left side;->5FC4忄
2E97⺗;CJK RADICAL HEART TWO;**form used at bottom;->38FA㣺;->5FC3心
2E98⺘;CJK RADICAL HAND;**form used on left side;->624C扌
2E99⺙;CJK RADICAL RAP;**form used on right side;->6535攵
2E9B⺛;CJK RADICAL CHOKE;->65E1旡
2E9C⺜;CJK RADICAL SUN;**actually a form of the radical for hat, despite its resemblance in shape to the radical for sun;->5183冃;->65E5日
2E9D⺝;CJK RADICAL MOON;->6708月
2E9E⺞;CJK RADICAL DEATH;->6B7A歺
2E9F⺟;CJK RADICAL MOTHER;~~6BCD母
2EA0⺠;CJK RADICAL CIVILIAN;->6C11民
2EA1⺡;CJK RADICAL WATER ONE;**form used on left side;->6C35氵
2EA2⺢;CJK RADICAL WATER TWO;**form used (rarely) at bottom;->6C3A氺
2EA3⺣;CJK RADICAL FIRE;**form used at bottom;->706C灬
2EA4⺤;CJK RADICAL PAW ONE;**form used at top;->722B爫
2EA5⺥;CJK RADICAL PAW TWO;**form used at top;->722B爫
2EA6⺦;CJK RADICAL SIMPLIFIED HALF TREE TRUNK;->4E2C丬
2EA7⺧;CJK RADICAL COW;->725B牛
2EA8⺨;CJK RADICAL DOG;**form used on left side;->72AD犭
2EA9⺩;CJK RADICAL JADE;**form used on left side;->738B王;->248E9𤣩
2EAA⺪;CJK RADICAL BOLT OF CLOTH;**form used on left side;->758B疋;->24D14𤴔
2EAB⺫;CJK RADICAL EYE;**form used at top;->2EB2⺲ cjk radical net two;->76EE目;->7F52罒
2EAC⺬;CJK RADICAL SPIRIT ONE;->793A示
2EAD⺭;CJK RADICAL SPIRIT TWO;->793B礻
2EAE⺮;CJK RADICAL BAMBOO;->7AF9竹;->25AD7𥫗
2EAF⺯;CJK RADICAL SILK;**form used on left side;->7CF9糹
2EB0⺰;CJK RADICAL C-SIMPLIFIED SILK;**form used on left side;->7E9F纟
2EB1⺱;CJK RADICAL NET ONE;->7F53罓
2EB2⺲;CJK RADICAL NET TWO;->2EAB⺫ cjk radical eye;->7F52罒;->26270𦉰
2EB3⺳;CJK RADICAL NET THREE;->34C1㓁;->7F51网
2EB4⺴;CJK RADICAL NET FOUR;->34C1㓁;->7F51网
2EB5⺵;CJK RADICAL MESH;->2626B𦉫
2EB6⺶;CJK RADICAL SHEEP;**form used on left side;->7F8A羊
2EB7⺷;CJK RADICAL RAM;**form used at top;->7F8A羊;->2634C𦍌
2EB8⺸;CJK RADICAL EWE;->7F8B羋;->2634B𦍋
2EB9⺹;CJK RADICAL OLD;->8002耂
2EBA⺺;CJK RADICAL BRUSH ONE;->8080肀
2EBB⺻;CJK RADICAL BRUSH TWO;->807F聿
2EBC⺼;CJK RADICAL MEAT;->8089肉
2EBD⺽;CJK RADICAL MORTAR;->81FC臼;->26951𦥑
2EBE⺾;CJK RADICAL GRASS ONE;->8279艹
2EBF⺿;CJK RADICAL GRASS TWO;->8279艹
2EC0⻀;CJK RADICAL GRASS THREE;->8279艹
2EC1⻁;CJK RADICAL TIGER;->864E虎
2EC2⻂;CJK RADICAL CLOTHES;**form used on left side;->8864衤
2EC3⻃;CJK RADICAL WEST ONE;**form used at top;->8980覀
2EC4⻄;CJK RADICAL WEST TWO;**form used on left side;->897F西
2EC5⻅;CJK RADICAL C-SIMPLIFIED SEE;->89C1见
2EC6⻆;CJK RADICAL SIMPLIFIED HORN;->89D2角
2EC7⻇;CJK RADICAL HORN;->278B2𧢲
2EC8⻈;CJK RADICAL C-SIMPLIFIED SPEECH;->8BA0讠
2EC9⻉;CJK RADICAL C-SIMPLIFIED SHELL;->8D1D贝
2ECA⻊;CJK RADICAL FOOT;**form used on left side;->8DB3足;->27FB7𧾷
2ECB⻋;CJK RADICAL C-SIMPLIFIED CART;->8F66车
2ECC⻌;CJK RADICAL SIMPLIFIED WALK;->8FB6辶
2ECD⻍;CJK RADICAL WALK ONE;->8FB6辶
2ECE⻎;CJK RADICAL WALK TWO;->8FB6辶
2ECF⻏;CJK RADICAL CITY;**form used on right side;->9091邑
2ED0⻐;CJK RADICAL C-SIMPLIFIED GOLD;->9485钅
2ED1⻑;CJK RADICAL LONG ONE;->9577長
2ED2⻒;CJK RADICAL LONG TWO;**form used on left side;->9578镸
2ED3⻓;CJK RADICAL C-SIMPLIFIED LONG;->957F长
2ED4⻔;CJK RADICAL C-SIMPLIFIED GATE;->95E8门
2ED5⻕;CJK RADICAL MOUND ONE;->961C阜;->28E0F𨸏
2ED6⻖;CJK RADICAL MOUND TWO;**form used on left side;->961D阝
2ED7⻗;CJK RADICAL RAIN;->96E8雨
2ED8⻘;CJK RADICAL BLUE;->9752青
2ED9⻙;CJK RADICAL C-SIMPLIFIED TANNED LEATHER;->97E6韦
2EDA⻚;CJK RADICAL C-SIMPLIFIED LEAF;->9875页
2EDB⻛;CJK RADICAL C-SIMPLIFIED WIND;->98CE风
2EDC⻜;CJK RADICAL C-SIMPLIFIED FLY;->98DE飞
2EDD⻝;CJK RADICAL EAT ONE;**form used at bottom;->98DF食
2EDE⻞;CJK RADICAL EAT TWO;**form used on left side;->2967F𩙿
2EDF⻟;CJK RADICAL EAT THREE;**form used on left side;->98E0飠
2EE0⻠;CJK RADICAL C-SIMPLIFIED EAT;**form used on left side;->9963饣
2EE1⻡;CJK RADICAL HEAD;->29810𩠐
2EE2⻢;CJK RADICAL C-SIMPLIFIED HORSE;->9A6C马
2EE3⻣;CJK RADICAL BONE;->9AA8骨
2EE4⻤;CJK RADICAL GHOST;->9B3C鬼
2EE5⻥;CJK RADICAL C-SIMPLIFIED FISH;->9C7C鱼
2EE6⻦;CJK RADICAL C-SIMPLIFIED BIRD;->9E1F鸟
2EE7⻧;CJK RADICAL C-SIMPLIFIED SALT;->5364卤
2EE8⻨;CJK RADICAL SIMPLIFIED WHEAT;->9EA6麦
2EE9⻩;CJK RADICAL SIMPLIFIED YELLOW;->9EC4黄
2EEA⻪;CJK RADICAL C-SIMPLIFIED FROG;->9EFE黾
2EEB⻫;CJK RADICAL J-SIMPLIFIED EVEN;->6589斉
2EEC⻬;CJK RADICAL C-SIMPLIFIED EVEN;->9F50齐
2EED⻭;CJK RADICAL J-SIMPLIFIED TOOTH;->6B6F歯
2EEE⻮;CJK RADICAL C-SIMPLIFIED TOOTH;->9F7F齿
2EEF⻯;CJK RADICAL J-SIMPLIFIED DRAGON;->7ADC竜;->9F8D龍
2EF0⻰;CJK RADICAL C-SIMPLIFIED DRAGON;->9F99龙
2EF1⻱;CJK RADICAL TURTLE;->9F9C龜
2EF2⻲;CJK RADICAL J-SIMPLIFIED TURTLE;->4E80亀
2EF3⻳;CJK RADICAL C-SIMPLIFIED TURTLE;~~9F9F龟
===
]]]
[[[
:U2F00.pdf:
Kangxi radicals
The Unicode Standard, Version 13.0
===
⿍???13画???怎么看都是12画
⽡???5画???怎么看都是4画
⽱???5画???怎么看都是4画#[底囗禹禺]？离禽
⼵???3画???怎么看都是2画#之？

:更改 笔顺码！！！
⼌[⺆]⼏[⺇]⼪[⺐]⼳[⺓]⼹[⺕]⾓[⻆]⾧[⻑]⾷[⻝]⾻[⻣]⿁[⻤]⿔[⻱]
    2F0C⼌[2E86⺆]2F0F⼏[2E87⺇]2F2A⼪[2E90⺐]2F33⼳[2E93⺓]2F39⼹[2E95⺕]2F93⾓[2EC6⻆]2FA7⾧[2ED1⻑]2FB7⾷[2EDD⻝]2FBB⾻[2EE3⻣]2FC1⿁[2EE4⻤]2FD4⿔[2EF1⻱]
    ===
    2F0C⼌[2E86⺆]:25 vs 35
    2F0F⼏[2E87⺇]:末笔:横竖弯钩vs横撇钩
    2F2A⼪[2E90⺐]:末笔:横竖弯钩vs竖弯钩
    2F33⼳[2E93⺓]:首笔:撇点vs撇横
    2F39⼹[2E95⺕]vs[5F50彐]:
        『2F39⼹』:『横@底』伸出到右侧；『丑』少[竖]
        『5F50彐』:『竖@首笔横折』伸出到底部；
        『2E95⺕』:『横@中』伸出到右侧；水平翻转[底囗虐]
    2F93⾓[2EC6⻆]:『竖@中』:断尾vs伸出##类似:⺷𦍌vs羊;龶vs丰
    2FA7⾧[2ED1⻑]:似乎没有明显区别:『竖提』看起来像两笔vs一笔；『竖@上』与『竖提@下』错位是两笔vs像一笔
    2FB7⾷[2EDD⻝]:似乎没有明显区别:『点@顶』变『横』vs『点』
    2FBB⾻[2EE3⻣]:[反骨]vs骨，即『横+竖』vs『横折』
    2FC1⿁[2EE4⻤]:[纵三组丿田儿]vs『丿+日+丿+乚』
    2FD4⿔[2EF1⻱]:
        *『2FD4⿔』顶上是『⺈』vs『2EF1⻱』顶上是『丿』
        *『2FD4⿔』的头部类似『黽』隔出左右两个小方格vs『2EF1⻱』的头部通透
        *『2FD4⿔』的两腿中横延长与壳相连vs『2EF1⻱』的躯干通透(与头部融通)
        *『2FD4⿔』16画vs『2EF1⻱』17画


2F3E⼾==[左囗所]==6236戶=!=6237户
    [顶点]-->[撇]
    笔顺也改变:丿丿乛一vs丶乛一丿
2F4F⽏=!=6BCB毋
    本pdf使用的字体显示:
        *『2F4F⽏』中间是『丨』vs『6BCB毋』中间是『丿』
2F7B⽻=!=7FBD羽
    本pdf使用的字体显示:
        *『2F7B⽻』4个『丿』
2F7E⽾=!=8012耒
    本pdf使用的字体显示:
        *『2F7E⽾』顶上是『丿』
2F86⾆==[纵组干口]=!=[纵组千口]==820C舌
    本pdf使用的字体显示:
        *『2F86⾆』顶上是『一』
2F93⾓=!=89D2角
    本pdf使用的字体显示:
        *『2F93⾓』断尾
#这里大部分[顶点]变[横],『2FAB⾫』[顶点]变[撇]##其他[顶点]变[短竖],『2F88⾈』[低点]变[短竖]##
2F07⼇=!=4EA0亠
    [顶点]-->[短竖]
2F27⼧=!=5B80宀
    [顶点]-->[短竖]
2F34⼴=!=5E7F广
    [顶点]-->[短竖]
2F42⽂=!=6587文
    [顶点]-->[短竖]
2F45⽅=!=65B9方
    [顶点]-->[短竖]
2F5E⽞=!=7384玄
    [顶点]-->[短竖]
2F67⽧=!=7592疒
    [顶点]-->[短竖]
2F73⽳=!=7A74穴
    [顶点]-->[短竖]
2F74⽴=!=7ACB立
    [顶点]-->[短竖]
2F90⾐=!=8863衣
    [顶点]-->[短竖]
2F9F⾟=!=8F9B辛
    [顶点]-->[短竖]
2FBC⾼=!=9AD8高
    [顶点]-->[短竖]
2FC5⿅=!=9E7F鹿
    [顶点]-->[短竖]
2FD1⿑=!=9F4A齊
    [顶点]-->[短竖]
2FC7⿇=!=9EBB麻
    [顶点]-->[短竖]
    [末捺]-->[竖弯钩]
    [首捺]-->[竖]
2FCB⿋=!=9EF9黹
    [末捺]-->[竖]

2F88⾈=!=821F舟
    [低点]-->[短竖]
2FAB⾫=!=96B9隹
    [顶点]-->[撇]
##2FAD⾭;KANGXI RADICAL BLUE;~~9751靑
2F94⾔=!=8A00言
    [顶点]-->[横]
2FB3⾳=!=97F3音
    [顶点]-->[横]
2FB7⾷=!=98DF食
    [顶点]-->[横]
2FD3⿓=!=9F8D龍
    [顶点]-->[横]

2FAE⾮=!=975E非
    [竖@左]-->[竖撇]
2FB5⾵=!=98A8風
    [撇@顶]-->[横]
2FC0⿀=!=9B32鬲
    [倒八]-->[儿]

2F39⼹=!=5F50彐=!=2E95⺕==[横翻囗底囗虐]
    本pdf使用的字体显示:
        『2F39⼹』:『横@底』伸出到右侧；『丑』少[竖]
        『5F50彐』:『竖@首笔横折』伸出到底部；
        『2E95⺕』:『横@中』伸出到右侧；水平翻转[底囗虐]
here
2FBB⾻=!=9AA8骨
    [反骨]
2FC1⿁==[纵组甶儿]=!=2EE4⻤==9B3C鬼
    本pdf使用的字体显示:
        *『2FC1⿁』10画vs『2EE4⻤』9画
2FD4⿔=!=2EF1⻱==9F9C龜
    本pdf使用的字体显示:
        *『2FD4⿔』顶上是『⺈』vs『2EF1⻱』顶上是『丿』
        *『2FD4⿔』的头部类似『黽』隔出左右两个小方格vs『2EF1⻱』的头部通透
        *『2FD4⿔』的两腿中横延长与壳相连vs『2EF1⻱』的躯干通透(与头部融通)
        *『2FD4⿔』16画vs『2EF1⻱』17画
===
%s/ \+$//g
%s/\%xa0\(.\)\%xa0$/\1/g
%s/\n→ /;->
%s/\n≈ /;\~\~
%s/^[0-9A-F]\{4}.\(KANGXI RADICAL \)\@=/\0;
===
data_txt4____unicode_ver13_0__U2F00_pdf__214_Kangxi_Radicals
===unicode_ver13_0:U2F00.pdf:214=16×13+6=len[2F00⼀..=2FD5⿕]
2F00⼀;KANGXI RADICAL ONE;~~4E00一
2F01⼁;KANGXI RADICAL LINE;~~4E28丨
2F02⼂;KANGXI RADICAL DOT;~~4E36丶
2F03⼃;KANGXI RADICAL SLASH;~~4E3F丿
2F04⼄;KANGXI RADICAL SECOND;~~4E59乙
2F05⼅;KANGXI RADICAL HOOK;~~4E85亅
2F06⼆;KANGXI RADICAL TWO;~~4E8C二
2F07⼇;KANGXI RADICAL LID;~~4EA0亠
2F08⼈;KANGXI RADICAL MAN;~~4EBA人
2F09⼉;KANGXI RADICAL LEGS;~~513F儿
2F0A⼊;KANGXI RADICAL ENTER;~~5165入
2F0B⼋;KANGXI RADICAL EIGHT;~~516B八
2F0C⼌;KANGXI RADICAL DOWN BOX;~~5182冂
2F0D⼍;KANGXI RADICAL COVER;~~5196冖
2F0E⼎;KANGXI RADICAL ICE;~~51AB冫
2F0F⼏;KANGXI RADICAL TABLE;~~51E0几
2F10⼐;KANGXI RADICAL OPEN BOX;~~51F5凵
2F11⼑;KANGXI RADICAL KNIFE;~~5200刀
2F12⼒;KANGXI RADICAL POWER;~~529B力
2F13⼓;KANGXI RADICAL WRAP;~~52F9勹
2F14⼔;KANGXI RADICAL SPOON;~~5315匕
2F15⼕;KANGXI RADICAL RIGHT OPEN BOX;~~531A匚
2F16⼖;KANGXI RADICAL HIDING ENCLOSURE;~~5338匸
2F17⼗;KANGXI RADICAL TEN;~~5341十
2F18⼘;KANGXI RADICAL DIVINATION;~~535C卜
2F19⼙;KANGXI RADICAL SEAL;~~5369卩
2F1A⼚;KANGXI RADICAL CLIFF;~~5382厂
2F1B⼛;KANGXI RADICAL PRIVATE;~~53B6厶
2F1C⼜;KANGXI RADICAL AGAIN;~~53C8又
2F1D⼝;KANGXI RADICAL MOUTH;~~53E3口
2F1E⼞;KANGXI RADICAL ENCLOSURE;~~56D7囗
2F1F⼟;KANGXI RADICAL EARTH;~~571F土
2F20⼠;KANGXI RADICAL SCHOLAR;~~58EB士
2F21⼡;KANGXI RADICAL GO;~~5902夂
2F22⼢;KANGXI RADICAL GO SLOWLY;~~590A夊
2F23⼣;KANGXI RADICAL EVENING;~~5915夕
2F24⼤;KANGXI RADICAL BIG;~~5927大
2F25⼥;KANGXI RADICAL WOMAN;~~5973女
2F26⼦;KANGXI RADICAL CHILD;~~5B50子
2F27⼧;KANGXI RADICAL ROOF;~~5B80宀
2F28⼨;KANGXI RADICAL INCH;~~5BF8寸
2F29⼩;KANGXI RADICAL SMALL;~~5C0F小
2F2A⼪;KANGXI RADICAL LAME;->21BC1𡯁;~~5C22尢
2F2B⼫;KANGXI RADICAL CORPSE;~~5C38尸
2F2C⼬;KANGXI RADICAL SPROUT;~~5C6E屮
2F2D⼭;KANGXI RADICAL MOUNTAIN;~~5C71山
2F2E⼮;KANGXI RADICAL RIVER;~~5DDB巛
2F2F⼯;KANGXI RADICAL WORK;~~5DE5工
2F30⼰;KANGXI RADICAL ONESELF;~~5DF1己
2F31⼱;KANGXI RADICAL TURBAN;~~5DFE巾
2F32⼲;KANGXI RADICAL DRY;~~5E72干
2F33⼳;KANGXI RADICAL SHORT THREAD;~~5E7A幺
2F34⼴;KANGXI RADICAL DOTTED CLIFF;~~5E7F广
2F35⼵;KANGXI RADICAL LONG STRIDE;~~5EF4廴
2F36⼶;KANGXI RADICAL TWO HANDS;~~5EFE廾
2F37⼷;KANGXI RADICAL SHOOT;~~5F0B弋
2F38⼸;KANGXI RADICAL BOW;~~5F13弓
2F39⼹;KANGXI RADICAL SNOUT;~~5F50彐
2F3A⼺;KANGXI RADICAL BRISTLE;~~5F61彡
2F3B⼻;KANGXI RADICAL STEP;~~5F73彳
2F3C⼼;KANGXI RADICAL HEART;~~5FC3心
2F3D⼽;KANGXI RADICAL HALBERD;~~6208戈
2F3E⼾;KANGXI RADICAL DOOR;~~6236戶
2F3F⼿;KANGXI RADICAL HAND;~~624B手
2F40⽀;KANGXI RADICAL BRANCH;~~652F支
2F41⽁;KANGXI RADICAL RAP;~~6534攴
2F42⽂;KANGXI RADICAL SCRIPT;~~6587文
2F43⽃;KANGXI RADICAL DIPPER;~~6597斗
2F44⽄;KANGXI RADICAL AXE;~~65A4斤
2F45⽅;KANGXI RADICAL SQUARE;~~65B9方
2F46⽆;KANGXI RADICAL NOT;~~65E0无
2F47⽇;KANGXI RADICAL SUN;~~65E5日
2F48⽈;KANGXI RADICAL SAY;~~66F0曰
2F49⽉;KANGXI RADICAL MOON;~~6708月
2F4A⽊;KANGXI RADICAL TREE;~~6728木
2F4B⽋;KANGXI RADICAL LACK;~~6B20欠
2F4C⽌;KANGXI RADICAL STOP;~~6B62止
2F4D⽍;KANGXI RADICAL DEATH;~~6B79歹
2F4E⽎;KANGXI RADICAL WEAPON;~~6BB3殳
2F4F⽏;KANGXI RADICAL DO NOT;~~6BCB毋
2F50⽐;KANGXI RADICAL COMPARE;~~6BD4比
2F51⽑;KANGXI RADICAL FUR;~~6BDB毛
2F52⽒;KANGXI RADICAL CLAN;~~6C0F氏
2F53⽓;KANGXI RADICAL STEAM;~~6C14气
2F54⽔;KANGXI RADICAL WATER;~~6C34水
2F55⽕;KANGXI RADICAL FIRE;~~706B火
2F56⽖;KANGXI RADICAL CLAW;~~722A爪
2F57⽗;KANGXI RADICAL FATHER;~~7236父
2F58⽘;KANGXI RADICAL DOUBLE X;~~723B爻
2F59⽙;KANGXI RADICAL HALF TREE TRUNK;~~723F爿
2F5A⽚;KANGXI RADICAL SLICE;~~7247片
2F5B⽛;KANGXI RADICAL FANG;~~7259牙
2F5C⽜;KANGXI RADICAL COW;~~725B牛
2F5D⽝;KANGXI RADICAL DOG;~~72AC犬
2F5E⽞;KANGXI RADICAL PROFOUND;~~7384玄
2F5F⽟;KANGXI RADICAL JADE;~~7389玉
2F60⽠;KANGXI RADICAL MELON;~~74DC瓜
2F61⽡;KANGXI RADICAL TILE;~~74E6瓦
2F62⽢;KANGXI RADICAL SWEET;~~7518甘
2F63⽣;KANGXI RADICAL LIFE;~~751F生
2F64⽤;KANGXI RADICAL USE;~~7528用
2F65⽥;KANGXI RADICAL FIELD;~~7530田
2F66⽦;KANGXI RADICAL BOLT OF CLOTH;~~758B疋
2F67⽧;KANGXI RADICAL SICKNESS;~~7592疒
2F68⽨;KANGXI RADICAL DOTTED TENT;~~7676癶
2F69⽩;KANGXI RADICAL WHITE;~~767D白
2F6A⽪;KANGXI RADICAL SKIN;~~76AE皮
2F6B⽫;KANGXI RADICAL DISH;~~76BF皿
2F6C⽬;KANGXI RADICAL EYE;~~76EE目
2F6D⽭;KANGXI RADICAL SPEAR;~~77DB矛
2F6E⽮;KANGXI RADICAL ARROW;~~77E2矢
2F6F⽯;KANGXI RADICAL STONE;~~77F3石
2F70⽰;KANGXI RADICAL SPIRIT;~~793A示
2F71⽱;KANGXI RADICAL TRACK;~~79B8禸
2F72⽲;KANGXI RADICAL GRAIN;~~79BE禾
2F73⽳;KANGXI RADICAL CAVE;~~7A74穴
2F74⽴;KANGXI RADICAL STAND;~~7ACB立
2F75⽵;KANGXI RADICAL BAMBOO;~~7AF9竹
2F76⽶;KANGXI RADICAL RICE;~~7C73米
2F77⽷;KANGXI RADICAL SILK;~~7CF8糸
2F78⽸;KANGXI RADICAL JAR;~~7F36缶
2F79⽹;KANGXI RADICAL NET;~~7F51网
2F7A⽺;KANGXI RADICAL SHEEP;~~7F8A羊
2F7B⽻;KANGXI RADICAL FEATHER;~~7FBD羽
2F7C⽼;KANGXI RADICAL OLD;~~8001老
2F7D⽽;KANGXI RADICAL AND;~~800C而
2F7E⽾;KANGXI RADICAL PLOW;~~8012耒
2F7F⽿;KANGXI RADICAL EAR;~~8033耳
2F80⾀;KANGXI RADICAL BRUSH;~~807F聿
2F81⾁;KANGXI RADICAL MEAT;~~8089肉
2F82⾂;KANGXI RADICAL MINISTER;~~81E3臣
2F83⾃;KANGXI RADICAL SELF;~~81EA自
2F84⾄;KANGXI RADICAL ARRIVE;~~81F3至
2F85⾅;KANGXI RADICAL MORTAR;~~81FC臼
2F86⾆;KANGXI RADICAL TONGUE;~~820C舌
2F87⾇;KANGXI RADICAL OPPOSE;~~821B舛
2F88⾈;KANGXI RADICAL BOAT;~~821F舟
2F89⾉;KANGXI RADICAL STOPPING;~~826E艮
2F8A⾊;KANGXI RADICAL COLOR;~~8272色
2F8B⾋;KANGXI RADICAL GRASS;~~8278艸
2F8C⾌;KANGXI RADICAL TIGER;~~864D虍
2F8D⾍;KANGXI RADICAL INSECT;~~866B虫
2F8E⾎;KANGXI RADICAL BLOOD;~~8840血
2F8F⾏;KANGXI RADICAL WALK ENCLOSURE;~~884C行
2F90⾐;KANGXI RADICAL CLOTHES;~~8863衣
2F91⾑;KANGXI RADICAL WEST;~~897E襾
2F92⾒;KANGXI RADICAL SEE;~~898B見
2F93⾓;KANGXI RADICAL HORN;~~89D2角
2F94⾔;KANGXI RADICAL SPEECH;~~8A00言
2F95⾕;KANGXI RADICAL VALLEY;~~8C37谷
2F96⾖;KANGXI RADICAL BEAN;~~8C46豆
2F97⾗;KANGXI RADICAL PIG;~~8C55豕
2F98⾘;KANGXI RADICAL BADGER;~~8C78豸
2F99⾙;KANGXI RADICAL SHELL;~~8C9D貝
2F9A⾚;KANGXI RADICAL RED;~~8D64赤
2F9B⾛;KANGXI RADICAL RUN;~~8D70走
2F9C⾜;KANGXI RADICAL FOOT;~~8DB3足
2F9D⾝;KANGXI RADICAL BODY;~~8EAB身
2F9E⾞;KANGXI RADICAL CART;~~8ECA車
2F9F⾟;KANGXI RADICAL BITTER;~~8F9B辛
2FA0⾠;KANGXI RADICAL MORNING;~~8FB0辰
2FA1⾡;KANGXI RADICAL WALK;~~8FB5辵
2FA2⾢;KANGXI RADICAL CITY;~~9091邑
2FA3⾣;KANGXI RADICAL WINE;~~9149酉
2FA4⾤;KANGXI RADICAL DISTINGUISH;~~91C6釆
2FA5⾥;KANGXI RADICAL VILLAGE;~~91CC里
2FA6⾦;KANGXI RADICAL GOLD;~~91D1金
2FA7⾧;KANGXI RADICAL LONG;~~9577長
2FA8⾨;KANGXI RADICAL GATE;~~9580門
2FA9⾩;KANGXI RADICAL MOUND;~~961C阜
2FAA⾪;KANGXI RADICAL SLAVE;~~96B6隶
2FAB⾫;KANGXI RADICAL SHORT TAILED BIRD;~~96B9隹
2FAC⾬;KANGXI RADICAL RAIN;~~96E8雨
2FAD⾭;KANGXI RADICAL BLUE;~~9751靑
2FAE⾮;KANGXI RADICAL WRONG;~~975E非
2FAF⾯;KANGXI RADICAL FACE;~~9762面
2FB0⾰;KANGXI RADICAL LEATHER;~~9769革
2FB1⾱;KANGXI RADICAL TANNED LEATHER;~~97CB韋
2FB2⾲;KANGXI RADICAL LEEK;~~97ED韭
2FB3⾳;KANGXI RADICAL SOUND;~~97F3音
2FB4⾴;KANGXI RADICAL LEAF;~~9801頁
2FB5⾵;KANGXI RADICAL WIND;~~98A8風
2FB6⾶;KANGXI RADICAL FLY;~~98DB飛
2FB7⾷;KANGXI RADICAL EAT;~~98DF食
2FB8⾸;KANGXI RADICAL HEAD;~~9996首
2FB9⾹;KANGXI RADICAL FRAGRANT;~~9999香
2FBA⾺;KANGXI RADICAL HORSE;~~99AC馬
2FBB⾻;KANGXI RADICAL BONE;~~9AA8骨
2FBC⾼;KANGXI RADICAL TALL;~~9AD8高
2FBD⾽;KANGXI RADICAL HAIR;~~9ADF髟
2FBE⾾;KANGXI RADICAL FIGHT;~~9B25鬥
2FBF⾿;KANGXI RADICAL SACRIFICIAL WINE;~~9B2F鬯
2FC0⿀;KANGXI RADICAL CAULDRON;~~9B32鬲
2FC1⿁;KANGXI RADICAL GHOST;~~9B3C鬼
2FC2⿂;KANGXI RADICAL FISH;~~9B5A魚
2FC3⿃;KANGXI RADICAL BIRD;~~9CE5鳥
2FC4⿄;KANGXI RADICAL SALT;~~9E75鹵
2FC5⿅;KANGXI RADICAL DEER;~~9E7F鹿
2FC6⿆;KANGXI RADICAL WHEAT;~~9EA5麥
2FC7⿇;KANGXI RADICAL HEMP;~~9EBB麻
2FC8⿈;KANGXI RADICAL YELLOW;~~9EC3黃
2FC9⿉;KANGXI RADICAL MILLET;~~9ECD黍
2FCA⿊;KANGXI RADICAL BLACK;~~9ED1黑
2FCB⿋;KANGXI RADICAL EMBROIDERY;~~9EF9黹
2FCC⿌;KANGXI RADICAL FROG;~~9EFD黽
2FCD⿍;KANGXI RADICAL TRIPOD;~~9F0E鼎
2FCE⿎;KANGXI RADICAL DRUM;~~9F13鼓
2FCF⿏;KANGXI RADICAL RAT;~~9F20鼠
2FD0⿐;KANGXI RADICAL NOSE;~~9F3B鼻
2FD1⿑;KANGXI RADICAL EVEN;~~9F4A齊
2FD2⿒;KANGXI RADICAL TOOTH;~~9F52齒
2FD3⿓;KANGXI RADICAL DRAGON;~~9F8D龍
2FD4⿔;KANGXI RADICAL TURTLE;~~9F9C龜
2FD5⿕;KANGXI RADICAL FLUTE;~~9FA0龠
===
===
slash斜线『/』
spear矛、标枪
bow弓
hook钩子
fang尖牙 vs tooth齿
    牙:1.指大牙，臼齒。古時，當唇者稱齒，在輔車之後者稱牙。
    齒:1.門牙。
man人类 vs person个体人、身体
scholar学者
corpse尸体
clan宗族、党派##氏
wrap包
enclosure围
turban头巾
steam蒸汽
tile砖瓦
dish盘子
cave山洞
tongue舌头、语言
bitter苦的##辛
leather皮革
fragrant芬香的、愉快的
sacrificial牺牲的、献祭的
hemp麻、大麻、纤维
millet稷、栗、玉米黍之类
grain谷物##禾
leek韭
drum鼓
dipper汲取 [舀取] 物,长柄杓,汤杓、北斗七星##斗


view  /sdcard/0my_files/tmp/out4py/script.中文字典囗..格式化囗新华字典囗..新华字典.out.txt
^,[亠冖宀儿匕屮廴弋彐攵攴彡戈戶斤殳玄癶禸缶耒舛艮虍行豸辰辵酉釆隹里髟鬯鬲黹鼎龠扌廾]
^,[蹂户夂夊]
^,[冂凵匚匸]



spoon匙、勺##匕:1.古代取食的用具，曲柄淺斗，有飯匕、牲匕、疏匕、挑匕之分。狀類後代的羹匙。#匕/ｂǐ/【名】/(象形。从二匕,匕亦声。甲骨文字形,象汤匙形。汉字部首之一。本义:勺子。按:一说“匕”象反人形,“妣”之初文)/古代的一种取食器具,长柄浅斗,形状像汤勺
sprout芽##屮:I  chè  草木初生。#屮://chè/草木刚长出来。//cǎo/古同“草”。
stride大步、跨步##廴://yǐn/古同“引”，开弓。/长行。//yìn /延。
shoot射##弋:3.用帶絲繩的箭來射。4.指狩獵。#弋/yì /【名】/(象形。甲骨文字形。本义:小木桩。今字作“杙”) /以钩弋压下枝,令着地。——《齐民要术》/系有绳子的箭,用来射鸟。如:弋(系有丝绳的射鸟短矢);弋罗(矢缴和罗网);弋缴(猎取飞鸟的箭)
rap轻敲##攵/攴#攵/pū/古同“攴”。#攴/pū/轻轻地击打。/古同“扑”，戒尺。
bristle鬃毛##彡://shān/须毛和画饰的花纹。/毛长。//xiǎn/〔彡姐〕古代羌族复姓。
door门##戶/hù/同“户”。#戸/hù/同“户”。#户/hù/【名】/(象形。甲骨文字形,象门(門)字的一半。汉字部首之一。从“户”的多与门户有关。本义:单扇门)/户,半门曰户。——《说文》/一扇曰户,两扇曰门。又在于堂室东曰户,在于宅区域曰门。——《字书》
profound深奥的、浓厚的##玄/xuán /【形】/(象形。小篆字,下端象单绞的丝,上端是丝绞上的系带,表示作染丝用的丝结。本义:赤黑色,黑中带红) /黑而有赤色者为玄。——《说文》/深;厚/神妙难捉摸;深奥
plow耕犁##耒/lěi /【动】/(象形。古代的一种翻土农具,形如木叉,上有曲柄,下面是犁头,用以松土,可看作犁的前身。“耒”是汉字部首之一,从“耒”的字,与原始农具或耕作有关。本义:古代的一种农具,形状像木叉)/耒,手耕曲木也。——《说文》
oppose反对##舛/chuǎn/【动】/(会意。小篆字形,是两只方向相反的脚,合起来表示相违背的意思。本义:相违背,颠倒)/舛,对卧也。——《说文》段注:“谓人与人相对而休也,相背,犹相对也。”
stopping##艮/gèn /【形】止;静止/泉可艮,九天之上,九天之下,何所不艮?——清·恽敬《艮泉图咏记》
walk enclosure##行vs辵#『enclosure』应该是指『行』为『左右包夹的部首』如『街』
walk##辵/chuò/走走停停。/跑。
hand##扌
two hands##廾
    廾 vs 扌
    廾/gǒng/两手捧物。今作“拱”。


morning##辰/古同“晨”，清早。/(象形。金文字形,是蛤蚌壳之类软体动物的形象,“蜃”的本字。后经假借而产生了其他用法。本义;蛤蚌之类的软体动物)
distinguish区别##釆/biàn/“辨”的古字。像兽爪分别之形，义为辨别。
short tailed bird短尾鸟##隹/zhuī/【名】/(象形。甲骨文字形,象鸟形。《说文》:“鸟之短尾之总名也。”与“鸟”同源。“隹”是汉字的一个部首,从“隹”的字与禽类有关。本义:短尾鸟的总名)/隹,鸟之短尾总名也。——《说文》
village村庄##里/lǐ/【名】/(会意。从土,从田。从“田”,含有区分界域的意思。本义:里弄;街巷)/里,居也。——《说文》/里,邑也。——《尔雅》。李注:“居之邑也。”/古代一种居民组织,先秦以二十五家为里/八家为邻,三邻为朋,三朋为里。——《尚书大传》/古者七十二家为里。——《论语·譔考文》/一里八十户。——《公羊传·宣公十五年》/百家为里。——《管子·度地》/广三百步、长三百步为一里。——《韩诗外传》/街坊（古代五家为邻，五邻为里）：里弄
wine##酉/yǒu/【名】/(象形。金文字形,象酒坛形。“酉”是汉字的一个部首,从“酉”的字多与酒或因发酵而制成的食物有关。本义:酒)/酉,就也。八月黍成,可为酎酒。——《说文》。按,酉即酒字,象酿器形,中有实。
sacrificial wine祭酒##鬯/chàng/【名】/(象形。甲骨文字形,象器皿中盛酒形,中有小点,表示酒糟。本义:古代祭祀、宴饮用的香酒,用郁金草合黑黍酿成)
cauldron大锅##鬲/lì/【名】/(象形。金文字形,象饮食器具形。本义:古代炊器。用于烧煮或烹炒的锅,特指类似于鼎状的炊具)同本义/古鼎中有三足皆空,中可容物者,所谓鬲也。——宋·沈括《梦溪笔谈》
embroidery刺绣##黹/zhǐ/【名】/用针做的活,特指除单纯用针缝的以外的活,如刺绣、编结、绒绣。如:针黹
axe斧#斤/jīn /【名】(象形。甲骨文字形,上面是横刃,下为曲柄,象斧斤形。本义:斧子一类的工具) /同本义。一般用以砍木,与斧相似,比斧小而刃横/今,斫木斧也。——《说文》。段注:“凡斫物者皆曰斧,斫木之斧,则谓之斤。”


go slowly##夊/suī/〔夊夊〕古同“绥绥”，慢慢行走的样子，如“雄狐夊夊。”（今作“有狐绥绥”）。
go##夂？#夂://zhǐ/从后至。//zhōng/古同“终”。
halberd戟##戈？#戈/gē/【名】/(象形。甲骨文字形,象一种长柄兵器形。本义:一种兵器) /中国古代的主要兵器/戈,平头戟也。从弋、一,横之象形。——《说文》。按,戈者,柲也,长六尺六寸,其刃横出,可勾可击,与矛专刺、殳专击者不同,亦与戟之兼刺与勾者异。/青铜制,盛行于商至战国时期,秦以后逐渐消失。其突出部分名援,援上下皆刃,用以横击和钩杀,勾割或啄刺敌人,因此,古代叫做勾兵或称啄兵。又如:戈殳(戈和殳。泛指兵器);戈甲(戈和铠甲。借指战争。又为兵器的统称);戈矢(戈和箭);戈矛(戈和矛)
weapon武器#殳？#殳/shū/名/(象形,甲骨文字形,象手持一种长柄勾头似的器具,可以取物,可以打击乐器,后成为兵器。本义:一种用竹或木制成的,起撞击或前导作用的古代兵器) /殳,以杖殊人也。——《说文》。段注:“杖者,殳用积竹而无刃”。毛传:“殳长丈二而无刃是也。殊,断也。”/古代的一种武器，用竹木做成，有棱无刃。/戟柄。
snout鼻##彐？#彐/xuě/曾作“雪”的简化字，后停用。
    snout vs nose
        nose鼻
        muzzle 狗、马等的鼻子
        snout 猪等的鼻子
        trunk 象的鼻子
lid盖##亠？#亠/tóu/汉字部首。
cover封面、盖子##冖/mì/古同“幂”，覆盖。
roof屋顶##宀？#宀/mián/深屋。/覆盖。
flute长笛##龠？#龠/yuè/【名】/(“籥”(yuè)的本字。会意。从品仑。“品”表示乐器的管孔,仑是按顺序排列之义。本义:乐器名)/古代管乐器像编管之形,似为排箫之前身/龠,乐之竹管,三孔,以和众声也。——《说文》。经传皆以籥为之。
jar广口瓶、刺耳声##缶？小口vs广口#缶/fǒu /【名】(象形。甲骨文字形,上面是“午”字,即“杵”。下面是“缶”的本体。“杵”是棒子,可用来制坯。“缶”又是秦乐器,“杵”可以敲击成曲。本义:瓦器,圆腹小口,用以盛酒浆等) /盛酒浆的瓦器。大腹小口,有盖。也有铜制的/缶,瓦器所以盛酒浆,秦人鼓之以节歌。象形。——《说文》/盎谓之缶。——《尔雅》/古代一种大肚子小口儿的盛酒瓦器。
tripod三脚架、三脚桌##鼎？#鼎/dǐng /【名】/(象形。甲骨文字形,上面的部分象鼎的左右耳及鼎腹,下面象鼎足。本义:古代烹煮用的器物) 。盛行于商、周。用于煮盛物品,或置于宗庙作铭功记绩的礼器。统治者亦用作烹人的刑具/鼎,三足两耳,和五味之宝器也。——《说文》/古代烹煮用的器物，一般是三足两耳：铜鼎。鼎食（列鼎而食，指豪侈生活）。鼎镬。

##特别不通:
hair##髟？#髟/biāo/毛发下垂的样子：“斑鬓髟以承弁兮。”
tiger##虍？#虍/hū/虎皮上的斑纹。
legs木头支架##儿？#儿/【名】(象形。甲骨文字形,下面是“人”字,上面象小儿张口哭笑。“儿”是汉字部首之一,从“儿”的字大都与“人”有关。本义:幼儿。古时男称儿,女称婴,后来孩童都称儿)
badger vt.一再要求; n.1 (C)‘动物’獾((獾亚科身驱短胖之食肉动物的统称,如美洲獾、欧洲獾)) 2 (U)獾的毛皮##豸？#豸/zhì/【名】本指长脊兽,如猫、虎之类。引申为无脚的虫,体多长,如蚯蚓之类/有足谓之虫,无足谓之豸。——《尔雅》
tent帐篷##dotted tent??##癶？#癶/bō/两足分张相背，行走不顺。
track小径、轨道、踪迹##禸？#禸/róu/古同“蹂”。#蹂/róu/【动】/(形声。从足,柔声。本义:践踏)/蹂,履也。——《广雅》/蹂,蹂践,蹋也。——《玉篇》
    ???

view ../../../unzip/e_book/字词典/[Chinese-English dictionary]cedict_1_0_ts.u8
^\(. \)\?[夂夊髟虍儿豸癶禸]
兒 儿 [er2] /child/son/
兒 儿 [r5] /non-syllabic diminutive suffix/retroflex final/
夂 夂 [zhi3] /"walk slowly" component in Chinese characters/see also 冬字頭|冬字头[dong1 zi4 tou2]/
夊 夊 [sui1] /see 夂[zhi3]/
冬字頭 冬字头 [dong1 zi4 tou2] /name of "walk slowly" component in Chinese characters/see also 夂[zhi3]/
禸 禸 [rou2] /trample/
禹 禹 [Yu3] /Yu the Great (c. 21st century BC), mythical leader who tamed the floods/surname Yu/
禺 禺 [ou3] /archaic variant of 偶[ou3]/
禺 禺 [yu2] /ancient area/
禺 禺 [yu4] /legendary monkey of ancient China/
离 离 [chi1] /mythical beast (archaic)/
虍 虍 [hu1] /stripes of a tiger/"tiger" radical in Chinese characters (Kangxi radical 141)/
豸 豸 [zhi4] /worm-like invertebrate/mythical animal (see 獬豸[xie4 zhi4])/radical in Chinese characters (Kangxi radical 153)/
髟 髟 [biao1] /hair/shaggy/

view /sdcard/0my_files/tmp/out4py/英语词霸囗.py..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
trample踩踏、轻视
stripe条纹
shaggy:a. 毛发蓬松的,长浓而粗的,表面粗糙的

##其他:
2F33⼳;KANGXI RADICAL SHORT THREAD;~~5E7A幺
2E93⺓;CJK RADICAL THREAD;->5E7A幺
    2F33⼳ vs 2E93⺓

2F0C⼌;KANGXI RADICAL DOWN BOX;~~5182冂
2F10⼐;KANGXI RADICAL OPEN BOX;~~51F5凵
2F15⼕;KANGXI RADICAL RIGHT OPEN BOX;~~531A匚
2F16⼖;KANGXI RADICAL HIDING ENCLOSURE;~~5338匸
    2F0C⼌ DOWN BOX
    2F10⼐ OPEN BOX
    2F15⼕ RIGHT OPEN BOX
    2F16⼖ HIDING ENCLOSURE
hiding enclosure##匸#掩藏

:匚
/fāng
/古代一种盛放东西的方形器物。
/量词，一斗。
/祭名。

:冂
/jiōng
/城外，郊外，野外。

:凵
/kǎn
/古同“坎”。
/凵
/qiǎn
/张口。

:匸
/xì
/掩藏。


===
]]]
[[[
grep $'Kangxi radical'   '../../../unzip/e_book/字词典/[Chinese-English dictionary]cedict_1_0_ts.u8'
===51行:
⺮ ⺮ [zhu2] /"bamboo" radical in Chinese characters (Kangxi radical 118)/
㔾 㔾 [jie2] /"seal" radical in Chinese characters (Kangxi radical 26)/
一 一 [yi1] /one/1/single/a (article)/as soon as/entire/whole/all/throughout/"one" radical in Chinese characters (Kangxi radical 1)/also pr. [yao1] for greater clarity when spelling out numbers digit by digit/
三框欄 三框栏 [san1 kuang4 lan2] /name of radical in Chinese characters (Kangxi radical 22)/see also 匚[fang1]/
三點水 三点水 [san1 dian3 shui3] /name of "water" radical in Chinese characters (Kangxi radical 85)/see also 氵[shui3]/
丨 丨 [gun3] /radical in Chinese characters (Kangxi radical 2)/
丶 丶 [zhu3] /"dot" radical in Chinese characters (Kangxi radical 3)/see also 點|点[dian3]/
丿 丿 [pie3] /radical in Chinese characters (Kangxi radical 4)/see 撇[pie3]/
乙 乙 [yi3] /second of the ten Heavenly Stems 十天干[shi2 tian1 gan1]/second in order/letter "B" or roman "II" in list "A, B, C", or "I, II, III" etc/second party (in legal contract, usually 乙方[yi3 fang1], as opposed to 甲方[jia3 fang1])/ethyl/bent/winding/radical in Chinese characters (Kangxi radical 5)/ancient Chinese compass point: 105°/
亅 亅 [jue2] /"vertical stroke with hook" radical in Chinese characters (Kangxi radical 6)/see also 豎鉤|竖钩[shu4 gou1]/
亠 亠 [tou2] /"lid" radical in Chinese characters (Kangxi radical 8)/
亻 亻 [ren2] /"person" radical in Chinese characters (Kangxi radical 9)/
側刀旁 侧刀旁 [ce4 dao1 pang2] /name of "knife" radical in Chinese characters (Kangxi radical 18), occurring in 到, 利, 别 etc/see also 刂[dao1]/
兩點水 两点水 [liang3 dian3 shui3] /name of "ice" radical in Chinese characters (Kangxi radical 15)/see also 冫[bing1]/
冂 冂 [jiong1] /radical in Chinese characters (Kangxi radical 13), occurring in 用, 同, 网 etc/see also 同字框[tong2 zi4 kuang4]/
冖 冖 [mi4] /"cover" radical in Chinese characters (Kangxi radical 14), occurring in 军, 写, 冠 etc/see also 禿寶蓋|秃宝盖[tu1 bao3 gai4]/see also 平寶蓋|平宝盖[ping2 bao3 gai4]/
冫 冫 [bing1] /"ice" radical in Chinese characters (Kangxi radical 15), occurring in 冰, 决, 次/see also 兩點水|两点水[liang3 dian3 shui3]/
刂 刂 [dao1] /"knife" radical in Chinese characters (Kangxi radical 18)/see also 立刀旁[li4 dao1 pang2]/see also 側刀旁|侧刀旁[ce4 dao1 pang2]/
匚 匚 [fang1] /radical in Chinese characters (Kangxi radical 22), occurring in 区, 医, 匹 etc/see also 三框欄|三框栏[san1 kuang4 lan2]/see also 區字框|区字框[qu1 zi4 kuang4]/
匸 匸 [xi4] /"cover" or "conceal" radical in Chinese characters (Kangxi radical 23)/see also 匚[fang1]/
區字框 区字框 [qu1 zi4 kuang4] /name of radical in Chinese characters (Kangxi radical 22)/see also 匚[fang1]/
卩 卩 [jie2] /"seal" radical in Chinese characters (Kangxi radical 26)/
厂 厂 [han3] /"cliff" radical in Chinese characters (Kangxi radical 27), occurring in 原, 历, 压 etc/
厂字旁 厂字旁 [chang3 zi4 pang2] /name of "cliff" 厂 radical in simplified Chinese characters (Kangxi radical 27)/
反文旁 反文旁 [fan3 wen2 pang2] /(colloquial) grapheme 攵 (variant form of Kangxi radical 66, 攴)/
同字框 同字框 [tong2 zi4 kuang4] /name of radical in Chinese characters (Kangxi radical 13)/see also 冂[jiong1]/
宀 宀 [mian2] /"roof" radical in Chinese characters (Kangxi radical 40), occurring in 家, 定, 安 etc/see also 寶蓋|宝盖[bao3 gai4]/
寶蓋 宝盖 [bao3 gai4] /name of "roof" radical in Chinese characters (Kangxi radical 40)/see also 宀[mian2]/
巾 巾 [jin1] /towel/general purpose cloth/women's headcovering (old)/Kangxi radical 50/
平寶蓋 平宝盖 [ping2 bao3 gai4] /name of "cover" radical in Chinese characters (Kangxi radical 14)/see also 冖[mi4]/
彐 彐 [ji4] /pig snout (Kangxi radical 58)/
彳 彳 [chi4] /step with the left foot (Kangxi radical 60)/see also 彳亍[chi4 chu4]/
文 文 [wen2] /language/culture/writing/formal/literary/gentle/(old) classifier for coins/Kangxi radical 67/
氵 氵 [shui3] /"water" radical in Chinese characters (Kangxi radical 85), occurring in 没, 法, 流 etc/see also 三點水|三点水[san1 dian3 shui3]/
爫 爫 [zhao3] /"claw" radical in Chinese characters (Kangxi radical 87)/
爿 丬 [qiang2] /"piece of wood" radical in Chinese characters (Kangxi radical 90), mirror image of 片[pian4]/
禿寶蓋 秃宝盖 [tu1 bao3 gai4] /name of "cover" radical in Chinese characters (Kangxi radical 14)/see also 冖[mi4]/
立刀旁 立刀旁 [li4 dao1 pang2] /name of "knife" radical in Chinese characters (Kangxi radical 18), occurring in 到, 利, 别 etc/see also 刂[dao1]/
竹 竹 [zhu2] /bamboo/CL:棵[ke1],支[zhi1],根[gen1]/Kangxi radical 118/
罒 罒 [wang3] /net (Kangxi radical 122)/
罓 罓 [wang3] /net (Kangxi radical 122)/
臣 臣 [chen2] /state official or subject in dynastic China/I, your servant (used in addressing the sovereign)/Kangxi radical 131/
虍 虍 [hu1] /stripes of a tiger/"tiger" radical in Chinese characters (Kangxi radical 141)/
虎字頭 虎字头 [hu3 zi4 tou2] /name of "tiger" radical in Chinese characters (Kangxi radical 141)/see also 虍[hu1]/
言字旁 言字旁 [yan2 zi4 pang2] /name of "speech" or "words" radical in Chinese characters (Kangxi radical 149)/see also 訁|讠[yan2]/
訁 讠 [yan2] /"speech" or "words" radical in Chinese characters (Kangxi radical 149)/see also 言字旁[yan2 zi4 pang2]/
豸 豸 [zhi4] /worm-like invertebrate/mythical animal (see 獬豸[xie4 zhi4])/radical in Chinese characters (Kangxi radical 153)/
身 身 [shen1] /body/life/oneself/personally/one's morality and conduct/the main part of a structure or body/pregnant/classifier for sets of clothes: suit, twinset/Kangxi radical 158/
镸 镸 [chang2] /"long" or "to grow" radical in Chinese characters (Kangxi radical 168)/
飠 饣 [shi2] /"to eat" or "food" radical in Chinese characters (Kangxi radical 184)/
鼎 鼎 [ding3] /ancient cooking cauldron with two looped handles and three or four legs/pot (dialect)/to enter upon a period of (classical)/Kangxi radical 206/one of the 64 hexagrams of the Book of Changes/
===
]]]
[[[
:RSIndex.pdf:
Radical-Stroke Index
The Unicode Standard, Version 13.0
===
Unicode 13.0.0 Radical-Stroke Index
18 Feb 2020
===
使用的部首是：康熙字典部首
    :U2F00.pdf:
    Kangxi radicals
===
Kangxi_Radicals
    see:CJK_Radicals_Supplement
===
data_txt4____Kangxi_Radicals
===Kangxi_Radicals=:
01:⼀⼁⼂⼃⼄⼅
02:⼆⼇⼈⼉⼊⼋⼌⼍⼎⼏⼐⼑⼒⼓⼔⼕⼖⼗⼘⼙⼚⼛⼜
03:⼝⼞⼟⼠⼡⼢⼣⼤⼥⼦⼧⼨⼩⼪⼫⼬⼭⼮⼯⼰⼱⼲⼳⼴⼵⼶⼷⼸⼹⼺⼻
04:⼼⼽⼾⼿⽀⽁⽂⽃⽄⽅⽆⽇⽈⽉⽊⽋⽌⽍⽎⽏⽐⽑⽒⽓⽔⽕⽖⽗⽘⽙⽚⽛⽜⽝
05:⽞⽟⽠⽡⽢⽣⽤⽥⽦⽧⽨⽩⽪⽫⽬⽭⽮⽯⽰⽱⽲⽳⽴
06:⽵⽶⽷⽸⽹⽺⽻⽼⽽⽾⽿⾀⾁⾂⾃⾄⾅⾆⾇⾈⾉⾊⾋⾌⾍⾎⾏⾐⾑
07:⾒⾓⾔⾕⾖⾗⾘⾙⾚⾛⾜⾝⾞⾟⾠⾡⾢⾣⾤⾥
08:⾦⾧⾨⾩⾪⾫⾬⾭⾮
09:⾯⾰⾱⾲⾳⾴⾵⾶⾷⾸⾹
10:⾺⾻⾼⾽⾾⾿⿀⿁
11:⿂⿃⿄⿅⿆⿇
12:⿈⿉⿊⿋
13:⿌⿍⿎⿏
14:⿐⿑
15:⿒
16:⿓⿔
17:⿕
===
09画:9B3C鬼:325113554
    10画:2FC1⿁:3251213554==[纵组甶儿]
17画:9F9C龜:32511255115115341
    16画:2FD4⿔:3525112551515134(我估计的笔顺码)
⿍???13画???怎么看都是12画
⽡???5画???怎么看都是4画
⽱???5画???怎么看都是4画#[底囗禹禺]？离禽
⼵???3画???怎么看都是2画#之？
here
===
/^\d\+ strokes\?
    1 stroke
    17 strokes
===214×3+17=659行
1 stroke
?
1
One 3
?
2
Line 3
?
3
Dot 3
?
4
Slash 4
?
5
Second 4
?
6
Hook 5
2 strokes
?
7
Two 5
?
8
Lid 5
?
9
Man 5
?
10
Legs 10
?
11
Enter 11
?
12
Eight 11
?
13
Down Box 11
?
14
Cover 12
?
15
Ice 12
?
16
Table 13
?
17
Open Box 13
?
18
Knife 13
?
19
Power 15
?
20
Wrap 16
?
21
Spoon 17
?
22
Right Open Box 17
?
23
Hiding Enclosure 17
?
24
Ten 17
?
25
Divination 18
?
26
Seal 18
?
27
Cliff 18
?
28
Private 19
?
29
Again 20
3 strokes
?
30
Mouth 20
?
31
Enclosure 28
?
32
Earth 29
?
33
Scholar 33
?
34
Go 34
?
35
Go Slowly 34
?
36
Evening 34
?
37
Big 34
?
38
Woman 35
?
39
Child 39
?
40
Roof 40
?
41
Inch 42
?
42
Small 42
?
43
Lame 43
?
44
Corpse 43
?
45
Sprout 44
?
46
Mountain 45
?
47
River 48
?
48
Work 48
?
49
Oneself 49
?
50
Turban 49
?
51
Dry 50
?
52
Short Thread 50
?
53
Dotted Cliff 51
?
54
Long Stride 52
?
55
Two Hands 52
?
56
Shoot 53
?
57
Bow 53
?
58
Snout 54
?
59
Bristle 54
?
60
Step 55
4 strokes
?
61
Heart 56
?
62
Halberd 61
?
63
Door 62
?
64
Hand 62
?
65
Branch 68
?
66
Rap 69
?
67
Script 70
?
68
Dipper 70
?
69
Axe 71
?
70
Square 71
?
71
Not 72
?
72
Sun 72
?
73
Say 75
?
74
Moon 75
?
75
Tree 76
?
76
Lack 83
?
77
Stop 84
?
78
Death 85
?
79
Weapon 86
?
80
Do Not 86
?
81
Compare 87
?
82
Fur 87
?
83
Clan 88
?
84
Steam 88
?
85
Water 88
?
86
Fire 96
?
87
Claw 101
?
88
Father 101
?
89
Double X 101
?
90
Half Tree Trunk 102
?
91
Slice 102
?
92
Fang 102
?
93
Cow 102
?
94
Dog 104
5 strokes
?
95
Profound 106
?
96
Jade 106
?
97
Melon 109
?
98
Tile 109
?
99
Sweet 110
?
100
Life 110
?
101
Use 110
?
102
Field 110
?
103
Bolt Of Cloth 112
?
104
Sickness 112
?
105
Dotted Tent 114
?
106
White 114
?
107
Skin 115
?
108
Dish 116
?
109
Eye 117
?
110
Spear 119
?
111
Arrow 120
?
112
Stone 120
?
113
Spirit 123
?
114
Track 125
?
115
Grain 125
?
116
Cave 127
?
117
Stand 129
6 strokes
?
118
Bamboo 129
?
119
Rice 133
?
120
Silk 135
?
121
Jar 139
?
122
Net 140
?
123
Sheep 141
?
124
Feather 142
?
125
Old 143
?
126
And 143
?
127
Plow 143
?
128
Ear 143
?
129
Brush 144
?
130
Meat 144
?
131
Minister 148
?
132
Self 148
?
133
Arrive 148
?
134
Mortar 149
?
135
Tongue 149
?
136
Oppose 149
?
137
Boat 149
?
138
Stopping 150
?
139
Color 150
?
140
Grass 151
?
141
Tiger 159
?
142
Insect 160
?
143
Blood 164
?
144
Walk Enclosure 164
?
145
Clothes 165
?
146
West 167
7 strokes
?
147
See 168
?
148
Horn 168
?
149
Speech 169
?
150
Valley 173
?
151
Bean 173
?
152
Pig 174
?
153
Badger 174
?
154
Shell 175
?
155
Red 177
?
156
Run 177
?
157
Foot 178
?
158
Body 181
?
159
Cart 182
?
160
Bitter 184
?
161
Morning 184
?
162
Walk 184
?
163
City 187
?
164
Wine 189
?
165
Distinguish 190
?
166
Village 190
8 strokes
?
167
Gold 190
?
168
Long 196
?
169
Gate 197
?
170
Mound 198
?
171
Slave 200
?
172
Short Tailed Bird 200
?
173
Rain 201
?
174
Blue 203
?
175
Wrong 203
9 strokes
?
176
Face 203
?
177
Leather 203
?
178
Tanned Leather 205
?
179
Leek 205
?
180
Sound 205
?
181
Leaf 206
?
182
Wind 207
?
183
Fly 208
?
184
Eat 209
?
185
Head 211
?
186
Fragrant 211
10 strokes
?
187
Horse 211
?
188
Bone 213
?
189
Tall 214
?
190
Hair 214
?
191
Fight 216
?
192
Sacrificial Wine 216
?
193
Cauldron 216
?
194
Ghost 216
11 strokes
?
195
Fish 217
?
196
Bird 220
?
197
Salt 224
?
198
Deer 225
?
199
Wheat 225
?
200
Hemp 226
12 strokes
?
201
Yellow 226
?
202
Millet 226
?
203
Black 226
?
204
Embroidery 227
13 strokes
?
205
Frog 227
?
206
Tripod 227
?
207
Drum 228
?
208
Rat 228
14 strokes
?
209
Nose 228
?
210
Even 228
15 strokes
?
211
Tooth 229
16 strokes
?
212
Dragon 230
?
213
Turtle 230
17 strokes
?
214
Flute 230
===
]]]



[[[
py_adhoc_call   script.hz.打印字符区   @打印字符区囗 =0x2E80 =0x2E99    =0x2E9B =0x2EF3    =0x2F00 =0x2FD5
:U2E80.pdf:
:U2F00.pdf:
++人工编辑:添加笔顺码
注意:vs:
    2EAB:⺫:25221
    2EB2:⺲:25431~𦉰
===
data_txt4____329_radical2stroke_number_code
===115+214=329个字根->笔顺码:
2E80:⺀:44#repeat
2E81:⺁:33=𠂆20086~厂5382#cliff悬崖峭壁
2E82:⺂:5=乛4E5B#second乙、第二
2E83:⺃:5=乚4E5A
2E84:⺄:5~乙4E59
2E85:⺅:32#person
2E86:⺆:35#box
2E87:⺇:35#table案几、桌子、台地、高原
2E88:⺈:35#knift
2E89:⺉:22
2E8A:⺊:21#divination占卜
2E8B:⺋:55=㔾353E#seal?密封?
2E8C:⺌:243#small
2E8D:⺍:443
2E8E:⺎:135=兀5140#lame?瘸、跛?vt.使跛足、使残废#【动】动摇,摇晃『兀其根本而能全于长世者也。』——《后汉书》##突、秃
2E8F:⺏:3435=尣5C23
2E90:⺐:135=尢5C22
2E91:⺑:3435=𡯂21BC2
2E92:⺒:515#snake蛇
2E93:⺓:554#thread线
2E94:⺔:551#snout鼻突
2E95:⺕:511
2E96:⺖:442#heart
2E97:⺗:2444
2E98:⺘:121#hand
2E99:⺙:3134=攵6535#rap轻敲、拍击##攵同攴/pū/轻轻地击打。/古同“扑”，戒尺。
2E9B:⺛:1535=旡65E1#choke呛##旡:飲食引起的氣逆哽塞。???旡/jì/胃里的气体从嘴里出来，并发出声音，即打嗝儿。
2E9C:⺜:2511=冃5183~日65E5#sun???#hat!!!##冃/mào/古同“帽”。
2E9D:⺝:2511#moon
2E9E:⺞:21354=歺6B7A#death##歺/dǎi/古同“歹”。##歹/dǎi/【形】/(象形。本作“歺”,音è。甲骨文字形,象有裂缝的残骨。隶变作“歹”。“歹”是汉字部首之一,从“歹”的字多与死、坏或不吉祥等义有关。①(è)本义:残骨。《说文》:“列骨之残也。”②坏)/坏。与“好”相对
2E9F:⺟:55414#mother
2EA0:⺠:51515#civilian
2EA1:⺡:441#water
2EA2:⺢:24134
2EA3:⺣:4444#fire
2EA4:⺤:3443#paw
2EA5:⺥:3324
2EA6:⺦:412#[简体]half tree trunk#爿(爿,丬) I qiáng剖木為二，左半為爿。II pán 1.劈成片的竹木。vs片
2EA7:⺧:3121#cow乳牛
2EA8:⺨:353#dog
2EA9:⺩:1121#jade翡翠、玉
2EAA:⺪:52121=𤴔24D14~疋758B#bolt of cloth 一匹布#bolt 3 [布、壁纸的] 一卷,一束[of]##???xxx belt xxx???##疋//pǐ/同“匹”①。//yǎ/古同“雅”，《尔雅》亦作《尔疋》。//shū/脚。
2EAB:⺫:25221=罒7F52~⺲2EB2~目76EE#eye
2EAC:⺬:11234#spirit灵、精神##示/shì/【动】(会意。小篆字形,“二”是古文“上”字,三竖代表日月星。甲骨文本作“T”,象祭台形。“示”是汉字的一个部首,其义多与祭祀、礼仪有关。本读(qí)。本义:地神。引申义:让人看,显示)
2EAD:⺭:4524
2EAE:⺮:314314#bamboo竹
2EAF:⺯:554444#silk
2EB0:⺰:551#[中国简体]silk
2EB1:⺱:2634#net网
2EB2:⺲:25431~𦉰
2EB3:⺳:4535
2EB4:⺴:4535
2EB5:⺵:2522=𦉫2626B#mesh网
2EB6:⺶:431113~羊7F8A#sheep
2EB7:⺷:431121=𦍌2634C~羊7F8A#ram公羊
2EB8:⺸:2121112~𦍋2634B~羋7F8B~芈8288#ewe母羊
2EB9:⺹:1213=耂8002#old
2EBA:⺺:5112=肀8080#brush笔刷##肀同聿，作偏旁##聿yù 1.筆的別稱。 《說文‧聿部》：“聿，所以書也。 楚謂之聿，吳謂之不律，燕謂之弗。” 漢揚雄《太玄‧飾》：“舌聿之利，利見知人也。” 司馬光集注：“聿，筆也。”
2EBB:⺻:51121~聿807F
2EBC:⺼:3541~肉8089#meat
2EBD:⺽:3211511=𦥑26951~臼81FC#mortar研钵
2EBE:⺾:122=艹8279=卄5344#grass
2EBF:⺿:1212~艹8279
2EC0:⻀:2121=卝535D~艹8279
2EC1:⻁:21531535#tiger
2EC2:⻂:45234#clothes
2EC3:⻃:125221#west
2EC4:⻄:125351
2EC5:⻅:2535#[中国简体]see
2EC6:⻆:3535112#[简体]horn
2EC7:⻇:35353434#horn角
2EC8:⻈:45#[中国简体]speech
2EC9:⻉:2534#[中国简体]shell
2ECA:⻊:2512121#foot
2ECB:⻋:1512#[中国简体]cart
2ECC:⻌:454#[简体]walk
2ECD:⻍:4454
2ECE:⻎:454
2ECF:⻏:52#右用邑#city
2ED0:⻐:31115#[中国简体]gold
2ED1:⻑:12111534#long
2ED2:⻒:1211154=镸9578
2ED3:⻓:3154#[中国简体]long
2ED4:⻔:425#[中国简体]gate
2ED5:⻕:32515151=𨸏#mound丘、堆##阜fù 1.土山。
2ED6:⻖:52#左用阜
2ED7:⻗:14524444#rain
2ED8:⻘:11212511#blue
2ED9:⻙:1152#[中国简体]tanned leather鞣制过的皮革##韦/（韋）/wéi/经去毛加工制成的柔皮：韦编三绝（喻读书刻苦）。/【动】/(形声。从舛(chuǎn),舛像两脚相对形。意为违背。囗声。韋是違的初字。本义:违背)同本义/【名】/熟皮,去毛熟治的皮革/兽皮之韦可以束枉。戾相违背,故借以为皮韦。按,熟曰韦,生曰革。——朱骏声《说文通训定声》
2EDA:⻚:132534#[中国简体]leaf
2EDB:⻛:3534#[中国简体]wind
2EDC:⻜:534#[中国简体]fly
2EDD:⻝:344511534#eat
2EDE:⻞:344511211=𩙿
2EDF:⻟:34451154
2EE0:⻠:355#[中国简体]eat
2EE1:⻡:5551325111#head
2EE2:⻢:551#[中国简体]horse
2EE3:⻣:255452511#bone
2EE4:⻤:325113554#ghost
2EE5:⻥:35251211#[中国简体]fish
2EE6:⻦:35451#[中国简体]bird
2EE7:⻧:2125341#[中国简体]salt盐、腌的##鹵(鹵,卤) I  lŭ 3.鹽的一種。亦泛指食鹽。 《史記‧貨殖列傳》：“山東食海鹽，山西食鹽鹵。” 5.用鹽水加五香等或用醬油對食品進行煮製。如：鹵雞；鹵肉。
2EE8:⻨:1121354#[简体]wheat
2EE9:⻩:12212512134#[简体]yellow
2EEA:⻪:25125115=黾9EFE#[中国简体]frog蛙##黾/黽/měng/【名】/(象形。甲骨文字形。象蛙形。本义:蛙的一种)同本义/湿地饶蛙黾。——张祜《发蜀客》/又如:黾窟(蛙洞);黾媒(捕蛙的诱饵);黾蜮(蛙类)
2EEB:⻫:41343211#[日本简体]even
2EEC:⻬:413432#[中国简体]even
2EED:⻭:212143123452#[日本简体]tooth
2EEE:⻮:21213452#[中国简体]tooth
2EEF:⻯:4143125115#[日本简体]dragon
2EF0:⻰:13534#[中国简体]dragon
2EF1:⻱:32511255115115341=龜9F9C#turtle#325-1125-511-511-5341#??1125(横@左-横@右-竖@右-竖弯钩@左)??为何不是125(横@右-竖@右-横折弯钩@左)? 竖弯钩-->横折弯钩 ##可能是参照『⿌:2511251211511』
2EF2:⻲:35251125115=亀4E80#[日本简体]turtle
2EF3:⻳:3525115=龟9F9F#[中国简体]turtle
2F00:⼀:1
2F01:⼁:2
2F02:⼂:4
2F03:⼃:3
2F04:⼄:5
2F05:⼅:2
2F06:⼆:11
2F07:⼇:21=!=41
2F08:⼈:34
2F09:⼉:35
2F0A:⼊:34
2F0B:⼋:34
2F0C:⼌:25
2F0D:⼍:45
2F0E:⼎:41
2F0F:⼏:35
2F10:⼐:52
2F11:⼑:53
2F12:⼒:53
2F13:⼓:35
2F14:⼔:35
2F15:⼕:15
2F16:⼖:15
2F17:⼗:12
2F18:⼘:24
2F19:⼙:52
2F1A:⼚:13
2F1B:⼛:54
2F1C:⼜:54
2F1D:⼝:251
2F1E:⼞:251
2F1F:⼟:121
2F20:⼠:121
2F21:⼡:354
2F22:⼢:354
2F23:⼣:354
2F24:⼤:134
2F25:⼥:531
2F26:⼦:521
2F27:⼧:245=!=445
2F28:⼨:124
2F29:⼩:234
2F2A:⼪:135
2F2B:⼫:513
2F2C:⼬:522
2F2D:⼭:252
2F2E:⼮:555
2F2F:⼯:121
2F30:⼰:515
2F31:⼱:252
2F32:⼲:112
2F33:⼳:554
2F34:⼴:213=!=413
2F35:⼵:54
2F36:⼶:132
2F37:⼷:154
2F38:⼸:515
2F39:⼹:511
2F3A:⼺:333
2F3B:⼻:332
2F3C:⼼:4544
2F3D:⼽:1534
2F3E:⼾:3351=!=4513
2F3F:⼿:3112
2F40:⽀:1254
2F41:⽁:2154
2F42:⽂:2134=!=4134
2F43:⽃:4412
2F44:⽄:3312
2F45:⽅:2153=!=4153
2F46:⽆:1135
2F47:⽇:2511
2F48:⽈:2511
2F49:⽉:3511
2F4A:⽊:1234
2F4B:⽋:3534
2F4C:⽌:2121
2F4D:⽍:1354
2F4E:⽎:3554
2F4F:⽏:5521=!=5531
2F50:⽐:1535
2F51:⽑:3115
2F52:⽒:3515
2F53:⽓:3115
2F54:⽔:2534
2F55:⽕:4334
2F56:⽖:3324
2F57:⽗:3434
2F58:⽘:3434
2F59:⽙:5213
2F5A:⽚:3215
2F5B:⽛:1523
2F5C:⽜:3112
2F5D:⽝:1344
2F5E:⽞:21554=!=41554
2F5F:⽟:11214
2F60:⽠:33544
2F61:⽡:1554
2F62:⽢:12211
2F63:⽣:31121
2F64:⽤:35112
2F65:⽥:25121
2F66:⽦:52134
2F67:⽧:21341=!=41341
2F68:⽨:54334
2F69:⽩:32511
2F6A:⽪:53254
2F6B:⽫:25221
2F6C:⽬:25111
2F6D:⽭:54523
2F6E:⽮:31134
2F6F:⽯:13251
2F70:⽰:11234
2F71:⽱:2554
2F72:⽲:31234
2F73:⽳:24534=!=44534
2F74:⽴:21431=!=41431
2F75:⽵:312312
2F76:⽶:431234
2F77:⽷:554234
2F78:⽸:311252
2F79:⽹:253434
2F7A:⽺:431112
2F7B:⽻:533533=!=541541
2F7C:⽼:121335
2F7D:⽽:132522
2F7E:⽾:311234=!=111234
2F7F:⽿:122111
2F80:⾀:511112
2F81:⾁:253434
2F82:⾂:125125
2F83:⾃:325111
2F84:⾄:154121
2F85:⾅:321511
2F86:⾆:112251=!=312251
2F87:⾇:354152
2F88:⾈:335412=!=335414
2F89:⾉:511534
2F8A:⾊:355215
2F8B:⾋:523522
2F8C:⾌:215315
2F8D:⾍:251214
2F8E:⾎:325221
2F8F:⾏:332112
2F90:⾐:213534=!=413534
2F91:⾑:125221
2F92:⾒:2511135
2F93:⾓:3535121=!=3535112
2F94:⾔:1111251=!=4111251
2F95:⾕:3434251
2F96:⾖:1251431
2F97:⾗:1353334
2F98:⾘:3443533
2F99:⾙:2511134
2F9A:⾚:1213234
2F9B:⾛:1212134
2F9C:⾜:2512134
2F9D:⾝:3251113
2F9E:⾞:1251112
2F9F:⾟:2143112=!=4143112
2FA0:⾠:1311534
2FA1:⾡:3332134
2FA2:⾢:2515215
2FA3:⾣:1253511
2FA4:⾤:3431234
2FA5:⾥:2511211
2FA6:⾦:34112431
2FA7:⾧:12111534
2FA8:⾨:25112511
2FA9:⾩:32515112
2FAA:⾪:51124134
2FAB:⾫:32311121=!=32411121
2FAC:⾬:12524444
2FAD:⾭:11212521
2FAE:⾮:31112111=!=21112111
2FAF:⾯:132522111
2FB0:⾰:122125112
2FB1:⾱:521251152
2FB2:⾲:211121111
2FB3:⾳:114312511=!=414312511
2FB4:⾴:132511134
2FB5:⾵:351251214=!=353251214
2FB6:⾶:534335342
2FB7:⾷:341511534=!=344511534
2FB8:⾸:431325111
2FB9:⾹:312342511
2FBA:⾺:1211254444
2FBB:⾻:2512452511=!=255452511##[反骨]
2FBC:⾼:2125125251=!=4125125251
2FBD:⾽:1211154333
2FBE:⾾:2112111212
2FBF:⾿:3444445235
2FC0:⿀:1251253512=!=1251254312
2FC1:⿁:3251213554==[纵组甶儿]=!=325113554
2FC2:⿂:35251214444
2FC3:⿃:32511154444
2FC4:⿄:21253444441
2FC5:⿅:21352211535=!=41352211535
2FC6:⿆:12343434354
2FC7:⿇:21312321235=!=41312341234
2FC8:⿈:122112512134
2FC9:⿉:312343424134
2FCA:⿊:254312114444
2FCB:⿋:224314325232=!=224314325234
2FCC:⿌:2511251211511
2FCD:⿍:251115132125
2FCE:⿎:1212514311254
2FCF:⿏:3215115445445
2FD0:⿐:32511125121132
2FD1:⿑:21432533543211=!=41432533543211
2FD2:⿒:212134341343452
2FD3:⿓:1143125111515111=!=4143125111515111
2FD4:⿔:3525112551515134=!=32511255115115341
2FD5:⿕:34125125125125122
===
===
===
行格式:
    字码:字根:笔顺码==部件名=!=笔顺码=同形字符~形近字符#英文名##中文相关义项
===
DONE:对比 笔顺码
    字根=同形字符~形近字符
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/单字_笔顺码_29685个.txt
===
DONE:英文名 是否匹配 中文相关义项
    字根#英文名##中文相关义项
    view  /sdcard/0my_files/tmp/out4py/script.中文字典囗..格式化囗新华字典囗..新华字典.out.txt
===
===
]]]







#]]]'''
__all__ = r'''
data_txt4____Kangxi_Radicals___XXX___CJK_Radicals_Supplement
data_txt4____unicode_ver13_0__U2E80_pdf__115_CJK_Radicals_Supplement
data_txt4____unicode_ver13_0__U2F00_pdf__214_Kangxi_Radicals
data_txt4____Kangxi_Radicals
data_txt4____329_radical2stroke_number_code
result_of_iter_parse4U2E80_pdf_U2F00_pdf
result_of_iter_parse4radical2stroke_number_code


show_data_txts
check_ints
打印字符区囗
打印字符区囗带笔顺码囗
iter_uints_
'''.split()#'''
__all__


# py_adhoc_call   script.hz.打印字符区   ,_iter_parse4U2E80_pdf_U2F00_pdf
result_of_iter_parse4U2E80_pdf_U2F00_pdf = (
[('2E80', '⺀', 'CJK RADICAL REPEAT', [], [], [])
,('2E81', '⺁', 'CJK RADICAL CLIFF', [], ['->5382厂', '->20086𠂆'], [])
,('2E82', '⺂', 'CJK RADICAL SECOND ONE', [], ['->4E5B乛'], [])
,('2E83', '⺃', 'CJK RADICAL SECOND TWO', [], ['->4E5A乚'], [])
,('2E84', '⺄', 'CJK RADICAL SECOND THREE', [], ['->4E59乙'], [])
,('2E85', '⺅', 'CJK RADICAL PERSON', ['**form used on left side'], ['->4EBB亻'], [])
,('2E86', '⺆', 'CJK RADICAL BOX', [], ['->5182冂'], [])
,('2E87', '⺇', 'CJK RADICAL TABLE', [], ['->51E0几', '->20628𠘨'], [])
,('2E88', '⺈', 'CJK RADICAL KNIFE ONE', ['**form used at top'], ['->5200刀', '->2008A𠂊'], [])
,('2E89', '⺉', 'CJK RADICAL KNIFE TWO', ['**form used on right side'], ['->5202刂'], [])
,('2E8A', '⺊', 'CJK RADICAL DIVINATION', ['**form used at top'], ['->535C卜'], [])
,('2E8B', '⺋', 'CJK RADICAL SEAL', ['**form used at bottom'], ['->353E㔾'], [])
,('2E8C', '⺌', 'CJK RADICAL SMALL ONE', ['**form used at top'], ['->5C0F小'], [])
,('2E8D', '⺍', 'CJK RADICAL SMALL TWO', ['**form used at top'], ['->5C0F小', '->2D544邵'], [])
,('2E8E', '⺎', 'CJK RADICAL LAME ONE', [], ['->5C22尢', '->5140兀'], [])
,('2E8F', '⺏', 'CJK RADICAL LAME TWO', [], ['->5C23尣'], [])
,('2E90', '⺐', 'CJK RADICAL LAME THREE', [], ['->5C22尢'], [])
,('2E91', '⺑', 'CJK RADICAL LAME FOUR', [], ['->5C23尣', '->21BC2𡯂'], [])
,('2E92', '⺒', 'CJK RADICAL SNAKE', [], ['->5DF3巳'], [])
,('2E93', '⺓', 'CJK RADICAL THREAD', [], ['->5E7A幺'], [])
,('2E94', '⺔', 'CJK RADICAL SNOUT ONE', [], ['->5F51彑'], [])
,('2E95', '⺕', 'CJK RADICAL SNOUT TWO', [], ['->5F50彐'], [])
,('2E96', '⺖', 'CJK RADICAL HEART ONE', ['**form used on left side'], ['->5FC4忄'], [])
,('2E97', '⺗', 'CJK RADICAL HEART TWO', ['**form used at bottom'], ['->38FA㣺', '->5FC3心'], [])
,('2E98', '⺘', 'CJK RADICAL HAND', ['**form used on left side'], ['->624C扌'], [])
,('2E99', '⺙', 'CJK RADICAL RAP', ['**form used on right side'], ['->6535攵'], [])
,('2E9B', '⺛', 'CJK RADICAL CHOKE', [], ['->65E1旡'], [])
,('2E9C', '⺜', 'CJK RADICAL SUN', ['**actually a form of the radical for hat, despite its resemblance in shape to the radical for sun'], ['->5183冃', '->65E5日'], [])
,('2E9D', '⺝', 'CJK RADICAL MOON', [], ['->6708月'], [])
,('2E9E', '⺞', 'CJK RADICAL DEATH', [], ['->6B7A歺'], [])
,('2E9F', '⺟', 'CJK RADICAL MOTHER', [], [], ['~~6BCD母'])
,('2EA0', '⺠', 'CJK RADICAL CIVILIAN', [], ['->6C11民'], [])
,('2EA1', '⺡', 'CJK RADICAL WATER ONE', ['**form used on left side'], ['->6C35氵'], [])
,('2EA2', '⺢', 'CJK RADICAL WATER TWO', ['**form used (rarely) at bottom'], ['->6C3A氺'], [])
,('2EA3', '⺣', 'CJK RADICAL FIRE', ['**form used at bottom'], ['->706C灬'], [])
,('2EA4', '⺤', 'CJK RADICAL PAW ONE', ['**form used at top'], ['->722B爫'], [])
,('2EA5', '⺥', 'CJK RADICAL PAW TWO', ['**form used at top'], ['->722B爫'], [])
,('2EA6', '⺦', 'CJK RADICAL SIMPLIFIED HALF TREE TRUNK', [], ['->4E2C丬'], [])
,('2EA7', '⺧', 'CJK RADICAL COW', [], ['->725B牛'], [])
,('2EA8', '⺨', 'CJK RADICAL DOG', ['**form used on left side'], ['->72AD犭'], [])
,('2EA9', '⺩', 'CJK RADICAL JADE', ['**form used on left side'], ['->738B王', '->248E9𤣩'], [])
,('2EAA', '⺪', 'CJK RADICAL BOLT OF CLOTH', ['**form used on left side'], ['->758B疋', '->24D14𤴔'], [])
,('2EAB', '⺫', 'CJK RADICAL EYE', ['**form used at top'], ['->2EB2⺲ cjk radical net two', '->76EE目', '->7F52罒'], [])
,('2EAC', '⺬', 'CJK RADICAL SPIRIT ONE', [], ['->793A示'], [])
,('2EAD', '⺭', 'CJK RADICAL SPIRIT TWO', [], ['->793B礻'], [])
,('2EAE', '⺮', 'CJK RADICAL BAMBOO', [], ['->7AF9竹', '->25AD7𥫗'], [])
,('2EAF', '⺯', 'CJK RADICAL SILK', ['**form used on left side'], ['->7CF9糹'], [])
,('2EB0', '⺰', 'CJK RADICAL C-SIMPLIFIED SILK', ['**form used on left side'], ['->7E9F纟'], [])
,('2EB1', '⺱', 'CJK RADICAL NET ONE', [], ['->7F53罓'], [])
,('2EB2', '⺲', 'CJK RADICAL NET TWO', [], ['->2EAB⺫ cjk radical eye', '->7F52罒', '->26270𦉰'], [])
,('2EB3', '⺳', 'CJK RADICAL NET THREE', [], ['->34C1㓁', '->7F51网'], [])
,('2EB4', '⺴', 'CJK RADICAL NET FOUR', [], ['->34C1㓁', '->7F51网'], [])
,('2EB5', '⺵', 'CJK RADICAL MESH', [], ['->2626B𦉫'], [])
,('2EB6', '⺶', 'CJK RADICAL SHEEP', ['**form used on left side'], ['->7F8A羊'], [])
,('2EB7', '⺷', 'CJK RADICAL RAM', ['**form used at top'], ['->7F8A羊', '->2634C𦍌'], [])
,('2EB8', '⺸', 'CJK RADICAL EWE', [], ['->7F8B羋', '->2634B𦍋'], [])
,('2EB9', '⺹', 'CJK RADICAL OLD', [], ['->8002耂'], [])
,('2EBA', '⺺', 'CJK RADICAL BRUSH ONE', [], ['->8080肀'], [])
,('2EBB', '⺻', 'CJK RADICAL BRUSH TWO', [], ['->807F聿'], [])
,('2EBC', '⺼', 'CJK RADICAL MEAT', [], ['->8089肉'], [])
,('2EBD', '⺽', 'CJK RADICAL MORTAR', [], ['->81FC臼', '->26951𦥑'], [])
,('2EBE', '⺾', 'CJK RADICAL GRASS ONE', [], ['->8279艹'], [])
,('2EBF', '⺿', 'CJK RADICAL GRASS TWO', [], ['->8279艹'], [])
,('2EC0', '⻀', 'CJK RADICAL GRASS THREE', [], ['->8279艹'], [])
,('2EC1', '⻁', 'CJK RADICAL TIGER', [], ['->864E虎'], [])
,('2EC2', '⻂', 'CJK RADICAL CLOTHES', ['**form used on left side'], ['->8864衤'], [])
,('2EC3', '⻃', 'CJK RADICAL WEST ONE', ['**form used at top'], ['->8980覀'], [])
,('2EC4', '⻄', 'CJK RADICAL WEST TWO', ['**form used on left side'], ['->897F西'], [])
,('2EC5', '⻅', 'CJK RADICAL C-SIMPLIFIED SEE', [], ['->89C1见'], [])
,('2EC6', '⻆', 'CJK RADICAL SIMPLIFIED HORN', [], ['->89D2角'], [])
,('2EC7', '⻇', 'CJK RADICAL HORN', [], ['->278B2𧢲'], [])
,('2EC8', '⻈', 'CJK RADICAL C-SIMPLIFIED SPEECH', [], ['->8BA0讠'], [])
,('2EC9', '⻉', 'CJK RADICAL C-SIMPLIFIED SHELL', [], ['->8D1D贝'], [])
,('2ECA', '⻊', 'CJK RADICAL FOOT', ['**form used on left side'], ['->8DB3足', '->27FB7𧾷'], [])
,('2ECB', '⻋', 'CJK RADICAL C-SIMPLIFIED CART', [], ['->8F66车'], [])
,('2ECC', '⻌', 'CJK RADICAL SIMPLIFIED WALK', [], ['->8FB6辶'], [])
,('2ECD', '⻍', 'CJK RADICAL WALK ONE', [], ['->8FB6辶'], [])
,('2ECE', '⻎', 'CJK RADICAL WALK TWO', [], ['->8FB6辶'], [])
,('2ECF', '⻏', 'CJK RADICAL CITY', ['**form used on right side'], ['->9091邑'], [])
,('2ED0', '⻐', 'CJK RADICAL C-SIMPLIFIED GOLD', [], ['->9485钅'], [])
,('2ED1', '⻑', 'CJK RADICAL LONG ONE', [], ['->9577長'], [])
,('2ED2', '⻒', 'CJK RADICAL LONG TWO', ['**form used on left side'], ['->9578镸'], [])
,('2ED3', '⻓', 'CJK RADICAL C-SIMPLIFIED LONG', [], ['->957F长'], [])
,('2ED4', '⻔', 'CJK RADICAL C-SIMPLIFIED GATE', [], ['->95E8门'], [])
,('2ED5', '⻕', 'CJK RADICAL MOUND ONE', [], ['->961C阜', '->28E0F𨸏'], [])
,('2ED6', '⻖', 'CJK RADICAL MOUND TWO', ['**form used on left side'], ['->961D阝'], [])
,('2ED7', '⻗', 'CJK RADICAL RAIN', [], ['->96E8雨'], [])
,('2ED8', '⻘', 'CJK RADICAL BLUE', [], ['->9752青'], [])
,('2ED9', '⻙', 'CJK RADICAL C-SIMPLIFIED TANNED LEATHER', [], ['->97E6韦'], [])
,('2EDA', '⻚', 'CJK RADICAL C-SIMPLIFIED LEAF', [], ['->9875页'], [])
,('2EDB', '⻛', 'CJK RADICAL C-SIMPLIFIED WIND', [], ['->98CE风'], [])
,('2EDC', '⻜', 'CJK RADICAL C-SIMPLIFIED FLY', [], ['->98DE飞'], [])
,('2EDD', '⻝', 'CJK RADICAL EAT ONE', ['**form used at bottom'], ['->98DF食'], [])
,('2EDE', '⻞', 'CJK RADICAL EAT TWO', ['**form used on left side'], ['->2967F𩙿'], [])
,('2EDF', '⻟', 'CJK RADICAL EAT THREE', ['**form used on left side'], ['->98E0飠'], [])
,('2EE0', '⻠', 'CJK RADICAL C-SIMPLIFIED EAT', ['**form used on left side'], ['->9963饣'], [])
,('2EE1', '⻡', 'CJK RADICAL HEAD', [], ['->29810𩠐'], [])
,('2EE2', '⻢', 'CJK RADICAL C-SIMPLIFIED HORSE', [], ['->9A6C马'], [])
,('2EE3', '⻣', 'CJK RADICAL BONE', [], ['->9AA8骨'], [])
,('2EE4', '⻤', 'CJK RADICAL GHOST', [], ['->9B3C鬼'], [])
,('2EE5', '⻥', 'CJK RADICAL C-SIMPLIFIED FISH', [], ['->9C7C鱼'], [])
,('2EE6', '⻦', 'CJK RADICAL C-SIMPLIFIED BIRD', [], ['->9E1F鸟'], [])
,('2EE7', '⻧', 'CJK RADICAL C-SIMPLIFIED SALT', [], ['->5364卤'], [])
,('2EE8', '⻨', 'CJK RADICAL SIMPLIFIED WHEAT', [], ['->9EA6麦'], [])
,('2EE9', '⻩', 'CJK RADICAL SIMPLIFIED YELLOW', [], ['->9EC4黄'], [])
,('2EEA', '⻪', 'CJK RADICAL C-SIMPLIFIED FROG', [], ['->9EFE黾'], [])
,('2EEB', '⻫', 'CJK RADICAL J-SIMPLIFIED EVEN', [], ['->6589斉'], [])
,('2EEC', '⻬', 'CJK RADICAL C-SIMPLIFIED EVEN', [], ['->9F50齐'], [])
,('2EED', '⻭', 'CJK RADICAL J-SIMPLIFIED TOOTH', [], ['->6B6F歯'], [])
,('2EEE', '⻮', 'CJK RADICAL C-SIMPLIFIED TOOTH', [], ['->9F7F齿'], [])
,('2EEF', '⻯', 'CJK RADICAL J-SIMPLIFIED DRAGON', [], ['->7ADC竜', '->9F8D龍'], [])
,('2EF0', '⻰', 'CJK RADICAL C-SIMPLIFIED DRAGON', [], ['->9F99龙'], [])
,('2EF1', '⻱', 'CJK RADICAL TURTLE', [], ['->9F9C龜'], [])
,('2EF2', '⻲', 'CJK RADICAL J-SIMPLIFIED TURTLE', [], ['->4E80亀'], [])
,('2EF3', '⻳', 'CJK RADICAL C-SIMPLIFIED TURTLE', [], [], ['~~9F9F龟'])
,('2F00', '⼀', 'KANGXI RADICAL ONE', [], [], ['~~4E00一'])
,('2F01', '⼁', 'KANGXI RADICAL LINE', [], [], ['~~4E28丨'])
,('2F02', '⼂', 'KANGXI RADICAL DOT', [], [], ['~~4E36丶'])
,('2F03', '⼃', 'KANGXI RADICAL SLASH', [], [], ['~~4E3F丿'])
,('2F04', '⼄', 'KANGXI RADICAL SECOND', [], [], ['~~4E59乙'])
,('2F05', '⼅', 'KANGXI RADICAL HOOK', [], [], ['~~4E85亅'])
,('2F06', '⼆', 'KANGXI RADICAL TWO', [], [], ['~~4E8C二'])
,('2F07', '⼇', 'KANGXI RADICAL LID', [], [], ['~~4EA0亠'])
,('2F08', '⼈', 'KANGXI RADICAL MAN', [], [], ['~~4EBA人'])
,('2F09', '⼉', 'KANGXI RADICAL LEGS', [], [], ['~~513F儿'])
,('2F0A', '⼊', 'KANGXI RADICAL ENTER', [], [], ['~~5165入'])
,('2F0B', '⼋', 'KANGXI RADICAL EIGHT', [], [], ['~~516B八'])
,('2F0C', '⼌', 'KANGXI RADICAL DOWN BOX', [], [], ['~~5182冂'])
,('2F0D', '⼍', 'KANGXI RADICAL COVER', [], [], ['~~5196冖'])
,('2F0E', '⼎', 'KANGXI RADICAL ICE', [], [], ['~~51AB冫'])
,('2F0F', '⼏', 'KANGXI RADICAL TABLE', [], [], ['~~51E0几'])
,('2F10', '⼐', 'KANGXI RADICAL OPEN BOX', [], [], ['~~51F5凵'])
,('2F11', '⼑', 'KANGXI RADICAL KNIFE', [], [], ['~~5200刀'])
,('2F12', '⼒', 'KANGXI RADICAL POWER', [], [], ['~~529B力'])
,('2F13', '⼓', 'KANGXI RADICAL WRAP', [], [], ['~~52F9勹'])
,('2F14', '⼔', 'KANGXI RADICAL SPOON', [], [], ['~~5315匕'])
,('2F15', '⼕', 'KANGXI RADICAL RIGHT OPEN BOX', [], [], ['~~531A匚'])
,('2F16', '⼖', 'KANGXI RADICAL HIDING ENCLOSURE', [], [], ['~~5338匸'])
,('2F17', '⼗', 'KANGXI RADICAL TEN', [], [], ['~~5341十'])
,('2F18', '⼘', 'KANGXI RADICAL DIVINATION', [], [], ['~~535C卜'])
,('2F19', '⼙', 'KANGXI RADICAL SEAL', [], [], ['~~5369卩'])
,('2F1A', '⼚', 'KANGXI RADICAL CLIFF', [], [], ['~~5382厂'])
,('2F1B', '⼛', 'KANGXI RADICAL PRIVATE', [], [], ['~~53B6厶'])
,('2F1C', '⼜', 'KANGXI RADICAL AGAIN', [], [], ['~~53C8又'])
,('2F1D', '⼝', 'KANGXI RADICAL MOUTH', [], [], ['~~53E3口'])
,('2F1E', '⼞', 'KANGXI RADICAL ENCLOSURE', [], [], ['~~56D7囗'])
,('2F1F', '⼟', 'KANGXI RADICAL EARTH', [], [], ['~~571F土'])
,('2F20', '⼠', 'KANGXI RADICAL SCHOLAR', [], [], ['~~58EB士'])
,('2F21', '⼡', 'KANGXI RADICAL GO', [], [], ['~~5902夂'])
,('2F22', '⼢', 'KANGXI RADICAL GO SLOWLY', [], [], ['~~590A夊'])
,('2F23', '⼣', 'KANGXI RADICAL EVENING', [], [], ['~~5915夕'])
,('2F24', '⼤', 'KANGXI RADICAL BIG', [], [], ['~~5927大'])
,('2F25', '⼥', 'KANGXI RADICAL WOMAN', [], [], ['~~5973女'])
,('2F26', '⼦', 'KANGXI RADICAL CHILD', [], [], ['~~5B50子'])
,('2F27', '⼧', 'KANGXI RADICAL ROOF', [], [], ['~~5B80宀'])
,('2F28', '⼨', 'KANGXI RADICAL INCH', [], [], ['~~5BF8寸'])
,('2F29', '⼩', 'KANGXI RADICAL SMALL', [], [], ['~~5C0F小'])
,('2F2A', '⼪', 'KANGXI RADICAL LAME', [], ['->21BC1𡯁'], ['~~5C22尢'])
,('2F2B', '⼫', 'KANGXI RADICAL CORPSE', [], [], ['~~5C38尸'])
,('2F2C', '⼬', 'KANGXI RADICAL SPROUT', [], [], ['~~5C6E屮'])
,('2F2D', '⼭', 'KANGXI RADICAL MOUNTAIN', [], [], ['~~5C71山'])
,('2F2E', '⼮', 'KANGXI RADICAL RIVER', [], [], ['~~5DDB巛'])
,('2F2F', '⼯', 'KANGXI RADICAL WORK', [], [], ['~~5DE5工'])
,('2F30', '⼰', 'KANGXI RADICAL ONESELF', [], [], ['~~5DF1己'])
,('2F31', '⼱', 'KANGXI RADICAL TURBAN', [], [], ['~~5DFE巾'])
,('2F32', '⼲', 'KANGXI RADICAL DRY', [], [], ['~~5E72干'])
,('2F33', '⼳', 'KANGXI RADICAL SHORT THREAD', [], [], ['~~5E7A幺'])
,('2F34', '⼴', 'KANGXI RADICAL DOTTED CLIFF', [], [], ['~~5E7F广'])
,('2F35', '⼵', 'KANGXI RADICAL LONG STRIDE', [], [], ['~~5EF4廴'])
,('2F36', '⼶', 'KANGXI RADICAL TWO HANDS', [], [], ['~~5EFE廾'])
,('2F37', '⼷', 'KANGXI RADICAL SHOOT', [], [], ['~~5F0B弋'])
,('2F38', '⼸', 'KANGXI RADICAL BOW', [], [], ['~~5F13弓'])
,('2F39', '⼹', 'KANGXI RADICAL SNOUT', [], [], ['~~5F50彐'])
,('2F3A', '⼺', 'KANGXI RADICAL BRISTLE', [], [], ['~~5F61彡'])
,('2F3B', '⼻', 'KANGXI RADICAL STEP', [], [], ['~~5F73彳'])
,('2F3C', '⼼', 'KANGXI RADICAL HEART', [], [], ['~~5FC3心'])
,('2F3D', '⼽', 'KANGXI RADICAL HALBERD', [], [], ['~~6208戈'])
,('2F3E', '⼾', 'KANGXI RADICAL DOOR', [], [], ['~~6236戶'])
,('2F3F', '⼿', 'KANGXI RADICAL HAND', [], [], ['~~624B手'])
,('2F40', '⽀', 'KANGXI RADICAL BRANCH', [], [], ['~~652F支'])
,('2F41', '⽁', 'KANGXI RADICAL RAP', [], [], ['~~6534攴'])
,('2F42', '⽂', 'KANGXI RADICAL SCRIPT', [], [], ['~~6587文'])
,('2F43', '⽃', 'KANGXI RADICAL DIPPER', [], [], ['~~6597斗'])
,('2F44', '⽄', 'KANGXI RADICAL AXE', [], [], ['~~65A4斤'])
,('2F45', '⽅', 'KANGXI RADICAL SQUARE', [], [], ['~~65B9方'])
,('2F46', '⽆', 'KANGXI RADICAL NOT', [], [], ['~~65E0无'])
,('2F47', '⽇', 'KANGXI RADICAL SUN', [], [], ['~~65E5日'])
,('2F48', '⽈', 'KANGXI RADICAL SAY', [], [], ['~~66F0曰'])
,('2F49', '⽉', 'KANGXI RADICAL MOON', [], [], ['~~6708月'])
,('2F4A', '⽊', 'KANGXI RADICAL TREE', [], [], ['~~6728木'])
,('2F4B', '⽋', 'KANGXI RADICAL LACK', [], [], ['~~6B20欠'])
,('2F4C', '⽌', 'KANGXI RADICAL STOP', [], [], ['~~6B62止'])
,('2F4D', '⽍', 'KANGXI RADICAL DEATH', [], [], ['~~6B79歹'])
,('2F4E', '⽎', 'KANGXI RADICAL WEAPON', [], [], ['~~6BB3殳'])
,('2F4F', '⽏', 'KANGXI RADICAL DO NOT', [], [], ['~~6BCB毋'])
,('2F50', '⽐', 'KANGXI RADICAL COMPARE', [], [], ['~~6BD4比'])
,('2F51', '⽑', 'KANGXI RADICAL FUR', [], [], ['~~6BDB毛'])
,('2F52', '⽒', 'KANGXI RADICAL CLAN', [], [], ['~~6C0F氏'])
,('2F53', '⽓', 'KANGXI RADICAL STEAM', [], [], ['~~6C14气'])
,('2F54', '⽔', 'KANGXI RADICAL WATER', [], [], ['~~6C34水'])
,('2F55', '⽕', 'KANGXI RADICAL FIRE', [], [], ['~~706B火'])
,('2F56', '⽖', 'KANGXI RADICAL CLAW', [], [], ['~~722A爪'])
,('2F57', '⽗', 'KANGXI RADICAL FATHER', [], [], ['~~7236父'])
,('2F58', '⽘', 'KANGXI RADICAL DOUBLE X', [], [], ['~~723B爻'])
,('2F59', '⽙', 'KANGXI RADICAL HALF TREE TRUNK', [], [], ['~~723F爿'])
,('2F5A', '⽚', 'KANGXI RADICAL SLICE', [], [], ['~~7247片'])
,('2F5B', '⽛', 'KANGXI RADICAL FANG', [], [], ['~~7259牙'])
,('2F5C', '⽜', 'KANGXI RADICAL COW', [], [], ['~~725B牛'])
,('2F5D', '⽝', 'KANGXI RADICAL DOG', [], [], ['~~72AC犬'])
,('2F5E', '⽞', 'KANGXI RADICAL PROFOUND', [], [], ['~~7384玄'])
,('2F5F', '⽟', 'KANGXI RADICAL JADE', [], [], ['~~7389玉'])
,('2F60', '⽠', 'KANGXI RADICAL MELON', [], [], ['~~74DC瓜'])
,('2F61', '⽡', 'KANGXI RADICAL TILE', [], [], ['~~74E6瓦'])
,('2F62', '⽢', 'KANGXI RADICAL SWEET', [], [], ['~~7518甘'])
,('2F63', '⽣', 'KANGXI RADICAL LIFE', [], [], ['~~751F生'])
,('2F64', '⽤', 'KANGXI RADICAL USE', [], [], ['~~7528用'])
,('2F65', '⽥', 'KANGXI RADICAL FIELD', [], [], ['~~7530田'])
,('2F66', '⽦', 'KANGXI RADICAL BOLT OF CLOTH', [], [], ['~~758B疋'])
,('2F67', '⽧', 'KANGXI RADICAL SICKNESS', [], [], ['~~7592疒'])
,('2F68', '⽨', 'KANGXI RADICAL DOTTED TENT', [], [], ['~~7676癶'])
,('2F69', '⽩', 'KANGXI RADICAL WHITE', [], [], ['~~767D白'])
,('2F6A', '⽪', 'KANGXI RADICAL SKIN', [], [], ['~~76AE皮'])
,('2F6B', '⽫', 'KANGXI RADICAL DISH', [], [], ['~~76BF皿'])
,('2F6C', '⽬', 'KANGXI RADICAL EYE', [], [], ['~~76EE目'])
,('2F6D', '⽭', 'KANGXI RADICAL SPEAR', [], [], ['~~77DB矛'])
,('2F6E', '⽮', 'KANGXI RADICAL ARROW', [], [], ['~~77E2矢'])
,('2F6F', '⽯', 'KANGXI RADICAL STONE', [], [], ['~~77F3石'])
,('2F70', '⽰', 'KANGXI RADICAL SPIRIT', [], [], ['~~793A示'])
,('2F71', '⽱', 'KANGXI RADICAL TRACK', [], [], ['~~79B8禸'])
,('2F72', '⽲', 'KANGXI RADICAL GRAIN', [], [], ['~~79BE禾'])
,('2F73', '⽳', 'KANGXI RADICAL CAVE', [], [], ['~~7A74穴'])
,('2F74', '⽴', 'KANGXI RADICAL STAND', [], [], ['~~7ACB立'])
,('2F75', '⽵', 'KANGXI RADICAL BAMBOO', [], [], ['~~7AF9竹'])
,('2F76', '⽶', 'KANGXI RADICAL RICE', [], [], ['~~7C73米'])
,('2F77', '⽷', 'KANGXI RADICAL SILK', [], [], ['~~7CF8糸'])
,('2F78', '⽸', 'KANGXI RADICAL JAR', [], [], ['~~7F36缶'])
,('2F79', '⽹', 'KANGXI RADICAL NET', [], [], ['~~7F51网'])
,('2F7A', '⽺', 'KANGXI RADICAL SHEEP', [], [], ['~~7F8A羊'])
,('2F7B', '⽻', 'KANGXI RADICAL FEATHER', [], [], ['~~7FBD羽'])
,('2F7C', '⽼', 'KANGXI RADICAL OLD', [], [], ['~~8001老'])
,('2F7D', '⽽', 'KANGXI RADICAL AND', [], [], ['~~800C而'])
,('2F7E', '⽾', 'KANGXI RADICAL PLOW', [], [], ['~~8012耒'])
,('2F7F', '⽿', 'KANGXI RADICAL EAR', [], [], ['~~8033耳'])
,('2F80', '⾀', 'KANGXI RADICAL BRUSH', [], [], ['~~807F聿'])
,('2F81', '⾁', 'KANGXI RADICAL MEAT', [], [], ['~~8089肉'])
,('2F82', '⾂', 'KANGXI RADICAL MINISTER', [], [], ['~~81E3臣'])
,('2F83', '⾃', 'KANGXI RADICAL SELF', [], [], ['~~81EA自'])
,('2F84', '⾄', 'KANGXI RADICAL ARRIVE', [], [], ['~~81F3至'])
,('2F85', '⾅', 'KANGXI RADICAL MORTAR', [], [], ['~~81FC臼'])
,('2F86', '⾆', 'KANGXI RADICAL TONGUE', [], [], ['~~820C舌'])
,('2F87', '⾇', 'KANGXI RADICAL OPPOSE', [], [], ['~~821B舛'])
,('2F88', '⾈', 'KANGXI RADICAL BOAT', [], [], ['~~821F舟'])
,('2F89', '⾉', 'KANGXI RADICAL STOPPING', [], [], ['~~826E艮'])
,('2F8A', '⾊', 'KANGXI RADICAL COLOR', [], [], ['~~8272色'])
,('2F8B', '⾋', 'KANGXI RADICAL GRASS', [], [], ['~~8278艸'])
,('2F8C', '⾌', 'KANGXI RADICAL TIGER', [], [], ['~~864D虍'])
,('2F8D', '⾍', 'KANGXI RADICAL INSECT', [], [], ['~~866B虫'])
,('2F8E', '⾎', 'KANGXI RADICAL BLOOD', [], [], ['~~8840血'])
,('2F8F', '⾏', 'KANGXI RADICAL WALK ENCLOSURE', [], [], ['~~884C行'])
,('2F90', '⾐', 'KANGXI RADICAL CLOTHES', [], [], ['~~8863衣'])
,('2F91', '⾑', 'KANGXI RADICAL WEST', [], [], ['~~897E襾'])
,('2F92', '⾒', 'KANGXI RADICAL SEE', [], [], ['~~898B見'])
,('2F93', '⾓', 'KANGXI RADICAL HORN', [], [], ['~~89D2角'])
,('2F94', '⾔', 'KANGXI RADICAL SPEECH', [], [], ['~~8A00言'])
,('2F95', '⾕', 'KANGXI RADICAL VALLEY', [], [], ['~~8C37谷'])
,('2F96', '⾖', 'KANGXI RADICAL BEAN', [], [], ['~~8C46豆'])
,('2F97', '⾗', 'KANGXI RADICAL PIG', [], [], ['~~8C55豕'])
,('2F98', '⾘', 'KANGXI RADICAL BADGER', [], [], ['~~8C78豸'])
,('2F99', '⾙', 'KANGXI RADICAL SHELL', [], [], ['~~8C9D貝'])
,('2F9A', '⾚', 'KANGXI RADICAL RED', [], [], ['~~8D64赤'])
,('2F9B', '⾛', 'KANGXI RADICAL RUN', [], [], ['~~8D70走'])
,('2F9C', '⾜', 'KANGXI RADICAL FOOT', [], [], ['~~8DB3足'])
,('2F9D', '⾝', 'KANGXI RADICAL BODY', [], [], ['~~8EAB身'])
,('2F9E', '⾞', 'KANGXI RADICAL CART', [], [], ['~~8ECA車'])
,('2F9F', '⾟', 'KANGXI RADICAL BITTER', [], [], ['~~8F9B辛'])
,('2FA0', '⾠', 'KANGXI RADICAL MORNING', [], [], ['~~8FB0辰'])
,('2FA1', '⾡', 'KANGXI RADICAL WALK', [], [], ['~~8FB5辵'])
,('2FA2', '⾢', 'KANGXI RADICAL CITY', [], [], ['~~9091邑'])
,('2FA3', '⾣', 'KANGXI RADICAL WINE', [], [], ['~~9149酉'])
,('2FA4', '⾤', 'KANGXI RADICAL DISTINGUISH', [], [], ['~~91C6釆'])
,('2FA5', '⾥', 'KANGXI RADICAL VILLAGE', [], [], ['~~91CC里'])
,('2FA6', '⾦', 'KANGXI RADICAL GOLD', [], [], ['~~91D1金'])
,('2FA7', '⾧', 'KANGXI RADICAL LONG', [], [], ['~~9577長'])
,('2FA8', '⾨', 'KANGXI RADICAL GATE', [], [], ['~~9580門'])
,('2FA9', '⾩', 'KANGXI RADICAL MOUND', [], [], ['~~961C阜'])
,('2FAA', '⾪', 'KANGXI RADICAL SLAVE', [], [], ['~~96B6隶'])
,('2FAB', '⾫', 'KANGXI RADICAL SHORT TAILED BIRD', [], [], ['~~96B9隹'])
,('2FAC', '⾬', 'KANGXI RADICAL RAIN', [], [], ['~~96E8雨'])
,('2FAD', '⾭', 'KANGXI RADICAL BLUE', [], [], ['~~9751靑'])
,('2FAE', '⾮', 'KANGXI RADICAL WRONG', [], [], ['~~975E非'])
,('2FAF', '⾯', 'KANGXI RADICAL FACE', [], [], ['~~9762面'])
,('2FB0', '⾰', 'KANGXI RADICAL LEATHER', [], [], ['~~9769革'])
,('2FB1', '⾱', 'KANGXI RADICAL TANNED LEATHER', [], [], ['~~97CB韋'])
,('2FB2', '⾲', 'KANGXI RADICAL LEEK', [], [], ['~~97ED韭'])
,('2FB3', '⾳', 'KANGXI RADICAL SOUND', [], [], ['~~97F3音'])
,('2FB4', '⾴', 'KANGXI RADICAL LEAF', [], [], ['~~9801頁'])
,('2FB5', '⾵', 'KANGXI RADICAL WIND', [], [], ['~~98A8風'])
,('2FB6', '⾶', 'KANGXI RADICAL FLY', [], [], ['~~98DB飛'])
,('2FB7', '⾷', 'KANGXI RADICAL EAT', [], [], ['~~98DF食'])
,('2FB8', '⾸', 'KANGXI RADICAL HEAD', [], [], ['~~9996首'])
,('2FB9', '⾹', 'KANGXI RADICAL FRAGRANT', [], [], ['~~9999香'])
,('2FBA', '⾺', 'KANGXI RADICAL HORSE', [], [], ['~~99AC馬'])
,('2FBB', '⾻', 'KANGXI RADICAL BONE', [], [], ['~~9AA8骨'])
,('2FBC', '⾼', 'KANGXI RADICAL TALL', [], [], ['~~9AD8高'])
,('2FBD', '⾽', 'KANGXI RADICAL HAIR', [], [], ['~~9ADF髟'])
,('2FBE', '⾾', 'KANGXI RADICAL FIGHT', [], [], ['~~9B25鬥'])
,('2FBF', '⾿', 'KANGXI RADICAL SACRIFICIAL WINE', [], [], ['~~9B2F鬯'])
,('2FC0', '⿀', 'KANGXI RADICAL CAULDRON', [], [], ['~~9B32鬲'])
,('2FC1', '⿁', 'KANGXI RADICAL GHOST', [], [], ['~~9B3C鬼'])
,('2FC2', '⿂', 'KANGXI RADICAL FISH', [], [], ['~~9B5A魚'])
,('2FC3', '⿃', 'KANGXI RADICAL BIRD', [], [], ['~~9CE5鳥'])
,('2FC4', '⿄', 'KANGXI RADICAL SALT', [], [], ['~~9E75鹵'])
,('2FC5', '⿅', 'KANGXI RADICAL DEER', [], [], ['~~9E7F鹿'])
,('2FC6', '⿆', 'KANGXI RADICAL WHEAT', [], [], ['~~9EA5麥'])
,('2FC7', '⿇', 'KANGXI RADICAL HEMP', [], [], ['~~9EBB麻'])
,('2FC8', '⿈', 'KANGXI RADICAL YELLOW', [], [], ['~~9EC3黃'])
,('2FC9', '⿉', 'KANGXI RADICAL MILLET', [], [], ['~~9ECD黍'])
,('2FCA', '⿊', 'KANGXI RADICAL BLACK', [], [], ['~~9ED1黑'])
,('2FCB', '⿋', 'KANGXI RADICAL EMBROIDERY', [], [], ['~~9EF9黹'])
,('2FCC', '⿌', 'KANGXI RADICAL FROG', [], [], ['~~9EFD黽'])
,('2FCD', '⿍', 'KANGXI RADICAL TRIPOD', [], [], ['~~9F0E鼎'])
,('2FCE', '⿎', 'KANGXI RADICAL DRUM', [], [], ['~~9F13鼓'])
,('2FCF', '⿏', 'KANGXI RADICAL RAT', [], [], ['~~9F20鼠'])
,('2FD0', '⿐', 'KANGXI RADICAL NOSE', [], [], ['~~9F3B鼻'])
,('2FD1', '⿑', 'KANGXI RADICAL EVEN', [], [], ['~~9F4A齊'])
,('2FD2', '⿒', 'KANGXI RADICAL TOOTH', [], [], ['~~9F52齒'])
,('2FD3', '⿓', 'KANGXI RADICAL DRAGON', [], [], ['~~9F8D龍'])
,('2FD4', '⿔', 'KANGXI RADICAL TURTLE', [], [], ['~~9F9C龜'])
,('2FD5', '⿕', 'KANGXI RADICAL FLUTE', [], [], ['~~9FA0龠'])
])
# py_adhoc_call   script.hz.打印字符区   ,_iter_parse4U2E80_pdf_U2F00_pdf
#end-result_of_iter_parse4U2E80_pdf_U2F00_pdf


#py_adhoc_call   script.hz.打印字符区   ,_iter_parse4radical2stroke_number_code
result_of_iter_parse4radical2stroke_number_code = (
[('2E80', '⺀', '44', '')
,('2E81', '⺁', '33', '')
,('2E82', '⺂', '5', '')
,('2E83', '⺃', '5', '')
,('2E84', '⺄', '5', '')
,('2E85', '⺅', '32', '')
,('2E86', '⺆', '35', '')
,('2E87', '⺇', '35', '')
,('2E88', '⺈', '35', '')
,('2E89', '⺉', '22', '')
,('2E8A', '⺊', '21', '')
,('2E8B', '⺋', '55', '')
,('2E8C', '⺌', '243', '')
,('2E8D', '⺍', '443', '')
,('2E8E', '⺎', '135', '')
,('2E8F', '⺏', '3435', '')
,('2E90', '⺐', '135', '')
,('2E91', '⺑', '3435', '')
,('2E92', '⺒', '515', '')
,('2E93', '⺓', '554', '')
,('2E94', '⺔', '551', '')
,('2E95', '⺕', '511', '')
,('2E96', '⺖', '442', '')
,('2E97', '⺗', '2444', '')
,('2E98', '⺘', '121', '')
,('2E99', '⺙', '3134', '')
,('2E9B', '⺛', '1535', '')
,('2E9C', '⺜', '2511', '')
,('2E9D', '⺝', '2511', '')
,('2E9E', '⺞', '21354', '')
,('2E9F', '⺟', '55414', '')
,('2EA0', '⺠', '51515', '')
,('2EA1', '⺡', '441', '')
,('2EA2', '⺢', '24134', '')
,('2EA3', '⺣', '4444', '')
,('2EA4', '⺤', '3443', '')
,('2EA5', '⺥', '3324', '')
,('2EA6', '⺦', '412', '')
,('2EA7', '⺧', '3121', '')
,('2EA8', '⺨', '353', '')
,('2EA9', '⺩', '1121', '')
,('2EAA', '⺪', '52121', '')
,('2EAB', '⺫', '25221', '')
,('2EAC', '⺬', '11234', '')
,('2EAD', '⺭', '4524', '')
,('2EAE', '⺮', '314314', '')
,('2EAF', '⺯', '554444', '')
,('2EB0', '⺰', '551', '')
,('2EB1', '⺱', '2634', '')
,('2EB2', '⺲', '25431', '')
,('2EB3', '⺳', '4535', '')
,('2EB4', '⺴', '4535', '')
,('2EB5', '⺵', '2522', '')
,('2EB6', '⺶', '431113', '')
,('2EB7', '⺷', '431121', '')
,('2EB8', '⺸', '2121112', '')
,('2EB9', '⺹', '1213', '')
,('2EBA', '⺺', '5112', '')
,('2EBB', '⺻', '51121', '')
,('2EBC', '⺼', '3541', '')
,('2EBD', '⺽', '3211511', '')
,('2EBE', '⺾', '122', '')
,('2EBF', '⺿', '1212', '')
,('2EC0', '⻀', '2121', '')
,('2EC1', '⻁', '21531535', '')
,('2EC2', '⻂', '45234', '')
,('2EC3', '⻃', '125221', '')
,('2EC4', '⻄', '125351', '')
,('2EC5', '⻅', '2535', '')
,('2EC6', '⻆', '3535112', '')
,('2EC7', '⻇', '35353434', '')
,('2EC8', '⻈', '45', '')
,('2EC9', '⻉', '2534', '')
,('2ECA', '⻊', '2512121', '')
,('2ECB', '⻋', '1512', '')
,('2ECC', '⻌', '454', '')
,('2ECD', '⻍', '4454', '')
,('2ECE', '⻎', '454', '')
,('2ECF', '⻏', '52', '')
,('2ED0', '⻐', '31115', '')
,('2ED1', '⻑', '12111534', '')
,('2ED2', '⻒', '1211154', '')
,('2ED3', '⻓', '3154', '')
,('2ED4', '⻔', '425', '')
,('2ED5', '⻕', '32515151', '')
,('2ED6', '⻖', '52', '')
,('2ED7', '⻗', '14524444', '')
,('2ED8', '⻘', '11212511', '')
,('2ED9', '⻙', '1152', '')
,('2EDA', '⻚', '132534', '')
,('2EDB', '⻛', '3534', '')
,('2EDC', '⻜', '534', '')
,('2EDD', '⻝', '344511534', '')
,('2EDE', '⻞', '344511211', '')
,('2EDF', '⻟', '34451154', '')
,('2EE0', '⻠', '355', '')
,('2EE1', '⻡', '5551325111', '')
,('2EE2', '⻢', '551', '')
,('2EE3', '⻣', '255452511', '')
,('2EE4', '⻤', '325113554', '')
,('2EE5', '⻥', '35251211', '')
,('2EE6', '⻦', '35451', '')
,('2EE7', '⻧', '2125341', '')
,('2EE8', '⻨', '1121354', '')
,('2EE9', '⻩', '12212512134', '')
,('2EEA', '⻪', '25125115', '')
,('2EEB', '⻫', '41343211', '')
,('2EEC', '⻬', '413432', '')
,('2EED', '⻭', '212143123452', '')
,('2EEE', '⻮', '21213452', '')
,('2EEF', '⻯', '4143125115', '')
,('2EF0', '⻰', '13534', '')
,('2EF1', '⻱', '32511255115115341', '')
,('2EF2', '⻲', '35251125115', '')
,('2EF3', '⻳', '3525115', '')
,('2F00', '⼀', '1', '')
,('2F01', '⼁', '2', '')
,('2F02', '⼂', '4', '')
,('2F03', '⼃', '3', '')
,('2F04', '⼄', '5', '')
,('2F05', '⼅', '2', '')
,('2F06', '⼆', '11', '')
,('2F07', '⼇', '21', '41')
,('2F08', '⼈', '34', '')
,('2F09', '⼉', '35', '')
,('2F0A', '⼊', '34', '')
,('2F0B', '⼋', '34', '')
,('2F0C', '⼌', '25', '')
,('2F0D', '⼍', '45', '')
,('2F0E', '⼎', '41', '')
,('2F0F', '⼏', '35', '')
,('2F10', '⼐', '52', '')
,('2F11', '⼑', '53', '')
,('2F12', '⼒', '53', '')
,('2F13', '⼓', '35', '')
,('2F14', '⼔', '35', '')
,('2F15', '⼕', '15', '')
,('2F16', '⼖', '15', '')
,('2F17', '⼗', '12', '')
,('2F18', '⼘', '24', '')
,('2F19', '⼙', '52', '')
,('2F1A', '⼚', '13', '')
,('2F1B', '⼛', '54', '')
,('2F1C', '⼜', '54', '')
,('2F1D', '⼝', '251', '')
,('2F1E', '⼞', '251', '')
,('2F1F', '⼟', '121', '')
,('2F20', '⼠', '121', '')
,('2F21', '⼡', '354', '')
,('2F22', '⼢', '354', '')
,('2F23', '⼣', '354', '')
,('2F24', '⼤', '134', '')
,('2F25', '⼥', '531', '')
,('2F26', '⼦', '521', '')
,('2F27', '⼧', '245', '445')
,('2F28', '⼨', '124', '')
,('2F29', '⼩', '234', '')
,('2F2A', '⼪', '135', '')
,('2F2B', '⼫', '513', '')
,('2F2C', '⼬', '522', '')
,('2F2D', '⼭', '252', '')
,('2F2E', '⼮', '555', '')
,('2F2F', '⼯', '121', '')
,('2F30', '⼰', '515', '')
,('2F31', '⼱', '252', '')
,('2F32', '⼲', '112', '')
,('2F33', '⼳', '554', '')
,('2F34', '⼴', '213', '413')
,('2F35', '⼵', '54', '')
,('2F36', '⼶', '132', '')
,('2F37', '⼷', '154', '')
,('2F38', '⼸', '515', '')
,('2F39', '⼹', '511', '')
,('2F3A', '⼺', '333', '')
,('2F3B', '⼻', '332', '')
,('2F3C', '⼼', '4544', '')
,('2F3D', '⼽', '1534', '')
,('2F3E', '⼾', '3351', '4513')
,('2F3F', '⼿', '3112', '')
,('2F40', '⽀', '1254', '')
,('2F41', '⽁', '2154', '')
,('2F42', '⽂', '2134', '4134')
,('2F43', '⽃', '4412', '')
,('2F44', '⽄', '3312', '')
,('2F45', '⽅', '2153', '4153')
,('2F46', '⽆', '1135', '')
,('2F47', '⽇', '2511', '')
,('2F48', '⽈', '2511', '')
,('2F49', '⽉', '3511', '')
,('2F4A', '⽊', '1234', '')
,('2F4B', '⽋', '3534', '')
,('2F4C', '⽌', '2121', '')
,('2F4D', '⽍', '1354', '')
,('2F4E', '⽎', '3554', '')
,('2F4F', '⽏', '5521', '5531')
,('2F50', '⽐', '1535', '')
,('2F51', '⽑', '3115', '')
,('2F52', '⽒', '3515', '')
,('2F53', '⽓', '3115', '')
,('2F54', '⽔', '2534', '')
,('2F55', '⽕', '4334', '')
,('2F56', '⽖', '3324', '')
,('2F57', '⽗', '3434', '')
,('2F58', '⽘', '3434', '')
,('2F59', '⽙', '5213', '')
,('2F5A', '⽚', '3215', '')
,('2F5B', '⽛', '1523', '')
,('2F5C', '⽜', '3112', '')
,('2F5D', '⽝', '1344', '')
,('2F5E', '⽞', '21554', '41554')
,('2F5F', '⽟', '11214', '')
,('2F60', '⽠', '33544', '')
,('2F61', '⽡', '1554', '')
,('2F62', '⽢', '12211', '')
,('2F63', '⽣', '31121', '')
,('2F64', '⽤', '35112', '')
,('2F65', '⽥', '25121', '')
,('2F66', '⽦', '52134', '')
,('2F67', '⽧', '21341', '41341')
,('2F68', '⽨', '54334', '')
,('2F69', '⽩', '32511', '')
,('2F6A', '⽪', '53254', '')
,('2F6B', '⽫', '25221', '')
,('2F6C', '⽬', '25111', '')
,('2F6D', '⽭', '54523', '')
,('2F6E', '⽮', '31134', '')
,('2F6F', '⽯', '13251', '')
,('2F70', '⽰', '11234', '')
,('2F71', '⽱', '2554', '')
,('2F72', '⽲', '31234', '')
,('2F73', '⽳', '24534', '44534')
,('2F74', '⽴', '21431', '41431')
,('2F75', '⽵', '312312', '')
,('2F76', '⽶', '431234', '')
,('2F77', '⽷', '554234', '')
,('2F78', '⽸', '311252', '')
,('2F79', '⽹', '253434', '')
,('2F7A', '⽺', '431112', '')
,('2F7B', '⽻', '533533', '541541')
,('2F7C', '⽼', '121335', '')
,('2F7D', '⽽', '132522', '')
,('2F7E', '⽾', '311234', '111234')
,('2F7F', '⽿', '122111', '')
,('2F80', '⾀', '511112', '')
,('2F81', '⾁', '253434', '')
,('2F82', '⾂', '125125', '')
,('2F83', '⾃', '325111', '')
,('2F84', '⾄', '154121', '')
,('2F85', '⾅', '321511', '')
,('2F86', '⾆', '112251', '312251')
,('2F87', '⾇', '354152', '')
,('2F88', '⾈', '335412', '335414')
,('2F89', '⾉', '511534', '')
,('2F8A', '⾊', '355215', '')
,('2F8B', '⾋', '523522', '')
,('2F8C', '⾌', '215315', '')
,('2F8D', '⾍', '251214', '')
,('2F8E', '⾎', '325221', '')
,('2F8F', '⾏', '332112', '')
,('2F90', '⾐', '213534', '413534')
,('2F91', '⾑', '125221', '')
,('2F92', '⾒', '2511135', '')
,('2F93', '⾓', '3535121', '3535112')
,('2F94', '⾔', '1111251', '4111251')
,('2F95', '⾕', '3434251', '')
,('2F96', '⾖', '1251431', '')
,('2F97', '⾗', '1353334', '')
,('2F98', '⾘', '3443533', '')
,('2F99', '⾙', '2511134', '')
,('2F9A', '⾚', '1213234', '')
,('2F9B', '⾛', '1212134', '')
,('2F9C', '⾜', '2512134', '')
,('2F9D', '⾝', '3251113', '')
,('2F9E', '⾞', '1251112', '')
,('2F9F', '⾟', '2143112', '4143112')
,('2FA0', '⾠', '1311534', '')
,('2FA1', '⾡', '3332134', '')
,('2FA2', '⾢', '2515215', '')
,('2FA3', '⾣', '1253511', '')
,('2FA4', '⾤', '3431234', '')
,('2FA5', '⾥', '2511211', '')
,('2FA6', '⾦', '34112431', '')
,('2FA7', '⾧', '12111534', '')
,('2FA8', '⾨', '25112511', '')
,('2FA9', '⾩', '32515112', '')
,('2FAA', '⾪', '51124134', '')
,('2FAB', '⾫', '32311121', '32411121')
,('2FAC', '⾬', '12524444', '')
,('2FAD', '⾭', '11212521', '')
,('2FAE', '⾮', '31112111', '21112111')
,('2FAF', '⾯', '132522111', '')
,('2FB0', '⾰', '122125112', '')
,('2FB1', '⾱', '521251152', '')
,('2FB2', '⾲', '211121111', '')
,('2FB3', '⾳', '114312511', '414312511')
,('2FB4', '⾴', '132511134', '')
,('2FB5', '⾵', '351251214', '353251214')
,('2FB6', '⾶', '534335342', '')
,('2FB7', '⾷', '341511534', '344511534')
,('2FB8', '⾸', '431325111', '')
,('2FB9', '⾹', '312342511', '')
,('2FBA', '⾺', '1211254444', '')
,('2FBB', '⾻', '2512452511', '255452511')
,('2FBC', '⾼', '2125125251', '4125125251')
,('2FBD', '⾽', '1211154333', '')
,('2FBE', '⾾', '2112111212', '')
,('2FBF', '⾿', '3444445235', '')
,('2FC0', '⿀', '1251253512', '1251254312')
,('2FC1', '⿁', '3251213554', '325113554')
,('2FC2', '⿂', '35251214444', '')
,('2FC3', '⿃', '32511154444', '')
,('2FC4', '⿄', '21253444441', '')
,('2FC5', '⿅', '21352211535', '41352211535')
,('2FC6', '⿆', '12343434354', '')
,('2FC7', '⿇', '21312321235', '41312341234')
,('2FC8', '⿈', '122112512134', '')
,('2FC9', '⿉', '312343424134', '')
,('2FCA', '⿊', '254312114444', '')
,('2FCB', '⿋', '224314325232', '224314325234')
,('2FCC', '⿌', '2511251211511', '')
,('2FCD', '⿍', '251115132125', '')
,('2FCE', '⿎', '1212514311254', '')
,('2FCF', '⿏', '3215115445445', '')
,('2FD0', '⿐', '32511125121132', '')
,('2FD1', '⿑', '21432533543211', '41432533543211')
,('2FD2', '⿒', '212134341343452', '')
,('2FD3', '⿓', '1143125111515111', '4143125111515111')
,('2FD4', '⿔', '3525112551515134', '32511255115115341')
,('2FD5', '⿕', '34125125125125122', '')
])
#py_adhoc_call   script.hz.打印字符区   ,_iter_parse4radical2stroke_number_code
#end-result_of_iter_parse4radical2stroke_number_code

import unicodedata
import re
from seed.tiny import ifNone, snd
from seed.seq_tools.bisearch import bisearch
__all__

def _extract_data_txt(line, /):
    txt = __doc__
    _, s = txt.split(f'\n{line}\n')
    s, _, _ = s.partition('\n===\n')
    return s
_heads = r'''
===Kangxi_Radicals___XXX___CJK_Radicals_Supplement=:
===unicode_ver13_0:U2E80.pdf:115=16×7+4-1=len[2E80⺀..=2EF3⻳]\-\{2E9A}
===unicode_ver13_0:U2F00.pdf:214=16×13+6=len[2F00⼀..=2FD5⿕]
===Kangxi_Radicals=:
===115+214=329个字根->笔顺码:
'''.split()#'''
_data_txts = [*map(_extract_data_txt, _heads)]
[data_txt4____Kangxi_Radicals___XXX___CJK_Radicals_Supplement
,data_txt4____unicode_ver13_0__U2E80_pdf__115_CJK_Radicals_Supplement
,data_txt4____unicode_ver13_0__U2F00_pdf__214_Kangxi_Radicals
,data_txt4____Kangxi_Radicals
,data_txt4____329_radical2stroke_number_code
] = _data_txts
def show_data_txts():
    for nm in sorted(nm for nm in globals() if nm.startswith('data_txt4____')):
        s = globals()[nm]
        print('#'*22)
        print(f'{nm}=:\n{s}')
    print('#'*22)




_regex4parse4U2E80_pdf_U2F00_pdf = re.compile(r'^([0-9A-F]+)(.);((?:CJK|KANGXI) RADICAL [ A-Z-]+(?:;(?:[*][*]|->|~~)[^;*~>-]+)*)')
    #2E88⺈;CJK RADICAL KNIFE ONE;**form used at top;->5200刀;->2008A𠂊
    #2E9F⺟;CJK RADICAL MOTHER;~~6BCD母
    #2EB0⺰;CJK RADICAL C-SIMPLIFIED SILK;**form used on left side;->7E9F纟
def _iter_parse4U2E80_pdf_U2F00_pdf():
    ss = [data_txt4____unicode_ver13_0__U2E80_pdf__115_CJK_Radicals_Supplement, data_txt4____unicode_ver13_0__U2F00_pdf__214_Kangxi_Radicals]
    for s in ss:
      for line in s.split('\n'):
        m = _regex4parse4U2E80_pdf_U2F00_pdf.match(line)
        if m is None:
            raise ValueError(f'{line!r}')
        uc = m.group(1)
        bk = m.group(2)
        nm, *ts = m.group(3).split(';')
        assert int(uc, 16) == ord(bk)
        assert hex(ord(bk)).upper() == '0X'+uc, (hex(ord(bk)).upper(), uc)
        assert unicodedata.name(bk) == nm, (unicodedata.name(bk), nm)
        comments = []
        eqv_hzs = []
        rel_hzs = []
        for t in ts:
            if t.startswith('**'):
                ls = comments
            elif t.startswith('->'):
                ls = eqv_hzs
            elif t.startswith('~~'):
                ls = rel_hzs
            else:
                raise ValueError(f'{line!r} : {t!r}')
            ls.append(t)
        yield uc, bk, nm, comments, eqv_hzs, rel_hzs

def _cmp_seq(lhs, rhs, /):
    assert len(lhs) == len(rhs), (len(lhs), len(rhs))
    for x,y in zip(lhs, rhs):
        assert x==y, (x,y)
#_cmp_seq(result_of_iter_parse4U2E80_pdf_U2F00_pdf, [*_iter_parse4U2E80_pdf_U2F00_pdf()])
assert result_of_iter_parse4U2E80_pdf_U2F00_pdf == [*_iter_parse4U2E80_pdf_U2F00_pdf()]

_regex4parse4radical2stroke_number_code = re.compile(r'^([0-9A-F]+):(.):(\d+)(?:.*?=!=(\d+))?')
    #2FC1:⿁:3251213554==[纵组甶儿]=!=325113554
def _iter_parse4radical2stroke_number_code():
    s = data_txt4____329_radical2stroke_number_code
    for line in s.split('\n'):
        m = _regex4parse4radical2stroke_number_code.match(line)
        if m is None:
            raise ValueError(f'{line!r}')
        uc = m.group(1)
        bk = m.group(2)
        sc = m.group(3)
        may_neq_sc = m.group(4)
        smay_neq_sc = ifNone(may_neq_sc, '')
        assert int(uc, 16) == ord(bk)
        yield uc, bk, sc, smay_neq_sc
assert result_of_iter_parse4radical2stroke_number_code == [*_iter_parse4radical2stroke_number_code()]

def _helper4check__radical2stroke_number_code():
    from nn_ns.CJK.CJK_data.汉字笔顺 import 汉字到笔顺码 as hz2js

    hz_js_pairs = sorted(hz2js.items(), key=snd)

    ls = [*_iter_parse4radical2stroke_number_code()]

    def f(uc,bk,sc,/):
        i,j = bisearch(sc, hz_js_pairs, key=snd)
        i = max(0,i-1)
        j = min(j+1,len(hz_js_pairs))
        xs = hz_js_pairs[i:j]
        print(uc,bk,sc,xs)
    for uc, bk, sc, smay_neq_sc in ls:
        f(uc,bk,sc)
        if smay_neq_sc:
            neq_sc = smay_neq_sc
            f(uc,bk,neq_sc)

def check_ints(xs, /):
    if not all(type(x) is int for x in xs):raise TypeError

if 0:
  def 打印字符区囗(uint2int, eq_vs_lt=False):
    check_ints(uint2int)
    check_ints(uint2int.values())
    #无序！

def 打印字符区囗(*ints, eq_vs_lt=False):
    'ints=(uint,uint_or_neg_sz)'
    it = iter_uints_(*ints, eq_vs_lt=eq_vs_lt)
    for k in it:
        ch = chr(k)
        print(f'{k:0>X}:{ch}')
def 打印字符区囗带笔顺码囗(*ints, eq_vs_lt=False):
    'ints=(uint,uint_or_neg_sz)'
    from nn_ns.CJK.CJK_data.raw.汉字笔顺 import 汉字到笔顺码 as hz2js
    it = iter_uints_(*ints, eq_vs_lt=eq_vs_lt)
    for k in it:
        ch = chr(k)
        smay_js = hz2js.get(ch, '')
        print(f'{k:0>X}:{ch}:{smay_js}')

def iter_uints_(*ints, eq_vs_lt=False):
    'ints=(uint,uint_or_neg_sz)'
    if not len(ints)%2 == 0:raise TypeError
    check_ints(ints)

    #if not all(0 <= u < 0x11_0000 for u in ints[::2]):raise TypeError
    if not all(0 <= u for u in ints[::2]):raise TypeError

    for i in range(len(ints))[::2]:
        u,v_or_neg_sz = ints[i:i+2]
        if v_or_neg_sz < 0:
            neg_sz = v_or_neg_sz
            v = u -neg_sz
        else:
            v = v_or_neg_sz
            v += eq_vs_lt is False
        yield from range(u,v)

if __name__ == "__main__":
    pass
__all__



from script.hz.打印字符区 import *
