r'''[[[
e ./script/hz/部件拆分囗囗编辑处.py
    并非脚本文件，只是用于分离 部分文档(那些命令细节与数据)
        以免执行替换命令时 修改数据
替换命令 更改部件名 大多是在下面两文件同时进行:
e ./script/hz/部件拆分.py
e ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt

[[
grep here ./script/hz/部件拆分囗囗编辑处.py
.+1,.+13s/here/goto
===
xxxxxxxxxxxxxxxxxxxxxx:goto
命名模式变更:goto
重命名调用前缀以消除歧义:goto
处理版字结尾的部件名:goto
优先级:goto
选用特殊字符囗口编程标识名用:goto
    囜囮囬圙圛圞:goto
选用特殊字符囗口鱻后:goto
    魊閾惐窢馘國:goto
选用特殊字符:goto
    龘靐鱻麤厵:goto
提取笔顺码暨比较:goto
==>>:
重要:
优先级:goto
    定义扩展regex
        ++魌
        即:从整体中提出部件，再给部件打上『版印』，并且 允许多个部件 正交 版印
命名模式变更:goto
    完成囗囗命名模式变更:DONE
提取笔顺码暨比较:goto
    对比:笔顺码:辅助定位错误:不过感觉 汉语字典.笔顺码 错误多，而且 差异不少来自于 笔顺不同
===
]]




doing:goto
完成囗囗命名模式变更:DONE

[[[
===
xxxxxxxxxxxxxxxxxxxxxx:here
e ./script/汉语字典囗.py
    #临时:寄存器:以防全文件替换时修改到命令行
-->:
e ./script/hz/部件拆分.py

[[
===
目标:
    使:正常运行:
    py_adhoc_call   script.hz.部件拆分   @生成拆分囗囗规范部件名囗 --ipath:../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt > /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..生成拆分囗囗规范部件名囗.out.txt
===
命名模式变更:here
    \<或vx-->窢vx
        或缺丿艮-->窢缺丿艮<==> (艮|缺丿艮)
        或儿版穴-->窢儿版穴<==> (八版穴|儿版穴)
>>:: 方案设计:
    #选用特殊字符囗口鱻后:goto
    魊閾惐窢馘國:goto
    龘靐鱻麤厵:goto
    囜囮囬圙圛圞:goto
\<或vx-->窢vx
    模板囮窢囜圙
x之或v或u版-->x鱻鬾魊v魊u版
    模板囮圙鱻鬾魊囜魊囜版
x之v版-->x鱻鬾v版
x之v版囗或u版-->x鱻鬾v版鱻魊u版
    模板囮圙鱻鬾囜版鱻魊囜版鱻魊囜版
x囗或v版-->x鱻馘v版
x囗或v版囗或u版-->x鱻馘v版鱻魊u版
    模板囮圙鱻馘囜版鱻魊囜版鱻魊囜版
x囗或y-->x鱻惐y
    模板囮圙鱻惐圙鱻惐圙
窢:huo>huò
鬾:ji>jì
魊:yu>yù
馘:guo>guó
惐:yu>yù
==>>: 实际更改:
    存档 ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified-save20240127.txt
+ \<或vx-->窢vx:
    DONE:
    当前修改路径:t1+t2+t3+t4+t5
        #取消: x1+x2+...
+ TODO:处理『版』结尾的部件名
    处理版字结尾的部件名:goto
===
===:
重命名调用前缀以消除歧义:here
    最终选用:龘da2/调用函数,靐bing4/特色命名结束符,鱻xiān/或分支,
    #
    囗囗:注释
    囗或: ?-->鱻
        例外:
            纵组囗或儿版穴囗方===纵组(或儿版穴,方)
            𣪘囗或囗横组囗或缺丿艮囗殳
        歧义:
            * 或v版x 作为参数 出现在:...囗或v版x...
                ...囗或v版x... --> ...囗窢v版x...
                \<或v版x --> 窢v版x

            * x囗或y:
                纵组夅貝囗或纵组夂貢
                敖囗或横组囗纵组士方攵
                --> x鱻惐y
                (x|y)

            * x囗或v版:
                纵组八夂囗或儿版囗或夊版
                #xxx --> x鱻本或v版
                --> x鱻馘v版
                (x<无印>|x<v>)
            * x之u版囗或v版:
                #xxx --> x鱻之u版鱻之v版
                --> x鱻鬾u版鱻魊v版
                (x<u>|x<v>)
    之..版:
        x之v版
                #xxx --> x鱻之v版
                --> x鱻鬾v版
                (x<v>)
        x之或u或v版
                #xxx --> x鱻之鱻u鱻v版
                #xxx --> x鱻之u版鱻之v版
                --> x鱻鬾魊u魊v版
                --> x鱻鬾u版鱻魊v版
                (x<u>|x<v>)
                <==> x之u版囗或v版
                    窢:huo>huò
                    惐:yu>yù

    囗:分隔/空格/转义(于只接受单字符参数处，领起特色命名)/非单字符命名引导符
    龘:调用函数
    靐:特色命名结束符
        歧义:雨型二包囗断头巾囗糹虫
            雨型二包(断头巾,糹虫,NONE)
            雨型二包(断,头,巾),糹虫
            -->buggy:雨型二包龘断头巾囗糹虫
            雨型二包(断,头,巾),糹虫
            -->buggy:雨型二包龘囗断头巾囗糹虫
            雨型二包(断头巾,糹虫,NONE)
            -->ok:雨型二包龘囗断头巾靐糹虫
            雨型二包(断头巾,糹,虫)




===
===
===
===
===
===
===
===
####################################
####################################
####################################
            * x囗或y:
                纵组夅貝囗或纵组夂貢
                敖囗或横组囗纵组士方攵
                --> x鱻惐y
                (x|y)
####################################
t1:
%s/囗或\(\([\U3400-\U10ffFF]\@=[^囗龘靐鱻版]\)\{-}\)\(\>\|[囗龘靐鱻]\)\@=/鱻惐\1/g
    ===
    \([\U3400-\U10ffFF]\@=[^囗龘靐鱻版]\)
    -->
    [^囗龘靐鱻版\U0-\U33FF]
    ===

####################################
####################################
####################################
            * 或v版x 作为参数 出现在:...囗或v版x...
                --> ...囗窢v版x...
####################################
t2:
%s/囗或\(\([\U3400-\U10ffFF]\@=[^囗龘靐鱻版]\)\{-}版\([\U3400-\U10ffFF]\@=[^囗龘靐鱻版]\)\)/囗窢\1/g
    ===
    \([\U3400-\U10ffFF]\@=[^囗龘靐鱻版]\)
    -->
    [^囗龘靐鱻版\U0-\U33FF]
    ===
    替换bug:纵组囗火版亾囗火版亾囗窢炎版㡭
    SHOULD_BE:纵组(火版亾囗火版亾,炎版㡭)===纵组囗火版亾囗火版亾鱻惐炎版㡭
命名本身bug:寽之近爫版囗窢斜月版炙头版
囗窢丂版奧囗囗
囗窢刁版占
囗窢丿底𩙿版旣
囗窢口版臣
囗窢断折版夕
囗窢奐之或大版或无头六版
囗窢朮版杀
囗窢目一版旦
囗窢干干版幵
囗窢目版拐化直
囗窢十十版卉
囗窢炎版㡭
囗窢斜月版夕

囗窢丆弯用版石囗窢厂直用版㕅
囗窢夕版彑囗窢丶版互


t3:
%s/囗窢\(丂版奧囗囗\|刁版占\|丿底𩙿版旣\|口版臣\|断折版夕\|奐之或大版或无头六版\|朮版杀\|目一版旦\|干干版幵\|目版拐化直\|十十版卉\|炎版㡭\|斜月版夕\)/鱻惐\1/g
%s/囗窢丆弯用版石囗窢厂直用版㕅/鱻惐丆弯用版石鱻惐厂直用版㕅/g
%s/囗窢夕版彑囗窢丶版互/鱻惐夕版彑鱻惐丶版互/g
%s/寽之近爫版囗窢斜月版炙头版/寽之近爫版囗或斜月炙头版/g
%s/鱻惐奐之或大或无头六版/鱻惐奐之或大或无头六版/g

t4:
𣪘鱻惐囗横组鱻惐缺丿艮囗殳
%s/𣪘鱻惐囗横组鱻惐缺丿艮囗殳/𣪘鱻惐横组囗窢缺丿艮囗殳/g
\<皀鱻惐缺丿艮\>
    正常
%s/\<或缺丿艮\>/窢缺丿艮/g

%s/\<或\(.\{-}\)\>/窢\1/g
%s/\<窢\>/或/g
%s/^或:d,窢儿版穴,或,/窢:d,窢儿版穴,或,/g
%s/鱻惐囗/鱻惐/g

t5:
%s/纵组一𠈌囗二版丰/纵三组一𠈌囗二版丰/g
####################################
####################################
####################################
===
===
===
===
####################################
####################################
####################################
            * x之u版囗或v版:
                --> x鱻之u版鱻之v版
                (x<u>|x<v>)
####################################
x1:
%s/版囗或\(\([\U3400-\U10ffFF]\@=[^囗龘靐鱻版]\)\{-}\)\(版\>\|版囗\)\@=/版鱻之\1/g
    ===
    \([\U3400-\U10ffFF]\@=[^囗龘靐鱻版]\)
    -->
    [^囗龘靐鱻版\U0-\U33FF]
    ===

####################################
####################################
####################################
        x之或u或v版
                --> x鱻之鱻u鱻v版
                --> x鱻之u版鱻之v版
                (x<u>|x<v>)
                <==> x之u版囗或v版
####################################
x2:
%s/之或\(\([\U3400-\U10ffFF]\@=[^囗龘靐鱻版]\)\{-}\)\(版\>\|版囗\)\@=/鱻之鱻\1/g
    ===
    \([\U3400-\U10ffFF]\@=[^囗龘靐鱻版]\)
    -->
    [^囗龘靐鱻版\U0-\U33FF]
    ===
####################################
####################################
####################################
===
===
===
===
===
===
]]
[[
处理版字结尾的部件名:here
    #命名模式变更:goto
    #选用特殊字符囗口鱻后:goto
===
py_adhoc_call   script.hz.部件拆分   @打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗 --ipath:../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt  > /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗.out.txt
grep '版$' /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗.out.txt --no-filename > /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified.txt
e /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified.txt
    443 lines

===
@ /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified.txt
%s/.*://g
    去除:笔顺码
save to:
    view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified-0.txt

===
precondition:
    [DONE: x囗或y-->x鱻惐y]
        模板囮圙鱻惐圙鱻惐圙
    [DONE: \<或vx-->窢vx]
        模板囮窢囜圙
post:
    + x之或v或u版-->x鱻鬾魊v魊u版
        模板囮圙鱻鬾魊囜魊囜版
    + x之v版-->x鱻鬾v版
    + x之v版囗或u版-->x鱻鬾v版鱻魊u版
        模板囮圙鱻鬾囜版鱻魊囜版鱻魊囜版
    + x囗或v版-->x鱻馘v版
    + x囗或v版囗或u版-->x鱻馘v版鱻魊u版
        模板囮圙鱻馘囜版鱻魊囜版鱻魊囜版

[^囗龘靐鱻版\U0-\U33FF]

@ /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified.txt
%s/之\([^版\U0-\U33FF]*版\)\@=/鱻鬾/g
%s/^\(.\)囗或/\1鱻馘
    !! [DONE: x囗或y-->x鱻惐y]
%s/\(鱻[馘鬾][^馘鬾]*\)版囗或/\1版鱻魊
    执行3次才完成全部替换



%s/纵组囗斜月版夕囗寸囗或冫版囗或断折夕版/纵组囗斜月版夕囗寸鱻馘冫版鱻魊断折夕版/g
%s/莽囗囗卄犬版囗或十十犬版囗或卄大版/莽鱻馘卄犬版鱻魊十十犬版鱻魊卄大版/g
# %s/匀勻囗或提二版/匀勻囗或提二版/g
# %s/既旣囗或丨二版/既旣囗或丨二版/g

%s/^\([^囗鱻馘鬾]*\)囗或/\1鱻馘
    再次:鱻馘
%s/\(鱻[馘鬾][^馘鬾]*\)版囗或/\1版鱻魊
    再执行1次

还有'或'剩下
    但没有:  ^[^或]*或[^或]*$
%s/\(鱻鬾[^鱻馘鬾或版]*\)或/\1魊
    执行5次
%s/奐鱻鬾魊大版或无头六版/奐鱻鬾魊大魊无头六版/g
没有'或'剩下

[
还有'囗'剩下, 正常，但 有些 部件名的版印 必须移动
    <<== 现决定 版印从属于特色命名，不能含『囗』或被隔断
    ??
    ^...*鱻[馘鬾]
    优先级:goto
===
grep '^...*鱻[馘鬾]' /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified.txt
===
.+1,.+26s/^\([纵横右][^鱻: ]*\)\(鱻[^:]*版\)$/\0:\1囗\2
纵组林月鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版:纵组林月囗鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版
纵组日夂鱻馘曰版鱻魊夊版:纵组日夂囗鱻馘曰版鱻魊夊版
横组熏力鱻馘灬底版:横组熏力囗鱻馘灬底版
纵组𠂉丹鱻鬾亠丹版鱻魊丄丹直化版:纵组𠂉丹囗鱻鬾亠丹版鱻魊丄丹直化版
纵组八夂鱻馘儿版鱻魊夊版:纵组八夂囗鱻馘儿版鱻魊夊版
纵组几口鱻鬾魊几魊儿魊八版:纵组几口囗鱻鬾魊几魊儿魊八版
纵组夂糸鱻鬾魊夂魊攵版:纵组夂糸囗鱻鬾魊夂魊攵版
横组户攵鱻鬾魊户魊戶魊戸版:横组户攵囗鱻鬾魊户魊戶魊戸版
纵组冖彑鱻馘宐鱻鬾宀直夕一版:纵组冖彑囗鱻馘宐鱻鬾宀直夕一版
横组巳巳鱻馘己版:横组巳巳囗鱻馘己版
纵组屮又鱻馘撇化屮版:纵组屮又囗鱻馘撇化屮版
横组月禾鱻鬾弯月版:横组月禾囗鱻鬾弯月版
纵组日月鱻鬾魊日魊曰魊直月魊肉月版:纵组日月囗鱻鬾魊日魊曰魊直月魊肉月版
纵组𠂉丹鱻鬾亠丹版:纵组𠂉丹囗鱻鬾亠丹版

右龘漢鱻鬾廿版鱻魊龷版鱻魊艹不出头倒日版:右龘漢囗鱻鬾廿版鱻魊龷版鱻魊艹不出头倒日版
右龘漢鱻馘艹倒日版:右龘漢囗鱻馘艹倒日版
右龘備鱻鬾魊龷直甪魊龷弯甪魊艹厂直用版:右龘備囗鱻鬾魊龷直甪魊龷弯甪魊艹厂直用版
右龘淵鱻馘直化版:右龘淵囗鱻馘直化版
右龘漢鱻鬾廿版:右龘漢囗鱻鬾廿版

纵组囗斜月版夕囗寸鱻馘冫版鱻魊断折夕版:纵组囗斜月版夕囗寸囗鱻馘冫版鱻魊断折夕版
横三组糹車糹鱻鬾魊糹魊糸版:横三组糹車糹囗鱻鬾魊糹魊糸版



横组口囗𨥫鱻鬾头留版:横组口𨥫鱻鬾头留版
横组忄囗𨥫鱻鬾头留版:横组忄𨥫鱻鬾头留版
横组女囗𨥫鱻鬾头留版:横组女𨥫鱻鬾头留版


憲鱻鬾丰龶鱻鬾横顶版鱻魊撇顶版鱻魊彡版:憲鱻魌丰龶鱻鬾横顶版鱻魊撇顶版鱻魊彡版
憲鱻鬾丰龶鱻鬾横顶版:憲鱻魌丰龶鱻鬾横顶版
纵组巫㕣鱻馘头嗇版:纵组巫㕣囗鱻魌巫鱻馘头嗇版
纵组䒑八鱻鬾魊丷魊八版:纵组䒑八囗鱻魌䒑鱻鬾魊丷魊八版

奐鱻鬾魊八魊人魊儿版鱻惐奐鱻鬾魊大魊无头六版:奐鱻魌芯鱻鬾魊八魊人魊儿版鱻魌底鱻鬾魊大魊无头六版

即鱻馘卽鱻鬾丨二版:即鱻惐卽鱻鬾丨二版
===
.+1,+43s/^\([^:\U0-\U33FF]\+\):\(\S\+\)$/%s\/\\<\1\\>\/\2\/g
exe  ' %s/\<纵组林月鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版\>/纵组林月囗鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版/g | %s/\<纵组日夂鱻馘曰版鱻魊夊版\>/纵组日夂囗鱻馘曰版鱻魊夊版/g | %s/\<横组熏力鱻馘灬底版\>/横组熏力囗鱻馘灬底版/g | %s/\<纵组𠂉丹鱻鬾亠丹版鱻魊丄丹直化版\>/纵组𠂉丹囗鱻鬾亠丹版鱻魊丄丹直化版/g | %s/\<纵组八夂鱻馘儿版鱻魊夊版\>/纵组八夂囗鱻馘儿版鱻魊夊版/g | %s/\<纵组几口鱻鬾魊几魊儿魊八版\>/纵组几口囗鱻鬾魊几魊儿魊八版/g | %s/\<纵组夂糸鱻鬾魊夂魊攵版\>/纵组夂糸囗鱻鬾魊夂魊攵版/g | %s/\<横组户攵鱻鬾魊户魊戶魊戸版\>/横组户攵囗鱻鬾魊户魊戶魊戸版/g | %s/\<纵组冖彑鱻馘宐鱻鬾宀直夕一版\>/纵组冖彑囗鱻馘宐鱻鬾宀直夕一版/g | %s/\<横组巳巳鱻馘己版\>/横组巳巳囗鱻馘己版/g | %s/\<纵组屮又鱻馘撇化屮版\>/纵组屮又囗鱻馘撇化屮版/g | %s/\<横组月禾鱻鬾弯月版\>/横组月禾囗鱻鬾弯月版/g | %s/\<纵组日月鱻鬾魊日魊曰魊直月魊肉月版\>/纵组日月囗鱻鬾魊日魊曰魊直月魊肉月版/g | %s/\<纵组𠂉丹鱻鬾亠丹版\>/纵组𠂉丹囗鱻鬾亠丹版/g | %s/\<右龘漢鱻鬾廿版鱻魊龷版鱻魊艹不出头倒日版\>/右龘漢囗鱻鬾廿版鱻魊龷版鱻魊艹不出头倒日版/g | %s/\<右龘漢鱻馘艹倒日版\>/右龘漢囗鱻馘艹倒日版/g | %s/\<右龘備鱻鬾魊龷直甪魊龷弯甪魊艹厂直用版\>/右龘備囗鱻鬾魊龷直甪魊龷弯甪魊艹厂直用版/g | %s/\<右龘淵鱻馘直化版\>/右龘淵囗鱻馘直化版/g | %s/\<右龘漢鱻鬾廿版\>/右龘漢囗鱻鬾廿版/g | %s/\<纵组囗斜月版夕囗寸鱻馘冫版鱻魊断折夕版\>/纵组囗斜月版夕囗寸囗鱻馘冫版鱻魊断折夕版/g | %s/\<横三组糹車糹鱻鬾魊糹魊糸版\>/横三组糹車糹囗鱻鬾魊糹魊糸版/g | %s/\<横组口囗𨥫鱻鬾头留版\>/横组口𨥫鱻鬾头留版/g | %s/\<横组忄囗𨥫鱻鬾头留版\>/横组忄𨥫鱻鬾头留版/g | %s/\<横组女囗𨥫鱻鬾头留版\>/横组女𨥫鱻鬾头留版/g | %s/\<憲鱻鬾丰龶鱻鬾横顶版鱻魊撇顶版鱻魊彡版\>/憲鱻魌丰龶鱻鬾横顶版鱻魊撇顶版鱻魊彡版/g | %s/\<憲鱻鬾丰龶鱻鬾横顶版\>/憲鱻魌丰龶鱻鬾横顶版/g | %s/\<纵组巫㕣鱻馘头嗇版\>/纵组巫㕣囗鱻魌巫鱻馘头嗇版/g | %s/\<纵组䒑八鱻鬾魊丷魊八版\>/纵组䒑八囗鱻魌䒑鱻鬾魊丷魊八版/g | %s/\<奐鱻鬾魊八魊人魊儿版鱻惐奐鱻鬾魊大魊无头六版\>/奐鱻魌芯鱻鬾魊八魊人魊儿版鱻魌底鱻鬾魊大魊无头六版/g | %s/\<即鱻馘卽鱻鬾丨二版\>/即鱻惐卽鱻鬾丨二版/g '




===

view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗.out.txt
save to:
    view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified-finished.txt
]
===
目标:替换下面两文件的对应项
cmp:
    view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified-0.txt
    view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified-finished.txt

配对

py_adhoc_call   nn_ns.app.zip_lines   @main4zip_files_   :/sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified-0.txt     :/sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified-finished.txt  --may_opath:/sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified..zip-0-finished.txt
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified..zip-0-finished.txt
    443lines

排序:先长后短！
py_adhoc_call   nn_ns.app.sort_lines   @main4sort_lines_ --key=len +reverse  --may_ipath:/sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified..zip-0-finished.txt  --may_opath:/sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified..zip-0-finished..sorted.txt
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗..grep.版s..out-modified..zip-0-finished..sorted.txt
    443lines

[
害之横顶丰版囗或撇顶丰版囗或横顶龶版囗或撇顶龶版:害鱻鬾横顶丰版鱻魊撇顶丰版鱻魊横顶龶版鱻魊撇顶龶版
奐之或八或人或儿版鱻惐奐之或大版或无头六版:奐鱻魌芯鱻鬾魊八魊人魊儿版鱻魌底鱻鬾魊大魊无头六版
𣁋之山一几版囗或山一儿版囗或山兀版囗或山几版:𣁋鱻鬾山一几版鱻魊山一儿版鱻魊山兀版鱻魊山几版
育之亠厶𠫓版囗或七丶𠫓版囗或直月版囗或肉月版:育鱻鬾亠厶𠫓版鱻魊七丶𠫓版鱻魊直月版鱻魊肉月版
纵组林月之或直月或弯月或肉月或缺丶朮或木版:纵组林月囗鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版
正之撇顶版囗或横顶版囗或𠃊止版囗或丄止版:正鱻鬾撇顶版鱻魊横顶版鱻魊𠃊止版鱻魊丄止版
右龘漢之廿版囗或龷版囗或艹不出头倒日版:右龘漢囗鱻鬾廿版鱻魊龷版鱻魊艹不出头倒日版
纵组囗斜月版夕囗寸囗或冫版囗或断折夕版:纵组囗斜月版夕囗寸囗鱻馘冫版鱻魊断折夕版
右龘備之或龷直甪或龷弯甪或艹厂直用版:右龘備囗鱻鬾魊龷直甪魊龷弯甪魊艹厂直用版
𣁋之山一王版囗或山一𡈼版囗或山一壬版:𣁋鱻鬾山一王版鱻魊山一𡈼版鱻魊山一壬版
凡之几丶版囗或不出头丸版囗或撇化卂版:凡鱻鬾几丶版鱻魊不出头丸版鱻魊撇化卂版
憲之丰龶之横顶版囗或撇顶版囗或彡版:憲鱻魌丰龶鱻鬾横顶版鱻魊撇顶版鱻魊彡版
吳之无二与版囗或丨无钩𠃌版囗或𠃊版:吳鱻鬾无二与版鱻魊丨无钩𠃌版鱻魊𠃊版
𣁋之山一几版囗或山一儿版囗或山兀版:𣁋鱻鬾山一几版鱻魊山一儿版鱻魊山兀版
衆之丿罒乑版囗或血底眾版囗或血乑版:衆鱻鬾丿罒乑版鱻魊血底眾版鱻魊血乑版
莽囗囗卄犬版囗或十十犬版囗或卄大版:莽鱻馘卄犬版鱻魊十十犬版鱻魊卄大版
纵组日月之或日或曰或直月或肉月版:纵组日月囗鱻鬾魊日魊曰魊直月魊肉月版
邦之横顶撇化丰版囗或撇顶撇化丰版:邦鱻鬾横顶撇化丰版鱻魊撇顶撇化丰版
杀之朩版囗或木版囗或朮版囗或术版:杀鱻鬾朩版鱻魊木版鱻魊朮版鱻魊术版
纵组𠂉丹之亠丹版囗或丄丹直化版:纵组𠂉丹囗鱻鬾亠丹版鱻魊丄丹直化版
胡之弯月版囗或直月版囗或肉月版:胡鱻鬾弯月版鱻魊直月版鱻魊肉月版
林之木木版囗或丶乚版囗或乚乚版:林鱻鬾木木版鱻魊丶乚版鱻魊乚乚版
纵组罒囗寸版即之厶版囗或丨二版:纵组罒囗寸版即鱻鬾厶版鱻魊丨二版
卞之亠卜版囗或丄卜版囗或十丶版:卞鱻鬾亠卜版鱻魊丄卜版鱻魊十丶版
蚩之屮版囗或撇化屮版囗或山䖝版:蚩鱻鬾屮版鱻魊撇化屮版鱻魊山䖝版
䏍之直月版囗或肉月版囗或弯月版:䏍鱻鬾直月版鱻魊肉月版鱻魊弯月版
㓞之丰版囗或提丰版囗或提龶版:㓞鱻鬾丰版鱻魊提丰版鱻魊提龶版
幵之撇化干直化干版囗或干干版:幵鱻鬾撇化干直化干版鱻魊干干版
反序拟包纵组凵田之或田或由版:反序拟包纵组凵田鱻鬾魊田魊由版
头用负之八版囗或人版囗或儿版:头用负鱻鬾八版鱻魊人版鱻魊儿版
纵组亡月之弯月版囗或斜月夕版:纵组亡月鱻鬾弯月版鱻魊斜月夕版
戾之户版囗或戶版囗或戸大戻版:戾鱻鬾户版鱻魊戶版鱻魊戸大戻版
纵组冖彑囗或宐之宀直夕一版:纵组冖彑囗鱻馘宐鱻鬾宀直夕一版
纵组弋月之弯月版囗或肉月版:纵组弋月鱻鬾弯月版鱻魊肉月版
脩之或夂或攵或直月或肉月版:脩鱻鬾魊夂魊攵魊直月魊肉月版
次之冫版囗或二版囗或提二版:次鱻鬾冫版鱻魊二版鱻魊提二版
纵组心用之直用版囗或弯用版:纵组心用鱻鬾直用版鱻魊弯用版
蕭囗或中间多一隔横直化肅版:蕭鱻馘中间多一隔横直化肅版
纵组几口之或几或儿或八版:纵组几口囗鱻鬾魊几魊儿魊八版
横组户攵之或户或戶或戸版:横组户攵囗鱻鬾魊户魊戶魊戸版
横三组糹車糹之或糹或糸版:横三组糹車糹囗鱻鬾魊糹魊糸版
麦之龶夂版囗或撇化丰又版:麦鱻鬾龶夂版鱻魊撇化丰又版
真之芯三版囗或十目一八版:真鱻鬾芯三版鱻魊十目一八版
具之芯三且版囗或目一八版:具鱻鬾芯三且版鱻魊目一八版
纵组日夂囗或曰版囗或夊版:纵组日夂囗鱻馘曰版鱻魊夊版
同版𦥯之同版囗或冂一丅版:同版𦥯鱻鬾同版鱻魊冂一丅版
纵组八夂囗或儿版囗或夊版:纵组八夂囗鱻馘儿版鱻魊夊版
寽之近爫版囗或斜月炙头版:寽鱻鬾近爫版鱻魊斜月炙头版
奐之八版囗或人版囗或儿版:奐鱻鬾八版鱻魊人版鱻魊儿版
風之撇顶䖝版囗或横顶䖝版:風鱻鬾撇顶䖝版鱻魊横顶䖝版
㐬之亠厶𠫓版囗或七丶𠫓版:㐬鱻鬾亠厶𠫓版鱻魊七丶𠫓版
羌之撇化羊乚版囗或𦍌儿版:羌鱻鬾撇化羊乚版鱻魊𦍌儿版
纵组䒑八之或丷或八版:纵组䒑八囗鱻魌䒑鱻鬾魊丷魊八版
窊之厶瓜版囗或无口虫瓜版:窊鱻鬾厶瓜版鱻魊无口虫瓜版
戾之户版囗或戶版囗或戸版:戾鱻鬾户版鱻魊戶版鱻魊戸版
辥之或屮𠂤或山𠂤或屮㠯版:辥鱻鬾魊屮𠂤魊山𠂤魊屮㠯版
肅囗或中间多一隔横直化版:肅鱻馘中间多一隔横直化版
丰龶之横顶版囗或撇顶版:丰龶鱻鬾横顶版鱻魊撇顶版
辱之或拟包纵组或纵组版:辱鱻鬾魊拟包纵组魊纵组版
縣之芯三且版囗或𠃊目版:縣鱻鬾芯三且版鱻魊𠃊目版
横组訔攵囗囗𣁋之山言版:横组訔攵囗囗𣁋鱻鬾山言版
半𥫗之𠂉丶版囗或𠂉一版:半𥫗鱻鬾𠂉丶版鱻魊𠂉一版
鬼之撇化甲版囗或甶儿版:鬼鱻鬾撇化甲版鱻魊甶儿版
条之或朩或木或夂或攵版:条鱻鬾魊朩魊木魊夂魊攵版
衰之一卄一版囗或廿一版:衰鱻鬾一卄一版鱻魊廿一版
差之撇化羊版囗或𦍌丿版:差鱻鬾撇化羊版鱻魊𦍌丿版
着之撇化羊版囗或𦍌丿版:着鱻鬾撇化羊版鱻魊𦍌丿版
養之撇化羊版囗或𦍌食版:養鱻鬾撇化羊版鱻魊𦍌食版
羗之撇化羊版囗或𦍌丿版:羗鱻鬾撇化羊版鱻魊𦍌丿版
彐之尾大版囗或右倒巾版:彐鱻鬾尾大版鱻魊右倒巾版
卽之皀版囗或丿缺亽𩙿版:卽鱻鬾皀版鱻魊丿缺亽𩙿版
纵组巫㕣囗或头嗇版:纵组巫㕣囗鱻魌巫鱻馘头嗇版
叟囗或𦥑版囗或不穿底版:叟鱻馘𦥑版鱻魊不穿底版
纵组夂糸之或夂或攵版:纵组夂糸囗鱻鬾魊夂魊攵版
契之三丰版囗或彡丰版:契鱻鬾三丰版鱻魊彡丰版
靑之直円版囗或弯円版:靑鱻鬾直円版鱻魊弯円版
冓之单杠版囗或双杠版:冓鱻鬾单杠版鱻魊双杠版
干之撇化版囗或直化版:干鱻鬾撇化版鱻魊直化版
畱之直化丣版囗或丣版:畱鱻鬾直化丣版鱻魊丣版
艾之卄艹版囗或十十版:艾鱻鬾卄艹版鱻魊十十版
正序纵包龘厂墨之黒版:正序纵包龘厂墨鱻鬾黒版
屯之横顶版囗或撇顶版:屯鱻鬾横顶版鱻魊撇顶版
氺之八八版囗或丷八版:氺鱻鬾八八版鱻魊丷八版
月之直月版囗或弯月版:月鱻鬾直月版鱻魊弯月版
用之直月版囗或弯月版:用鱻鬾直月版鱻魊弯月版
戢之融横版囗或断横版:戢鱻鬾融横版鱻魊断横版
昌之日日版囗或日曰版:昌鱻鬾日日版鱻魊日曰版
黽之闭肠版囗或开塞版:黽鱻鬾闭肠版鱻魊开塞版
卸之丄止版囗或𠃊止版:卸鱻鬾丄止版鱻魊𠃊止版
垂之卄艹版囗或十十版:垂鱻鬾卄艹版鱻魊十十版
節之或即或卽或丨二版:節鱻鬾魊即魊卽魊丨二版
與之芯丨版囗或芯丿版:與鱻鬾芯丨版鱻魊芯丿版
舋之同版囗或冂一丅版:舋鱻鬾同版鱻魊冂一丅版
厉之撇顶版囗或横顶版:厉鱻鬾撇顶版鱻魊横顶版
𠂢之带钩版囗或无钩版:𠂢鱻鬾带钩版鱻魊无钩版
反之撇顶版囗或横顶版:反鱻鬾撇顶版鱻魊横顶版
匕之撇顶版囗或横顶版:匕鱻鬾撇顶版鱻魊横顶版
月之弯月版囗或肉月版:月鱻鬾弯月版鱻魊肉月版
用之弯月版囗或直月版:用鱻鬾弯月版鱻魊直月版
脾之弯月版囗或肉月版:脾鱻鬾弯月版鱻魊肉月版
肥之弯月版囗或肉月版:肥鱻鬾弯月版鱻魊肉月版
肋之弯月版囗或肉月版:肋鱻鬾弯月版鱻魊肉月版
氐之氏丶版囗或氏一版:氐鱻鬾氏丶版鱻魊氏一版
角之三腿版囗或两腿版:角鱻鬾三腿版鱻魊两腿版
䍃之斜月夕版囗或爫版:䍃鱻鬾斜月夕版鱻魊爫版
刍之彐版囗或右倒巾版:刍鱻鬾彐版鱻魊右倒巾版
育之直月版囗或弯月版:育鱻鬾直月版鱻魊弯月版
率之丷八版囗或八八版:率鱻鬾丷八版鱻魊八八版
卷之丷龹版囗或八𠔉版:卷鱻鬾丷龹版鱻魊八𠔉版
並之虚业版囗或虛业版:並鱻鬾虚业版鱻魊虛业版
甯之直用版囗或弯用版:甯鱻鬾直用版鱻魊弯用版
丑之尾大版囗或双杠版:丑鱻鬾尾大版鱻魊双杠版
蚩之屮版囗或撇化屮版:蚩鱻鬾屮版鱻魊撇化屮版
纵组屮又囗或撇化屮版:纵组屮又囗鱻馘撇化屮版
辥之撇化屮版囗或山版:辥鱻鬾撇化屮版鱻魊山版
月之直月版囗或肉月版:月鱻鬾直月版鱻魊肉月版
系之撇顶版囗或横顶版:系鱻鬾撇顶版鱻魊横顶版
纵组罒囗寸版即之厶版:纵组罒囗寸版即鱻鬾厶版
𠫓之亠厶版囗或七丶版:𠫓鱻鬾亠厶版鱻魊七丶版
青囗或円版囗或弯月版:青鱻馘円版鱻魊弯月版
肖囗或肉月版囗或小版:肖鱻馘肉月版鱻魊小版
纵三组目大㔾囗或巳版:纵三组目大㔾鱻馘巳版
奐之或大版或无头六版:奐鱻鬾魊大魊无头六版
毒之或母或毋或毌版:毒鱻鬾魊母魊毋魊毌版
右龘漢囗或艹倒日版:右龘漢囗鱻馘艹倒日版
辱之拟包纵组辰寸版:辱鱻鬾拟包纵组辰寸版
奔之廾版囗或𠂇十版:奔鱻鬾廾版鱻魊𠂇十版
非之或丨丨或丿丨版:非鱻鬾魊丨丨魊丿丨版
閒之或直月或弯月版:閒鱻鬾魊直月魊弯月版
横组熏力囗或灬底版:横组熏力囗鱻馘灬底版
邊之自版囗囗非白版:邊鱻鬾自版囗囗非白版
斥之乂卜版囗或下版:斥鱻鬾乂卜版鱻魊下版
瓜之或厶或无口虫版:瓜鱻鬾魊厶魊无口虫版
殺之或朩或朮或术版:殺鱻鬾魊朩魊朮魊术版
爵之厶版囗或丨二版:爵鱻鬾厶版鱻魊丨二版
䍃之或爫或斜月夕版:䍃鱻鬾魊爫魊斜月夕版
奐之或八或人或儿版:奐鱻鬾魊八魊人魊儿版
貿之头留版囗或卯版:貿鱻鬾头留版鱻魊卯版
庸之或直月或弯月版:庸鱻鬾魊直月魊弯月版
扁之或户或戶或戸版:扁鱻鬾魊户魊戶魊戸版
扈之或户或戶或戸版:扈鱻鬾魊户魊戶魊戸版
弱之冫版囗或丿丿版:弱鱻鬾冫版鱻魊丿丿版
韋之㐄版囗或底年版:韋鱻鬾㐄版鱻魊底年版
翟之羽版囗或彐彐版:翟鱻鬾羽版鱻魊彐彐版
勇之直用版囗或田版:勇鱻鬾直用版鱻魊田版
幵之撇化干直化干版:幵鱻鬾撇化干直化干版
横组口囗𨥫之头留版:横组口𨥫鱻鬾头留版
横组忄囗𨥫之头留版:横组忄𨥫鱻鬾头留版
横组女囗𨥫之头留版:横组女𨥫鱻鬾头留版
憲之丰龶之横顶版:憲鱻魌丰龶鱻鬾横顶版
横组月禾之弯月版:横组月禾囗鱻鬾弯月版
纵组𠂉丹之亠丹版:纵组𠂉丹囗鱻鬾亠丹版
契之丰版囗或龶版:契鱻鬾丰版鱻魊龶版
奏之天版囗或夭版:奏鱻鬾天版鱻魊夭版
寺之土版囗或士版:寺鱻鬾土版鱻魊士版
甚之八版囗或儿版:甚鱻鬾八版鱻魊儿版
疐之乛版囗或厶版:疐鱻鬾乛版鱻魊厶版
匱之目版囗或且版:匱鱻鬾目版鱻魊且版
賴之𠂊版囗或刀版:賴鱻鬾𠂊版鱻魊刀版
横组臣月之弯月版:横组臣月鱻鬾弯月版
要之覀版囗或襾版:要鱻鬾覀版鱻魊襾版
平之丷版囗或八版:平鱻鬾丷版鱻魊八版
旡之𠃋版囗或丄版:旡鱻鬾𠃋版鱻魊丄版
虜之田版囗或毌版:虜鱻鬾田版鱻魊毌版
尚之丷版囗或八版:尚鱻鬾丷版鱻魊八版
呈之王版囗或𡈼版:呈鱻鬾王版鱻魊𡈼版
畢之甲版囗或田版:畢鱻鬾甲版鱻魊田版
曷之匃版囗或匂版:曷鱻鬾匃版鱻魊匂版
䇠之主版囗或龶版:䇠鱻鬾主版鱻魊龶版
右龘淵囗或直化版:右龘淵囗鱻馘直化版
杀之朩版囗或木版:杀鱻鬾朩版鱻魊木版
殺之或朩或朮木版:殺鱻鬾魊朩魊朮木版
殺之术版囗或朮版:殺鱻鬾术版鱻魊朮版
横组釆𥜽之厶禸版:横组釆𥜽鱻鬾厶禸版
㸒之壬版囗或𡈼版:㸒鱻鬾壬版鱻魊𡈼版
今之亽版囗或亼版:今鱻鬾亽版鱻魊亼版
周之或土或二丰版:周鱻鬾魊土魊二丰版
勺之丶版囗或一版:勺鱻鬾丶版鱻魊一版
处之卜版囗或人版:处鱻鬾卜版鱻魊人版
昝之卜版囗或人版:昝鱻鬾卜版鱻魊人版
包之巳版囗或己版:包鱻鬾巳版鱻魊己版
次之冫版囗或二版:次鱻鬾冫版鱻魊二版
半之丷版囗或八版:半鱻鬾丷版鱻魊八版
酋之丷版囗或八版:酋鱻鬾丷版鱻魊八版
㜸之䒑版囗或艹版:㜸鱻鬾䒑版鱻魊艹版
益之丷版囗或八版:益鱻鬾丷版鱻魊八版
㡀之丷版囗或八版:㡀鱻鬾丷版鱻魊八版
營之吕版囗或呂版:營鱻鬾吕版鱻魊呂版
宂之几版囗或儿版:宂鱻鬾几版鱻魊儿版
朗之郎版囗或郞版:朗鱻鬾郎版鱻魊郞版
戾之户版囗或戶版:戾鱻鬾户版鱻魊戶版
神之礻版囗或示版:神鱻鬾礻版鱻魊示版
冗之几版囗或儿版:冗鱻鬾几版鱻魊儿版
即囗或卽之丨二版:即鱻惐卽鱻鬾丨二版
卂之十版囗或𠂇版:卂鱻鬾十版鱻魊𠂇版
横组巳巳囗或己版:横组巳巳囗鱻馘己版
亟之了版囗或丂版:亟鱻鬾了版鱻魊丂版
函之了版囗或丂版:函鱻鬾了版鱻魊丂版
蚤之叉版囗或㕚版:蚤鱻鬾叉版鱻魊㕚版
綿之糹版囗或糸版:綿鱻鬾糹版鱻魊糸版
巤之乂版囗或人版:巤鱻鬾乂版鱻魊人版
纵组亡月之弯月版:纵组亡月鱻鬾弯月版
纵组弋月之弯月版:纵组弋月鱻鬾弯月版
纵组心用之直用版:纵组心用鱻鬾直用版
邦之横顶撇化丰版:邦鱻鬾横顶撇化丰版
朁囗或出头兂兂版:朁鱻馘出头兂兂版
卜囗或交叠丨乀版:卜鱻馘交叠丨乀版
昌囗或纵组日曰版:昌鱻馘纵组日曰版
即囗或丿缺亽𩙿版:即鱻馘丿缺亽𩙿版
忝之或天或夭版:忝鱻鬾魊天魊夭版
賣之或罒或四版:賣鱻鬾魊罒魊四版
聖之或王或𡈼版:聖鱻鬾魊王魊𡈼版
巷之或巳或己版:巷鱻鬾魊巳魊己版
雚之或卄或卝版:雚鱻鬾魊卄魊卝版
灰之或𠂇或厂版:灰鱻鬾魊𠂇魊厂版
㓹之厂包炎刂版:㓹鱻鬾厂包炎刂版
区之或乂或又版:区鱻鬾魊乂魊又版
牙之或𠃋或丄版:牙鱻鬾魊𠃋魊丄版
鬵之或旡或兂版:鬵鱻鬾魊旡魊兂版
致之或攵或夂版:致鱻鬾魊攵魊夂版
虞之或吴或吳版:虞鱻鬾魊吴魊吳版
虎之或几或儿版:虎鱻鬾魊几魊儿版
墨之或黒或黑版:墨鱻鬾魊黒魊黑版
炭之或𠂇或厂版:炭鱻鬾魊𠂇魊厂版
睘之或𠄌或丨版:睘鱻鬾魊𠄌魊丨版
頽之或几或儿版:頽鱻鬾魊几魊儿版
節之或即或卽版:節鱻鬾魊即魊卽版
敏之或每或毎版:敏鱻鬾魊每魊毎版
鼻之或丌或廾版:鼻鱻鬾魊丌魊廾版
悤之或囱或囪版:悤鱻鬾魊囱魊囪版
咎之或卜或人版:咎鱻鬾魊卜魊人版
廣之或黄或黃版:廣鱻鬾魊黄魊黃版
廛之或八或儿版:廛鱻鬾魊八魊儿版
兗之或八或儿版:兗鱻鬾魊八魊儿版
亲之或朩或木版:亲鱻鬾魊朩魊木版
益之或丷或八版:益鱻鬾魊丷魊八版
曾之或丷或八版:曾鱻鬾魊丷魊八版
恬之或千或干版:恬鱻鬾魊千魊干版
寇之或攴或攵版:寇鱻鬾魊攴魊攵版
㦿之或户或戶版:㦿鱻鬾魊户魊戶版
慈之或兹或茲版:慈鱻鬾魊兹魊茲版
羌之撇化羊乚版:羌鱻鬾撇化羊乚版
艹之或卄或卝版:艹鱻鬾魊卄魊卝版
砉囗或撇顶丰版:砉鱻馘撇顶丰版
堇囗或艹倒日版:堇鱻馘艹倒日版
再囗或双杠冄版:再鱻馘双杠冄版
任囗或一士王版:任鱻馘一士王版
爯囗或双杠冄版:爯鱻馘双杠冄版
匀勻囗或提二版:匀勻鱻馘提二版
撇化半囗或八版:撇化半鱻馘八版
彐囗或右倒巾版:彐鱻馘右倒巾版
既旣囗或丨二版:既旣鱻馘丨二版
右龘漢之廿版:右龘漢囗鱻鬾廿版
央之不出头版:央鱻鬾不出头版
𣁋之山一土版:𣁋鱻鬾山一土版
𣁋之山一巾版:𣁋鱻鬾山一巾版
𣁋之山一糸版:𣁋鱻鬾山一糸版
无顶夒之白版:无顶夒鱻鬾白版
㐬之亠厶𠫓版:㐬鱻鬾亠厶𠫓版
䍃之斜月夕版:䍃鱻鬾斜月夕版
丰龶之横顶版:丰龶鱻鬾横顶版
具之芯三且版:具鱻鬾芯三且版
半𥫗之𠂉丶版:半𥫗鱻鬾𠂉丶版
同版𦥯之同版:同版𦥯鱻鬾同版
吳之无二与版:吳鱻鬾无二与版
头用负之八版:头用负鱻鬾八版
害之横顶丰版:害鱻鬾横顶丰版
差之撇化羊版:差鱻鬾撇化羊版
畱之直化丣版:畱鱻鬾直化丣版
着之撇化羊版:着鱻鬾撇化羊版
縣之芯三且版:縣鱻鬾芯三且版
羗之撇化羊版:羗鱻鬾撇化羊版
育之亠厶𠫓版:育鱻鬾亠厶𠫓版
衆之丿罒乑版:衆鱻鬾丿罒乑版
衰之一卄一版:衰鱻鬾一卄一版
辥之撇化屮版:辥鱻鬾撇化屮版
風之撇顶䖝版:風鱻鬾撇顶䖝版
養之撇化羊版:養鱻鬾撇化羊版
鬼之撇化甲版:鬼鱻鬾撇化甲版
𣁋之山一几版:𣁋鱻鬾山一几版
𣁋之山一王版:𣁋鱻鬾山一王版
丰囗或撇顶版:丰鱻馘撇顶版
耒囗或撇顶版:耒鱻馘撇顶版
天囗或倒二版:天鱻馘倒二版
赤囗或直化版:赤鱻馘直化版
赫囗或直化版:赫鱻馘直化版
者囗或加丶版:者鱻馘加丶版
目囗或长腿版:目鱻馘长腿版
冒囗或日目版:冒鱻馘日目版
肙囗或肉月版:肙鱻馘肉月版
罪囗或撇竖版:罪鱻馘撇竖版
臿囗或横顶版:臿鱻馘横顶版
旣囗或丨二版:旣鱻馘丨二版
角囗或两腿版:角鱻馘两腿版
言囗或横顶版:言鱻馘横顶版
良囗或横顶版:良鱻馘横顶版
那囗或双杠版:那鱻馘双杠版
者之加丶版:者鱻鬾加丶版
鬲之口㐄版:鬲鱻鬾口㐄版
且之芯三版:且鱻鬾芯三版
冊之双杠版:冊鱻鬾双杠版
臿之穿底版:臿鱻鬾穿底版
血之丿罒版:血鱻鬾丿罒版
𨥫之头留版:𨥫鱻鬾头留版
戠之融横版:戠鱻鬾融横版
彐之尾大版:彐鱻鬾尾大版
䏍之直月版:䏍鱻鬾直月版
丑之尾大版:丑鱻鬾尾大版
並之虚业版:並鱻鬾虚业版
冓之单杠版:冓鱻鬾单杠版
凡之几丶版:凡鱻鬾几丶版
勇之直用版:勇鱻鬾直用版
匕之撇顶版:匕鱻鬾撇顶版
卞之亠卜版:卞鱻鬾亠卜版
卷之丷龹版:卷鱻鬾丷龹版
卸之丄止版:卸鱻鬾丄止版
厉之撇顶版:厉鱻鬾撇顶版
反之撇顶版:反鱻鬾撇顶版
垂之卄艹版:垂鱻鬾卄艹版
契之三丰版:契鱻鬾三丰版
寽之近爫版:寽鱻鬾近爫版
屯之横顶版:屯鱻鬾横顶版
干之撇化版:干鱻鬾撇化版
戢之融横版:戢鱻鬾融横版
斥之乂卜版:斥鱻鬾乂卜版
昌之日日版:昌鱻鬾日日版
月之弯月版:月鱻鬾弯月版
月之直月版:月鱻鬾直月版
林之木木版:林鱻鬾木木版
正之撇顶版:正鱻鬾撇顶版
氐之氏丶版:氐鱻鬾氏丶版
氺之八八版:氺鱻鬾八八版
率之丷八版:率鱻鬾丷八版
用之弯月版:用鱻鬾弯月版
用之直月版:用鱻鬾直月版
甯之直用版:甯鱻鬾直用版
真之芯三版:真鱻鬾芯三版
窊之厶瓜版:窊鱻鬾厶瓜版
系之撇顶版:系鱻鬾撇顶版
肋之弯月版:肋鱻鬾弯月版
肥之弯月版:肥鱻鬾弯月版
育之直月版:育鱻鬾直月版
胡之弯月版:胡鱻鬾弯月版
脾之弯月版:脾鱻鬾弯月版
與之芯丨版:與鱻鬾芯丨版
艾之卄艹版:艾鱻鬾卄艹版
角之三腿版:角鱻鬾三腿版
貿之头留版:貿鱻鬾头留版
靑之直円版:靑鱻鬾直円版
麦之龶夂版:麦鱻鬾龶夂版
黽之闭肠版:黽鱻鬾闭肠版
𠂢之带钩版:𠂢鱻鬾带钩版
𠫓之亠厶版:𠫓鱻鬾亠厶版
㓞囗或彡版:㓞鱻馘彡版
絜囗或彡版:絜鱻馘彡版
賣囗或四版:賣鱻馘四版
坴囗或儿版:坴鱻馘儿版
夌囗或儿版:夌鱻馘儿版
巸囗或𦣝版:巸鱻馘𦣝版
垔囗或西版:垔鱻馘西版
犮囗或乂版:犮鱻馘乂版
冏囗或儿版:冏鱻馘儿版
气囗或乙版:气鱻馘乙版
躳囗或呂版:躳鱻馘呂版
似囗或厶版:似鱻馘厶版
微囗或儿版:微鱻馘儿版
杀囗或𠃊版:杀鱻馘𠃊版
㕣囗或儿版:㕣鱻馘儿版
倉囗或亼版:倉鱻馘亼版
文囗或丄版:文鱻馘丄版
於囗或𠂉版:於鱻馘𠂉版
半囗或八版:半鱻馘八版
关囗或八版:关鱻馘八版
劵囗或八版:劵鱻馘八版
卷囗或八版:卷鱻馘八版
絭囗或八版:絭鱻馘八版
空囗或儿版:空鱻馘儿版
启囗或戶版:启鱻馘戶版
戹囗或戶版:戹鱻馘戶版
冢囗或豕版:冢鱻馘豕版
丩囗或丄版:丩鱻馘丄版
將囗或寽版:將鱻馘寽版
夋囗或儿版:夋鱻馘儿版
㐄囗或丄版:㐄鱻馘丄版
䒑囗或八版:䒑鱻馘八版
䍃之爫版:䍃鱻鬾爫版
𣴎之氺版:𣴎鱻鬾氺版
㓞之丰版:㓞鱻鬾丰版
㜸之䒑版:㜸鱻鬾䒑版
㡀之丷版:㡀鱻鬾丷版
㸒之壬版:㸒鱻鬾壬版
䇠之主版:䇠鱻鬾主版
亟之了版:亟鱻鬾了版
今之亽版:今鱻鬾亽版
冗之几版:冗鱻鬾几版
函之了版:函鱻鬾了版
刍之彐版:刍鱻鬾彐版
勺之丶版:勺鱻鬾丶版
包之巳版:包鱻鬾巳版
匱之目版:匱鱻鬾目版
卂之十版:卂鱻鬾十版
半之丷版:半鱻鬾丷版
卽之皀版:卽鱻鬾皀版
呈之王版:呈鱻鬾王版
处之卜版:处鱻鬾卜版
夒之白版:夒鱻鬾白版
奏之天版:奏鱻鬾天版
奐之八版:奐鱻鬾八版
契之丰版:契鱻鬾丰版
奔之廾版:奔鱻鬾廾版
宂之几版:宂鱻鬾几版
寺之土版:寺鱻鬾土版
尚之丷版:尚鱻鬾丷版
巤之乂版:巤鱻鬾乂版
平之丷版:平鱻鬾丷版
弱之冫版:弱鱻鬾冫版
戾之户版:戾鱻鬾户版
旡之𠃋版:旡鱻鬾𠃋版
昝之卜版:昝鱻鬾卜版
曷之匃版:曷鱻鬾匃版
朗之郎版:朗鱻鬾郎版
杀之朩版:杀鱻鬾朩版
次之冫版:次鱻鬾冫版
殺之术版:殺鱻鬾术版
營之吕版:營鱻鬾吕版
爵之厶版:爵鱻鬾厶版
甚之八版:甚鱻鬾八版
畢之甲版:畢鱻鬾甲版
疐之乛版:疐鱻鬾乛版
益之丷版:益鱻鬾丷版
神之礻版:神鱻鬾礻版
綿之糹版:綿鱻鬾糹版
翟之羽版:翟鱻鬾羽版
舋之同版:舋鱻鬾同版
虜之田版:虜鱻鬾田版
蚤之叉版:蚤鱻鬾叉版
蚩之屮版:蚩鱻鬾屮版
要之覀版:要鱻鬾覀版
賴之𠂊版:賴鱻鬾𠂊版
邊之自版:邊鱻鬾自版
酋之丷版:酋鱻鬾丷版
韋之㐄版:韋鱻鬾㐄版
版:版
]
[
===
.+1,+445s/^\([^:\U0-\U33FF]\+\):\(\S\+\)$/%s\/\\<\1\\>\/\2\/g
.+1,+445s/^\([^:\U0-\U33FF]\+\):\(\S\+\)$/%s\/\1\/\2\/g
[
%s/害之横顶丰版囗或撇顶丰版囗或横顶龶版囗或撇顶龶版/害鱻鬾横顶丰版鱻魊撇顶丰版鱻魊横顶龶版鱻魊撇顶龶版/g
%s/奐之或八或人或儿版鱻惐奐之或大版或无头六版/奐鱻魌芯鱻鬾魊八魊人魊儿版鱻魌底鱻鬾魊大魊无头六版/g
%s/𣁋之山一几版囗或山一儿版囗或山兀版囗或山几版/𣁋鱻鬾山一几版鱻魊山一儿版鱻魊山兀版鱻魊山几版/g
%s/育之亠厶𠫓版囗或七丶𠫓版囗或直月版囗或肉月版/育鱻鬾亠厶𠫓版鱻魊七丶𠫓版鱻魊直月版鱻魊肉月版/g
%s/纵组林月之或直月或弯月或肉月或缺丶朮或木版/纵组林月囗鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版/g
%s/正之撇顶版囗或横顶版囗或𠃊止版囗或丄止版/正鱻鬾撇顶版鱻魊横顶版鱻魊𠃊止版鱻魊丄止版/g
%s/右龘漢之廿版囗或龷版囗或艹不出头倒日版/右龘漢囗鱻鬾廿版鱻魊龷版鱻魊艹不出头倒日版/g
%s/纵组囗斜月版夕囗寸囗或冫版囗或断折夕版/纵组囗斜月版夕囗寸囗鱻馘冫版鱻魊断折夕版/g
%s/右龘備之或龷直甪或龷弯甪或艹厂直用版/右龘備囗鱻鬾魊龷直甪魊龷弯甪魊艹厂直用版/g
%s/𣁋之山一王版囗或山一𡈼版囗或山一壬版/𣁋鱻鬾山一王版鱻魊山一𡈼版鱻魊山一壬版/g
%s/凡之几丶版囗或不出头丸版囗或撇化卂版/凡鱻鬾几丶版鱻魊不出头丸版鱻魊撇化卂版/g
%s/憲之丰龶之横顶版囗或撇顶版囗或彡版/憲鱻魌丰龶鱻鬾横顶版鱻魊撇顶版鱻魊彡版/g
%s/吳之无二与版囗或丨无钩𠃌版囗或𠃊版/吳鱻鬾无二与版鱻魊丨无钩𠃌版鱻魊𠃊版/g
%s/𣁋之山一几版囗或山一儿版囗或山兀版/𣁋鱻鬾山一几版鱻魊山一儿版鱻魊山兀版/g
%s/衆之丿罒乑版囗或血底眾版囗或血乑版/衆鱻鬾丿罒乑版鱻魊血底眾版鱻魊血乑版/g
%s/莽囗囗卄犬版囗或十十犬版囗或卄大版/莽鱻馘卄犬版鱻魊十十犬版鱻魊卄大版/g
%s/纵组日月之或日或曰或直月或肉月版/纵组日月囗鱻鬾魊日魊曰魊直月魊肉月版/g
%s/邦之横顶撇化丰版囗或撇顶撇化丰版/邦鱻鬾横顶撇化丰版鱻魊撇顶撇化丰版/g
%s/杀之朩版囗或木版囗或朮版囗或术版/杀鱻鬾朩版鱻魊木版鱻魊朮版鱻魊术版/g
%s/纵组𠂉丹之亠丹版囗或丄丹直化版/纵组𠂉丹囗鱻鬾亠丹版鱻魊丄丹直化版/g
%s/胡之弯月版囗或直月版囗或肉月版/胡鱻鬾弯月版鱻魊直月版鱻魊肉月版/g
%s/林之木木版囗或丶乚版囗或乚乚版/林鱻鬾木木版鱻魊丶乚版鱻魊乚乚版/g
%s/纵组罒囗寸版即之厶版囗或丨二版/纵组罒囗寸版即鱻鬾厶版鱻魊丨二版/g
%s/卞之亠卜版囗或丄卜版囗或十丶版/卞鱻鬾亠卜版鱻魊丄卜版鱻魊十丶版/g
%s/蚩之屮版囗或撇化屮版囗或山䖝版/蚩鱻鬾屮版鱻魊撇化屮版鱻魊山䖝版/g
%s/䏍之直月版囗或肉月版囗或弯月版/䏍鱻鬾直月版鱻魊肉月版鱻魊弯月版/g
%s/㓞之丰版囗或提丰版囗或提龶版/㓞鱻鬾丰版鱻魊提丰版鱻魊提龶版/g
%s/幵之撇化干直化干版囗或干干版/幵鱻鬾撇化干直化干版鱻魊干干版/g
%s/反序拟包纵组凵田之或田或由版/反序拟包纵组凵田鱻鬾魊田魊由版/g
%s/头用负之八版囗或人版囗或儿版/头用负鱻鬾八版鱻魊人版鱻魊儿版/g
%s/纵组亡月之弯月版囗或斜月夕版/纵组亡月鱻鬾弯月版鱻魊斜月夕版/g
%s/戾之户版囗或戶版囗或戸大戻版/戾鱻鬾户版鱻魊戶版鱻魊戸大戻版/g
%s/纵组冖彑囗或宐之宀直夕一版/纵组冖彑囗鱻馘宐鱻鬾宀直夕一版/g
%s/纵组弋月之弯月版囗或肉月版/纵组弋月鱻鬾弯月版鱻魊肉月版/g
%s/脩之或夂或攵或直月或肉月版/脩鱻鬾魊夂魊攵魊直月魊肉月版/g
%s/次之冫版囗或二版囗或提二版/次鱻鬾冫版鱻魊二版鱻魊提二版/g
%s/纵组心用之直用版囗或弯用版/纵组心用鱻鬾直用版鱻魊弯用版/g
%s/蕭囗或中间多一隔横直化肅版/蕭鱻馘中间多一隔横直化肅版/g
%s/纵组几口之或几或儿或八版/纵组几口囗鱻鬾魊几魊儿魊八版/g
%s/横组户攵之或户或戶或戸版/横组户攵囗鱻鬾魊户魊戶魊戸版/g
%s/横三组糹車糹之或糹或糸版/横三组糹車糹囗鱻鬾魊糹魊糸版/g
%s/麦之龶夂版囗或撇化丰又版/麦鱻鬾龶夂版鱻魊撇化丰又版/g
%s/真之芯三版囗或十目一八版/真鱻鬾芯三版鱻魊十目一八版/g
%s/具之芯三且版囗或目一八版/具鱻鬾芯三且版鱻魊目一八版/g
%s/纵组日夂囗或曰版囗或夊版/纵组日夂囗鱻馘曰版鱻魊夊版/g
%s/同版𦥯之同版囗或冂一丅版/同版𦥯鱻鬾同版鱻魊冂一丅版/g
%s/纵组八夂囗或儿版囗或夊版/纵组八夂囗鱻馘儿版鱻魊夊版/g
%s/寽之近爫版囗或斜月炙头版/寽鱻鬾近爫版鱻魊斜月炙头版/g
%s/奐之八版囗或人版囗或儿版/奐鱻鬾八版鱻魊人版鱻魊儿版/g
%s/風之撇顶䖝版囗或横顶䖝版/風鱻鬾撇顶䖝版鱻魊横顶䖝版/g
%s/㐬之亠厶𠫓版囗或七丶𠫓版/㐬鱻鬾亠厶𠫓版鱻魊七丶𠫓版/g
%s/羌之撇化羊乚版囗或𦍌儿版/羌鱻鬾撇化羊乚版鱻魊𦍌儿版/g
%s/纵组䒑八之或丷或八版/纵组䒑八囗鱻魌䒑鱻鬾魊丷魊八版/g
%s/窊之厶瓜版囗或无口虫瓜版/窊鱻鬾厶瓜版鱻魊无口虫瓜版/g
%s/戾之户版囗或戶版囗或戸版/戾鱻鬾户版鱻魊戶版鱻魊戸版/g
%s/辥之或屮𠂤或山𠂤或屮㠯版/辥鱻鬾魊屮𠂤魊山𠂤魊屮㠯版/g
%s/肅囗或中间多一隔横直化版/肅鱻馘中间多一隔横直化版/g
%s/丰龶之横顶版囗或撇顶版/丰龶鱻鬾横顶版鱻魊撇顶版/g
%s/辱之或拟包纵组或纵组版/辱鱻鬾魊拟包纵组魊纵组版/g
%s/縣之芯三且版囗或𠃊目版/縣鱻鬾芯三且版鱻魊𠃊目版/g
%s/横组訔攵囗囗𣁋之山言版/横组訔攵囗囗𣁋鱻鬾山言版/g
%s/半𥫗之𠂉丶版囗或𠂉一版/半𥫗鱻鬾𠂉丶版鱻魊𠂉一版/g
%s/鬼之撇化甲版囗或甶儿版/鬼鱻鬾撇化甲版鱻魊甶儿版/g
%s/条之或朩或木或夂或攵版/条鱻鬾魊朩魊木魊夂魊攵版/g
%s/衰之一卄一版囗或廿一版/衰鱻鬾一卄一版鱻魊廿一版/g
%s/差之撇化羊版囗或𦍌丿版/差鱻鬾撇化羊版鱻魊𦍌丿版/g
%s/着之撇化羊版囗或𦍌丿版/着鱻鬾撇化羊版鱻魊𦍌丿版/g
%s/養之撇化羊版囗或𦍌食版/養鱻鬾撇化羊版鱻魊𦍌食版/g
%s/羗之撇化羊版囗或𦍌丿版/羗鱻鬾撇化羊版鱻魊𦍌丿版/g
%s/彐之尾大版囗或右倒巾版/彐鱻鬾尾大版鱻魊右倒巾版/g
%s/卽之皀版囗或丿缺亽𩙿版/卽鱻鬾皀版鱻魊丿缺亽𩙿版/g
%s/纵组巫㕣囗或头嗇版/纵组巫㕣囗鱻魌巫鱻馘头嗇版/g
%s/叟囗或𦥑版囗或不穿底版/叟鱻馘𦥑版鱻魊不穿底版/g
%s/纵组夂糸之或夂或攵版/纵组夂糸囗鱻鬾魊夂魊攵版/g
%s/契之三丰版囗或彡丰版/契鱻鬾三丰版鱻魊彡丰版/g
%s/靑之直円版囗或弯円版/靑鱻鬾直円版鱻魊弯円版/g
%s/冓之单杠版囗或双杠版/冓鱻鬾单杠版鱻魊双杠版/g
%s/干之撇化版囗或直化版/干鱻鬾撇化版鱻魊直化版/g
%s/畱之直化丣版囗或丣版/畱鱻鬾直化丣版鱻魊丣版/g
%s/艾之卄艹版囗或十十版/艾鱻鬾卄艹版鱻魊十十版/g
%s/正序纵包龘厂墨之黒版/正序纵包龘厂墨鱻鬾黒版/g
%s/屯之横顶版囗或撇顶版/屯鱻鬾横顶版鱻魊撇顶版/g
%s/氺之八八版囗或丷八版/氺鱻鬾八八版鱻魊丷八版/g
%s/月之直月版囗或弯月版/月鱻鬾直月版鱻魊弯月版/g
%s/用之直月版囗或弯月版/用鱻鬾直月版鱻魊弯月版/g
%s/戢之融横版囗或断横版/戢鱻鬾融横版鱻魊断横版/g
%s/昌之日日版囗或日曰版/昌鱻鬾日日版鱻魊日曰版/g
%s/黽之闭肠版囗或开塞版/黽鱻鬾闭肠版鱻魊开塞版/g
%s/卸之丄止版囗或𠃊止版/卸鱻鬾丄止版鱻魊𠃊止版/g
%s/垂之卄艹版囗或十十版/垂鱻鬾卄艹版鱻魊十十版/g
%s/節之或即或卽或丨二版/節鱻鬾魊即魊卽魊丨二版/g
%s/與之芯丨版囗或芯丿版/與鱻鬾芯丨版鱻魊芯丿版/g
%s/舋之同版囗或冂一丅版/舋鱻鬾同版鱻魊冂一丅版/g
%s/厉之撇顶版囗或横顶版/厉鱻鬾撇顶版鱻魊横顶版/g
%s/𠂢之带钩版囗或无钩版/𠂢鱻鬾带钩版鱻魊无钩版/g
%s/反之撇顶版囗或横顶版/反鱻鬾撇顶版鱻魊横顶版/g
%s/匕之撇顶版囗或横顶版/匕鱻鬾撇顶版鱻魊横顶版/g
%s/月之弯月版囗或肉月版/月鱻鬾弯月版鱻魊肉月版/g
%s/用之弯月版囗或直月版/用鱻鬾弯月版鱻魊直月版/g
%s/脾之弯月版囗或肉月版/脾鱻鬾弯月版鱻魊肉月版/g
%s/肥之弯月版囗或肉月版/肥鱻鬾弯月版鱻魊肉月版/g
%s/肋之弯月版囗或肉月版/肋鱻鬾弯月版鱻魊肉月版/g
%s/氐之氏丶版囗或氏一版/氐鱻鬾氏丶版鱻魊氏一版/g
%s/角之三腿版囗或两腿版/角鱻鬾三腿版鱻魊两腿版/g
%s/䍃之斜月夕版囗或爫版/䍃鱻鬾斜月夕版鱻魊爫版/g
%s/刍之彐版囗或右倒巾版/刍鱻鬾彐版鱻魊右倒巾版/g
%s/育之直月版囗或弯月版/育鱻鬾直月版鱻魊弯月版/g
%s/率之丷八版囗或八八版/率鱻鬾丷八版鱻魊八八版/g
%s/卷之丷龹版囗或八𠔉版/卷鱻鬾丷龹版鱻魊八𠔉版/g
%s/並之虚业版囗或虛业版/並鱻鬾虚业版鱻魊虛业版/g
%s/甯之直用版囗或弯用版/甯鱻鬾直用版鱻魊弯用版/g
%s/丑之尾大版囗或双杠版/丑鱻鬾尾大版鱻魊双杠版/g
%s/蚩之屮版囗或撇化屮版/蚩鱻鬾屮版鱻魊撇化屮版/g
%s/纵组屮又囗或撇化屮版/纵组屮又囗鱻馘撇化屮版/g
%s/辥之撇化屮版囗或山版/辥鱻鬾撇化屮版鱻魊山版/g
%s/月之直月版囗或肉月版/月鱻鬾直月版鱻魊肉月版/g
%s/系之撇顶版囗或横顶版/系鱻鬾撇顶版鱻魊横顶版/g
%s/纵组罒囗寸版即之厶版/纵组罒囗寸版即鱻鬾厶版/g
%s/𠫓之亠厶版囗或七丶版/𠫓鱻鬾亠厶版鱻魊七丶版/g
%s/青囗或円版囗或弯月版/青鱻馘円版鱻魊弯月版/g
%s/肖囗或肉月版囗或小版/肖鱻馘肉月版鱻魊小版/g
%s/纵三组目大㔾囗或巳版/纵三组目大㔾鱻馘巳版/g
%s/奐之或大版或无头六版/奐鱻鬾魊大魊无头六版/g
%s/毒之或母或毋或毌版/毒鱻鬾魊母魊毋魊毌版/g
%s/右龘漢囗或艹倒日版/右龘漢囗鱻馘艹倒日版/g
%s/辱之拟包纵组辰寸版/辱鱻鬾拟包纵组辰寸版/g
%s/奔之廾版囗或𠂇十版/奔鱻鬾廾版鱻魊𠂇十版/g
%s/非之或丨丨或丿丨版/非鱻鬾魊丨丨魊丿丨版/g
%s/閒之或直月或弯月版/閒鱻鬾魊直月魊弯月版/g
%s/横组熏力囗或灬底版/横组熏力囗鱻馘灬底版/g
%s/邊之自版囗囗非白版/邊鱻鬾自版囗囗非白版/g
%s/斥之乂卜版囗或下版/斥鱻鬾乂卜版鱻魊下版/g
%s/瓜之或厶或无口虫版/瓜鱻鬾魊厶魊无口虫版/g
%s/殺之或朩或朮或术版/殺鱻鬾魊朩魊朮魊术版/g
%s/爵之厶版囗或丨二版/爵鱻鬾厶版鱻魊丨二版/g
%s/䍃之或爫或斜月夕版/䍃鱻鬾魊爫魊斜月夕版/g
%s/奐之或八或人或儿版/奐鱻鬾魊八魊人魊儿版/g
%s/貿之头留版囗或卯版/貿鱻鬾头留版鱻魊卯版/g
%s/庸之或直月或弯月版/庸鱻鬾魊直月魊弯月版/g
%s/扁之或户或戶或戸版/扁鱻鬾魊户魊戶魊戸版/g
%s/扈之或户或戶或戸版/扈鱻鬾魊户魊戶魊戸版/g
%s/弱之冫版囗或丿丿版/弱鱻鬾冫版鱻魊丿丿版/g
%s/韋之㐄版囗或底年版/韋鱻鬾㐄版鱻魊底年版/g
%s/翟之羽版囗或彐彐版/翟鱻鬾羽版鱻魊彐彐版/g
%s/勇之直用版囗或田版/勇鱻鬾直用版鱻魊田版/g
%s/幵之撇化干直化干版/幵鱻鬾撇化干直化干版/g
%s/横组口囗𨥫之头留版/横组口𨥫鱻鬾头留版/g
%s/横组忄囗𨥫之头留版/横组忄𨥫鱻鬾头留版/g
%s/横组女囗𨥫之头留版/横组女𨥫鱻鬾头留版/g
%s/憲之丰龶之横顶版/憲鱻魌丰龶鱻鬾横顶版/g
%s/横组月禾之弯月版/横组月禾囗鱻鬾弯月版/g
%s/纵组𠂉丹之亠丹版/纵组𠂉丹囗鱻鬾亠丹版/g
%s/契之丰版囗或龶版/契鱻鬾丰版鱻魊龶版/g
%s/奏之天版囗或夭版/奏鱻鬾天版鱻魊夭版/g
%s/寺之土版囗或士版/寺鱻鬾土版鱻魊士版/g
%s/甚之八版囗或儿版/甚鱻鬾八版鱻魊儿版/g
%s/疐之乛版囗或厶版/疐鱻鬾乛版鱻魊厶版/g
%s/匱之目版囗或且版/匱鱻鬾目版鱻魊且版/g
%s/賴之𠂊版囗或刀版/賴鱻鬾𠂊版鱻魊刀版/g
%s/横组臣月之弯月版/横组臣月鱻鬾弯月版/g
%s/要之覀版囗或襾版/要鱻鬾覀版鱻魊襾版/g
%s/平之丷版囗或八版/平鱻鬾丷版鱻魊八版/g
%s/旡之𠃋版囗或丄版/旡鱻鬾𠃋版鱻魊丄版/g
%s/虜之田版囗或毌版/虜鱻鬾田版鱻魊毌版/g
%s/尚之丷版囗或八版/尚鱻鬾丷版鱻魊八版/g
%s/呈之王版囗或𡈼版/呈鱻鬾王版鱻魊𡈼版/g
%s/畢之甲版囗或田版/畢鱻鬾甲版鱻魊田版/g
%s/曷之匃版囗或匂版/曷鱻鬾匃版鱻魊匂版/g
%s/䇠之主版囗或龶版/䇠鱻鬾主版鱻魊龶版/g
%s/右龘淵囗或直化版/右龘淵囗鱻馘直化版/g
%s/杀之朩版囗或木版/杀鱻鬾朩版鱻魊木版/g
%s/殺之或朩或朮木版/殺鱻鬾魊朩魊朮木版/g
%s/殺之术版囗或朮版/殺鱻鬾术版鱻魊朮版/g
%s/横组釆𥜽之厶禸版/横组釆𥜽鱻鬾厶禸版/g
%s/㸒之壬版囗或𡈼版/㸒鱻鬾壬版鱻魊𡈼版/g
%s/今之亽版囗或亼版/今鱻鬾亽版鱻魊亼版/g
%s/周之或土或二丰版/周鱻鬾魊土魊二丰版/g
%s/勺之丶版囗或一版/勺鱻鬾丶版鱻魊一版/g
%s/处之卜版囗或人版/处鱻鬾卜版鱻魊人版/g
%s/昝之卜版囗或人版/昝鱻鬾卜版鱻魊人版/g
%s/包之巳版囗或己版/包鱻鬾巳版鱻魊己版/g
%s/次之冫版囗或二版/次鱻鬾冫版鱻魊二版/g
%s/半之丷版囗或八版/半鱻鬾丷版鱻魊八版/g
%s/酋之丷版囗或八版/酋鱻鬾丷版鱻魊八版/g
%s/㜸之䒑版囗或艹版/㜸鱻鬾䒑版鱻魊艹版/g
%s/益之丷版囗或八版/益鱻鬾丷版鱻魊八版/g
%s/㡀之丷版囗或八版/㡀鱻鬾丷版鱻魊八版/g
%s/營之吕版囗或呂版/營鱻鬾吕版鱻魊呂版/g
%s/宂之几版囗或儿版/宂鱻鬾几版鱻魊儿版/g
%s/朗之郎版囗或郞版/朗鱻鬾郎版鱻魊郞版/g
%s/戾之户版囗或戶版/戾鱻鬾户版鱻魊戶版/g
%s/神之礻版囗或示版/神鱻鬾礻版鱻魊示版/g
%s/冗之几版囗或儿版/冗鱻鬾几版鱻魊儿版/g
%s/即囗或卽之丨二版/即鱻惐卽鱻鬾丨二版/g
%s/卂之十版囗或𠂇版/卂鱻鬾十版鱻魊𠂇版/g
%s/横组巳巳囗或己版/横组巳巳囗鱻馘己版/g
%s/亟之了版囗或丂版/亟鱻鬾了版鱻魊丂版/g
%s/函之了版囗或丂版/函鱻鬾了版鱻魊丂版/g
%s/蚤之叉版囗或㕚版/蚤鱻鬾叉版鱻魊㕚版/g
%s/綿之糹版囗或糸版/綿鱻鬾糹版鱻魊糸版/g
%s/巤之乂版囗或人版/巤鱻鬾乂版鱻魊人版/g
%s/纵组亡月之弯月版/纵组亡月鱻鬾弯月版/g
%s/纵组弋月之弯月版/纵组弋月鱻鬾弯月版/g
%s/纵组心用之直用版/纵组心用鱻鬾直用版/g
%s/邦之横顶撇化丰版/邦鱻鬾横顶撇化丰版/g
%s/朁囗或出头兂兂版/朁鱻馘出头兂兂版/g
%s/卜囗或交叠丨乀版/卜鱻馘交叠丨乀版/g
%s/昌囗或纵组日曰版/昌鱻馘纵组日曰版/g
%s/即囗或丿缺亽𩙿版/即鱻馘丿缺亽𩙿版/g
%s/忝之或天或夭版/忝鱻鬾魊天魊夭版/g
%s/賣之或罒或四版/賣鱻鬾魊罒魊四版/g
%s/聖之或王或𡈼版/聖鱻鬾魊王魊𡈼版/g
%s/巷之或巳或己版/巷鱻鬾魊巳魊己版/g
%s/雚之或卄或卝版/雚鱻鬾魊卄魊卝版/g
%s/灰之或𠂇或厂版/灰鱻鬾魊𠂇魊厂版/g
%s/㓹之厂包炎刂版/㓹鱻鬾厂包炎刂版/g
%s/区之或乂或又版/区鱻鬾魊乂魊又版/g
%s/牙之或𠃋或丄版/牙鱻鬾魊𠃋魊丄版/g
%s/鬵之或旡或兂版/鬵鱻鬾魊旡魊兂版/g
%s/致之或攵或夂版/致鱻鬾魊攵魊夂版/g
%s/虞之或吴或吳版/虞鱻鬾魊吴魊吳版/g
%s/虎之或几或儿版/虎鱻鬾魊几魊儿版/g
%s/墨之或黒或黑版/墨鱻鬾魊黒魊黑版/g
%s/炭之或𠂇或厂版/炭鱻鬾魊𠂇魊厂版/g
%s/睘之或𠄌或丨版/睘鱻鬾魊𠄌魊丨版/g
%s/頽之或几或儿版/頽鱻鬾魊几魊儿版/g
%s/節之或即或卽版/節鱻鬾魊即魊卽版/g
%s/敏之或每或毎版/敏鱻鬾魊每魊毎版/g
%s/鼻之或丌或廾版/鼻鱻鬾魊丌魊廾版/g
%s/悤之或囱或囪版/悤鱻鬾魊囱魊囪版/g
%s/咎之或卜或人版/咎鱻鬾魊卜魊人版/g
%s/廣之或黄或黃版/廣鱻鬾魊黄魊黃版/g
%s/廛之或八或儿版/廛鱻鬾魊八魊儿版/g
%s/兗之或八或儿版/兗鱻鬾魊八魊儿版/g
%s/亲之或朩或木版/亲鱻鬾魊朩魊木版/g
%s/益之或丷或八版/益鱻鬾魊丷魊八版/g
%s/曾之或丷或八版/曾鱻鬾魊丷魊八版/g
%s/恬之或千或干版/恬鱻鬾魊千魊干版/g
%s/寇之或攴或攵版/寇鱻鬾魊攴魊攵版/g
%s/㦿之或户或戶版/㦿鱻鬾魊户魊戶版/g
%s/慈之或兹或茲版/慈鱻鬾魊兹魊茲版/g
%s/羌之撇化羊乚版/羌鱻鬾撇化羊乚版/g
%s/艹之或卄或卝版/艹鱻鬾魊卄魊卝版/g
%s/砉囗或撇顶丰版/砉鱻馘撇顶丰版/g
%s/堇囗或艹倒日版/堇鱻馘艹倒日版/g
%s/再囗或双杠冄版/再鱻馘双杠冄版/g
%s/任囗或一士王版/任鱻馘一士王版/g
%s/爯囗或双杠冄版/爯鱻馘双杠冄版/g
%s/匀勻囗或提二版/匀勻鱻馘提二版/g
%s/撇化半囗或八版/撇化半鱻馘八版/g
%s/彐囗或右倒巾版/彐鱻馘右倒巾版/g
%s/既旣囗或丨二版/既旣鱻馘丨二版/g
%s/右龘漢之廿版/右龘漢囗鱻鬾廿版/g
%s/央之不出头版/央鱻鬾不出头版/g
%s/𣁋之山一土版/𣁋鱻鬾山一土版/g
%s/𣁋之山一巾版/𣁋鱻鬾山一巾版/g
%s/𣁋之山一糸版/𣁋鱻鬾山一糸版/g
%s/无顶夒之白版/无顶夒鱻鬾白版/g
%s/㐬之亠厶𠫓版/㐬鱻鬾亠厶𠫓版/g
%s/䍃之斜月夕版/䍃鱻鬾斜月夕版/g
%s/丰龶之横顶版/丰龶鱻鬾横顶版/g
%s/具之芯三且版/具鱻鬾芯三且版/g
%s/半𥫗之𠂉丶版/半𥫗鱻鬾𠂉丶版/g
%s/同版𦥯之同版/同版𦥯鱻鬾同版/g
%s/吳之无二与版/吳鱻鬾无二与版/g
%s/头用负之八版/头用负鱻鬾八版/g
%s/害之横顶丰版/害鱻鬾横顶丰版/g
%s/差之撇化羊版/差鱻鬾撇化羊版/g
%s/畱之直化丣版/畱鱻鬾直化丣版/g
%s/着之撇化羊版/着鱻鬾撇化羊版/g
%s/縣之芯三且版/縣鱻鬾芯三且版/g
%s/羗之撇化羊版/羗鱻鬾撇化羊版/g
%s/育之亠厶𠫓版/育鱻鬾亠厶𠫓版/g
%s/衆之丿罒乑版/衆鱻鬾丿罒乑版/g
%s/衰之一卄一版/衰鱻鬾一卄一版/g
%s/辥之撇化屮版/辥鱻鬾撇化屮版/g
%s/風之撇顶䖝版/風鱻鬾撇顶䖝版/g
%s/養之撇化羊版/養鱻鬾撇化羊版/g
%s/鬼之撇化甲版/鬼鱻鬾撇化甲版/g
%s/𣁋之山一几版/𣁋鱻鬾山一几版/g
%s/𣁋之山一王版/𣁋鱻鬾山一王版/g
%s/丰囗或撇顶版/丰鱻馘撇顶版/g
%s/耒囗或撇顶版/耒鱻馘撇顶版/g
%s/天囗或倒二版/天鱻馘倒二版/g
%s/赤囗或直化版/赤鱻馘直化版/g
%s/赫囗或直化版/赫鱻馘直化版/g
%s/者囗或加丶版/者鱻馘加丶版/g
%s/目囗或长腿版/目鱻馘长腿版/g
%s/冒囗或日目版/冒鱻馘日目版/g
%s/肙囗或肉月版/肙鱻馘肉月版/g
%s/罪囗或撇竖版/罪鱻馘撇竖版/g
%s/臿囗或横顶版/臿鱻馘横顶版/g
%s/旣囗或丨二版/旣鱻馘丨二版/g
%s/角囗或两腿版/角鱻馘两腿版/g
%s/言囗或横顶版/言鱻馘横顶版/g
%s/良囗或横顶版/良鱻馘横顶版/g
%s/那囗或双杠版/那鱻馘双杠版/g
%s/者之加丶版/者鱻鬾加丶版/g
%s/鬲之口㐄版/鬲鱻鬾口㐄版/g
%s/且之芯三版/且鱻鬾芯三版/g
%s/冊之双杠版/冊鱻鬾双杠版/g
%s/臿之穿底版/臿鱻鬾穿底版/g
%s/血之丿罒版/血鱻鬾丿罒版/g
%s/𨥫之头留版/𨥫鱻鬾头留版/g
%s/戠之融横版/戠鱻鬾融横版/g
%s/彐之尾大版/彐鱻鬾尾大版/g
%s/䏍之直月版/䏍鱻鬾直月版/g
%s/丑之尾大版/丑鱻鬾尾大版/g
%s/並之虚业版/並鱻鬾虚业版/g
%s/冓之单杠版/冓鱻鬾单杠版/g
%s/凡之几丶版/凡鱻鬾几丶版/g
%s/勇之直用版/勇鱻鬾直用版/g
%s/匕之撇顶版/匕鱻鬾撇顶版/g
%s/卞之亠卜版/卞鱻鬾亠卜版/g
%s/卷之丷龹版/卷鱻鬾丷龹版/g
%s/卸之丄止版/卸鱻鬾丄止版/g
%s/厉之撇顶版/厉鱻鬾撇顶版/g
%s/反之撇顶版/反鱻鬾撇顶版/g
%s/垂之卄艹版/垂鱻鬾卄艹版/g
%s/契之三丰版/契鱻鬾三丰版/g
%s/寽之近爫版/寽鱻鬾近爫版/g
%s/屯之横顶版/屯鱻鬾横顶版/g
%s/干之撇化版/干鱻鬾撇化版/g
%s/戢之融横版/戢鱻鬾融横版/g
%s/斥之乂卜版/斥鱻鬾乂卜版/g
%s/昌之日日版/昌鱻鬾日日版/g
%s/月之弯月版/月鱻鬾弯月版/g
%s/月之直月版/月鱻鬾直月版/g
%s/林之木木版/林鱻鬾木木版/g
%s/正之撇顶版/正鱻鬾撇顶版/g
%s/氐之氏丶版/氐鱻鬾氏丶版/g
%s/氺之八八版/氺鱻鬾八八版/g
%s/率之丷八版/率鱻鬾丷八版/g
%s/用之弯月版/用鱻鬾弯月版/g
%s/用之直月版/用鱻鬾直月版/g
%s/甯之直用版/甯鱻鬾直用版/g
%s/真之芯三版/真鱻鬾芯三版/g
%s/窊之厶瓜版/窊鱻鬾厶瓜版/g
%s/系之撇顶版/系鱻鬾撇顶版/g
%s/肋之弯月版/肋鱻鬾弯月版/g
%s/肥之弯月版/肥鱻鬾弯月版/g
%s/育之直月版/育鱻鬾直月版/g
%s/胡之弯月版/胡鱻鬾弯月版/g
%s/脾之弯月版/脾鱻鬾弯月版/g
%s/與之芯丨版/與鱻鬾芯丨版/g
%s/艾之卄艹版/艾鱻鬾卄艹版/g
%s/角之三腿版/角鱻鬾三腿版/g
%s/貿之头留版/貿鱻鬾头留版/g
%s/靑之直円版/靑鱻鬾直円版/g
%s/麦之龶夂版/麦鱻鬾龶夂版/g
%s/黽之闭肠版/黽鱻鬾闭肠版/g
%s/𠂢之带钩版/𠂢鱻鬾带钩版/g
%s/𠫓之亠厶版/𠫓鱻鬾亠厶版/g
%s/㓞囗或彡版/㓞鱻馘彡版/g
%s/絜囗或彡版/絜鱻馘彡版/g
%s/賣囗或四版/賣鱻馘四版/g
%s/坴囗或儿版/坴鱻馘儿版/g
%s/夌囗或儿版/夌鱻馘儿版/g
%s/巸囗或𦣝版/巸鱻馘𦣝版/g
%s/垔囗或西版/垔鱻馘西版/g
%s/犮囗或乂版/犮鱻馘乂版/g
%s/冏囗或儿版/冏鱻馘儿版/g
%s/气囗或乙版/气鱻馘乙版/g
%s/躳囗或呂版/躳鱻馘呂版/g
%s/似囗或厶版/似鱻馘厶版/g
%s/微囗或儿版/微鱻馘儿版/g
%s/杀囗或𠃊版/杀鱻馘𠃊版/g
%s/㕣囗或儿版/㕣鱻馘儿版/g
%s/倉囗或亼版/倉鱻馘亼版/g
%s/文囗或丄版/文鱻馘丄版/g
%s/於囗或𠂉版/於鱻馘𠂉版/g
%s/半囗或八版/半鱻馘八版/g
%s/关囗或八版/关鱻馘八版/g
%s/劵囗或八版/劵鱻馘八版/g
%s/卷囗或八版/卷鱻馘八版/g
%s/絭囗或八版/絭鱻馘八版/g
%s/空囗或儿版/空鱻馘儿版/g
%s/启囗或戶版/启鱻馘戶版/g
%s/戹囗或戶版/戹鱻馘戶版/g
%s/冢囗或豕版/冢鱻馘豕版/g
%s/丩囗或丄版/丩鱻馘丄版/g
%s/將囗或寽版/將鱻馘寽版/g
%s/夋囗或儿版/夋鱻馘儿版/g
%s/㐄囗或丄版/㐄鱻馘丄版/g
%s/䒑囗或八版/䒑鱻馘八版/g
%s/䍃之爫版/䍃鱻鬾爫版/g
%s/𣴎之氺版/𣴎鱻鬾氺版/g
%s/㓞之丰版/㓞鱻鬾丰版/g
%s/㜸之䒑版/㜸鱻鬾䒑版/g
%s/㡀之丷版/㡀鱻鬾丷版/g
%s/㸒之壬版/㸒鱻鬾壬版/g
%s/䇠之主版/䇠鱻鬾主版/g
%s/亟之了版/亟鱻鬾了版/g
%s/今之亽版/今鱻鬾亽版/g
%s/冗之几版/冗鱻鬾几版/g
%s/函之了版/函鱻鬾了版/g
%s/刍之彐版/刍鱻鬾彐版/g
%s/勺之丶版/勺鱻鬾丶版/g
%s/包之巳版/包鱻鬾巳版/g
%s/匱之目版/匱鱻鬾目版/g
%s/卂之十版/卂鱻鬾十版/g
%s/半之丷版/半鱻鬾丷版/g
%s/卽之皀版/卽鱻鬾皀版/g
%s/呈之王版/呈鱻鬾王版/g
%s/处之卜版/处鱻鬾卜版/g
%s/夒之白版/夒鱻鬾白版/g
%s/奏之天版/奏鱻鬾天版/g
%s/奐之八版/奐鱻鬾八版/g
%s/契之丰版/契鱻鬾丰版/g
%s/奔之廾版/奔鱻鬾廾版/g
%s/宂之几版/宂鱻鬾几版/g
%s/寺之土版/寺鱻鬾土版/g
%s/尚之丷版/尚鱻鬾丷版/g
%s/巤之乂版/巤鱻鬾乂版/g
%s/平之丷版/平鱻鬾丷版/g
%s/弱之冫版/弱鱻鬾冫版/g
%s/戾之户版/戾鱻鬾户版/g
%s/旡之𠃋版/旡鱻鬾𠃋版/g
%s/昝之卜版/昝鱻鬾卜版/g
%s/曷之匃版/曷鱻鬾匃版/g
%s/朗之郎版/朗鱻鬾郎版/g
%s/杀之朩版/杀鱻鬾朩版/g
%s/次之冫版/次鱻鬾冫版/g
%s/殺之术版/殺鱻鬾术版/g
%s/營之吕版/營鱻鬾吕版/g
%s/爵之厶版/爵鱻鬾厶版/g
%s/甚之八版/甚鱻鬾八版/g
%s/畢之甲版/畢鱻鬾甲版/g
%s/疐之乛版/疐鱻鬾乛版/g
%s/益之丷版/益鱻鬾丷版/g
%s/神之礻版/神鱻鬾礻版/g
%s/綿之糹版/綿鱻鬾糹版/g
%s/翟之羽版/翟鱻鬾羽版/g
%s/舋之同版/舋鱻鬾同版/g
%s/虜之田版/虜鱻鬾田版/g
%s/蚤之叉版/蚤鱻鬾叉版/g
%s/蚩之屮版/蚩鱻鬾屮版/g
%s/要之覀版/要鱻鬾覀版/g
%s/賴之𠂊版/賴鱻鬾𠂊版/g
%s/邊之自版/邊鱻鬾自版/g
%s/酋之丷版/酋鱻鬾丷版/g
%s/韋之㐄版/韋鱻鬾㐄版/g
%s/版/版/g
]
===
:执行上面的命令行:
    复制上面的命令行+执行『:@ "』于下面两文件:
    e ./script/hz/部件拆分.py
    e ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt

view others/app/gvim/command-batch-exec.txt
完成囗囗命名模式变更:DONE
doing:DONE
===
]

===


===
===
===
]]
[[
优先级:here
    #底-->高；顶层-->底层；外围-->内层
    囗囗 # partition<left>
        尾注释
    鱻惐 # split
        顶层分支
    囗鱻[馘鬾] # partition<left> at_most1
        整体之版印
        右龘漢鱻馘艹倒日版-->右龘漢囗鱻馘艹倒日版
            ===(右龘漢)囗鱻馘艹倒日版
        纵组林月鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版-->纵组林月囗鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版
            ===(纵组(林,月))囗鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版
            #===(纵组(林鱻鬾魊缺丶朮魊木版,月鱻鬾魊直月魊弯月魊肉月版))
    囗\@<!鱻[馘鬾] # detect after parse atomic_name(单字/无结构特色命名/?括号?)
        原子部件名之版印
        正序纵包龘厂墨鱻鬾黒版
            ===正序纵包(厂,墨鱻鬾黒版)
        丰龶鱻鬾横顶版鱻魊撇顶版
            ===(丰龶)鱻鬾横顶版鱻魊撇顶版
        纵组巫㕣鱻馘头嗇版-->纵组巫鱻馘头嗇版靐㕣-->纵组巫㕣囗鱻魌巫鱻馘头嗇版
            ===纵组((巫)鱻馘头嗇版,㕣)
        横组臣月鱻鬾弯月版
            ===横组(臣,月鱻鬾弯月版)

===
        囜 := [^\U0-\U33FF龘靐鱻麤厵囗或版鱻馘鬾魊魌惐]
        版印囗主体 := 鱻[馘鬾]{囜}+版(鱻魊{囜}+版)*
            # | 鱻鬾(魊{囜}+){2,}版
            | 鱻[馘鬾](魊{囜}+){2,}版
                ++new:馘
        #版印 := {版印囗主体}|(鱻魌{囜}+{版印囗主体})+
        版印 := (鱻魌{囜}+)?{版印囗主体}(鱻魌{囜}+{版印囗主体})*
                ++new:魌
                eg.纵组巫㕣囗鱻魌巫鱻馘头嗇版
                eg.憲鱻魌丰龶鱻鬾横顶版鱻魊撇顶版鱻魊彡版
                eg.奐鱻魌芯鱻鬾魊八魊人魊儿版鱻魌底鱻鬾魊大魊无头六版
        整体之版印 := 囗{版印}$
        原子部件名之版印 := 囗\@<!{版印}($|[囗靐]\@=)

===
]]
[[
选用特殊字符囗口编程标识名用:here
    模板{分隔符}...
===
㘝㘞㘟㘠㘡㘢㘣㘤㘥囙囚四囜囝回因囡团団囤囥囦囧囨囩囫囬园囮囯困囲図围囵囶囷囸囹固囻囼国图囿圀圁圂圃圄圆圇圈圉圊國圌圍圎圏圐圑園圓圔圕圖圗團圙圚圛圜圝圞
grep '[㘝㘞㘟㘠㘡㘢㘣㘤㘥囙囚四囜囝回因囡团団囤囥囦囧囨囩囫囬园囮囯困囲図围囵囶囷囸囹固囻囼国图囿圀圁圂圃圄圆圇圈圉圊國圌圍圎圏圐圑園圓圔圕圖圗團圙圚圛圜圝圞]' /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取拼音.withoutNULL..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
囚:qiu>qiú
四:si>sì
囙:yin>yīn
囜:nin>nín
回:hui>huí
囝:jian,nan>jiǎn,nān
囡:nan>nān
团:tuan>tuán
因:yin>yīn
団:tuan>tuán
囤:dun,tun>dùn,tún
囮:e>é
囫:hu>hú
囥:kang>kàng
困:kun>kùn
囵:lun>lún
围:wei>wéi
园:yuan>yuán
囯:guo>guó
囬:hui>huí
囧:jiong>jiǒng
囨:pian>piān
囲:wei>wéi
図:tu>tú
囦:yuan>yuān
囩:yun>yún
固:gu>gù
国:guo>guó
囹:ling>líng
囷:qun>qūn
图:tu>tú
囶:guo>guó
囻:guo>guó
囸:ri>rì
囼:tai>tāi
囿:you>yòu
圀:guo>guó
圂:hun>hǔn
圃:pu>pǔ
圄:yu>yǔ
圆:yuan>yuán
圁:yin>yín
圈:juan,>juàn,juān,quān
圊:qing>qīng
圉:yu>yǔ
國:guo>guó
圇:lun>lún
圌:chui>chuí
圐:ku>kū
圍:wei>wéi
圏:quan>quān
圎:yuan>yuán
園:yuan>yuán
圓:yuan>yuán
圕:tuan>tuān
圑:pu>pǔ
圔:ya>yà
圙:lve>lüè
團:tuan>tuán
圖:tu>tú
圗:tu>tú
圚:hui>huì
圜:huan,yuan>huán,yuán
圛:yi>yì
圝:luan>luán
圞:luan>luán
==>>
因:yin>yīn
囚:qiu>qiú
困:kun>kùn
团:tuan>tuán
回:hui>huí
囧:jiong>jiǒng
囲:wei>wéi
    太常见

団:tuan>tuán
図:tu>tú
    已经被用过#用于标识方位

囝:jian,nan>jiǎn,nān
囡:nan>nān
    ?

囙:yin>yīn
囜:nin>nín
囮:e>é
囫:hu>hú
囥:kang>kàng
囵:lun>lún
囬:hui>huí
囨:pian>piān
囦:yuan>yuān
囩:yun>yún
圙:lve>lüè
圛:yi>yì
圝:luan>luán
圞:luan>luán
==>>:
囜囮囬圙圛圞:here
===
]]
[[
选用特殊字符囗口鱻后:here
===
grep '[ad],\(.*,\)\?或,' ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt
㖪:a,口,或,
㚜:d,大,或,
㰲:a,或,欠,
㳼:d,或,水,
㽣:a,田,或,
䂸:a,石,或,
䈅:d,𥫗,或,
䍞:d,网,或,
#xxx:䤋:a,酉,或,
䤋:a,酋,或,
䧕:a,阝,或,
䮙:a,馬,或,
䰥:d,或,鬼,
䱛:a,魚,或,
域:a,土,或,
惐:a,忄,或,
惑:d,或,心,
戫:a,有,或,
掝:a,扌,或,
棫:a,木,或,
淢:a,氵,或,
琙:a,王,或,
稢:a,禾,或,
窢:d,或儿版穴,或,
緎:a,糹糸,或,
罭:d,罒,或,
聝:a,耳,或,
蜮:a,虫,或,
馘:a,首,或,

grep '[㖪㚜㰲㳼㽣䂸䈅䍞䤋䧕䮙䰥䱛域惐惑戫掝棫淢琙稢窢緎罭聝蜮馘]' /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取拼音.withoutNULL..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
掝:huo>huò
淢:yu>yù
域:yu>yù
惐:yu>yù
戫:yu>yù
棫:yu>yù
琙:yu>yù
惑:huo>huò
稢:yu>yù
罭:yu>yù
窢:huo>huò
蜮:yu>yù
聝:guo>guó
緎:yu>yù
馘:guo>guó
==>>
惐:yu>yù
罭:yu>yù
惑:huo>huò
窢:huo>huò
馘:guo>guó
===
view ../../python3_src/nn_ns/CJK/CJK_struct/cjk_decomp_0_4_0/cjk-decomp-0.4.0.txt
䬎:sbl(風,或)
魊:sbl(鬼,或)
阈:st(门,或)
閾:st(門,或)
國:s(囗,或)
grep '[䬎魊阈閾國]' /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取拼音.withoutNULL..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
阈:yu>yù
國:guo>guó
閾:yu>yù
魊:yu>yù
==>>
魊:yu>yù
閾:yu>yù
惐:yu>yù
窢:huo>huò
馘:guo>guó
國:guo>guó
魊閾惐窢馘國:here
===
翉:a,本,羽,
呠:a,口,本,
grep '[翉呠]' /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取拼音.withoutNULL..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
呠:pen>pěn
翉:ben>běn
===
grep 支 ../../python3_src/nn_ns/CJK/CJK_struct/cjk_decomp_0_4_0/cjk-decomp-0.4.0.txt
㲍:sbl(支,毛)
㽻:stl(疒,支)
䞚:sbl(走,支)
吱:a(口,支)
庋:stl(广,支)
忮:a(忄,支)
攰:sbl(支,力)
攳:sbl(支,尋)
翄:a(羽,支)
翅:sbl(支,羽)
肢:a(月,支)
鬾:sbl(鬼,支)

grep '[㲍㽻䞚吱庋忮攰攳翄翅肢鬾]' /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取拼音.withoutNULL..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
庋:gui>guǐ
吱:zi,zhi>zī,zhī
忮:zhi>zhì
肢:zhi>zhī
攰:gui>guì
攳:xun>xún
翅:chi>chì
翄:chi>chì
鬾:ji>jì
==>>
吱:zi,zhi>zī,zhī
肢:zhi>zhī
    枝zhi~之
鬾:ji>jì
    鬾:鬼~魊
===
grep 鬼 ../../python3_src/nn_ns/CJK/CJK_struct/cjk_decomp_0_4_0/cjk-decomp-0.4.0.txt
䫥:sbl(鬼,頁)
䰠:sbl(鬼,申)
䰡:sbl(鬼,失)
䰢:sbl(鬼,行)
䰣:sbl(鬼,网)
䰦:sbl(鬼,卑)
䰧:sbl(鬼,虎)
䰨:sbl(鬼,眉)
䰫:sbl(鬼,堯)
䰬:sbl(鬼,19988)
䰮:sbl(鬼,義)
䰯:sbl(鬼,疑)
鬽:sbl(鬼,彡)
鬾:sbl(鬼,支)
鬿:sbl(鬼,斤)
魀:sbl(鬼,介)
魁:sbl(鬼,斗)
魃:sbl(鬼,犮)
魅:sbl(鬼,未)
魆:sbl(鬼,戉)
魈:sbl(鬼,肖)
魉:sbl(鬼,两)
魊:sbl(鬼,或)
魋:sbl(鬼,隹)
魌:sbl(鬼,其)
魍:sbl(鬼,罔)
魎:sbl(鬼,兩)
魐:sbl(鬼,兼)
魑:sbl(鬼,离)
魒:sbl(鬼,票)
魓:sbl(鬼,畢)
魕:sbl(鬼,幾)
魖:sbl(鬼,虚)
𠺌:a(口,鬼)
愧:a(忄,鬼)
溾:a(氵,鬼)
䰩:a(者,鬼)
䰭:a(𦓔,鬼)
䰥:d(或,鬼)
魙:d(漸,鬼)
廆:stl(广,鬼)
瘣:stl(疒,鬼)
魇:stl(厌,鬼)
魔:stl(麻,鬼)
魘:stl(37069,鬼)

䫥䰠䰡䰢䰣䰦䰧䰨䰫䰬䰮䰯鬽鬾鬿魀魁魃魅魆魈魉魊魋魌魍魎魐魑魒魓魕魖
廆瘣魇魔魘
𠺌愧溾䰩䰭䰥魙
grep '[䫥䰠䰡䰢䰣䰦䰧䰨䰫䰬䰮䰯鬽鬾鬿魀魁魃魅魆魈魉魊魋魌魍魎魐魑魒魓魕魖]' /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取拼音.withoutNULL..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
鬽:mei>mèi
魁:kui>kuí
魀:ga>gà
鬾:ji>jì
鬿:qi>qí
魃:ba>bá
魅:mei>mèi
魆:xu>xū
魉:liang>liǎng
魈:xiao>xiāo
魋:tui>tuí
魍:wang>wǎng
魊:yu>yù
魎:liang>liǎng
魌:qi>qī
魑:chi>chī
魓:bi>bì
魐:gan>gān
魒:piao>piāo
魖:xu>xū
魕:ji>jī
grep '[廆瘣魇魔魘]' /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取拼音.withoutNULL..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
廆:gui,hui,wei>guī,huì,wěi
瘣:hui>huì
魇:yan>yǎn
魔:mo>mó
魘:yan>yǎn
grep '[𠺌愧溾䰩䰭䰥魙]' /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取拼音.withoutNULL..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
溾:ai>āi
愧:kui>kuì
魙:zhan>zhān
==>>
鬽:mei>mèi
魀:ga>gà
鬾:ji>jì
魊:yu>yù
魌:qi>qī
魑:chi>chī
魓:bi>bì
魐:gan>gān
魒:piao>piāo
魖:xu>xū
===
\<或vx-->窢vx
x之或v或u版-->x鱻鬾魊v魊u版
x之v版-->x鱻鬾v版
x之v版囗或u版-->x鱻鬾v版鱻魊u版
x囗或v版-->x鱻馘v版
x囗或v版囗或u版-->x鱻馘v版鱻魊u版
x囗或y-->x鱻惐y
窢:huo>huò
鬾:ji>jì
魊:yu>yù
馘:guo>guó
惐:yu>yù
===
===
]]
[[
选用特殊字符:here
笔画数最多:龘䲜䨻,靐齉䴒齾䴒䶫䯂
䨻1452444425121145244442512114524444251211452444425121
龘414312511151511141431251115151114143125111515111
䲜35251214444352512144443525121444435251214444
靐145244442512114524444251211452444425121
齉325111251211321251245251251112213534
䴒14524444251251251123434132511154444
齾21531512512543121344212134341343452
䴒14524444251251251123434132511154444
䶫2121343413434522512511351221113134
䯂1211254444121125444412112544441234

查拼音:[龘䲜䨻]
查拼音:[靐齉䴒齾䴒䶫䯂]
    #不冠[,:] 比如:『:骉（驫）』
    #
:龘dá
:靐bìng
:齉nàng
:齾yà
查无:䲜龘
查无:䴒䴒䶫䯂
有拼音:龘靐齉齾
查解释:[鱻麤厵驫雧飝灥飍馫]
===
view /sdcard/0my_files/tmp/out4py/汉语字典囗.py..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
view ./script/汉语字典囗.py
ls /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/ -1 -v
    ==>> 笔画数 [1..=36,39,48]
#补偿{{[[
%s/"}],"/"}]\r,"/g
%s/^.*"\(.\)","py":"\([^"]*\)".*$/    \1\2
#补偿]]??很奇怪
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/48
    龘dá
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/39
    靐bìng
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/36
    齉nàng
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/35
    齾yà
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/34
    龗líng
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/33
    爩yù
    鱻xiān
    麤cū
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/32
    灪yù
    籲yù
    龖dá
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/31
    灩yàn
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/30
    厵yuán
    爨cuàn
    癵luán
    籱zhuó
    饢náng
    驫biāo
    鱺lí
    鸝lí
    麣yán
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/29
    虋mén
    纞liàn
    讟dú
    靏he
    钃zhú
    韊lán
    驪lí
    鬱yù
    鸜qú
    麷fēng
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/28
    囖luó
    戇gàng
    欟guàn
    爧líng
    jué
    癴luán
    躨kuí
    豔yàn
    雧jí
    钀niè
    鑿záo
    驨xí
    鱹guàn
    鸙yuè
    麢líng
    黸lú
    鼺léi
    齽jìn
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/27
    飝fēi
    灧yàn
    犫chōu
    灥xún
    纜lǎn
    蠿zhuó
    軉yu
    讜dǎng
    貜jué
    躩jué
    豓yàn
    靋lì
    饡zàn
    鑻pàn
    鑾luán
    飍xiū
    顳niè
    馫xīn
    驡lóng
    鬤ráng
    鬰yù
    鱸lú
    鸗lóng
    黷dú
    齈nòng
    龞biē
view /sdcard/0my_files/unzip/apk/dictionary/han_yu_zi_dian/assets/sr/24
    儾nàng
    壩bà
    虈xiāo
    灟zhú
    攭lì
    屭xì
    巙kuí
    囕ra,mo
    孎zhú
    瓛huán
    斖wěi
    欗lán
    爣tǎng
    曭tǎng
    穲lí
    瓥lì
    羉luán
    襹shī
    癲diān
    矕mǎn
    礹yán
    纗zuī
    艷yàn
    纛dào
    衢qú
    衋xì
    籬lí
    艭shuāng
    蠶cán
    贜zāng
    軈yā,gā,tēi
    讑yào
    醿mí
    貛huān
    躟ráng
    觀guān
    雥zá
    靇lóng
    饝mó
    鑬jiàn
    鑫xīn
    韇dú
    韥dú
    顰pín
    驟zhòu
    鬢bìn
    鱡zéi
    鸅zé
    麠jīng
    鹼jiǎn
    黌hóng
    鼉tuó
    鼞tāng
    齅xiù
    齳yǔn
===
候选特殊字符:
    48龘dá
    39靐bìng #还行:䨻
    33鱻xiān #还行:䲜
    33麤cū
    30厵yuán
    30驫biāo #否决!!䯂
    28雧jí
    27飝fēi
    27灥xún
    27飍xiū
    27馫xīn
    24屭xì
    24雥zá #否决!!雧,雦
    24鑫xīn
候选特殊字符:龘dá靐bìng鱻xiān麤cū厵yuán
    龘靐鱻麤厵:here
===
,龖
:20627:龍:32:41431251115151114143125111515111:uegd:da:dá
:龖dá
/双龙：“龖之赫，霆之砉。”
/龙腾飞的样子。
,龘
:20629:龍:48:414312511151511141431251115151114143125111515111:uegd:da:dá
:龘dá
/古同“龖”，龙腾飞的样子。

,靐
:19022:雨:39:145244442512114524444251211452444425121:flfl:bing:bìng
:靐bìng
/〔靐靐〕雷声。

,齉
:20566:鼻:36:325111251211321251245251251112213534:thle:nang:nàng
:齉nàng
/鼻子不通气，发音不清：齉鼻子。

,齾
:20617:齒:35:21531512512543121344212134341343452:hagb:ya:yà
:齾yà
/缺齿。
/（器物）缺损：“每行凡七十九字，其下多断齾不存。”

,厵
:319:厂:30:133251123413325112341332511234:drii:yuan:yuán
:厵yuán
/古同“源”。

,飝
:3385:飞:27:534353432534353432534353432:nuth:fei:fēi
:飝fēi
/义未详。

,骉
:4505:马:9:551551551:cccf:biao:biāo
:骉（驫）
/biāo
/众马奔腾的样子。

,灥
:11567:水:27:325112534325112534325112534:riri:xun:xún
:灥xún
/三泉。
/
/灥
/quán
/古同“泉”。
/
/灥
/quàn
/下雨而泉水出。

,雧
:19069:隹:28:3241112132411121324111211234:wyws:ji:jí
:雧jí
/古同“集”，群鸟落于木上。

,飍
:19107:風:27:353251214353251214353251214:mtjj:xiu:xiū
:飍xiū
/惊跑的样子：“驰谢如惊飍。”

,馫
:19340:香:27:312342511312342511312342511:tjtj:xin:xīn
:馫xīn
/古同“馨”。

,驫
:19762:馬:30:121125444412112544441211254444:cccu:biao:biāo
:驫biāo
/见“骉”。

,麤
:19820:鹿:33:413522115354135221153541352211535:ynjx:cu:cū
:麤cū
/同“粗”。

,鱻
:20446:魚:33:352512144443525121444435251214444:qoqo:xian:xiān
:鱻xiān
/古同“鲜”。

]]
[[
提取笔顺码暨比较:here
===
view /sdcard/0my_files/tmp/out4py/汉语字典囗.py..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
    see:提取笔顺码暨比较
view /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取笔顺码..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
    total:21004 line:ok
    368KB
===
比较:
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/单字_笔顺码_29685个.txt
    ---
    view /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取笔顺码..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
        view /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取笔顺码.withoutNULL..nn_ns.fileformat.sqlite3_dump_cmd.out.txt

比较笔顺码囗囗汉语字典囗囗汉字笔顺表囗
[加载笔顺码囗囗汉语字典囗():
    ValueError: ('衖', '332122134112', '332122513511112')
===:
,衖
:20957:行:12:332122134112:tawh:xiang:xiàng
:衖
/xiàng
/古同“巷”：“金家香衖千轮鸣。”
,衖
:20958:行:15:332122513511112:tawh:hu:hú
:衚
/hú
/〔衚衕〕同“胡同”，巷。
,衚
:20959:行:15:332431325111112:tdeh:dao:dào
:衜
/dào
/古同“道”。
,衞
:20960:行:16:3325212511252112:tnhh:wei:wèi
:衞
/wèi
/同“衛”。
,衟
:...
...
===
汉语字典:
    衖:332122134112
    衖:332122513511112-->衚
    衚:332431325111112-->衜
    衞:3325212511252112
汉字笔顺表:
    衖332122134112
    衚332122513511112
    衜332431325111112
    衞3325212511252112
===
]

py_adhoc_call   script.hz.部件拆分   @比较笔顺码囗囗汉语字典囗囗汉字笔顺表囗 :/sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取笔顺码.withoutNULL..nn_ns.fileformat.sqlite3_dump_cmd.out.txt -patch  > /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..比较笔顺码囗囗汉语字典囗囗汉字笔顺表囗.out.txt
[
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..比较笔顺码囗囗汉语字典囗囗汉字笔顺表囗.out.txt
    感觉 汉语字典 错的比较多，例如『龟:^351_-->352_』『傤:"u"-->5』『:笔划却是:𦍌』
        但 笔顺码 多种可能『來:木人人:一从小』『門:冂二冂二:彐丨冂二』
    ---
    dict4news empty
    dict4bug: total 555==558-3
===:
######################
######################
丣u4E23h !1321551 =1315251
丱u4E31h !53221 =53212
乀u4E40h !4 =5
乁u4E41h !4 =5
亪u4EAAh !4132344 =4132345
來u4F86h !12343434 =13434234
俙u4FD9h !323413252 =323413251
倈u5008h !3212343434 =3213434234
們u5011h !3225112511 =3251122511
xxx傤u50A4h !321211521534 =321211521u34
僀u50C0h !3213221545252 =3212213545252
僩u50E9h !32251125113511 =32511225113511
僴u50F4h !32251125112511 =32511225112511
僶u50F6h !322511251211511 =32251251115151
儃u5103h !324125251125111 =324125151125111
儕u5115h !3241432533543211 =3241432533543112
兤u5164h !24313541312212512134 =24313512212512134
凝u51DDh !4135311345452134 =4135322345452134
剰u5270h !31122123422 =31212213422
剿u527Fh !5552511123422 =5551511123422
勑u52D1h !1234343453 =1343423453
叀u53C0h !12512154 =12511254
唻u553Bh !25112343434 =25113434234
問u554Fh !25112511251 =51122511251
嗤u55E4h !2515221251214 =2512521251214
嘨u5628h !25151123243134 =25151124313432
嘯u562Fh !2515112322151512 =2515112321155212
噺u567Ah !2514143112343312 =2514143112353312
嚃u5683h !2512522123344454 =2511522113344454
嚏u568Fh !25112452512152134 =25112452512152124
嚨u56A8h !2514143125111515111 =25141431251121515111
嚪u56AAh !2512511251135321511 =2515112251135321511
嚱u56B1h !25121531512514311534 =25121531512514311523
囊u56CAh !1251245251251112213534 =1251245251251112213524
囒u56D2h !25112225112511125431234 =25112251122511125431234
囼u56FCh !25542511 =25532511
園u5712h !2512125132341 =2512125132541
坰u5770h !12125251 =121251251
塄u5844h !121252214153 =121251124153
塍u584Dh !3511431134121 =2511431134121
墆u5886h !12113221545252 =12112213545252
增u589Eh !121432524312511 =121431524312511
墹u58B9h !121251125112511 =121511225112511
墾u58BEh !3443533511534121 =3443533511234121
壛u58DBh !1212511251135321511 =1215112251135321511
壟u58DFh !4143125111515111121 =41431251121515111121
壠u58E0h !1214143125111515111 =12141431251121515111
壣u58E3h !12112211155455453221 =12112211155455453212
壽u58FDh !12151211251124 =12151211251154
変u5909h !412234354 =413234354
夓u5913h !3211132511151134354 =132511135151134354
奕u5955h !413234134 =413234132
奫u596Bh !134441322151512 =134441321155212
妴u59B4h !35455531 =35355531
委u59D4h !31234531 =31234534
婡u5A61h !53112343434 =53113434234
婣u5A63h !531322151512 =531321155212
婲u5A72h !5311223235 =5131223235
嫘u5AD8h !53125121554234 =53125121554134
嫟u5ADFh !5311122132515 =5311122131515
嫺u5AFAh !531251125113511 =531511225113511
嫻u5AFBh !531251125111234 =531511225111234
嫿u5AFFh !531511121251211 =531511211251211
嬒u5B12h !5313412524312511 =5313412514312511
嬙u5B19h !5311234341252511 =5311234341251511
嬭u5B2Dh !53113425234343434 =53123425234343434
孄u5B44h !53125112511125431234 =53151122511125431234
孈u5B48h !531252324111212534251 =531252324111212534252
孏u5B4Fh !53112225112511125431234 =53112251122511125431234
字u5B57h !445521 =425521
孶u5B76h !122554554521 =4155441554521
宺u5BBAh !4452511325 =4452511235
寵u5BF5h !4454143125111515111 =44541431251121515111
寷u5BF7h !445211121112521251431 =445111221112521251431
専u5C02h !125121124 =125112124
岼u5CBCh !25214312 =25212312
崍u5D0Dh !25212343434 =25213434234
崫u5D2Bh !25251352252 =25251342252
嵽u5D7Dh !25213221545252 =25212213545252
巃u5DC3h !2524143125111515111 =25241431251121515111
巄u5DC4h !2524143125111515111 =25241431251121515111
巉u5DC9h !25235251153535251354 =25234251153434251354
巐u5DD0h !252412512525125113132 =252412512525125113312
巔u5DD4h !2521225111134132511134 =25212251111341325111134
巕u5DD5h !2524313251514143112521 =2524313251514143112531
帰u5E30h !2351145252 =4351145252
帶u5E36h !13221545252 =12213545252
幤u5E64h !243252513134252 =243251513134252
幱u5E71h !25225112511125431234 =2525112151125431234
庲u5EB2h !41312343434 =41313434234
廗u5ED7h !41313221545252 =41312213545252
廧u5EE7h !4131234341252511 =4131343421252511
廨u5EE8h !4133535112533112 =4133525112533112
廰u5EF0h !41312211112252214544 =41312211113252214544
弬u5F2Ch !5151225125 =5151251225
彇u5F47h !5155112322151512 =5155112321155212
彘u5F58h !551153113435 =551311341535
徍u5F8Dh !332121121 =552121121
徠u5FA0h !33212343434 =33213434234
德u5FB7h !332122522114544 =332132522114544
忚u5FDAh !442525 =442515
恵u6075h !1251214544 =1251124544
悝u609Dh !4422511211 =4422511122
悳u60B3h !122511154544 =132511154544
悶u60B6h !251125114544 =511225114544
悻u60BBh !44212143112 =44212143221
惢u60E2h !454445444544 =354435443544
惸u60F8h !442352511521 =44235251521
愄u6104h !442251211534 =442251211234
愶u6136h !4425353532511 =4225353532511
慸u6178h !132215452524544 =122135452524544
憖u6196h !1234343413444544 =1343423413444544
憗u6197h !1234343431344544 =1343434231344544
憪u61AAh !442251125113511 =442511225113511
憫u61ABh !442251125114134 =442511225114134
憴u61B4h !4422511251211511 =442251251115151
懘u61D8h !441132215452524544 =441122135452524544
戶u6236h !3351 =3513
戼u623Ch !5151251 =13151251
捫u636Bh !12125112511 =12151122511
搑u6411h !121122122111 =121122122112
搿u643Fh !31133412513112 =31123412513112
摍u644Dh !12144532132511 =12144532131511
摑u6451h !12125125115341 =1212512515341
摕u6455h !12113221545252 =12112213545252
撊u648Ah !121251125113511 =121511225113511
撋u648Bh !121251125111121 =121511225111121
擙u64D9h !121325431234134 =1213253431234134
擱u64F1h !12125112511354251 =12151122511354251
攔u6514h !12125112511125431234 =12151122511125431234
敵u6575h !414325122513134 =414325122513234
敻u657Bh !352534251113134 =35253425111354
斄u6584h !1123431341312343434 =1123431341313434234
斕u6595h !413425112511125431234 =413451122511125431234
曀u66C0h !2511121451251431 =2511121451251341
曄u66C4h !25111221122112 =251112211212112
曨u66E8h !25114143125111515111 =251141431251121515111
朧u6727h !35114143125111515111 =351141431251121515111
枾u67BEh !123412321 =123413122
桺u687Ah !12341321551 =12341153512
棩u68E9h !1234322151512 =1234321155212
棶u68F6h !123412343434 =123413434234
椚u691Ah !123425112511 =123451122511
極u6975h !123452251541 =123452151541
榌u698Ch !1234534335342 =1234534353432
様u69D8h !123443112124134 =12344311212534
樮u6A2Eh !12341252214334 =123412212514334
橌u6A4Ch !1234251125113511 =1234511225113511
橍u6A4Dh !1234251125111121 =1234511225111121
橚u6A5Ah !12345112322151512 =12345112321155212
橺u6A7Ah !1234251125112511 =1234511225112511
櫊u6ACAh !123425112511354251 =123451122511354251
櫚u6ADAh !123425112511251251 =123451122511251251
櫩u6AE9h !12342511251135321511 =12345112251135321511
櫳u6AF3h !12344143125111515111 =123441431251121515111
櫷u6AF7h !123432511255115115341 =12343251253415511511
櫹u6AF9h !12341225112322151512 =12341225112321155212
欄u6B04h !123425112511125431234 =123451122511125431234
欗u6B17h !123412225112511125431234 =123412251122511125431234
欫u6B2Bh !31121213534 =3112153534
歗u6B57h !51123221515123534 =51123211552123534
歿u6B7Fh !13543554 =13545354
殢u6BA2h !135413221545252 =135412213545252
沒u6C92h !4413554 =4415354
涐u6D90h !4413121534 =4413151534
淵u6DF5h !441322151512 =441312155212
淶u6DF6h !44112343434 =44113434234
湽u6E7Dh !441155525121 =441555125121
滙u6ED9h !4411324111215 =1441324111215
滯u6EEFh !44113221545252 =44112213545252
潚u6F5Ah !4415112322151512 =4415112321155212
潣u6F63h !441251125114134 =441511225114134
潤u6F64h !441251125111121 =441511225111121
澖u6F96h !441251125111234 =441511225111234
澗u6F97h !441251125112511 =441511225112511
澠u6FA0h !4412511251211511 =441251251115151
濶u6FF6h !44125112511312251 =44151122511312251
瀒u7012h !441123434341252511 =441134342341252511
瀟u701Fh !4411225112322151512 =4411225112321155212
瀧u7027h !4414143125111515111 =44141431251121515111
瀾u703Eh !44125112511125431234 =44151122511125431234
灁u7041h !44125112511325112534 =44151122511325112534
灃u7043h !441211121112521251431 =441111221112521251431
灍u704Dh !441251125114315233534 =441511225114315233534
灛u705Bh !44125112511251251251112 =44151122511251251251112
灡u7061h !44112225112511125431234 =44112251122511125431234
灧u7067h !441211121112521251431355215 =441111221112521251431355215
灩u7069h !4412111211125212514311215425221 =4411112211125212514311215425221
灪u706Ah !44112343112521234453444445215333 =44112343112521234453444445235333
焛u711Bh !251125114334 =511225114334
煕u7155h !1251255154444 =1512255154444
熌u718Ch !43342511251134 =43345112251134
熽u71BDh !43345112322151512 =43345112321155212
燗u71D7h !4334251125113511 =4334511225113511
燘u71D8h !4334251125114134 =4334511225114134
燛u71DBh !5215211251254334 =12152211251254334
爋u720Bh !43343125431211444453 =43343125431211534444
爓u7213h !43342511251135321511 =43345112251135321511
爖u7216h !43344143125111515111 =433441431251121515111
爛u721Bh !433425112511125431234 =433451122511125431234
爤u7224h !433412225112511125431234 =433412251122511125431234
犙u7299h !312154545434333 =312154545434444
犜u729Ch !3121412515213134 =3121312515213134
狌u72CCh !35331121 =34331121
狦u72E6h !353252211 =353251122
猌u730Ch !123434341344 =134342341344
猍u730Dh !35312343434 =35313434234
獒u7352h !11215331341344 =11213531341344
獡u7361h !353321511354444 =35332151154444
琜u741Ch !112112343434 =112113434234
璛u749Bh !11215112322151512 =11215112321155212
瓏u74CFh !11214143125111515111 =112141431251121515111
瓓u74D3h !112125112511125431234 =112151122511125431234
甴u7534h !25211 =25121
畵u7575h !5111212512152 =5111212512154
癇u7647h !41341251125113511 =41341511225113511
癎u764Eh !41341251125112511 =41341511225112511
癠u7660h !4134141432533543211 =4134141432533543112
睞u775Eh !2511112343434 =2511113434234
瞤u77A4h !25111251125111121 =25111511225111121
瞯u77AFh !25111251125113511 =25111511225113511
瞷u77B7h !25111251125112511 =25111511225112511
矓u77D3h !251114143125111515111 =2511141431251121515111
矙u77D9h !251112511251151221113134 =251115112251151221113134
碛u789Bh !1325111212534 =13251112125134
磵u78F5h !13251251125112511 =13251511225112511
礀u7900h !13251251125113511 =13251511225113511
礱u7931h !414312511151511113251 =4143125112151511113251
礲u7932h !132514143125111515111 =1325141431251121515111
祂u7942h !4524525 =4524515
祳u7973h !45241311534 =45241322534
穂u7A42h !312341251214544 =312341251124544
竈u7AC8h !445341212511251211511 =44534121251251115151
竉u7AC9h !445344143125111515111 =4453441431251121515111
箂u7B82h !31431412343434 =31431413434234
簆u7C06h !31431444511352154 =31431444511353134
簘u7C18h !31431451123243134 =31431451124313432
簡u7C21h !314314251125112511 =314314511225112511
簢u7C22h !314314251125114134 =314314511225114134
簫u7C2Bh !3143145112322151512 =3143145112321155212
籠u7C60h !3143144143125111515111 =31431441431251121515111
籣u7C63h !31431425112511125431234 =31431451122511125431234
粛u7C9Bh !51123243134 =51124313432
糷u7CF7h !43123412225112511125431234 =43123412251122511125431234
綄u7D84h !5544444451135 =5544444452235
縷u7E37h !55444425112512531 =55444425112512534
繍u7E4Dh !55444451123243134 =55444451124313432
繝u7E5Dh !554444251125113511 =554444511225113511
繡u7E61h !5544445112322151512 =5544445112321155212
繣u7E63h !554444511121251211 =554444511211251211
繩u7E69h !5544442511251211511 =554444251251115151
纛u7E9Bh !1121554142511112343554234 =112155212511112343554234
缻u7F3Bh !3112521554 =5112521554
罇u7F47h !311252431253511124 =311252431253411124
罾u7F7Eh !25221432524312511 =25221432514312511
羋u7F8Bh !21221112 =12121112
羐u7F90h !122121354 =2121121354
翗u7FD7h !354354541541 =354355541541
耍u800Dh !132522531 =132522513
聀u8040h !1221111534 =1221111535
聒u8052h !122111312251 =122111321251
聞u805Eh !25112511122111 =51122511122111
聾u807Eh !4143125111515111122111 =41431251121515111122111
肅u8085h !5112322151512 =5112321155212
膢u81A2h !351125112512531 =351125112512534
膶u81B6h !3511251125111121 =3511511225111121
臦u81E6h !521521125125 =1215221125125
臩u81E9h !52152112512513432 =121522112512513432
舢u8222h !335414252 =335414251
艜u825Ch !33541413221545252 =33541412213545252
艷u8277h !211121112521251431355215 =111221112521251431355215
菕u83D5h !12234125122 =12235125122
菛u83DBh !12225112511 =12251122511
萊u840Ah !12212343434 =12213434234
萏u840Fh !12235321511 =12235312511
葘u8458h !122155525121 =122555125121
蒮u84AEh !1224532411121 =1224532511121
蓐u84D0h !1221311534124 =1221311543124
蔄u8504h !12225112511251 =12251122511251
蔅u8505h !12225112511531 =12251122511531
蔕u8515h !12213221545252 =12212213545252
蕄u8544h !122251125114544 =122511225114544
蕑u8551h !122251125113511 =122511225113511
蕭u856Dh !1225112322151512 =1225112321155212
蕳u8573h !122251125112511 =122511225112511
薗u8597h !1222512125132341 =1222512125135341
藺u85FAh !1222511251132411121 =1225112251132411121
蘢u8622h !1224143125111515111 =12241431251121515111
蘭u862Dh !12225112511125431234 =12251122511125431234
蘴u8634h !122211121112521251431 =122111221112521251431
虁u8641h !1221325111212151534354 =122431325111212151534354
虈u8648h !122251251132511134251251 =122132511134251251251251
虌u864Ch !122432523431342511251211511 =12243252343134251125511151
蜵u8735h !251214322151512 =251214321155212
螮u87AEh !25121413221545252 =25121412213545252
蟬u87ECh !251214251251251112 =251214251251251121
蟰u87F0h !2512145112322151512 =2512145112321155212
蠅u8805h !2512142511251211511 =251214251251115151
蠨u8828h !2512141225112322151512 =2512141225112321155122
蠪u882Ah !4143125111515111251214 =41431251115151121251214
蠬u882Ch !2512144143125111515111 =25121441431251121515111
蠿u883Fh !554554155455421251214251214 =554554155455412251214251214
衝u885Dh !332312511211112 =331312511211112
裫u88EBh !45234322151512 =45234321155212
襇u8947h !45234251125112511 =45234511225112511
襉u8949h !45234251125113511 =45234511225113511
襲u8972h !4143125111515111413534 =41431251121515111413534
襴u8974h !4523425112511125431234 =4523451122511125431234
襽u897Dh !4523412225112511125431234 =4523412251122511125431234
覵u89B5h !2511251135112511135 =5112251135112511135
覸u89B8h !2511251125112511135 =5112251125112511135
誺u8ABAh !411125112343434 =411125113434234
誾u8ABEh !251125114111251 =511225114111251
論u8AD6h !411125134125122 =411125135125122
譋u8B4Bh !4111251251125113511 =4111251511225113511
譝u8B5Dh !41112512511251211511 =4111251251251115151
讇u8B87h !41112512511251135321511 =41112515112251135321511
讋u8B8Bh !41431251115151114111251 =414312511215151114111251
讕u8B95h !411125125112511125431234 =411125151122511125431234
谀u8C00h !4532151134 =4531251134
谻u8C3Bh !34342515113 =34342515112
豐u8C50h !211121112521251431 =111221112521251431
豒u8C52h !2111211125212514314351523 =1112211125212514314351523
豓u8C53h !211121112521251431134425221 =111221112521251431134425221
豔u8C54h !2111211125212514311215425221 =1112211125212514311215425221
豳u8C73h !21353334135333452 =13533342135333452
賚u8CDAh !123434342511134 =134342342511134
贚u8D1Ah !25111344143125111515111 =251113441431251121515111
蹐u8E50h !25121214134342511 =25121214133442511
蹛u8E5Bh !251212113221545252 =251212112213545252
蹭u8E6Dh !2512121432524312511 =2512121431524312511
躙u8E99h !25121212511251132411121 =25121215112251132411121
躝u8E9Dh !251212125112511125431234 =251212151122511125431234
躢u8EA2h !2512121251125112511541541 =2512121511225112511541541
躪u8EAAh !25121211222511251132411121 =25121211225112251132411121
輤u8F24h !125111211212511 =1251112112121511
輺u8F3Ah !1251112155525121 =1251112555125121
轥u8F65h !12511121222511251132411121 =12511121225112251132411121
逨u9028h !12343434454 =13434234454
遰u9070h !13221545252454 =12213545252454
還u9084h !2522112513534454 =2522112513234454
郲u90F2h !1234343452 =1343423452
鄜u911Ch !4135221151552 =4135221153552
鄳u9133h !251125121151152 =25125111515152
酆u9146h !21112111252125143152 =11122111252125143152
錄u9304h !3411243155124134 =3411243151124134
錸u9338h !3411243112343434 =3411243113434234
鍆u9346h !3411243125112511 =3411243151122511
鍿u937Fh !34112431155525121 =34112431555125121
鏽u93FDh !341124315112322151512 =341124315112321155212
鐗u9417h !34112431251125113511 =34112431511225113511
鐦u9426h !34112431251125111132 =34112431511225111132
鐧u9427h !34112431251125112511 =34112431511225112511
鑨u9468h !341124314143125111515111 =3411243141431251121515111
鑭u946Dh !3411243125112511125431234 =3411243151122511125431234
钄u9484h !3411243112225112511125431234 =3411243112251122511125431234
钸u94B8h !3111513252 =3111513251
铆u94C6h !3111535352 =3111535351
镌u954Ch !311153241112153 =31153241112153
镧u9567h !31115425125431234 =31115425125341234
門u9580h !25112511 =51122511
閁u9581h !251125113 =511225113
閂u9582h !251125111 =511225111
閃u9583h !2511251134 =5112251134
閄u9584h !2511251134 =5112251134
閅u9585h !2511251112 =5112251112
閆u9586h !25112511111 =51122511111
閇u9587h !25112511124 =51122511124
閈u9588h !25112511112 =51122511112
閉u9589h !25112511123 =51122511123
閊u958Ah !25112511252 =51122511252
開u958Bh !251125111132 =511225111132
閌u958Ch !251125114135 =511225114135
閍u958Dh !251125114153 =511225114153
閎u958Eh !251125111354 =511225111354
閏u958Fh !251125111121 =511225111121
閐u9590h !251125113115 =511225113115
閑u9591h !251125111234 =511225111234
閒u9592h !251125113511 =511225113511
間u9593h !251125112511 =511225112511
閔u9594h !251125114134 =511225114134
閕u9595h !251125111523 =511225111523
閖u9596h !251125112534 =511225112534
閗u9597h !251125114412 =511225114412
閘u9598h !2511251125112 =5112251125112
閙u9599h !2511251141252 =5112251141252
閚u959Ah !2511251141431 =5112251141431
閛u959Bh !2511251114312 =5112251114312
閜u959Ch !2511251112512 =5112251112512
閝u959Dh !2511251134454 =5112251134454
閞u959Eh !2511251154132 =5112251154132
閟u959Fh !2511251145434 =5112251145434
閠u95A0h !2511251111214 =5112251111214
閡u95A1h !25112511415334 =51122511415334
関u95A2h !25112511431134 =51122511431134
閣u95A3h !25112511354251 =51122511354251
閤u95A4h !25112511341251 =51122511341251
閥u95A5h !25112511321534 =51122511321534
閦u95A6h !25112511343434 =51122511343434
閧u95A7h !25112511122134 =51122511122134
閨u95A8h !25112511121121 =51122511121121
閩u95A9h !25112511251214 =51122511251214
閪u95AAh !25112511125351 =51122511125351
閫u95ABh !251125112512341 =511225112512341
閬u95ACh !251125114511534 =511225114511534
閭u95ADh !25112511251251 =51122511251251
閮u95AEh !25112511312154 =51122511312154
閯u95AFh !251125114412343 =511225114412343
閰u95B0h !25112511321511 =51122511321511
閱u95B1h !251125113425135 =511225113425135
閲u95B2h !251125114325135 =511225114325135
閳u95B3h !251125111251112 =511225111251112
閴u95B4h !251125112511134 =511225112511134
閵u95B5h !2511251132411121 =5112251132411121
閶u95B6h !2511251125112511 =5112251125112511
閷u95B7h !3412342511251134 =3412345112251134
閸u95B8h !2511251112155121 =5112251112155121
閹u95B9h !2511251113425115 =5112251113425115
閺u95BAh !2511251125114134 =5112251125114134
閻u95BBh !2511251135321511 =5112251135321511
閼u95BCh !2511251141533444 =5112251141533444
閽u95BDh !2511251135152511 =5112251135152511
閾u95BEh !2511251112511534 =5112251112511534
閿u95BFh !2511251134434554 =5112251134434554
闀u95C0h !25112511122134515 =51122511122134515
闁u95C1h !2511251125112511 =5112251151122511
闂u95C2h !2511251143113455 =5112251143113455
闃u95C3h !25112511251111344 =51122511251111344
闄u95C4h !25112511125221531 =51122511125221531
闅u95C5h !25112511251112154 =51122511251112154
闆u95C6h !25112511251251251 =51122511251251251
闇u95C7h !25112511414312511 =51122511414312511
闈u95C8h !25112511521251152 =51122511521251152
闉u95C9h !25112511125221121 =51122511125221121
闊u95CAh !25112511441312251 =51122511441312251
闋u95CBh !25112511543341134 =51122511543341134
闌u95CCh !25112511125431234 =51122511125431234
闍u95CDh !2511251112132511 =5112251112132511
闎u95CEh !25112511325112534 =51122511325112534
闏u95CFh !25112511353251214 =51122511353251214
闐u95D0h !251125111225111134 =511225111225111134
闑u95D1h !251125113251111234 =511225113251111234
闒u95D2h !251125112511541541 =511225112511541541
闓u95D3h !251125112521251431 =511225112521251431
闔u95D4h !251125111215425221 =511225111215425221
闕u95D5h !251125114315233534 =511225114315233534
闖u95D6h !251125111211254444 =511225111211254444
闗u95D7h !251125115545544444 =511225115545544444
闘u95D8h !251125111251431124 =511225111251431124
闙u95D9h !2511251145133134251 =5112251145132513134
闚u95DAh !2511251111342511135 =5112251111342511135
闛u95DBh !2511251124345251121 =5112251124345251121
關u95DCh !2511251155455453221 =5112251155455453212
闝u95DDh !2511251125111343134 =5112251125111343134
闞u95DEh !2511251151221113134 =5112251151221113134
闟u95DFh !25112511341251541541 =51122511341251541541
闠u95E0h !25112511251212511134 =51122511251212511134
闡u95E1h !25112511251251251112 =51122511251251251112
闢u95E2h !251125115132514143112 =511225115132514143112
闣u95E3h !251125112434525125121 =511225112434525125121
闤u95E4h !251125112522112513534 =511225112522112513534
闥u95E5h !25112511121431112454 =51122511121431112454
闦u95E6h !251125112512211251431 =511225112512211251431
闧u95E7h !251125111212513234454 =511225111212513234454
隴u96B4h !524143125111515111 =5241431251121515111
霈u9708h !145244444411252 =145244444411251
靊u974Ah !14524444211121112521251431 =14524444111221112521251431
韊u97CAh !12212511212225112511125431234 =12212511212251122511125431234
顂u9842h !12343434132511134 =13434234132511134
飛u98DBh !534335342 =534353432
飜u98DCh !343123425121534335342 =343123425121534353432
飝u98DDh !534335342534335342534335342 =534353432534353432534353432
飮u98EEh !3445112113534 =3445115113534
飱u98F1h !1354344511534 =135434451154
騋u9A0Bh !121125444412343434 =121125444413434234
騛u9A1Bh !1211254444534335342 =1211254444534353432
騿u9A3Fh !121125444441431251112 =12112544441431251112
驌u9A4Ch !12112544445112322151512 =12112544445112321155122
驡u9A61h !41431251115151111211254444 =414312511215151111211254444
骸u9AB8h !255452511415334 =255452511415335
鬛u9B1Bh !1211154333253415445445 =12111543333253415445445
鬜u9B1Ch !1211154333251125113511 =1211154333511225113511
鬝u9B1Dh !1211154333251125112511 =1211154333511225112511
鬥u9B25h !2112111212 =1121211212
鬦u9B26h !21121112124412 =11212112124412
鬧u9B27h !211211121241252 =112121121241252
鬨u9B28h !2112111212122134 =1121211212122134
鬩u9B29h !211211121232151135 =112121121232151135
鬪u9B2Ah !21121112121251431124 =11212112121251431124
鬫u9B2Bh !211211121251221113134 =112121121251221113134
鬬u9B2Ch !2112111212352155151213312 =1121211212351255151213312
鬭u9B2Dh !211211121255155151213312 =11212112122151525151213312
鬮u9B2Eh !211211121232511255115115341 =11212112123251253415511511
鬰u9B30h !123434341234453444445215333 =123434341234453444445235333
鬱u9B31h !12343112521234453444445215333 =12343112521234453444445235333
鯠u9BE0h !3525121444412343434 =3525121444413434234
鰦u9C26h !35251214444431554554 =35251214444122554554
鱐u9C50h !352512144445112322151512 =352512144445112321155122
鱦u9C66h !352512144442511251211511 =35251214444251251115151
鱮u9C6Eh !352512144443211152511134 =352512144443211152513411
鳶u9CF6h !15432511154444 =15431511154444
鵖u9D56h !511543232511154444 =5115432511154444
鶆u9D86h !1234343432511154444 =1343423432511154444
鷫u9DEBh !511232215151232511154444 =511232115521232511154444
鷳u9DF3h !25112511351132511154444 =51122511351132511154444
鷴u9DF4h !25112511123432511154444 =51122511123432511154444
鷼u9DFCh !25112511251132511154444 =51122511251132511154444
麒u9E92h !4135221151512211134 =4135221153512211134
麟u9E9Fh !41352211515431234354152 =41352211535431234354152
麡u9EA1h !4135221153541432533543211 =4135221153541432533541132
麣u9EA3h !413522115152512511351221113134 =413522115352512511351221113134
麤u9EA4h !413522115354135221151541352211535 =413522115354135221153541352211535
麳u9EB3h !1234343435412343434 =1234343435413434234
麷u9EB7h !12343434354211121112521251431 =12343434354111221112521251431
黽u9EFDh !2511251211511 =251251115151
黿u9EFFh !11352511251211511 =1135251251115151
鼀u9F00h !121342511251211511 =12134251251115151
鼁u9F01h !121542511251211511 =12154251251115151
鼂u9F02h !251112511251211511 =25111251251115151
鼃u9F03h !1211212511251211511 =121121251251115151
鼄u9F04h !3112342511251211511 =311234251251115151
鼅u9F05h !311342512511251211511 =31134251251251115151
鼆u9F06h !45251141342511251211511 =4525114134251251115151
鼇u9F07h !11215331342511251211511 =1121533134251251115151
鼈u9F08h !432523431342511251211511 =43252343134251251115151
鼉u9F09h !2512512512112511251211511 =251251251211251251115151
鼊u9F0Ah !51325141431122511251211511 =5132514143112251251115151
鼘u9F18h !1212514311254322151512 =1212514311254321155122
鼝u9F1Dh !4413221515121212514311254 =4413211552121212514311254
鼵u9F35h !3215115445445445341344 =3215445445445445341344
鼷u9F37h !32151154454453443554134 =32151154454453223554134
齌u9F4Ch !414325335432114334 =414325335432113432
齑u9F51h !413432211121111 =413421112111132
齢u9F62h !21214312345234454 =21214312345234452
龎u9F8Eh !134143125111515111 =1341431251121515111
龏u9F8Fh !4143125111515111132 =41431251121515111132
龐u9F90h !4134143125111515111 =41341431251121515111
龑u9F91h !41431251115151111134 =414312511215151111134
龒u9F92h !414312511151511111234 =4143125112151511111234
龓u9F93h !1325114143125111515111 =13251141431251121515111
龔u9F94h !4143125111515111122134 =41431251121515111122134
龕u9F95h !3412514143125111515111 =34125141431251121515111
龗u9F97h !145244442512512514143125111515111 =1452444425125125141431251121515111
龜u9F9Ch !32511255115115341 =3251253415511511
龝u9F9Dh !3123432511255115115341 =312343251253415511511
龞u9F9Eh !4325234313432511255115115341 =243253431343251253415511511
xxx龟u9F9Fh !3525115 =3515115
uE830h !3121 =3112
uE833h !52121 =5212
xxxuE83Bh !121534 =431121
uE84Fh !3111525111251113241112154 =3411243125111251113241112154
uE850h !251125113434121 =511225113434121
uE851h !25112511355112 =51122511355112
uE85Ch !125235451 =325235451
蘒uFA20h !1223123432511255115115341 =1223123435251125115
######################
]
===
]]
===
]]]

#]]]'''#'''
