#growing:goto
#phase1____OUTLINES:goto
#phase1____doing:goto
#一部件多字形多笔顺码:goto
#部件拼音:goto
#bug_report:goto
#now:允许多次不同拆分:具 凞
#def___OPS:goto
#xxxxxxxxxxxxxxxxxxxxxx:goto
#__all__:goto
r'''[[[
case:情形/场合/事例/状况/判例/个例/案例/专题;框/箱体/盒/壳体;病例; #我的翻译:况框/况型

e ../../python3_src/useful__cjk_naming.txt
e TODO2024.txt
命名何长？命名即是定义，定义即是命名。命名是简洁概貌内透本质外比差异的提示性不完整定义，定义是山重水复囊括所有细节层次结构繁杂的命名。注释，于命名的模糊处，于定义的区别处。
    汉字部件命名vs汉字拆分
    接口设计vs匿名函数
其实吧，没那么严格，认得出就行。正因如此，大家过于随性，才导致如今的混乱。
    汉字字形:一字多形，各种地方特色
    HTML:浏览器的网页分析『高容错性』看似有利于用户，其实在变相纵容混乱的代码。


e ../../python3_src/seed/recognize/toy/poor_efficiency_toy_recognizer.py

亘:d,一,旦,
仧:d,上,人,
刼:a,去,刃,
劰:a,白,力,
劮:a,失,力,
勒:a,革,力,
動:a,重,力,
勥:d,强強,力,
厺:d,大,厶,
    大私无公
吢:d,心,口,
吣:a,口,心,
問:A,門,口,
垉:a,土,包,
埋:a,土,里,
    埋土里
旵昊
颪
垕
閄
烎
仧
奣
夵不一
夯:d,大,力,
奀:d,不,大,
夸:d,大,亏,
夿:d,大,巴,
夻:d,大,口,
杢
忈
汖有相逢
睂槑氼
奁负责人
坔不服
厼:私小
嘦:d,只,要,
嘧:a,口,密,
口令呤
妮:a,女,尼,
妵:a,女,主,
媂:a,女,帝,
嵪:a,山,高,
嵭:a,山,旁,
憇:d,甜,心,
懑:d,满,心,
毣:d,羽,毛,
灿:a,火,山,
炛:d,火,化,
炡:a,火,正,
炢:a,火,术朮,
睩:a,目,录彔,
烎
奰
嬽



排序:
    * 任意部件-笔顺码
        #一部件多笔顺码
        #一笔顺码多部件
    * 复杂部件(部首笔顺+部首拆分/反向波兰表示法(十一{纵组}囗囗士), 字型+笔顺次序, ...)
        部首/大区，字型笔顺/中区
    * 仅汉字unicode次序:方便对照
        /sdcard/0my_files/zip/zip_selected__e_book_data/13.0.0[download_at][20200913]/charts-East_Asian_Scripts/U4E00.pdf

反向波兰表示法
新世纪汉英科技大词典
postfix notation
reverse Pollish notation
suffix notation
#后缀表示法/后继表示法


e ./script/hz/部件拆分.py
e ./script/hz/部件拆分囗囗编辑处.py
e ../../python3_src/useful__cjk_naming.txt
[[
phase1____OUTLINES:here
===
e ./script/hz/部件拆分.py
    <<==update==:
    view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..列出可推导出来的部件笔顺码囗囗用于更新补丁囗.out.txt
        update 部件笔顺码补丁:_patch__nm2js
            列出可推导出来的部件笔顺码囗囗用于更新补丁囗():goto
    e /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..main4phase1_.out.txt
        编辑/重命名 数字部件名,手机字体不支持的高位面汉字部件名
            main4phase1_():goto
e ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt
    <<==original==:
    view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out.txt
    <<==update==:
    view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..生成拆分囗囗规范部件名囗.out.txt
        部件:特色命名-->不断规范化-->部分命名足够规范得以自动拆分
            生成拆分囗囗规范部件名囗():goto
            #def___OPS:goto
            #三参数判定:goto
view ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/单字_笔顺码_29685个.txt
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/my_patch_ex.txt
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/my_patch.py.out.txt
        :eg: 头龘甬:龴
===
++my_patch_ex.txt #手动补丁:添加
e ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/my_patch_ex.txt
e ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺.py
===
++my_found_bugs.txt #手动补丁:订正
e ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/my_found_bugs.txt
===
]]



script.hz.部件拆分
py -m nn_ns.app.debug_cmd   script.hz.部件拆分 -x
py -m nn_ns.app.doctest_cmd script.hz.部件拆分:__doc__ --ndiff -ff -v
py_adhoc_call  seed.helper.print_methods  @wrapped_print_methods   %script.hz.部件拆分:XXX@T    =T      ++exclude_prefixes:_
from script.hz.部件拆分 import *


view ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字Unicode编码范围.txt
==== from nn_ns.CJK.CJK_data.raw.汉字相关字符范围 import union_ranges
union_ranges =\
((0x2E80, 0x2EF4)
,(0x2F00, 0x2FD6)
,(0x2FF0, 0x2FFC)
,(0x3007, 0x3008)
,(0x3100, 0x3130)
,(0x31A0, 0x31E4)
,(0x3400, 0x4DC0)
,(0x4E00, 0x9FFD)
,(0xE400, 0xE5E9)
,(0xE600, 0xE6D0)
,(0xE815, 0xE870)
,(0xF900, 0xFADA)
,(0x20000, 0x2A6D7)
,(0x2A700, 0x2B735)
,(0x2B740, 0x2B81E)
,(0x2B820, 0x2CEA2)
,(0x2CEB0, 0x2EBE1)
,(0x2F800, 0x2FA1E)
,(0x30000, 0x3134B)
)

CJK Compatibility Ideographs Supplement
Range: 2F800–2FA1F
    勺0x2F828 === 勺0x52FA

CJK Compatibility Ideographs
Range: F900–FAFF

[\UF900-\UFAff\U2F800-\U2FA1f]
    标识 兼容汉字
        见:_debug__keyword_auto_convert()
        见:_patch__nm2js
[\U100-\U33FF][『』]\@<!
    排除 笔划

/sdcard/0my_files/zip/zip_selected__e_book_data/13.0.0[download_at][20200913]/charts-East_Asian_Scripts/U4E00.pdf
CJK Unified Ideographs
Range: 4E00-9FFC

/sdcard/0my_files/zip/zip_selected__e_book_data/13.0.0[download_at][20200913]/charts-East_Asian_Scripts/U3400.pdf
CJK Unified Ideographs Extension A
Range: 3400-4DBF

/sdcard/0my_files/zip/zip_selected__e_book_data/13.0.0[download_at][20200913]/charts-East_Asian_Scripts/UF900.pdf
CJK Compatibility Ideographs
Range: F900-FAFF




[[[
phase1____doing:here
===
+ 提取拆分:基本面
+ 删除不规则拆分
    当前只保留a,d (横组，纵组)
+ 重命名有误部件囗囗部首改正囗正确笔顺
+ 重命名有误部件
    当前状态:
        『doing:here』之前的已完成(人工逐行检查)
        『doing:here』之后:
            + 先行替换:
                搜索 数字代号类部件
                搜索 高位面汉字类部件
                大约处理30个左右
                自动替换
            + 人工逐行检查，直至再次碰的上面两类部件，移动『doing:here』标签，返回上一步-循环
    当前状态:++main4phase1_()
        辅助人工命名部件:特色命名:
            * 数字部件-->推导部件笔顺码
                * 列出已知的笔顺码相同的部件名 作为候选
                * 尝试拆分成两个已知的笔顺码的部件名 作为候选子部件
        ==>>:
        更新补丁:部件笔顺码:列出可推导出来的部件笔顺码囗囗用于更新补丁囗()
            添加在 ./script/hz/部件拆分.py 末尾_patch__nm2js
        更新补丁:部件拆分:生成拆分囗囗规范部件名囗()
            添加在 ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt 开头
===
+ 提取拆分:基本面
py_adhoc_call   script.hz.部件拆分   @提取基本面编码空间里的汉字囗 --opath:/sdcard/0my_files/tmp/out4py/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out.txt
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out.txt
cp /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out.txt ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt
du -h ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt
    368K
e ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt
===
+ 删除不规则拆分

e ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt
%s/^.:.[^,].*\n//g
%s/^.:[^ad].*\n//g

===
+ 重命名有误部件囗囗部首改正囗正确笔顺
%s/:a,牛,/:a,牜,
%s/:a,足,/:a,𧾷,
%s/:d,西,/:d,覀,
%s/:a,羊,/:a,撇化羊,
%s/:a,示,/:a,礻,
%s/:d,穴,/:d,窢儿版穴,
%s/,\<卄\>/,艹
    例外:侖:d,亼,正序纵包龘冂卄,

    begin-vim:/[\U100-\U33FF]
%s/㇕/无钩𠃌/g
%s/㇠/乙/g
%s/⻊/𧾷/g
%s/㇟/乚/g
%s/⻭/歯/g
%s/⺙/攵/g
%s/⺶/撇化羊/g
%s/⺊/头龘上/g
%s/⺍/头龘兴/g
%s/㇐/一/g
%s/⺈/头龘负囗囗𠂊结尾在中囗囗非头龘欠/g
    头龘欠囗囗𠂊结尾在右囗囗非头龘负
    头龘负囗囗𠂊结尾在中囗囗非头龘欠
    无丶夕囗囗𠂊结尾在左囗囗非头龘欠
%s/⽻/羽/g
%s/⽾/耒/g
%s/⺤/爫/g
%s/⺧/断尾牛/g
%s/㇓/丿/g
%s/㇑/丨/g
%s/⺀/纵组丶丶/g
    底龘冬=纵组丶丶or冫
%s/㇝/乀/g
%s/㇀/提横/g
%s/⺌/头龘肖/g
%s/⺮/𥫗/g
%s/⺪/𤴔/g
%s/⺳/窢儿版㓁/g
%s/⺹/耂/g
%s/㇔/丶/g
%s/㇖/乛/g
%s/㇚/亅/g
%s/㇗/𠃊/g
%s/㇇/横撇/g
%s/㇆/无钩𠃌/g
%s/㇣/圆圈版零/g
%s/〇/圆圈版零/g
%s/⺁/𠂆/g
%s/⺗/小丶版心囗囗底龘恭/g
%s/⺷/𦍌/g
    end-vim:/[\U100-\U33FF]
3657,3788s/\<月\>/窢肉月
    选择性替换『月-->窢肉月』
    窢肉月:冫版肉月:⺼:[䏌0x43CC..=䑏0x444F]
        冫版肉月:⺼:䏓䑃𦢊脁肦胊膧胐脧
        窢肉月:其余,使用『月』笔顺

%s/:d,雨,/:d,头用雨,
%s/:a,食,/:a,飠,
%s/:a,[飠𩙿],/:a,飠𩙿,
%s/:d,亦,/:d,头用亦,
%s/:a,毛,/:G,毛,
    --> G拟包横组
    例外:『覒』
#没有『𤣩』:%s/:a,𤣩,/:a,王,
%s/:a,礻,/:a,礻示,
%s/:a,糹,/:a,糹糸,
#没有『𠆢』:%s/:d,𠆢,/:d,人入,
    growing

===
+ 重命名有误部件
py_adhoc_call   script.hz.部件拆分   @_prepare4phase1__try_to_findout_encoding4font4cellphone_
py_adhoc_call   script.hz.部件拆分   @列出可推导出来的部件笔顺码囗囗用于更新补丁囗 --ipath:../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt > /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..列出可推导出来的部件笔顺码囗囗用于更新补丁囗.out.txt
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..列出可推导出来的部件笔顺码囗囗用于更新补丁囗.out.txt

py_adhoc_call   script.hz.部件拆分   @main4phase1_ --ipath:../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt > /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..main4phase1_.out.txt
e /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..main4phase1_.out.txt

py_adhoc_call   script.hz.部件拆分   @生成拆分囗囗规范部件名囗 --ipath:../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt > /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..生成拆分囗囗规范部件名囗.out.txt
    #def___OPS:goto
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..生成拆分囗囗规范部件名囗.out.txt
    xxxxxxxxxxxxxxxxxxxxxx:goto


py_adhoc_call   script.hz.部件拆分   ,str.迭代囗囗规范部件名囗 --ipath:../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt -include_number_name > /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..迭代囗囗规范部件名囗.out.txt
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..迭代囗囗规范部件名囗.out.txt

py_adhoc_call   script.hz.部件拆分   @打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗 --ipath:../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt  > /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗.out.txt
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗.out.txt
grep '版$' /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗.out.txt
    处理版字结尾的部件名:goto

[[
bug_report:here
===
!!!笔顺码bug!!!:
    e ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/my_found_bugs.txt
    㴝31234223424134-->3123422342534
    㺈3532521251214-->3535221251214
    䒄3354145125125121-->33541445125125121
    䗰251214251212511134-->25121455212511134
    #,衮袞='41342513534'@䙛
    #,衮袞='4134543534'@䜇
    䙛4523441342513534-->452344134543534
    別2513522-->2515322
    煕12251255154444-->1251255154444
    𢛳132522114544-->122522114544
    様12344311212534-->123443112124134
    爋43343125431211534444-->43343125431211444453

様:a,木,𣴎鱻鬾氺版,
??様12344311212534-->123443112124134
爋:a,火,横组熏力囗鱻馘灬底版[HTK一致:横组熏力;手机字体:横组熏力|笔顺码+部件拆分:灬底版横组熏力],
??爋43343125431211534444-->43343125431211444453
===
!!!发现 手机字体 bug!!!:
    [㙯0x366F==纵组埶云=!=纵组埶土]#手机字体bug!!
    [㮝0x3B9D==横组木郤=!=横组木卻]#手机字体bug!!
    [㴝0x3D1D==水版㴝==纵组利氽[G,T一致]=!=𪏭0x2A3E===氺版㴝==纵三组利人氺[U,T,V,H一致]]#手机字体bug!!
    白版臱
    [籩0x7C69===纵组,𥫗,邊鱻鬾自版囗囗非白版=!=...白版臱]
    growing
    ######################
    候选???见下面:
    㪱:a,文,窢奂奐[G,T:奐;手机字体与笔顺码:奂]
    㴴:a,氵,纵组囗火版亾囗火版亾鱻惐炎版㡭[G,T:纵组囗火版亾囗火版亾;手机字体与笔顺码:炎版㡭],
    㵮:a,氵,纵组大囗二版革鱻惐纵组大革[G,T,J:纵组大囗二版革;手机字体与笔顺码:纵组大革],
    䕎:d,艹,窢目版横组日畐[G,T:横组日畐;手机字体与笔顺码:横组目畐],
    䤪:a,金,朵鱻惐纵组乃木[G,T,H一致:朵;手机字体:纵组乃木|笔顺码:无法区分],
    濹:a,氵,墨鱻鬾魊黒魊黑版[GJ黑;手机字体与笔顺码:黒],
    玂:a,犭,横组蕇斤鱻惐蘄[GK横组蕇斤-HT蘄;手机字体:横组蕇斤|笔顺码:无法区分],
===
]]



不唯一命名:
    变体乍
    取消:xxx
        㑒:d,亼,37564,
        -->㑒:d,人,底龘㑒,
特色命名:
    儿版川#底龘荒
    无头六#底龘六
    拟包横组元女囗囗女版㝴#女版底龘寇
    #女版壹#纵四组士冖一女
    #纵组人口底龘恭#底龘隳
    窢郎版良
        㓪:a,窢郎版良[G:左龘郎|J,K:良],刀,
        郎[G,H,T,J,K,V]一致#非『良』
        剆:a,窢郎版良[G,H,T:左龘郎|K:良],刂,
        勆:[G-TJ]
        朗:a,窢郎版良[GHTJV缺丿良-K良],弯月,
    由版画
        㓰:a,由版画,刂,
    缺丨匈#乂版匃#匃#匈
    录彔
        㖨:a,口,录彔[G:录|T,J:彔],
    㗗:a,窢万版另[G:力版另|T:万底版另],卑,
        䤢:G,J-T
    内內
        㘨:a,土,内內[G,V:内|T:內],
        抐:a,扌,内內[G-HTJK],
    㚇:d,窢八版兇[G:八|T,K:儿],夂,
    𦍍:纵组丷干|纵组八干|纵组人干|窢人版纵组八干
        䯎䖫
            䯎:a,骨,窢人版纵组八干[G纵组人干-T纵组八干],
    㛎:a,女,吕呂[G:吕|T,V:呂],
        䥨G - T
        熍:a,火,宫宮[G-T],
    取消关注:㟬:d,山,窢𦥑版叟[G,K:臼版叟|T:𦥑版叟],
        䝿:d,窢𦥑版臾[G:臼版臾|T,J:𦥑版臾],貝,
        傁:a,亻,叟鱻馘𦥑版鱻魊不穿底版[G,K:臼版叟|T,J:𦥑版叟|H:窢不穿底版叟],
        搜:a,扌,叟鱻馘𦥑版鱻魊不穿底版[GJKV-T-H],
    #㨲#宋版荣#纵组艹宋
    㨖:a,扌,窢夂版致[G:攵版致|T:夂版致],
    㡛:a,巾,窢亾版荒[G:亡版荒|T:亾版荒],
    㥁:d,罒版拐化直,心,
    㝸:d,小,窢日儿版皃[G,T:白儿版皃|J:日儿版皃],
    㝹:d,少,兔免[G,V:兔|T:免],
    㞊:a,祟,尢尤[G:尢|T:尤],
    㞷:d,艸山[G:屮|T:撇化屮|J:山],王,
        屮 vs 䶹0x4DB9/撇化屮 手机字体不支持
    𦙌:缺丿胤#横组囗纵组幺月囗乚
    㣲:a,彳,口版敳, #40260-->无䒑豈:+攵=>口版敳
    㩓:d,毁毀[G:毁|T:毀],手,
        䥣:d,毁毀[G,T:毁|K:毀],金,
        檓:a,木,毁毀[G-HTK],
    㩸=>直夕宐版疉=>宐囗囗纵组宀囗丶版彑
        疊疉㬪彑宐
        [疉0x7589==纵组畾囗窢冖彑版宐][窢冖彑版宐==G,T:纵组冖彑|J:宐囗囗纵组宀囗丶版彑]
        [㬪0x3B2A==G,T:纵三组晶宀彑]
        [宐0x5B90==G,J:纵组宀囗丶版彑|H:纵三组宀夕一|T:纵组宀囗丶版互]
        宐:d,宀,38116-->丶版彑鱻惐夕版彑鱻惐丶版互[GJ直化夕版-H夕版-T直化歹版],
        疉:d,畾,38208-->窢冖彑版宐,
    㫄:d,窢二版亠[G:亠|T,J:二],正序纵包龘勹方,
    取消『提一版爵/提二版爵』
        #㬭:a,日,窢一版爵[G:提丶版爵|T:提一版爵],
        #㩱:a,扌,窢二版爵[G,T,V:提丶版爵|K:提二版爵],
    㪁㪎㪢:攴攵[G:攴|T:攵]
        㪈㪌㪜㪬:攴攵[G,K:攴|T:攵]
    取消『丿版羽』:因为K韩国版羽 必是 丿版羽
        #㪧:a,窢四丿羽版翕[G:双冫羽版翕|K:四丿羽版翕],攴,
        #翕:纵组合囗窢丿版羽[G,H,T:冫版羽|J,K,V:丿版羽]
    㪱:a,文,窢奂奐[G,T:奐;手机字体与笔顺码:奂]
    㫩:d,直化卉鱻惐十十版卉,日,
        㫩0x3AE9䯵0x4BF5奔0x5954尭0x5C2D桒0x6852賁0x8CC1贲0x8D32鼖0x9F16
        㫩=>[直化卉鱻惐十十版卉[G:直化卉|T:十版品]]
        䯵=>[卉] #G,T一致
        奔:G,H,T,J,K,V一致
        尭=>[直化卉[G,T,J:直化卉]] #一致
        桒=>[直化卉鱻惐十十版卉[G,T,J:直化卉|K:十版品]]
        賁=>[直化卉==纵组十艹] #賁:G,H,T,J,K一致
        贲 简体字只有G源
        鼖=>[窢直化卉[G,H,T,J:直化卉|K:卉]]
    㬕:a,日,礻示[G:礻|T:示],羊,
        榊:a,木,神鱻鬾礻版鱻魊示版[GHT-J],
        社:a,礻示[GHTJV-K],土,
        祀:a,礻示[GHT-JK],巳,
        祘:a,示礻[GHJK-T],示,
    㯯:a,木,纵组夅貝鱻惐纵组夂貢[G,T:纵组夅貝|K:纵组夂貢],
    木版弃=纵三组亠厶木
    㯆:a,木,産產[G:丷版産|T,K:乂版產],
        剷:GV-HTJK
    㴁:a,氵,窢夭版纵组天井囗/纵组天井鱻惐纵组夭井[G:纵组天井|T,K:纵组夭井],
    #加丶尿===纵组丶尿===包龘户水
    㴄:a,氵,囧鱻惐包龘四口[G:囧|T:包龘四口],
    㴄:a,氵,21272-->囧鱻惐包龘四口,
        㴅:d,水,21272-->窢八版包龘四口,
        xxx:21272:囧鱻惐包龘四口
    㲊:a,睿𥈠[G,T:𥈠|J:睿],殳,
        䜜:T𥈠 - G睿
        䥧:G,T一致:𥈠
    㲧0x3CA7=>窢加丶蚤
    㳛:a,氵,臾㬰[G:臾|T:㬰],
    㳫:d,水,臼𦥑[G,H:臼|T:𦥑],
        䳎=>G,T一致:臼
        䳔:d,臼𦥑,鳥,
    㳽:a,氵,窢𠂉版弥[G:弥|T,K:𠂉版弥],
    㴳:a,氵,窢工版横组土尨[G:土|T:工],
    㴴:a,氵,纵组囗火版亾囗火版亾鱻惐炎版㡭[G,T:纵组囗火版亾囗火版亾;手机字体与笔顺码:炎版㡭],
    㸉=>中序拟横三组火辛火
    㵪:a,氵,羡羨[G:羡|T,K,H:羨],
        檨:a,木,羡羨[G-HTK],
    㵮:a,氵,纵组大囗二版革鱻惐纵组大革[G,T,J:纵组大囗二版革;手机字体与笔顺码:纵组大革],
    㶳:d,窢断尾聿[G:断尾聿|T:聿],火,
    㺙=>母贝版實
    㷗:d,窢臣版横三组丿㠯巳[G,T:横三组丿㠯巳|K:横三组丿臣巳],火,
    㷩:d,横三组丿臣己[K-only],火,
    㸿:a,牜,壳売[J:売;手机字体:壳],
    㼱:d,北,窢儿版㓁[G:八版㓁|T:儿版㓁],瓦,
    㿳:a,皮,窢交叠一巛版甾[G:三折版甾囗囗右龘輜|T:穿心巛版甾囗囗右龘輺],
    䄵:d,禾,㐄-->底龘年,
    䍃:d,爫鱻惐斜月版夕[G:爫|T,J,U:双点版夕],缶,
        瑤:a,王,䍃鱻鬾斜月夕版鱻魊爫版[GHTJK-V],
        瑶:a,王,䍃鱻鬾爫版[GHTJK一致:爫], #瑤
        瑶瑤
    䎉:a,羽,戌戍[G,T:戌|K:戍;手机字体:戌|笔顺码:戍],
    姢:a,女,䏍鱻鬾直月版鱻魊肉月版鱻魊弯月版[G直月版-T肉月版-K弯月版],
        #?底用月?
    窢肉月:冫版肉月:⺼:[䏌0x43CC..=䑏0x444F]
        冫版肉月:⺼:䏓䑃𦢊脁肦胊膧胐脧
        窢肉月:其余,使用『月』笔顺
            肖,肙,育,肯,胃,嗋:脅,骨,龍,冐,䏍,隋:纵组左月囗囗右龘隋,嬴...见下面『底用肉月』
            #xxx青,有
    䏕:a,月,壬王[G,T,K:壬|J:王],
    冫vs二:
        䏛:a,月,匀勻[G:匀|T:勻],
        䝧:a,貝,匀勻[G:匀|T:勻],
        䨏:次:G,H - T,K
    䏞:a,月,末未[G,J:末|T:未],
    䐈:a,月,直鱻惐目版拐化直[G,T:芯三版直|J:目版拐化直],
        #vs 罒版拐化直
        窢目版拐化直-->直鱻惐目版拐化直
        植:a,木,直鱻惐目版拐化直[GHTV-JK],
    䐜:a,月,真眞[G,T:芯三版真|J,K:匕目版拐化真],
        窢匕目版拐化真-->真眞
        槙:a,木,真鱻鬾芯三版鱻魊十目一八版[GHT-J],
    䐽:a,月,窢廿兩版㒼[G,T:㒼|K:纵组廿兩],
    䐿:a,月,窢釆版奥[G:米版奥|T:釆版奥奧],
        -->奥奧
        䜒
    䑐:a,臣,尔尓[G:尔|T,K:𠂉版尔;手机字体与笔顺码:𠂉版尔],
        弥:a,弓,尔尓[G-HTJK],
    䒻:d,艹,屺𡵆[G:屺|T,K:𡵆],
    䓭:d,艹,窢朮版刹[G:木版刹|T:朮版剎],
    䓯:d,艹,窢毋版毒[G:母版毒|T:毋版毒],
    䕄:d,艹,丞氶[G:丞|T:氶;;手机字体与笔顺码:丞],皿,
    #䕂=>[G-only:无钩版底龘袁]
        #䕂園遠闧薗薳
        #䕂:d,艹,逆序包龘辶囗纵组台囗无钩𧘇,
        䕂:d,艹,厶版遠,
        厶版遠:L,辶,厶版无钩袁,
        遠:L,辶,无钩袁,
        園:O,口,无钩袁,
        厶版无钩袁:d,台,无钩𧘇,
        无钩袁:d,𠮷,无钩𧘇,
    黄黃:䐵:G vs T
    䕎:d,艹,窢目版横组日畐[G,T:横组日畐;手机字体与笔顺码:横组目畐],
    䖙:d,卧臥[G:卧|T:臥],虒,
        䭆=>[G:卧|T,K:臥]
    䖹:a,虫,窢卝干版缩头芈𦍋[G:卝干版𦍋|T,K:缩头芈𦍋],
    䗰:a,虫,窢母版貫[G,T:毌版貫|K:母版貫],
    䐗:a,月,窢加丶版者[G,V:耂日版者|T,J,K:耂日丶版者],
    䘄:d,窢加丶版者[G,T:耂日版者|K:耂日丶版者],䖵,
        䡤:G,T-K
        偖:G,H,T,V - J,K
            ===者鱻馘加丶版
    䘠:a,衤,乂版友犮[G,K:乂版友|T:乂版犮],
        䮂:a,馬,窢乂版犮[G犮-T:乂版犮],
            䳁
        䯋:a,骨,窢乂版犮[G犮-T,K:乂版犮],
            䳊
        -->犮鱻馘乂版
        冹:a,冫,犮鱻馘乂版[G犮-H,T,K:乂版犮],
    䘤:a,衤,术朮[G:术|T:朮],
        怵:a,忄,术朮[GV-HTJK],
        沭:a,氵,术朮[G-HTJK],
    䙛:a,衤,衮袞[G:厶版衮|T,H:口版袞],
        䜇
    䙴:d,覀襾[G,T:覀|J:襾],大,㔾巳[G,T,J:㔾;手机字体与笔顺码:巳],
    !!!䚜:卑===白丿十/笔顺码支持!!!卧槽，错了这多年！
    䛘:a,言,窢王版任[G,K:横顶版任|T:撇顶版任],
        䮢:a,馬,窢横顶版臿[G撇顶版臿-T横顶版臿],
        偛GK-HT
            ===臿鱻馘横顶版
    秃:䛢:a,言,秃禿[G:几版秃|K,T:儿版禿],
        瀩:a,氵,頽鱻鬾魊几魊儿版[G-HTK],
    䛼:a,言,窢土版纵组臼工[G,T:纵组臼工|K:纵组臼土],
    䜁:a,言,窢𠃊大版奊[G:夨版奊|T:𠃊大版奊],
    #䜒 䜚 䜜
    䜚:a,言,窢氺版遝[G:小八版遝|T:氺版遝],
        䤽G - T
    #䝥 䝧 䝦
    䝦:a,豸,衆眾[G:衆|T:眾],
    䝼:GH-K円版青
    䝼:a,貝,窢円版青[G,H:直月版青|K:円版青],
        窢円版青===青囗或円版
        倩:a,亻,青鱻馘円版鱻魊弯月版[G,H:直月版青|T:弯月版青囗囗非冫版肉月|J,K:円版青],
            凊
    䡯:a,車,窢囪版悤[G:囱版悤|T:囪版悤],
        傯:GHJK-T
            ===悤鱻鬾魊囱魊囪版
        窗:d,窢儿版穴,囱囪[GHJKV-T],
    䡸:a,車,窢戊版戉版蔑[G:戉版蔑|T:戊版蔑],
    䡹:a,車,窢厶版疐[G:乛版疐囗囗右龘嚏|T:厶版疐囗囗右龘嚔],
        疐:懥:a,忄,疐鱻鬾乛版鱻魊厶版[GHT-JK],
    䢴:a,干鱻惐撇化千[G:干|T:撇化千],阝,
    䣋:a,釆采[G:釆|T:采],阝,
        䎹,䧽=>[G,T一致:釆]
        䰂=>[G,T,K一致:采]
    䣟:a,窢兂版朁[G:平头旡版朁|T:出头兂版朁],阝,
        䤐,䫬=>[G,T一致:平头旡版朁]
        兓:旡vs兂
        旡兂
        僭:a,亻,朁鱻馘出头兂兂版[GHTKV-J],
        窢兂版朁===朁鱻馘出头兂兂版
        兂===GT出头旡|J包龘撇化囗底龘年乚
        灊:a,氵,鬵鱻鬾魊旡魊兂版[GHTK-J],
    䣮:a,酉,窢乂版犮[G:又版犮|T:乂版犮],
    䤪:a,金,朵鱻惐纵组乃木[G,T,H一致:朵;手机字体:纵组乃木|笔顺码:无法区分],
        䑮:a,舟,纵组乃木囗囗非朵,
        䒳:d,艹,纵组乃木囗囗非朵,
    䦋:a,镸,敖鱻惐横组囗纵组士方攵[G:敖|T:横组囗纵组士方攵],
        䫨:a,敖鱻惐横组囗纵组士方攵[G:敖|T,K:横组囗纵组士方攵],頁,
        䮯G-T
        傲GV-HTJ
    䩶:a,革,窢撇屮版蚩[G,T一致:撇屮版蚩;手机字体与笔顺码:直屮版蚩],
        媸:a,女,蚩鱻鬾屮版鱻魊撇化屮版鱻魊山䖝版[GH-TJK-V],
        弢:a,弓,纵组屮又囗鱻馘撇化屮版[GHT纵组屮又-JK纵组囗撇化版屮囗又],
    䪲:a,兀丌[GK兀-T丌],頁,
    䫀:a,窢缺丿艮[G缺丿艮-T艮],頁,
    䫇:a,窢弯冄版纵组彡冄[G直化版冄-T弯版冄],頁,
    䮧:a,𠦝,窢𠂉版纵组人馬[G纵组𠂉馬-T,K纵组人馬],
    䮥:a,馬,窢乂版鬲[G丷版鬲-T乂版鬲],
    䮟:a,馬,叜鱻馘又版容[G叜-T,K又版容],
    䯠:a,骨,昷𥁕[G昷-T,K𥁕],
        㬈
    䱁:a,魚,窢大十版本[G:木一版本|T:大十版本;手机字体:大十版本|笔顺码:木一版本],
    䱢:a,魚,争爭[G:争|T:爭],
        琤:a,王,争爭[G-HTJK],
    䱶:a,魚,郎郞[G:郎|T,J,K:郞],
        樃:a,木,朗鱻鬾郎版鱻魊郞版[GH-TJK],
    䲚:a,魚,窢刀版賴[G:負版賴|T,K:刀版賴],
        ##偩:負:GHT - K力版刀?万?另
        冤:GHTV vs JK刀
    䵤:d,开幵[G:开|T,K:干干版幵],黑,
        咞:GH-T
        开鱻惐干干版幵-->开幵
        栞:d,幵鱻鬾撇化干直化干版鱻魊干干版[GHT-JK],木,
        汧:a,氵,开幵[GHT-JK],
        烎:d,开幵鱻惐干干版幵[G-H-K],火,
    亇:d,𠂉鱻惐头龘欠囗囗𠂊结尾在右囗囗非头龘负[G,H,K:头龘欠|T:𠂉],亅,
    亦:d,亠,窢直化版底龘赤[G,T,J,K:丿丨版底龘赤|H:直化版底龘赤],
    亴:d,纵三组亠口冖,土鱻惐二版丰[G,K:土|T:二版丰],九,
    任:a,亻,壬鱻惐一士版王[G,J,K:壬|T,H:一士版王],
        妊:a,女,壬鱻惐一士版王[GJK-HT],
        恁:d,任鱻馘一士王版[GJKV-HT],心,
    侮:a,亻,每毎[G,H,T,K:每|J:毎],
        勄:a,每囗囗非毎[GTJK一致],力,
    備:a,亻,右龘備,
        右龘備:d,艹,丆直用版石鱻惐丆弯用版石鱻惐厂直用版㕅[G,H,V:丆直用版石|T:丆弯用版石|J,K:厂直用版㕅],
        橣:a,木,甯鱻鬾直用版鱻魊弯用版[GH-T],
        右龘備:備:犕:a,牜,右龘備囗鱻鬾魊龷直甪魊龷弯甪魊艹厂直用版[GH-T-K],
    僧:a,亻,曾曽[G,H,T:丷顶版曾|K,V:八顶版曾|J:田脸版曽],
    毐:d,士,毋母毌[GT-H-K],
    毒:d,龶,母毋毌[GHKV-T-J],
        母毋毌:毒:碡:a,石,毒鱻鬾魊母魊毋魊毌版[GH-T-JK],
        纛:d,毒鱻鬾魊母魊毋魊毌版[GHK-T-J],縣鱻鬾芯三且版鱻魊𠃊目版[GT-HJK],
    具:d,芯三版且鱻惐目一版旦[G,H,T,K,V:芯三版且|J:目一版旦],八,
        懸:d,縣鱻鬾芯三且版鱻魊𠃊目版[GT-HJK],心,
        真:d,十,具鱻鬾芯三且版鱻魊目一八版[GHTV-JK],
    冐:d,冃日[G,J,K:冃|T:日],直月鱻惐弯月鱻惐冃[G,J:直月|T:弯月|K:冃],
    冒:d,冃日[G,T,K,V:冃|J:日],目,
    冬:d,夂,底龘冬/纵组丶丶鱻惐冫囗囗底龘冬[G,H,T,J,V:纵组丶丶|K:冫],
        冭:d,大,纵组丶丶鱻惐冫囗囗底龘冬[G:纵组丶丶|T,J:冫],
        寒[GHTJ丶丶版-KV冫版]
    冴:a,冫,牙鱻鬾魊𠃋魊丄版[GHT:𠃋版牙|JK:丄版牙],
    不同拆分:
        凞:a,冫,熈, #G,J
        凞:d,横四组冫丿臣巳,灬, #H,T
        凞:d,横三组冫臣巳,灬, #K
        卼:G,兀,危, #G
        卼:a,兀,危, #H,T,K
    凟:a,冫,賣鱻馘四版[G,T:|H:],
    刘:a,文鱻馘丄版[G,T:窢亠版文|J,K:窢丄版文],刂,
    判:a,半鱻惐撇化半鱻惐八版撇化半[G,H,T:丷版撇化半|J:丷版直化半|K,V:八版撇化半],刂,
    刹:a,杀鱻馘𠃊版[G,J,K:木版杀|T:缺丶朮版杀],刂,
    刼:a,去,刃刄[G,H:刃|T,J,K:刄],
        剏
        扨:[GH-TJKV]
        籾:[GHT-JK]
    非:剕:a,非鱻鬾魊丨丨魊丿丨版[G:丨丨版非|HTJK:丿丨版非],刂,
        劘
        罪:d,罒,非鱻鬾魊丨丨魊丿丨版[G-HTJKV],
    前:d,䒑,底用刖/刖囗或直化版[G,H,J,K,V:直化刖|T:弯月版刖],
        但是！
        偂:G直月-T,K弯月-J丶丶版直月
        剪:前:GHKV直月-T弯月-J丶丶版直月
    剎:a,术版杀鱻惐朮版杀[G:术版杀|H,T:朮版杀],刂,
    割:a,害鱻鬾横顶丰版鱻魊撇顶丰版鱻魊横顶龶版鱻魊撇顶龶版[G:横顶丰版害|H:撇顶丰版害|T,K:撇顶龶版害|J,V:横顶龶版害],刂,
        害:d,宀,丰龶鱻鬾横顶版鱻魊撇顶版[GV丰-J龶-HTK撇顶版龶],口,
        幰:a,巾,憲鱻魌丰龶鱻鬾横顶版鱻惐丰:㓞:撇顶版囗或彡版[GHJ丰版-TK龶版][G横顶版-HTK撇顶版-J彡版],
        恝:d,㓞鱻馘彡版[GHTK-J],心,
        揳:a,扌,契鱻鬾三丰版鱻魊彡丰版[GHTKV-J],
    勂:a,告吿[GTK:断尾牛版告|H:牛版告],力,
        哠:a,口,告吿[GTKV-HJ],
    勇:d,龴,直化用鱻惐田[GHTV:直化用|JK:田],力,
        勇:湧:a,氵,勇鱻鬾直用版鱻魊田版[GHTV-JK],
    勖:a,冒鱻馘日目版[GHTJK:冒|V:纵组日目],力,
    勗:d,日曰冃[GTJ:日|H:曰|K:冃],助,
    勘:a,甚鱻鬾八版鱻魊儿版[G:八版甚|HTJKV:儿版甚],力,
    勤:a,堇鱻馘艹倒日版[GHTKV:革二版堇|J:纵组艹囗融并口龶成倒日版呈],力,
        嘆:a,口,右龘漢囗鱻馘艹倒日版[GHTKV-J],
    勥:d,强強[G:口版强|TJ:厶版強],力,
    #xxx匀:A,勹,冫二,
    匀:A,勹,冫鱻惐提二囗囗非二[GT:冫|JK:提二囗囗非二], #勻
        呁:a,口,匀勻鱻馘提二版[G冫版-HT二版-K提二版],
        咨:d,次鱻鬾冫版鱻魊二版鱻魊提二版[GHV-T-JK],口,
    包:S,勹,巳己[GHTKV巳:|J:己],
    匓:A,勹,𣪘鱻惐横组囗窢缺丿艮囗殳[G:缺丿艮版𣪘|TJK:𣪘],
    匔:A,勹,躳鱻馘呂版[G-TK],
    叟:d,臼𦥑丨叟头[G,K:臼穿底版头龘叟|H:臼不穿底版头龘叟|T,J:𦥑穿底版头龘叟],又,
        嫂[GJKV-H-T]
    叫:a,口,丩鱻馘丄版[GHTV:丩|JK:丄版丩],
    吟:a,口,今鱻鬾亽版鱻魊亼版[G-HTJKV],
    吨:a,口,屯鱻鬾横顶版鱻魊撇顶版[GHTV-JK],
        扽
    呈:d,口,王𡈼囗囗非壬[GJV-HTKU],
        望:d,纵组亡月鱻鬾弯月版鱻魊斜月夕版[GJKV-HT],王𡈼囗囗非壬[GJKV-HT],
        朢:d,横组臣月鱻鬾弯月版,王𡈼囗囗非壬[G-HTJK],
        檉:a,木,聖鱻鬾魊王魊𡈼版[G-HTJK],
    呧:a,口,氐鱻鬾氏丶版鱻魊氏一版[G-HTJK],
    咲:a,口,关鱻馘八版[GHTJ-K],
    哎:a,口,艾鱻鬾卄艹版鱻魊十十版[GJV-HTK],
        唾:a,口,垂鱻鬾卄艹版鱻魊十十版[GJKV-HT],
    哧:a,口,赤鱻馘直化版[GTK-H],
        捇:[GTKV-H]
    哪:a,口,那鱻馘双杠版[GHTV-JK],
    哴:a,口,良鱻馘横顶版[GT-V],
    哵:a,口,别別[G-TK],
        捌:a,扌,别別[GV-HTJK],
    唁:a,口,言鱻馘横顶版[GHTV-JK],
    唃:a,口,角鱻馘两腿版[G-HTK],
    唆:a,口,夋鱻馘儿版[GV-HTJK],
    唐:A,广,窢不穿底版纵组肀口[GHTK-JV],
    唛:a,口,麦鱻鬾龶夂版鱻魊撇化丰又版[G-T],
    唣:a,口,皂皀[G-H],
    唱:a,口,昌鱻鬾日日版鱻魊日曰版[GTJKV-H],
    唳:a,口,戾鱻鬾户版鱻魊戶版鱻魊戸版[GH-TK-J],
        啓[GHV-TK-J]
        戾戻:捩:a,扌,戾鱻鬾户版鱻魊戶版鱻魊戸大戻版[GH-TK-J],
    唴:a,口,羌鱻鬾撇化羊乚版鱻魊𦍌儿版[G-HTK],
    唹:a,口,於鱻馘𠂉版[GTJKV-H],
        箊:d,𥫗,於鱻馘𠂉版,
    啄:a,口,豖豕[GHTKV-J],
        琢:a,王,豖豕[GHTKV-J],
    商:d,纵组亠丷,冏鱻馘儿版[GV-HTJK],
    啌:a,口,空鱻馘儿版[G-TJKV],
    啚:d,口,纵组十回鱻惐纵组亠回鱻惐纵组丄回[GV-T-JK],
    善:d,纵组羊䒑鱻惐纵组𦍌䒑[GJK-HTV],口,
        墡:GJK-HT
    喒:a,口,昝鱻鬾卜版鱻魊人版[GHJK-T],
    喓:a,口,要鱻鬾覀版鱻魊襾版[GHTKV-J],
    喚:a,口,奐鱻鬾八版鱻魊人版鱻魊儿版[GV-HT-JK],
    喝:a,口,曷鱻鬾匃版鱻魊匂版[GHTKV-J],
    喞:a,口,卽鱻鬾皀版鱻魊丿缺亽𩙿版囗囗非即[GTK-J], #唧
        䳭:a,即卽[G,H:即|T,K:卽],鳥,
    喡:a,口,韋鱻鬾㐄版鱻魊底年版[GHTV-K],
    喢:a,口,臿鱻馘横顶版[GK-HT],
    喭:a,口,彦彥[GV-HTJK],
    喫:a,口,契鱻鬾丰版鱻魊龶版[GHTKV-J],
    喯:a,口,奔鱻鬾廾版鱻魊𠂇十版[GKV-T],
    喳:a,口,查査[GHT-K],
        揸:a,扌,查査[GHT-JK],
        楂:a,木,查査[GHTK-J],
        渣:a,氵,查査[GHT-JK],
    営:d,头龘学鱻惐头用尚[GJK-T],吕呂[G-JKT],
    嗞:a,口,兹茲[GT䒑-J艹-HK十十],
        滋:a,氵,兹茲玆[GTJK-H-U],
        濨:a,氵,慈鱻鬾魊兹魊茲版囗囗慈慈[GTK-HJ],
        礠:a,石,慈鱻鬾魊兹魊茲版囗囗慈慈[G-TJK],
    囍:a,喜鱻惐纵组古古,喜鱻惐纵组古古[GHTJ-K],
    埒埓
        埒:a,土,寽,
        #xxx埓:a,土,寽,
        埓:a,土,寽鱻鬾近爫版鱻魊斜月炙头版[GJ:近爫版寽囗囗丿丿夹丶丶|T:冫版夕|U:丶丶版夕],
    埾:d,取鱻惐变体取[GHTK-J],土,
        娵:a,女,取鱻惐变体取[GHT-JK],
        娶:GHTJKV一致
    塌:a,土,纵组日羽囗囗右龘塌[GJ日-H曰-TK冃;羽~],
        纵组日羽-->纵组日羽囗囗右龘塌 #右龘塌
    塚:a,土,冢鱻馘豕版[GHTK-J],
    墏:d,將鱻馘寽版[GHJ丶丶版斜月版-T冫版夕/冫版斜月版-K寽],土,
    墟:a,土,虚虛[G-HTJK],
    墨:d,黑黒[GHTKV-J],土,
    处:G,夂,卜人[GHK-T],
    夅:d,夂,㐄鱻馘丄版囗囗底龘年[GHT-JK],
    変:d,头用亦[TJK丿亅版亦-G直化亦],夂夊[GJK-T],
        奕:d,头用亦/亦鱻惐直化亦[GTJK丿亅版亦-H直化亦],大,
        帟:d,头用亦/亦鱻惐直化亦[GTJK-H],巾,
        恋:d,头用亦[TJK-GV],心,
        亦鱻惐直化亦
            [亦弈奕帟亪迹]
        直化亦/亦-->头用亦
            [栾蛮峦脔挛鵉銮変鸾恋弯孪娈变]
            『头用亦vs亦鱻惐直化亦』其实 两者都是混同，但依G笔顺码，故 同出而异名
        夋:d,厶,纵组八夂囗鱻馘儿版鱻魊夊版[G八-TJK儿][GJ夂-TK夊],
        夌:d,纵组土八鱻惐纵组土儿[G八-HTJK儿],夂夊[GHJ夂-TK夊],
        复:d,𠂉,日曰[GTJV-H],夂夊[GHJV-T],
            抇:a,扌,日曰[TKV-GH],
    奐:d,头用负鱻鬾八版鱻魊人版鱻魊儿版[G-HT-JK],大,
        寏:d,宀,奐鱻鬾魊八魊人魊儿版鱻惐奐之或大或无头六版[G八-T人-JK儿][GT大-JK无头六],
    契:d,㓞鱻鬾丰版鱻魊提丰版鱻魊提龶版[GV-HTK-J],大,
    妒:a,女,户戶[GHV-TJK],
    尾大:
        夛:d,彐鱻鬾尾大版,夕,
        典:d,尾大版曲,八,
    妦:a,女,丰鱻馘撇顶版[G-HTK],
    姉:a,女,市巿[HTV市/亠-JK市/丄-G巿/十],
        昁:a,日,巿市囗囗十[GTK一致:十版],
        杮:a,木,巿市囗囗十亠[GHTJ-K],
        沛:a,氵,巿市囗囗十丄[GHTJV-K],
    娰:a,女,似鱻馘厶版[GJ-T],
    娼:a,女,昌鱻馘纵组日曰版[GTJK-H],
        昌:d,日,日曰[GTJKV-H],
        曾:d,纵组囗丷八囗脸龘曾[GHT-JKV],日曰[GTJKV-H],
        欥:a,日曰[GTK-H],欠,
    媐:d,巸鱻馘𦣝版[GHTK-J],女,
    媩:a,女,胡鱻鬾弯月版鱻魊直月版鱻魊肉月版[GK-H-T],
        楜:a,木,胡鱻鬾弯月版鱻魊直月版鱻魊肉月版[GJK-H-T],
        抈:a,扌,弯月[GHTKV一致:弯月],
        朞:d,其,月鱻鬾直月版鱻魊弯月版[GH-TJKU],
    媺:a,女,𣁋鱻鬾山一几版鱻魊山一儿版鱻魊山兀版鱻魊山几版[G-HT-J-K],
        山一几版𣁋-->𣁋鱻鬾山一几版鱻魊山一儿版鱻魊山兀版鱻魊山几版
        微:a,彳,𣁋鱻鬾山一几版鱻魊山一儿版鱻魊山兀版[GKV-HT-J],
    嬍:a,女,𣁋鱻鬾山一王版鱻魊山一𡈼版鱻魊山一壬版[G-H-T],
        山一王版𣁋-->𣁋鱻鬾山一王版鱻魊山一𡈼版鱻魊山一壬版
    嫋:a,女,弱鱻鬾冫版鱻魊丿丿版[GHT-JK],
        羽-弱
    嬩:a,女,與鱻鬾芯丨版鱻魊芯丿版[G-T],
        嶼[GHJK-T]
    寨:d,无足寒,木朩[HTJKV-G],
    将:a,丬,纵组夕寸鱻惐寽[G-TJK],
    將:a,爿,纵组囗斜月版夕囗寸囗鱻馘冫版鱻魊断折夕版[GHJK丶丶版斜月版夕-T冫版斜月版夕-V断折夕版],
        爫:爰:d,爫鱻惐断折版夕[GHT丿𭕄版爫-JK𠂆丶丶爪版爫-V断折版夕],纵组一友,
    岙:d,夭天[GH-T],山,
        忝:d,天夭[GHTV-JK],小丶版心囗囗底龘恭,
        忝:添:a,氵,忝鱻鬾魊天魊夭版[GHT-JKV],
    峀:d,山,由田[GK-T],
    崳:a,山,俞兪[GHT-K],
    嵬:d,山,鬼鱻鬾撇化甲版鱻魊甶儿版[G-HTJKV],
    戢:嶯:d,山,戢鱻鬾融横版鱻魊断横版[G融合耳顶横与戈顶横版-HTK横组咠戈],
        戠:幟:a,巾,戠鱻鬾融横版[GHTJKV一致:融横版],
        我:嶬[GHTJK一致:融横版]
    嶵:a,山,罪鱻馘撇竖版[G-HTK],
    嶶:d,山,微鱻馘儿版[G-HT],
    巆:a,山,營鱻鬾吕版鱻魊呂版[G-HTK],
    巕:a,山,㜸鱻鬾䒑版鱻魊艹版[]GH䒑-T十十,
    凡:巩:a,工,凡鱻鬾几丶版鱻魊不出头丸版鱻魊撇化卂版[G-T-J],
        嬴[GJK弯月-HT肉月][GK几丶版凡-J撇化卂版凡-T不出头丸版凡-H卜版卂]
        帆[GHTJK几丶版凡-V单杠版凡]
        恐:[GJKV几丶版凡-T不出头丸版凡-H卜版卂]
    巸:a,右龘姬[GT口版臣-JK𦣝],巳,
        右龘姬===(𦣝or口版臣)
        姬[GHT口版臣-K𦣝]
        弬:a,弓,𦣝鱻惐口版臣[GJ-T],
        同出而异名:依G笔顺码而改名:𦣝鱻惐口版臣vs右龘姬/口版臣鱻惐𦣝
    巽:d,横组巳巳囗鱻馘己版[GHTKV横组巳巳-J横组己己],共,
    师:a,横组丨丿鱻惐横组丶丿[G-T],帀,
        归[G-T]
        帰:a,横组丨丿鱻惐横组丶丿[JK横组丨丿-GT横组丶丿;手机字体与笔顺码:横组丨丿],帚,
    幵:a,干鱻鬾撇化版鱻魊直化版[GH-TJ],,干,
    正:延:L,廴,正鱻鬾撇顶版鱻魊横顶版鱻魊𠃊止版鱻魊丄止版[GHTJK撇顶版-V横顶版][GKV𠃊止版-HTJ丄止版],
        卸:御:a,彳,卸鱻鬾丄止版鱻魊𠃊止版[GKV丄止版-HTJ𠃊止版],
            反转！！！妖孽！
    廷:L,廴,壬𡈼[JKV士-GHT土],
    异:d,巳已己[G巳-H已-TJK己],廾,
    弑:a,杀鱻鬾朩版鱻魊木版[G-TJKV],式,
    彃:a,弓,畢鱻鬾甲版鱻魊田版[GHK甲版-T田版][GTK卄版-H十十版],
    彛:d,彐鱻鬾尾大版鱻魊右倒巾版[G彐鱻鬾尾大版-TJK彐之右倒巾版],纵组粉廾,
        急:d,刍鱻鬾彐版鱻魊右倒巾版[GJ-HTKV],心,
    径:a,彳,左龘颈鱻惐圣[G左龘颈-TJK圣],
    待:a,彳,寺鱻鬾土版鱻魊士版[GHJKV-T],
        恃:[GHJK-T]
        持:[GHJKV-T]
    恬:a,忄,舌鱻惐纵组干口[GHJKV-T],
    悞:a,忄,吳鱻鬾无二与版鱻魊丨无钩𠃌版鱻魊𠃊版[GHT-JK-V],
    惨:a,忄,参叁[GHJK-T],
    惮:a,忄,单単[GT-J],
    慅:a,忄,蚤鱻鬾叉版鱻魊㕚版[G-HTJK],
        搔[GV-HTJK]
    慨:a,忄,既鱻惐丿底𩙿版旣[GHTJV-K],
        槩:d,既旣鱻馘丨二版[GH-TKV-J],木,
    黽:憴:a,忄,黽鱻鬾闭肠版鱻魊开塞版[GK-HT],
    養:懩:a,忄,養鱻鬾撇化羊版鱻魊𦍌食版[G-HTJK],
        攁
    戾:A,户戶[GHV-TJK],犬,
        房:A,户戶戸[GHV-TK-J],方,
        所:a,戶戸[GHTKV-J],斤,
    勺:扚:a,扌,勺鱻鬾丶版鱻魊一版[GHT-JK],
        犳:a,犭,勺勺[GT-K],
    扭:a,扌,丑鱻鬾尾大版鱻魊双杠版[G-HTJK],
    扳:a,扌,反鱻鬾撇顶版鱻魊横顶版[GHV-TJK],
    平:抨:a,扌,平鱻鬾丷版鱻魊八版[GHTV-JK],
        半:拌:a,扌,半鱻鬾丷版鱻魊八版[GHTV-JK],
        卷:捲:a,扌,卷鱻鬾丷龹版鱻魊八𠔉版[GHT-JKV],
        酋:揂:a,扌,酋鱻鬾丷版鱻魊八版[GHTV-K],
        搤:a,扌,益鱻鬾丷版鱻魊八版[GHT-JK],
        敝:a,㡀鱻鬾丷版鱻魊八版[GHTV-JK],攵,
        敞:a,尚鱻鬾丷版鱻魊八版[GHT-JK],攵,
    宂:抭:a,扌,宂鱻鬾几版鱻魊儿版[G-HTK],
        沉:a,氵,冗鱻鬾几版鱻魊儿版[GHJKV-T],
    抱:a,扌,包鱻鬾巳版鱻魊己版[GHTKV-J],
        泡
    拐:a,扌,另叧[GKV-HTJ],
    拥:a,扌,用鱻鬾弯月版鱻魊直月版[GV-H],
    邦:挷:a,扌,邦鱻鬾横顶撇化丰版鱻魊撇顶撇化丰版[GV-HT],
    角:捔:a,扌,角鱻鬾三腿版鱻魊两腿版[G-HTJK],
    舍:捨:a,扌,舍舎[GHTKV-J],
    掰:a,龵手[GK-HT],分,手,
        搿:a,龵手[GJK-HT],合,手,
    並:掽:a,扌,並鱻鬾虚业版鱻魊虛业版[GHT-JK],
    奏:揍:a,扌,奏鱻鬾天版鱻魊夭版[GHT-K],
        楱:a,木,奏鱻鬾天版鱻魊夭版[GHTV-JK],
    搢:a,扌,晋晉[G-HTJK],
    搲:a,扌,窊鱻鬾厶瓜版鱻魊无口虫瓜版[GHT-K],
        狐:a,犭,瓜鱻鬾魊厶魊无口虫版[GHTV-JK],
    杀:殺:摋:a,扌,殺鱻鬾魊朩魊朮魊术版[G-HT-JK],
    屏:摒:a,扌,屏屛[GHT-JK],
    撝:a,扌,爲為[GJKV-HT],
    撇化羊版囗或𦍌丿版
        着:撯:a,扌,着鱻鬾撇化羊版鱻魊𦍌丿版[G-HT],
        差:搓:a,扌,差鱻鬾撇化羊版鱻魊𦍌丿版[GV-HTJK],
        溬:a,氵,羗鱻鬾撇化羊版鱻魊𦍌丿版[G-T],
    擄:a,扌,虜鱻鬾田版鱻魊毌版[GH-TJK],
    擳:a,扌,節鱻鬾魊即魊卽版[GHT-K],
        櫛:a,木,節鱻鬾魊即魊卽魊丨二版[GHT-NONE-JK],
    攬:a,扌,覽覧[GHTJK-V],
    敢:a,纵组囗无钩𠃌囗耳鱻惐纵组丅耳囗囗左龘敢[G-HTJKV],攵,
    散:a,纵组龷月囗囗左龘散[GHJKV直月-T底用肉月],攵,
    斖:d,文,舋鱻鬾同版鱻魊冂一丅版[G-HT],
        爂:d,同版𦥯鱻鬾同版鱻魊冂一丅版[GK-HT],火,
        璺:d,同版𦥯鱻鬾同版鱻魊冂一丅版鱻惐冂一空心彐[GK-HT-J],玉,
    斠:a,冓鱻鬾单杠版鱻魊双杠版[GHTK-V],斗,
    新:a,亲鱻鬾魊朩魊木版[GV-HTJK],斤,
    斲:a,左龘斲囗囗角似口版囗或角似卯版囗囗鬬__5515515121_vs_35215515121[GHTK左龘斲囗囗角似口版5515515121-J左龘斲囗囗角似卯版35215515121],斤,
    旃:a,方,纵组𠂉丹囗鱻鬾亠丹版鱻魊丄丹直化版[GHT-JK],
        栴[GHT-JK]
    旡:既:a,缺丿艮,旡鱻鬾𠃋版鱻魊丄版[GHT-J],
        旣:a,皀,旡鱻鬾𠃋版鱻魊丄版[GHT-K],
    旨:d,匕鱻鬾撇顶版鱻魊横顶版[GJKV-HT],日,
    昊:d,日,天鱻馘倒二版[GHT-JK],
    昝:d,处鱻鬾卜版鱻魊人版[GH-TJK],日,
    曺:d,由版古鱻惐纵组亠田[GJK-T],日,
    曼:d,日冃[GJKV-HT],纵组罒又,
    朕:a,弯月,关鱻馘八版[GHTJV-K],
    杀:d,乂,朩木[G-T],
    条:d,夂,朩木[G-HTJK],
    柝:a,木,斥鱻鬾乂卜版鱻魊下版[GJK-HT],
    栃:a,木,厉鱻鬾撇顶版鱻魊横顶版[GJK包龘𠂆万-H正序纵包龘厂万],
    條:a,横组亻丨,条鱻鬾魊朩魊木魊夂魊攵版[GV朩-HTJK木][GV夂-HTJK攵],
    樇:a,木,脩鱻鬾魊夂魊攵魊直月魊肉月版[G夂-HTK攵][GHK直月-T肉月],
    梳:a,木,㐬鱻鬾亠厶𠫓版鱻魊七丶𠫓版[GH亠厶-JKV丄版-T],
        棄:d,𠫓鱻鬾亠厶版鱻魊七丶版[GHJK-T],穿头版纵组廿木鱻惐纵组丗木[GHT-JK],
        棛:a,木,育鱻鬾亠厶𠫓版鱻魊七丶𠫓版鱻魊直月版鱻魊肉月版[G-T][G-T],
        焴:a,火,育鱻鬾直月版鱻魊弯月版[GHK-T],
    棩:a,木,右龘淵囗鱻馘直化版[GTK-H],
        肅:橚:a,木,肅鱻馘中间多一隔横直化版[GTK-H],
        肅:潚:a,氵,肅鱻馘中间多一隔横直化版[GTJK-H],
        蕭:櫹:a,木,蕭鱻馘中间多一隔横直化肅版[GTK-H],
        蕭:瀟:a,氵,蕭鱻馘中间多一隔横直化肅版,
    棷:a,木,取鱻惐变体取[GHTK-J],
    樦:a,木,䇠鱻鬾主版鱻魊龶版[GHT-K],
        殶:a,主龶[GHT-K],殳,
        炷:a,火,主龶[GHT-JK],
    橮:a,木,貿鱻鬾头留版鱻魊卯版[G-T],
    檒:d,林,風鱻鬾撇顶䖝版鱻魊横顶䖝版[GK-HT],
    綿:檰:a,木,綿鱻鬾糹版鱻魊糸版[GT-JK],
    檾:d,𤇾,林鱻鬾木木版鱻魊丶乚版鱻魊乚乚版[GH-JK-T],
    櫃:a,木,匱鱻鬾目版鱻魊且版[GHTJK-V],
    櫝:a,木,賣鱻鬾魊罒魊四版[GTK-HJ],
    櫱:d,辥鱻鬾撇化屮版鱻魊山版[GHJK-T],木,
    櫴:a,木,賴鱻鬾𠂊版鱻魊刀版[G-T],
        瀨:a,氵,賴鱻鬾𠂊版鱻魊刀版[G-HTJK],
    次:a,冫二鱻惐提二[GHJV冫-T二-K提二],欠,
    欤:a,与鱻惐刁版占[GT-J],欠,
    残:a,歹,戋㦮[G-TJK],
        浅
    亟:d,木型纵组了叹囗或丂版[GV木型纵组了叹-HTJK木型纵组丂叹],一,
        涵:a,氵,函鱻鬾了版鱻魊丂版[GHT-JK],
    殺:a,杀鱻鬾朩版鱻魊木版鱻魊朮版鱻魊术版[G朩-JV木-HT朮-K术],殳,
    汛:a,氵,卂鱻鬾十版鱻魊𠂇版[GHTV-JK],
    汴:a,氵,卞鱻鬾亠卜版鱻魊丄卜版鱻魊十丶版[GHT-J-K],
    沿:a,氵,纵组几口囗鱻鬾魊几魊儿魊八版[GKV-HT-J],
    洖:a,氵,吴吳[G-HT],
        噳
    洡:a,氵,耒鱻馘撇顶版[GV-T],
    洴:a,氵,并幷[GHT-JK],
        摒
    派:a,氵,𠂢鱻鬾带钩版鱻魊无钩版[GHTKV-J],
    浳:a,氵,纵组弋月鱻鬾弯月版鱻魊肉月版[G-T],
        肥:淝:a,氵,肥鱻鬾弯月版鱻魊肉月版[GJKV-HT],
        肋:筋:d,𥫗,肋鱻鬾弯月版鱻魊肉月版[GJKV-HT],
    淸:a,氵,靑鱻鬾直円版鱻魊弯円版[GK-T],
    巷:港:a,氵,巷鱻鬾魊巳魊己版[GHTV-JK],
    舌:恬:湉:a,氵,恬鱻鬾魊千魊干版[GHJK-T],
    滞:a,氵,带帯[G-J],
    滬:a,氵,扈鱻鬾魊户魊戶魊戸版[GH-TK-J],
    漖:a,氵,教敎[GHT-J],
    漢:a,氵,右龘漢囗鱻鬾廿版鱻魊龷版鱻魊艹不出头倒日版[GHTK-V-J],
    潃:a,氵,彳,纵组夂月之或直月或肉月或夂或攵版[GH直月-T肉月][G夂-HT攵],
    潨:a,氵,衆鱻鬾丿罒乑版鱻魊血底眾版鱻魊血乑版[G-T-JK],
    潵:a,氵,散㪚[G直月-T肉月-V日],
    潸:a,氵,纵组林月囗鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版[GH直月-JK弯月-T肉月][GJK木缺丶朮版林-T缺丶朮缺丶朮版林-H木木版林],
    澚:a,氵,丂版奥鱻惐丂版奧囗囗缺一粤鱻惐缺一粵[G丂版奥/缺一粤-TJ丂版奧/缺一粵],
        米版向
        釆版向
        丂
    澞:a,氵,虞鱻鬾魊吴魊吳版[G-HTK],
    濓:a,氵,亷廉[GHT-V],
    濞:a,氵,鼻鱻鬾魊丌魊廾版[GHTJV-K],
    濯:a,氵,翟鱻鬾羽版鱻魊彐彐版[GHT冫版羽-K丿丿版羽-J彐彐版羽],
    濲:a,氵,纵四组士冖一木鱻惐纵三组士冖禾[G一木-HTK禾],
    濹:a,氵,墨鱻鬾魊黒魊黑版[GJ黑;手机字体与笔顺码:黒],
    灂:a,氵,爵鱻鬾厶版鱻魊丨二版[GHT-K],
        爵:d,爫,纵组罒囗寸版即鱻鬾厶版鱻魊丨二版[GHTJV-K],
    灋:a,氵,拟包纵组廌去鱻惐纵组廌去[GHT-JK],
    灰:炭:d,山,灰鱻鬾魊𠂇魊厂版[GV-HTJK],
        𠂇厂
        灰:d,𠂇,火, #G,H,T,K,V
        灰:A,厂,火, #J
        湠:a,氵,炭鱻鬾魊𠂇魊厂版[G-HT],
    赤:赫:爀:a,火,赫鱻馘直化版[GTJK-H],
    爋:a,火,横组熏力囗鱻馘灬底版[HTK一致:横组熏力;手机字体:横组熏力|笔顺码+部件拆分:灬底版横组熏力],
        玂:a,犭,横组蕇斤鱻惐蘄[GK横组蕇斤-HT蘄;手机字体:横组蕇斤|笔顺码:无法区分],
    雚:爟:a,火,雚鱻鬾魊卄魊卝版[GK-HTJ],
        艹:卄卝
    庸:
        牅:a,爿,庸鱻鬾魊直月魊弯月版[GHJ-T], #牗
        牗:a,片,庸鱻鬾魊直月魊弯月版, #牅
    犮:O,缺乚尤,又乂[G-HTJK], #笔顺『𠂇又丶』最后=>O
    猒:a,纵组日月囗鱻鬾魊日魊曰魊直月魊肉月版囗囗非冐[GTJK日-H曰][GHJK直月-T肉月],犬,
    黄:廣:獷:a,犭,廣鱻鬾魊黄魊黃版[G-HTJK],
    亠:玄:d,亠丄[GHT-JKV],幺,
    珊:a,王,册冊[GV-HTJK],
    虎:几儿:琥:a,王,虎鱻鬾魊几魊儿版[GV-HTJK],
    𧘇:睘/袁/哀/遠:環:a,王,睘鱻鬾魊𠄌魊丨版[GHTKV-J],
        但:『睘』:GHTJK一致:𠄌
    瓯:a,区鱻鬾魊乂魊又版[GJK-T],瓦,
    画:d,一,反序拟包纵组凵田鱻鬾魊田魊由版[GHT-JK],
    眔:d,罒,氺鱻鬾八八版鱻魊丷八版[GT-J],
        率:繂:a,糹糸,率鱻鬾丷八版鱻魊八八版[GHT-K],
    眾:d,罒,木型纵组亻从鱻惐中序拟横三组人亻人[GHTV-JK],
    瞯:a,目,閒鱻鬾魊直月魊弯月版[GTJK-H],
    禸:%,厶鱻惐无口虫[GHJK-T],冂,
    稽:a,禾,纵组尤旨鱻惐纵组尤㫖[GHTJV-K],
    竹:a,纵组𠂉丨鱻惐纵组𠂉亅[GHTJK-V],纵组𠂉亅,
    篹:d,𥫗,目,大,㔾巳[GHTK-J],
    簆:d,𥫗,寇鱻鬾魊攴魊攵版[GT-HJK],
    簔:d,𥫗,衰鱻鬾一卄一版鱻魊廿一版[GJ-T], #簑0x7C11簔0x7C14
    簭:d,𥫗,纵组巫㕣囗鱻魌巫鱻馘头嗇版[GHT-K],
    粟:d,覀囗囗非西[GHTJKV一致:覀],米,
    辥:糱:d,辥鱻鬾魊屮𠂤魊山𠂤魊屮㠯版[GH-T-K],米,
    紙:a,糹糸[GHTV-JK],氏,
    攵夂:致:緻:a,糹糸,致鱻鬾魊攵魊夂版[GJ-HTK],
        夂攵:纵组夂糸:絛:a,横组亻丨,纵组夂糸囗鱻鬾魊夂魊攵版[G-HTJK],
    丷八:益:d,纵组䒑八囗鱻魌䒑鱻鬾魊丷魊八版[GHTJV-K],皿,
        縊:a,糹糸,益鱻鬾魊丷魊八版[GHTV-JK],
    縟:a,糹糸,辱鱻鬾魊拟包纵组魊纵组版[GJKV-HT],
    県-系:縣:a,纵组囗芯三版且囗小鱻惐県[GTV-HJK],系鱻鬾撇顶版鱻魊横顶版[GHTJK-V],
    每毎:敏:繁:d,敏鱻鬾魊每魊毎版[GHTKV-J],糸,
    廛:纏:a,糹糸,廛鱻鬾魊八魊儿版[GV-HTJK],
    羀:d,网,畱鱻鬾直化丣版鱻魊丣版[GT-JK],
    羋:d,夹丨卝,二版丰鱻惐干[GJK-HT], #芈
    撇化羊vs𦍌丿
        羌:A,撇化羊,乚, #G
        羌:d,𦍌,儿, #H,T,J,K
        羗:A,撇化羊,拟包横组乚厶, #G
        羗:d,𦍌,拟包横组儿厶, #H,T,J,K
        羗:G,羌,厶,
    永:羕:d,𦍌,永鱻惐纵组亠水鱻惐纵组丄水[GHT-K亠丄],
    羮:d,羔,纵组一夫鱻惐㺯[GHTJK-V],
    growing[G:|T:]

車版击/正序拟下包纵组車凵=!=軎
底龘隳==加丶尒

一部件多字形多笔顺码:here
    直:目版拐化直#埴
    真:目版拐化真#嵮
    真:目版真/十目+无头六#慎
    真眞#寘
        #JK常态
    具:芯三版,目版
        埧
        填
        #J常态?
        #例外:惧:GHTJK一致:芯三版
    縣:芯三且版vs𠃊目版#懸
    旦vs且
        查査#楂
    昷𥁕#塭
    黑黒#墨
        黒黑#濹
    录彔#娽
        #常态
    内內#抐
    吕呂#巆:營
        宫宮#熍
    尔尓#弥
        #J常态
    毁毀#檓
    带帯#滞
    教敎#漖
    攵攴
    头用夂:夂攵
        脩#樇
        条#條[GV-HTJK],樤[G-TJK]
    ?攵夂#緻:致
    ?夂攵#絛:纵组夂糸
    ?市巿#姉
    ?主龶#樦,殶,炷
    ?参叁#惨
    ?毋母毌#毐,毒
        母毋毌#碡
    ?母毌
        每毎#悔:每,繁:敏
        拇:GHTJK一致:母
    兼:丷版兼vs K丿丿并千版兼
    弱:丿版#嫋
    羽:丿版#噿:翠
        #K常态!
    今:亽vs亼#岑
    令:亽vs亼;龴vs缺一卫(类似:卩)#姈
    户戶戸
        妒:户戶
        扁#媥
        戾:户戶
        房:户戶戸
        扈:户戶戸#滬GH-TK-J
        所:戶戸
        肩:户戶#掮:GHV-TJK
    匕𠤎七#顷比叱皂皀
        横-撇
            尼:匕#坭埿
            比#堒
            塡
            疑#嶷HT-GJK
            旨#恉HT-GJK,指HT-GJKV
            #T常态！
    害:丰-龶,横顶版-撇顶版#害,割
    㓞:横组丰刀:絜:左上角:彡版丰#噄
        囓,恝
        㓞:丰版/提丰版,提龶版#契
    壬,𡈼,王,一士版王
        婬:㸒:壬,𡈼
        #但『皇』:GHTJK一致:王#媓
    横顶版-撇顶版
        呈:王壬𡈼#埕
            望,朢,檉:聖
        妊:壬,一士版王
        丰#妦
        邦:撇顶版撇化丰#垹,帮
            HT常态
        䖝#堸:風
        屯#噸:頓,屯[GHTV-JK]
        反#坂
        忝#婖
            夭天#岙
            天夭#忝,奏
        舌vs底龘舍/纵组干口#恬,湉
        耒#洡
        系#縣
    丷八
        兑兌
        尊#噂
        酋#揂
        曾#囎
        半#坢
        平#坪
        关#朕
        卷#埢
        龹𠔉#塍
        益#塧
        㒸#墜
        㡀#嫳:敝
        肖#峭
            #头龘肖==小|倒小
            #例外:晄,恍:GHTJKV一致:倒小
                #?头龘光===倒小?
        弚#弚G-HTK
        #例外:底用䒑#壴
        #例外:弟:GHTJKV一致
    丷儿
        鬲#囐
    八儿
        穴#噾:窨#埪
            容:宀+八儿+人+口#容
        㓁#堔
        坴#坴,埶
        夌#堎
        夋#埈
        冏#埛
        商#墒
        甚#堪
        㚇#堫
        詹#嶦
        廛#纏
    八儿人:
        奐#寏
    几儿
        亮#喨:G-HTJK
        虎#婋,彪:G-HTJK,琥GV-HTJK
        微#嶶
        宂#抭
        冗#沉
        秃禿#䛢,瀩:頽
        壳売#㸿
    几儿八#沿:纵组几口
    犮:又乂#坺,犮
    蚩:屮,撇化屮,山䖝版#媸
        弢
    夂夊#夌
        #?TK常态?
        #例外:変,夏:K夂-T夊
        #T常态!
    俞兪#堬
    爲為#噅
    开幵#咞
        开幵鱻惐干干版幵#烎
    者:加丶版#堵
        #J常态!
    即卽#堲
    艮:即
    良:缺丿良/厶版良vs良
        朗#塱
        郎#嫏
        郎郞
        #K常态!
    左用良:缺丿良,底龘𩙿,皀
        郎#嚮:鄉
        食飠𩙿
        節:底龘飠,底龘𩙿#幯
    敖鱻惐横组囗纵组士方攵#傲
        #常态!
    辶:之版辶,丶廴版辶,丶之版辶#塳,撻
        #常态!
    堇鱻馘艹倒日版
        #但:『堇』本字没有J版，也就恰好没有『艹倒日版』
        #但:『墐』:GHTJK一致！
    右龘漢囗鱻馘艹倒日版
    林:(木or朮版木)+朮版木 #<<==嘛,檾
        例外:罧GHTJK一致:木木
    ?杀:朩木朮术#殺
        朩木#杀
        术朮
    角:三腿版vs两腿版#嘝,捔
    唐:纵组肀口:肀:不穿底版肀#塘
    艹䒑
        兹茲#濨:慈
    艹:卄版,十十版
        華#嘩
        垂#垂
        荒#塃
        荅#塔
        塟
        莫#塻
        #HT常态?
    艹:卄卝
        蒦#嚄,獲GJKV-HT
        雚#嚾,爟
        苟#敬:GJKV-HT
        蔑#櫗:GV-T
        #HT常态?
    丶vs短撇
        隹#堆
        纵组亠厶囗囗𠫓#堉:育
    丶vs短竖
        亠丄
            亥#垓
            卒#埣
            六#塓:冥
            广#塘
            高#塙
            方#坊
            旁#塝
            立#境
            享#墪
            衣#壊
            主#宔
            市#市GHTV-JK贼像『巿』
            玄#弦GHT-JKV
            卞#汴GHT-J-K
            #常态!
        宀#<<==宀
            穴#坹,塎:容
            宛#埦
            #JKV常态!
        礻#社T短竖-V短横
    然:丶丶版,冫版#嘫
    丶vs短横
        礻#社T短竖-V短横
        勺勺#圴,犳
        氐#坻
        良#娘
        言#娮
        倉#嵢
        永#栐
        今
        半𥫗#懢:監
            半𥫗vs缺丨午#嚂
    氺四点vs四短横
        臯#嘷
        头用雨#嚅:需
        屬#囑
        脊#塉
        犀#墀
        褱#壞
    纵组八八vs氺四点
        眔#嚃
        率#摔:JK-GHT,繂
        㡀#撇:敝:JK-GHT
    冫二
        匀勻鱻馘提二版#均
        次#垐
    月:二版,丶丶版(只有J)
        朝#嘲
        塍
        媵
        朋#掤
        #xxx J常态?
        #例外:
            #底用肉月:娟:J直月
            刖:一致:弯月版
            抈:一致:弯月版
    靑:直円版,弯円版
        淸
    青月:直月版,円版,弯月版
        青#埥
    直月版,弯月版
        有#宥
            #例外:崤:肴
        閒#憪H-GTJKV,瞯
        庸:直月,弯月#牅,牗
    底用刖:直月版,弯月版#前,媮:俞兪
        刖:一致:弯月版
        #例外:揃,揄:J丶丶版
    胡:直月版,肉月版,弯月版#媩,湖,猢
    一致:弯月版
        抈
        刖
        搠
        霸#欛GTJK
        縢#籘GTJK
    底用肉月vs直月
        猒#猒,嚈
            #非『冐』:直月,弯月,冃
        纵组立月囗囗左龘龍囗囗直月肉月#湇,嚨,攏:龍:T肉月
        肙#埍
        厭#懕
        纵组左月囗囗右龘隋#堶:右龘隋
        脊#塉
        䏍#姢,態:能
        肖#娋
        胃#媦,渭
        骨#愲
        脅#愶
        嬴#嬴,攍HT肉月
        贏#灜HT肉月
        肩#掮
        肯#掯
        胥#揟
        背#揹
        肋#筋
        脾#簲
        肥#淝
        䏌#洕
        浳#浳
        脣#漘
        羘#羘
        纵组林月囗鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版#潸
        散#撒,散GHJKV直月-T肉月
        育#堉,徹
            育/横组育攵#撤,澈
            #例外:焴:育:GHK直月-T弯月
        纵组幺月#胤
        肴#崤 #但『有』不含『肉月』
        纵组夂月之或直月或肉月或夂或攵版:
            脩#樇
            潃
        #例外:青,底用刖,有,閒
    丹:亠版丹,丄版丹
        旃
    覀西
        覃#䚓
        垔#垔,堙
        #例外:粟
    头用亦:亦vs直化亦#奕
        赤:直化版#哧,嚇:赫
    敢:左上角:无钩𠃌版vs丅版#噉,敢G-HTJKV
    朁:出头兂兂版#噆
    米版向vs釆版向
        奥奧#噢
            #常态!
        粤粵
        丂版奥鱻惐丂版奧囗囗缺一粤鱻惐缺一粵#澚
    吴吳#洖
        虞#噳
    虚虛#墟
    善:纵组羊䒑,断尾羊版/𦍌版/纵组𦍌䒑#善,墡
        #常态!
    鼻:丌vs廾#嚊
    疐:厶版疐#䡹
    專:纵组叀寸#囀
    黄黃#嚝:廣,墴,獷
        #常态!
        黃:由田:
            T=>廿一田八#櫎
    画:田由#画
    告吿#嚳,悎
        #HJ常态!
    下:丨丶相交
        斥#坼
    彐vs右倒巾:
        又版帚#埐
        帚#埽,帚G-HTJK
        刍#急
    头龘咼:偏左版咼vs偏右版咼
        咼#堝
        骨#搰GV-HTJK
    䍃:瑶瑤
    争爭#埩,琤
    將:斜月版vs爫/头用爪/寽
        墏
    头用爪:爫vs爪之丶丶版vs断折夕版
        孚#垺
        寽#埒
        㸒#婬
        爰#媛
        舀#嫍
        妥#挼GHT-JK
        采#採GHTJV-K
        丿𭕄版爫,𠂆丶丶爪版爫,断折版夕:
            爰#爰GHT-JK-V
    #头龘负囗囗𠂊结尾在中囗囗非头龘欠
    带钩版vs无钩版
        示#奈
        糸#嫘:累
        忝#忝
        ?底用小
            示#奈
            糸#嫘:累
            但:一致:带钩:
                尞#嫽
        木朩
            亲#媇
            杀#弑
            #非 常态
        xxx?底用木:朩
            亲#媇
            但:一致:无钩:
                某:GHTJKV一致:无钩#媒
                枼#媟
                染#媣
                呆#媬
                榮#嬫
            ==>>只有『亲』
    头龘负:𠂊vs带钩版/底龘万vs刀
        臽#埳,欿
        負#媍
    日曰冃
        最:GJKV日,HT冃#撮,嘬
        曷:日,H曰#堨
        纵组日羽囗囗右龘塌:GJ日-H曰-TK冃#搨,塌:右龘塌
        曼:日,冃#墁
        昌:纵组日日vs纵组日曰#娼
        冒:GHTJK一致:纵组冃目#媢
            但:帽=>GHTV冃-JK日
        抇:TKV日-GH曰#抇
        曹:GTK日-H曰#嶆
        朁:GTK日-H曰#嶜
        會:GTK日-H曰#徻
        欥:GTK日-H曰#欥
        魯:GTJK日-H曰#櫓
        替:GTJK日-H曰#潜
        㝵:GTJKV日-H曰#得
        复:GTJKV日-H曰#復,澓
        曾:GTJKV日-H曰#曾
        沓:GTJKV日-H曰#沓
        曰:
            [0x66F0曰..=?]
        一致:日:
            意#憶
            景#憬
            尞#憭
            暴#懪
            白#拍
            旱#捍
            圼#捏
            是#提
            亘#揎:宣
            昷#揾
            晋晉#搢
            莫#摸
            者#撦:奢
            亶#擅
            昬#敯
            耆#榰
            昊#淏
            捑
            [0x65E5日..=0x66EF曯]旧,旦,旨,早...曯
    㐄:丄版囗囗底龘年#夅
        韋#媁
        舛#曻
    处:卜人#处,昝
    卧臥:卜人
    那:双杠版#娜
    丑:尾大版vs双杠版#峱
    冉:双杠版
        冉#侢:再,偁,斠:冓
    非:丨丨版,丿丨版#婓
        罪#嶵,罪
    ?以:厶版#娰
    周:土vs二版丰#婤
    臣𦣝,口版臣
        右龘姬===(𦣝or口版臣)
        巸:口版臣vs𦣝#媐,洍
    辱:拟包纵组:纵组vs右上包围#媷
    叟:臼穿底版,臼不穿底版,𦥑穿底版#叟,嫂
    與:芯丨版,芯丿版#嬩,嶼
    #?底用纵组丶丶:纵组丶丶vs冫#冭,冬,寒
        #?例外?仒,
        #确认:枣:GT一致:纵组丶丶
    鬼:撇化甲版vs甶儿版#嵬
    撇化羊版vs𦍌丿版
        差#嫅,搓
        着#撯
        養#攁
    融横版,断横版
        戢#嶯
    囱囪
        窗#窗
        悤#幒
            #NOTE:悤:d,囱囗囗非囪,心,
    左龘颈囗vs圣#径
    止:𠃊止版,丄止版
        正:GKV-HTJ#延
        卸:HTJ-GKV#御
            反转！！！妖孽！
    术朮#怵
    寺:土版,士版#待
        #T常态
    蚤:叉版,㕚版#慅
    糹糸#檰:綿,櫞:緣
        䜌#卛,戀
        羅#儸
        #JK常态
    刃刄#扨
    另叧#拐
    别別#捌
    𠆢:头用人:人入
        全#拴
    舍舎#捨
    业:虚版业,虛版业
        並#掽
    晋晉#搢
    瓜:厶vs无口虫#搲GHT-K,狐GHTV-JK
    并幷#洴
        屏屛#摒
    旡:𠃋版,丄版#旡[GHTJ-K]
    旡兂#灊:鬵
    𠫓:亠厶版,七丶版#梳:㐬,流,澈:育,珫:充
        #T常态
    羡羨:檨
    罒四:
        買,賣#櫝
    戋㦮#残,浅
    亟:了丂#亟
        函:了丂#涵
        #例外:烝:GHTJKV一致:了
        #例外:焏:GTJ一致:了
    灰:𠂇厂#灰,炭,湠
    巳己:
        包:巳版,己版
            抱
            泡
            #J常态
            #例外:炮:GHTJKV一致:巳,炰GHTJK
        巷#港
    ?亷廉#濓
    鼻:丌廾#濞
    同版𦥯:同版,冂一丅版#爂
    牙:𠃋丄
        冴,牚:[GHT-JK],
        牙:[GHTJ-KV]
    右龘備:龷直甪,龷弯甪,艹厂直用#備,犕
    册冊#珊
    豖豕#啄,琢
    单単#箪
        #J常态

    ...
    growing

取消:
    #录彔:G vs T
    #窢𦥑版叟:G vs T
    取消『提一版爵/提二版爵』
    取消『丿版羽』:因为K韩国版羽 必是 丿版羽
    卽版節vs即版節
    横顶版vs 撇顶版
        偑:H,T一 - G,J,K丿
        䛽:T - G
        䛘:T - G,K
        㹠:G,T,V横顶版屯vs J,K撇顶版屯
        天 夭
        丰:䛶:G - T,K
        程:GJV王vs HTK𡈼#壬
        䄇䇸:GV王vs TJK𡈼#壬
        侱:GV王vs TK𡈼#壬
        耒:GJ vs TK
    㹣:G,T丶丶版冬vs J冫版冬
    㹾:G卜版咎vs T人版咎
        倃:G,K卜版咎vs H,T人版咎
    㺄:GT刂版俞vs K巜版俞
    㺈:G直屮版蚩vs TK撇屮版蚩
        䥀G-T
        䩶=>[G,T一致:撇屮版蚩;手机字体与笔顺码:直屮版蚩]
    㺌:丷版兼vs K丿丿并千版兼
    㺔:a,犭,HJKV爲 T為,
    户戶，扁
        户戶戸
    八vs儿:
        㓁:纵组冖八 纵组冖儿
        䛎:G - T
        䛪:G - T,K #K带钩
        䡜G-T
        冏G-HTJK
        凌:夌:GV-HTJK
        勘:G-HTJKV
    几vs儿:
        虎:䖎:G几vs T,J儿
        䛇:G几vs T儿
        䛢,䢇,䥩:G - K,T
        亮:G - H,T,J,K
        仉:G,H,T,K,V - NONE
    匕:尼:䛏:G,H撇梁匕vs T横梁匕
    G亽vs T亼:
        㼨:丶版今vs 一版今
        㽉
        㸳:G,T头甬版令vs J底节版令
        冷:令=>GHTV龴-JK缺一卫
        冷:令=>GV亽-HTJK亼
            呤
    亽亼:
        令
        凔:倉:G-HTK
    䃊,䑅䁾:卄版艹vs十十版艹vs卝版艹
        倕:G,K卄艹版垂vs H,T十十艹版垂
        喵:GV-HT-NONE
    䁽:G乂版vs T人版/囚
    礻vs示
        䄃=>[GTH礻JK示]
        榊:神
    咼:G偏左版咼vs TH偏右版咼
        堝:G-THJK
    角:䚗:G三腿版角vs T两腿版角
        𧣈𧤤[???;手机字体:两腿版角|笔顺码:三腿版角]
    丷八
        曾:GT丷vs K八
        尊:䔿:GTH丷vs K八
        肖:GT⺌ vs K小
        䘷益:GT - K
        冸:半
    #直:䐈:GT vs J目版拐化直
    #真:䐜:GT vs JK匕目版拐化真
        #傎GHT-JK
        券:龹:GHTJ-KV
        真眞
    差:䐤:G撇化羊版vs T,J𦍌丿版
        差[GV-HTJK]
    取消:䓧[G:了版䓧|T:丂版䓧]
        <<==亟:[G,V:了版䓧|H,T,J,K:丂版䓧]
        極:a,木,亟鱻鬾了版鱻魊丂版[GV-HTJK],
    夂夊夕:？？#夏囱处？
    垔:䗎䓰:覀vs西
        䓰:d,艹,窢西版垔[G:覀版垔|T:西版垔],
        䙵:G,T - K
        䚈:G-T,J
        䧈:a,阝,覀西[G-only:覀;手机字体与笔顺码:西],
    覀vs襾
        䚓:G,K - T
        䙴:G,T - J
        偠:要:G,H,T,K - J
    䙴:覀vs襾;㔾巳
    㔾巳
        䙴
        篹
    #䗰:貫:G,T毌 vs K母
    ##䘄䐗:者:G,T? vs T?,J,K加点版#类似『石䂖』
    辶:䙜:[G:之版辶|T:丶廴版辶|K:丶之版辶]
    ?䙱:屬:GT氺-->K四短横？
        䚖:靈:头用雨:G四短横vs T氺
        䝥:臯:G氺四点 vs T四短横
        头用雨:T,H - G,K
    ?䚕:麗:头用丽:G丶vs K短竖
    直月vs弯月:
        䨖:有:G,J-T
        䨝:有:G,H-T
    䨙:G,V壬vs T𡈼
    飠vs𩙿飮
        K=>𩙿
        䬯,䬱GT-K
    取消区分:䶯0x4DAF
        :<<==龜:0x9F9C:字形个不相同:
            G:丿头大脸四脚直肠乂背龟
            V:象头大脸四脚直肠乂背龟
            H,K:象头大鼻孔四脚直肠乂背龟
            T,J:象头大鼻孔四脚井肠乂背龟
            #黽
        ==>>:
        但不取消:䆋0x418B
            <<== 䆋0x418B vs 龝0x9F9D
                    #独立之后:竟然不是？T:刀头大鼻孔四脚日背龟
            这应当是兼容字?:䆋0x418B:a,禾,窢乂版刀头大鼻孔四脚日背龟囗囗右龘䆋35251125511511511[T:刀头大鼻孔四脚日背龟|K:刀头大鼻孔四脚乂背龟],
    低:G,V丶vs H,T,J,K短横
    倗:朋:G,H,T,K四短横 vs J四丶
        偂:G直月-T,K弯月-J丶丶版直月
            剪:前:GHKV直月-T弯月-J丶丶版直月
            但是!:前:d,䒑,底用刖[G,H,J,K,V:直化刖|T:弯月版刖],
        偸:G,K直月-T弯月-J丶丶版直月
    倜:周:G,T,K土 vs H,J二版丰
        周=>GTJKV土口-H二版丰
    取消:双杠版冉:侢,偁
        #但是:冉=>GHTJV单杠vs K双杠
        #但是:再=>GHTJKV单杠 一致 无 双杠！
        #但是:冓=>GHTJK单杠 一致 无 双杠！
        侢:a,亻,再囗或冄版[G,H:再|T:冄版],
            #侢:a,亻,窢冄版再-->再囗或冄版, #以便补全complete
        偁=>[G H,T单杠版冉|J,K双杠版冉]
        傋=>[G H,T,K一致:单杠版冉]
    儼=>敢:右上角:G无钩𠃌 vs H,T,J,K,V丅
    儸:糹vs糸
        卛
    堨:曷[GTK日-H曰]
移除:
    䂖:d,𠆣,口,

    growing[G:|T:]

[[
def___OPS:here
    三参数判定:goto
    要求:含『二包』
OPS = 'a d F L O G A S ~ J % & V I ^ '
OPS__with_prefix_Nary = 'a横x组? d纵x组? F拟包纵组2 L反序拟包横组2 O插序全包龘2 G拟包横组2 A正序纵包龘2 S正序互包龘2 ~融横版横组2 J反序横组2 %下沉交叠拟纵组2 &插序下沉交叠拟纵组2 V正序拟下包纵组2 I融竖版纵组2 ^出头交叠拟纵组2 '
pattern4regex4spec_char = r'[囗龘靐鱻]'
    #def__pattern4regex4spec_char:here
pattern4regex4decorated_prefix = r'(?P<decorator>[^囗龘靐鱻]*?)(?P<basic_prefix>[纵横][三四五六七八九十]?组|包龘|[左右头底躯胸脸]龘|[左右][上下]龘|水平镜像龘|雨型二包龘|反序拟二包纵组|插序巫幽型全二包龘)'
    #def__pattern4regex4decorated_prefix:here

===
重命名调用前缀以消除歧义:here
[[
xxxxxxxxxxxxxxxxxxxxxx:goto
e ./script/汉语字典囗.py
    #临时:寄存器:以防全文件替换时修改到命令行
-->:
e ./script/hz/部件拆分.py
]]

===
选用特殊字符:goto
笔画数最多:龘䲜䨻,靐齉䴒齾䴒䶫䯂
查拼音:[,:][龘䲜䨻]
查拼音:[,:][靐齉䴒齾䴒䶫䯂]
:龘dá
:靐bìng
:齉nàng
:齾yà
查无:䲜龘
查无:䴒䴒䶫䯂
有拼音:龘靐齉齾
===
view ./script/汉语字典囗.py
view /sdcard/0my_files/tmp/out4py/汉语字典囗.py..仅提取拼音.withoutNULL..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
===
候选特殊字符:龘dá靐bìng鱻xiān麤cū厵yuán
    龘靐鱻麤厵:goto
最终选用:龘da2/调用函数,靐bing4/特色命名结束符,鱻xiān/鱻惐分支,

==>>:
重命名，以消除歧义
    包囗-->包龘
    融横版-->融横版横组
    融竖版-->融竖版纵组
    [左右头底躯胸脸...]囗 --> ...龘
    [左右][上下]囗 --> ...龘
所有前缀是:
    [^龘囗]*[纵横][三四五六七八九十]?组
    [^龘囗]*包龘
    [^龘囗]*融横版横组
    [^龘囗]*融竖版纵组
    [左右头底躯胸脸...]龘
    [左右][上下]龘
===
复杂半包围:
    [㱿===无弓彀]
        头用㱿囗囗头用无弓彀
    [㫃===无矢族]
    [倝===无斗斡]
    放:敫/敖鱻惐横组囗纵组士方攵
    右龘徽
    寐
?包龘耳?
    左上包龘耳又#变体取
        最
    右上包龘耳王#左龘聽
        聽
正序互包龘-『S』:
    包:S,勹,巳己,
正序纵包龘-『A』:
    冏:A,冂,㕣,
    匀:A,勹,冫二,
    %s/正序纵包龘厂刀/正序纵包龘厂刀/g
    底龘嚴===正序纵包龘厂敢
    問:A,門,口,
拟包纵组-『F』:
    拟包纵组尼木
    㱘:F,厭,止,
    䱷:a,拟包纵组虍魚,攵,
拟包横组-『G』:
    #xxx乸:a,也,母, #a-->G
    乸:G,也,母,
    卼:G,兀,危,
    剋:G,克,刂,
    処:G,夂,几,
    底龘冦===拟包横组元攴囗囗攴版㝴
    右龘嬎===拟包横组免生
    右龘嬔===拟包横组兔生
    右龘抛===拟包横组九力
    右龘拋===拟包横组尢力
正序拟下包纵组『V』:
    墼=>車版击/正序拟下包纵组車凵=!=軎
    車版击:V,車,凵,
        墼:d,横组囗車版击囗殳,土, #非『軎』
    缶:V,午,凵,
    触底版纵组丵臼:V,丵,臼,
        糳:d,横组囗触底版纵组丵臼囗殳,米,
反序拟包纵组-『U』
    底龘凿===反序拟包纵组凵囗纵组丷干
反序拟二包纵组3
    #~插序巫幽型全二包龘
    头龘豐===反序拟二包纵组山丰丰
反序拟包横组-『L』
    遠:L,辶,无钩袁,
反序横组-『J』
    疒:J,冫,广, #笔顺？先『广』再『冫』?虽然差不多
插序全包龘-『O』
    園:O,口,无钩袁,
中序拟横三组-『H』
    㸉4143112433443344334
        #xxx㸉=>中序-包拟横组囗炏辛
        㸉=>中序拟横三组火辛火
    蘷122132511212151534354
        蘷=>中序拟横三组止百巳/木型纵组百囗横组止巳/纵组一囗中序拟横三组止白巳#夒鱻鬾白版
    䕫12232511212151534354
        䕫=>中序拟横三组止白巳
    夔=>中序拟横三组止自巳
木型纵组-『T』:
    䀌:d,木型纵组聿皕,皿,
    ?木型二包纵组聿百百4
插序巫幽型全二包龘3-『W』:
    #~反序拟二包纵组
    头龘啬
    头龘喪
    躯龘宻===插序巫幽型全二包龘又丶丿==又丷版必
    笔顺码模式不一致bug?:
        幽255455452:丨幺幺凵
        豐211121112521251431:丰丰山豆
雨型二包龘3
    底龘繭===雨型二包龘囗断头巾靐糹虫
融竖版纵组『I』:
    熏:头龘熏
        熏:d,无足版融竖版纵组千黑,灬,
        无足版融竖版纵组千黑:I,千,无足黑,
        无足黑:I,包龘口丷囗囗𦉰,土,
        包龘口丷囗囗𦉰:O,口,丷,
        包龘口丷囗囗𦉰:d,冂,䒑,
        𦉰:A,冂,䒑,
    融合纵组山人
        㐪:d,亠,融合纵组山人,
        融合纵组山人:I,山,人,
        融合纵组山人:A,屮,乀,
    融并甲电版㫣
        亀:d,头龘负囗囗𠂊结尾在中囗囗非头龘欠,融并甲电版㫣,
        融并甲电版㫣:I,甲,电,
融横版横组『~』#融横版vs断横版
    戠:a,音,戈, #断横版#T,J,K
    戠:~,音,戈, #融横版#G,H
    底龘羲===融横版横组囗纵组禾丂囗戈
下沉交叠拟纵组『%』:正序
    牽
    头龘牽===下沉交叠拟纵组玄冖
插序下沉交叠拟纵组『&』:
    禹/禺
出头交叠拟纵组『^』:正序
    xxx反序下沉交叠拟纵组
    禸===出头交叠拟纵组冂厶
    肉===出头交叠拟纵组冂仌
    底龘襾===出头交叠拟纵组冂凵
]]


[[
xxxxxxxxxxxxxxxxxxxxxx:there:移动至下面文件:
e ./script/hz/部件拆分囗囗编辑处.py
===:
xxxxxxxxxxxxxxxxxxxxxx:goto
命名模式变更:goto
重命名调用前缀以消除歧义:goto
处理版字结尾的部件名:goto
优先级:goto
选用特殊字符囗口编程标识名用:goto
    囜囮囬圙圛圞:goto
选用特殊字符囗口鱻后:goto
    魊閾惐窢馘國:goto
选用特殊字符:goto
    龘靐鱻麤厵:goto
提取笔顺码暨比较:goto
==>>:
重要:
优先级:goto
    定义扩展regex
        ++魌
        即:从整体中提出部件，再给部件打上『版印』，并且 允许多个部件 正交 版印
命名模式变更:goto
    完成囗囗命名模式变更:DONE
提取笔顺码暨比较:goto
    对比:笔顺码:辅助定位错误:不过感觉 汉语字典.笔顺码 错误多，而且 差异不少来自于 笔顺不同
===
]]




view ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/单字_笔顺码_29685个.txt

grep '[瑴㲄榖轂㺉豰瞉䐨𧏚嗀嗀䍍穀鷇觳殼𢡱㲉螜愨糓㷤彀毂㝅㜌縠㨌殻慤]' /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out.txt
[㜌㝅㨌㲄㲉㷤㺉䍍䐨嗀彀愨慤榖殻殼毂瑴瞉穀糓縠螜觳豰轂鷇]
    vs [瑴㲄榖轂㺉豰瞉䐨𧏚嗀嗀䍍穀鷇觳殼𢡱㲉螜愨糓㷤彀毂㝅㜌縠㨌殻慤]
    =>𧏚嗀𢡱
    嗀0xFA0D𢡱0x22871𧏚0x273DA #兼容字符or超出基本位面
    嗀0x55C0

㺻:a,王,90360-->巿,
grep '[巿市]'  ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt
    --> 巿市囗囗亠/巿市囗囗十

grep '[0-9]'  ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt | less
.,.+9s/,\(\d\+\),/\r\1:\r/g

grep $'[\U10000-\U10ffFF]'  ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt | less
    注意:『𠂉𥫗𦍌𦥑』这些在0x20000以上
    vim:/[\U10000-\U10ffFF]

e ../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt
.,$s/^\(\d\+\|\S\):\(\S\+\)$/%s\/\\<\1\\>\/\2\/g
exe 's/ \+/ \| /g | s/.*/exe ' "'" '\0' "'"

view others/app/gvim/command-batch-exec.txt
exe '%s/\<59273\>/纵组𠂉力/g' | '%s/\<65045\>/豖/g'


%s/\<𦔮\>/变体耴/g
矦𡘓
矦'CJK UNIFIED IDEOGRAPH-77E6'
𡘓'CJK UNIFIED IDEOGRAPH-21613'
㒼12212523434
䓣12212523434
    㙢㨺䤍:䓣-->㒼[G,T,K一致],
毀3215111213554
毁3215111213554
毀'CJK UNIFIED IDEOGRAPH-6BC0'土版毁
毁'CJK UNIFIED IDEOGRAPH-6BC1'工版毁

㴝31234223424134-->3123422342534
𪏭31234223424134
㴝'CJK UNIFIED IDEOGRAPH-3D1D'
𪏭'CJK UNIFIED IDEOGRAPH-2A3ED'
[㴝0x3D1D==水版㴝==纵组利氽[G,T一致]]
[𪏭0x2A3ED==氺版㴝==纵三组利人氺[U,T,V,H一致]]
㴝𪏭

釜釡
釜3434112431
釡3434112431
滏4413434112431
㵚441343434112431
淪44134125122
㵸44134125125125122
瀹44134125125125125122

㷗3251515154334
㷩31251255154334
輺1251112155525121
輜125111255525121
鍿34112431155525121
錙3411243155525121
葘122155525121
菑12255525121
湽441155525121
淄44155525121
甾巛
㶳5111214334
䀆51121433425221
㶳:d,窢断尾聿,火,
䀆:d,肀,灭,皿, or 䀆:d,断尾𦘒囗囗非㶳,火,皿,
肀𦘒聿,断尾聿,断尾𦘒
散122125113134
㪚122125113134
王壬𡈼
壬𡈼王
壬3121
𡈼3121
蘷122132511212151534354
䕫12232511212151534354
蘷:龷白
䕫:卄白
虁:龷自
夔:䒑自
䛖䛕
嚏25112452512152134
嚔251124525121542134
嚏嚔:疐
䣟:兓:旡兂
郞451153452
郎45115452
郎郞
力53
刀53
万153
另25153
別2513522-->2515322
别2515322
𡋾2515322121
万底版另
告吿
彦彥
産產
敻夐#攵夂
夂夊攵#夂zhong终vs夊sui绥vs攵pu攴/扑
秊秊#完全一样！
秊31234312
秊31234312
秊0x79CA秊0xF995(CJK Compatibility Ideographs)
戼丣
埒埓
恒恆
市巿

熙12251255154444
煕12251255154444-->1251255154444
𤋮1251255154444
臣125125
𦣝125125
    臣𦣝,口版臣
    右龘姬
木1234
朩1234
木朩
兹茲-玆
兹茲玆
疋𤴓#旋蛋疑楚喷嚏vs定是
㚄121452512152134 士冖
疐12452512152134 十冖
晚晩
晚25113525135
晩251135252135
    倒日+儿
皐臯#獔獋
瑨0x7468𤨁0x24A01
矈:白版臱
矏:自版臱
羋芈𦍋
羋0x7F8B芈0x8288𦍋0x2634B
羋 断中竖版芈
芈
𦍋 短中竖版芈
耇耈耉
    耇0x8007耈0x8008耉0x8009
    耂句
    老句
    撇化隔横版考口
㖈䎛耆
    㖈0x3588䎛0x439B耆0x8006
        /sdcard/0my_files/zip/zip_selected__e_book_data/13.0.0[download_at][20200913]/charts-East_Asian_Scripts/U3400.pdf
        ?又不是『兼容汉字』?也许有unicode额外属性标明『兼容』?
    0x3588老口[T横顶版匕-K撇顶版匕]
        [pg9/119]
    0x439B老口[K撇顶版匕]
        [pg73/119]
    老日

耇121335251
耉121335251
㖈121335251
䎛121335251
耆1213352511
耄1213353115
耈12133535251
䀌衋:皿血
    growing
羨羡
實㺙



毀毁
廾卉𠦄
捁𡌃
插揷
㴝𪏭
釜釡


37045:纵组亠口
16397:擧
99898:融合纵组山人
48108:纵组亠厶囗囗𠫓
37110:儿版川
61446:底龘襄
90009:横组亻亻
90024:戾
19467:啇
65178:業
65417:達
12058:與
39046:蔑
95161:系
35189:无头六
37278:拟包横组元女囗囗女版㝴
𫊣:萬
𠬶:又版帚
19452:冏
59263:横组冫七
𠇍:底龘隳
99933:烕
16771:絜
55377:左龘斲
90045:正序纵包龘厂炎
60966:朁
90050:菲
90051:纵三组𥫗一韭
59683:薛
19795:巂
97660:横组生丸
90052:養
42088:盧
96647:右龘漢
90014:㔾
39028:左龘㕟
37680:左龘㕟
39029:䜭
39030:左龘㕢
39487:左龘㕢
39488:纵组又韭
26539:冗
12082:犮
95030:缺丨匈
39060:寻
12085:夆
99979:囷
90060:芴
65732:屰
39068:纵组罒方
12089:矦
𣬉:纵组囟比
𠫤:左龘郄
𡰯:左龘刷
𪠫:纵组臼又
𠮠:窢万版另
65370:紫
59270:祭
60997:過
45436:鄉
25860:臺
94304:節
39070:豦
12098:顔
59273:纵组𠂉力
65045:豖
21235:浝
37212:纵组𦍌牛
39074:虖
12203:衮
65313:厥
23590:埶
39078:夢
19905:廛
17619:羲
48247:戲
26827:䒑
38353:纵组田疋
47310:攸
33141:羌
90104:坴
99787:叜
91748:爯
27279:横组禾尤
39002:纵四组士冖一女
65036:奚
𢛧:纵组隹心
𢧵:横组雀戈
𦾐:藍
𤰩:横组田予
𡚐:奭
𤯔:纵组一生
𣅀:纵组亠日
𠂬:无梁巵
𣦼:横组歺又
43362:虘
90116:當
39092:瞢
90118:毚
90119:疊
39003:纵四组士冖一子
48126:纵组宀王
21239:横组亻㐁
21240:横组爿米
61475:袁
97679:執
45440:横组爿夢
45441:横组爿囗帚版夢
45417:巩
59279:氶
90122:尨
23055:岡
45444:敃
65028:窢𦥑版叟
65133:荅
45305:皋
65393:與
90016:蒦
61472:徴
39097:黎
39099:欝
57347:横组工口
61844:㠩
90135:臽
28527:冐
𠭥:横组祟又
𠚤:纵组囗头龘负丶
𤰇:右龘備
𤽄:纵组白小
𦙌:缺丿胤
𡨄:无足寒
𤞣:猒
𡿿:包龘或巛
𠂈:丩
𠔼:正序纵包龘冂一
𦤶:窢夂版致
𦯕:纵组艹宋
𡬳:纵三组爫罒寸
𡻎:纵组山隽
𦾈:纵组艹喿
𥇛:目版爽
𠬢:纵组屮又
𪠊:正序纵包龘厂赤
𠵛:纵组品丂
𣧄:纵组巛歹
𦍐:纵组人羊
𠧪:仌版卤
𣑦:纵组巩木
𦭶:纵组艹先
𠱠:横三组口口口
𡌦:纵组非土
𡬽:横组票寸
𢆍:无二重
𠧢:匕版卓
𠮥:纵组囗头龘负口
𣎳:乚版木
𡊭:纵组必土
𪟆:横组屰刂
46156:敄
59284:窢亾版荒
60985:祭
48405:㬅
59050:右龘龍
48664:賓
65345:韱
39109:纵组爫囗正序纵包龘尸囗纵组囗横四组止丨丨巳囗夂
45450:敞
45451:敬
65071:攴
65395:右龘旅
45736:㡀
90141:纵组爾王
90142:纵组大早
37108:横组彳丨
40260:无䒑豈
59292:兦
62291:旡
99977:㬰
45456:孜
90151:罙
65050:匊
24595:头龘憂
13905:亟
90939:㒸
90158:拟包纵组尼木
90159:圂
21875:禾版戚
12180:産產
45460:貌
65412:壽
45461:貍
26350:壹
39005:纵组欠心
39407:憲
45581:隱
90169:戹
59296:头龘监
39319:帀版风
61052:表
92757:纵组从龰囗囗右龘從
42692:秉
90175:芮
51179:纵组左月囗囗右龘隋
39006:纵三组士冖手
65043:上彐版疌
90181:荀
61053:袁
90187:扈
41114:兜
23795:乾
39140:處
39141:䖏
39143:寒
51998:肅
38207:猒
21265:毁毀
39146:榮
45353:寨
65286:麃
39150:纵组隹冏
12218:繁
39151:爵
12220:雚
47107:獻
90205:籋
41708:騫
43157:直夕宐版疉
38208:窢冖彑版宐
38116:丶版彑鱻惐夕版彑鱻惐丶版互
25747:疊
34288:睿
39162:纵组囗撇化屮囗撇化屮
59298:幺幺兀版㡭
92492:正序纵包龘勹方
43540:纵组人亓
90213:纵组几口
39007:横组亻丨
39008:纵组夂日
39165:帚
41067:疌
39167:侖
12244:啓
37112:横组育攵
90218:纵组山曷
12249:羸
59300:右龘旅
61055:𠂢
65196:寽
90228:芳
37025:垔
23129:恆
39176:畟
40415:圅
60224:纵组𠂉丹
45925:朔
65200:纵组尤旨
65004:巵
90007:纵组匕木
90243:覓
99903:育
42076:壺
90246:萃
39184:牽
92159:棻
39186:虜
90251:纵组夅貝鱻惐纵组夂貢
47005:头龘囊
90253:蓉
59304:右龘儍
39188:菐
39189:盡
60323:右下罒版監
97435:蓋
39190:賔
39191:遭
65382:巤
39195:適
91974:篙
59308:貝版覧
17618:羲
60651:覧
39201:彝
12292:藥
20884:真
65119:匽
37243:纵组白方
43359:䖒
39206:憂
39207:纵组眔魚
37069:厭
32204:纵组士囗一版冃
39211:纵三组士冖王
39212:纵四组士冖一卵
47876:横组未攵
97020:𠦝
12016:纵组人毛
90276:茸
90282:叉版圣
90283:䏍
39216:交叠四丶廾
59312:纵组𠂉疋
97147:横组氵氵
37685:横组扌囗纵组𠂉子
39221:木版弃
90291:纵组天井鱻惐纵组夭井
90292:加丶尿囗囗包龘户水
90294:纵组穴王
65059:丏
90297:纵组爫旧
39295:宫
12328:纵组穴囗大版灭
59315:炎版㡭
13069:冘
39231:纵组艹㐬
90305:包龘或大囗囗包龘戈吴
90306:最
65415:彳
90312:絮
39235:裔
39236:䀄
90317:葛
90318:葉
12341:纵组大革
12344:箄
39237:冩
12347:閻
90322:黄
25284:㽔
61153:還
24485:歛
90325:簡
39241:纵组夂黑
39752:横组亻丨
40315:纵组夂黑
97650:䋣
90326:簟
59316:纵组𠂉與
38394:纵组𠂉與
𥁑:纵组必皿
𨥏:纵组父金囗囗父金版釜
𦝚:横组月盈
𠎤:双口版龠
𡻟:横组山莫
12358:横组屏屏
90328:纍
12017:二火版层
𫁙:横组禾午
37070:纵组臼土
59317:横三组丿㠯巳
39246:亭
𥄷:横组目巨
39009:纵四组士冖一火
59318:丞
12363:峯
97708:横三组丿臣己
𪣂:纵组火土
24593:奉
22294:備
37307:底龘崋
65398:日头崋
90338:䓬
45472:横组臽攵
37417:无足燕
12353:僉
12368:節
24747:中序拟横三组火辛火
24071:賴
37060:右龘漢
99846:头龘興
𦉬:纵组罒丁
44634:壳
92454:累
40610:營
39258:夒
90252:苟
12389:纵组囗横组讠大贝
𦣞:右龘姬
48555:蚩
39012:纵四组士冖一犬
39263:母贝版實
92177:馵
12399:囂
90360:巿
90361:纵组丿𤴓
21282:横组臣㕚
94435:筆
97714:横组石豕
97658:头龘與
42893:畿
𤬦:纵组冖瓦
37153:头龘𦥯
62210:缺一马
41940:雍
90381:黨
45482:肀
97717:横组古缶
59331:横组土囗纵组𠂉鹵
21292:木型纵组聿皕
55390:横组石又
45486:横组户攵
97768:横组户戈
59148:專
90394:莽
61060:睘
59334:纵组古㐄
97723:㓞
20325:罔
90405:苴
45009:楽
60986:察
65392:呈
90415:芺
𣶒:右龘淵
98995:横组句又
92568:纵组支只
39310:倉
90428:荼
90429:莘
99701:窢乂版刀头大鼻孔四脚日背龟囗囗右龘䆋35251125511511511
65737:穴
37140:纵组目大
19988:矞
45495:過
21304:横组爿臬
𩊐:横组革耳
10358:横组䏠凡
97732:横组夕力
97733:包龘口夕
45502:刪
43380:侖
44549:咼
45505:俊
45506:㕟
𦥝:舀
90444:纵组日羽囗囗右龘塌
𠝻:横组甚刂
45508:散
𥫛:纵组𥫗厶
37353:纵组大車
47912:隊
91547:棠
45511:数
21319:摠
39761:遷
21322:毅
65320:黎
59371:巤
45517:䙔
𥬥:无廾算
10359:横组脒几
12471:簽
97767:横组户又
37289:无丿妥
97769:横组每殳
45215:蔡
59347:覧
91939:蕉
12484:䇔
18201:薰
39014:纵四组士冖一缶
42644:薦
37009:耒
42820:冫版肉月
39349:纵组力囗无丨氺
𡱁:正序纵包龘尸矢
𧴪:纵组囗头龘肖貝
37486:头龘齊
39015:纵四组士冖一月
39372:纵组夂月
𡕙:纵组夂月
25666:肎
25919:纵组囗长腿甘囗冖
39362:疌
26662:纵组吅冖
99840:包龘匚炎
25329:舜
90495:符
39366:冨
99721:右上龘侯
37165:纵组艹冖
61063:役
𡗥:纵组大屯
61064:徂
21347:姧
41469:㓂
21349:娏
37191:栗
97792:横组缶且
92577:茈
97798:横组白百
37448:横组乡隹
46512:敕
21356:横组𤴔朿
61065:厶版遠
21365:嫂
𦭝:纵组艹罒
97804:横组目畐
45550:遜
21371:稱
45552:褐
𠔁:纵组八八
21377:底龘爾囗囗交疊巾㸚
45554:縢
61066:中序拟横三组止白巳
48145:纵组八夂囗鱻馘儿版鱻魊夊版
22776:横组幸匊
45559:雜
65321:叢
97820:躅
65322:横组囗右龘漢囗鳥
𧄶:纵组艹䜌
21394:㸐
45560:横三组木缶木
45561:横组鬯彡
47951:横三组木缶木
37528:底龘鬰
97641:卧
97642:虒
91311:窢卝干版缩头芈𦍋
39018:纵组夂虫
40076:㐬
90756:並
95860:笄
97844:神
30377:熏
48413:憲
12541:厲
42308:篾
92894:萬
90510:乂版友
65057:袞
90519:纵组果衣
39387:蹇
𡗜:大版灭
39389:卣
65580:囟
37241:纵组丑山
𠯑:纵组氏口
59366:米版亾
48860:纵组丰木
37091:纵组臼工
12571:单止歰
60530:奊
37103:賈
46843:遝
92690:纵组免免
59377:㡭
39465:憂
59370:日版延
53407:纵组囗头龘上冖
37901:纵组一谷
62913:头龘監
99519:横组臣殳
61072:卮
51101:纵组囗头龘业冖
59373:聚
39415:臯
45572:横组囗无钩刂囗又
90552:芰
𪯻:横组文文
39418:纵组龹貝
42044:虍版睿
90557:纵组囗斜月版夕囗廾
90561:纵组水月
57516:头龘瞢
39431:龠
𡉊:纵三组一八土囗囗八版至
𫉶:戉版蔑
𤴡:疐
39437:辱
59381:包龘口囗头龘肖
65804:包龘𦥑囟囗囗囟版头龘興
𨛳:横组昔阝
65085:矍
65242:出头乇
𩇮:纵组非手
𥪴:横组章夅
𡵱:纵组山斤
49608:眔
39457:圅
21413:木型纵组十玨
90601:烹
90602:脣
𫓇:横组釒阝
90606:葴
39461:亷
90609:蒪
97837:横组求求
12650:纵组覀囗横组臣卩
39467:正序纵包龘𠂆万囗囗撇顶厉
59248:纵组囗头龘惠𧘇
59386:无梁兮
39472:纵组山囗底龘隳
12667:夾女版㥷
39474:賓
39475:芯鹵版悤
97841:横组氵壬
63064:復
21423:潭
91012:纵组厶鼎
26025:横组囗纵组林月攴
45582:儵
12674:僉
𢆰:纵组一幺
𧈪:蚩
90622:悹
59247:横组𠂔欠
59246:横组𠂔次
97581:纵组次韭
𪪇:缺乀朿
39490:窢弯冄版纵组彡冄
39491:豸
59389:咼
90635:纵组彡否
𦓔:纵组而而
37004:飠
97850:横组歹又
95907:正序纵包龘勹吉
48616:纵组龶皿
61638:會
65299:薄
12032:窢𠂉版纵组人馬
39525:蹇
37281:纵组幺月
𩫏:纵五组亠口回口十
37271:纵组人氺
21223:横三组弓者弓
39530:脊
𠄣:亙
𠅇:罔
41895:拟包纵组虍魚
39541:虜
90340:負
37856:横组魚束
39543:瞢
39026:拟包纵组虍鱼
90677:奚
17311:寇
65403:睘
61086:後
97649:横组臣又
37267:黍
60995:纵组𠂉昜
99553:横组知于
39557:責
99697:干干版幵
37330:头龘啬
37104:缺丿𧘇
𢆉:纵组丷干
38458:横组囗正序纵包龘冂丶囗正序纵包龘冂丶
37024:二版丰
10001:横组丿丨
38498:纵组爫糸
29554:融并甲电版㫣
37774:纵组十旱
37283:左龘亂
37456:底龘赤
37106:纵三组亠口冖
37186:纵组日小
37596:纵三组冖土九
37866:纵组回旦
37565:芯一版区
37509:分
37526:纵组一木
𡚬:纵组二女
37259:无腿兴
37252:帀版风
65346:纵组口囗儿版川囗囗三腿兄
𠕁:正序纵包龘冂卄
37260:右龘侯
37952:横组丑刂
65347:又版帚
37444:呂
38005:㣊
37849:彐版𡰪
37582:纵组夂犬
39613:纵组夂火囗囗非灸
37728:放
37293:目版拐化直
37167:要
37426:上彐版疌
37969:半型纵组𠈌十
37676:半型纵组丷十
37146:右龘備
45642:效
37021:䍃
𦐇:纵组日羽囗囗右龘塌
37065:纵组𠂉昜
37605:纵三组囟八夂囗囗右龘傻
38383:芯用版䓒
23907:纵组吅从
38107:䙴
37707:横组車攵
37619:纵组覀舛
37825:粟
37295:右龘儍
37382:賓
37833:賞
37094:暴
48411:賣
63569:底免版兄
38418:中序拟横三组囗左龘卬囗白囗空心彐
21631:中序拟横三组囗左龘北白匕
37337:出头巾版㒳
99918:横组月巜
37086:缺一卫
𢆶:横组幺幺
37460:拟包横组元攴囗囗攴版㝴
37121:奏
37154:无足鸟
37934:纵组豆几
37633:反序拟包纵组凵囗纵组丷干
38060:万底版另
37030:左龘颈
37285:左龘制
37105:窢郎版良
𣏂:术版杀
37063:头龘黎
37087:横组未攵
24225:正序纵包龘厂刀囗囗刀版历
37807:纵组冖力
37044:头龘学
37027:𤇾
59978:纵组𠂉囗一隹版存
37119:𡿺
38261:纵组从十
37277:甲版早
37660:正序纵包龘冂囗纵组丷干
37143:左龘卬
37116:左龘印
37084:窢缺丿艮
37589:横组原原
𤰔:由版古
37117:纵组厶大
37562:纵组人三
38343:头龘叏
65522:中版古
37333:纵组爫冖
𡰥:左龘叚
65362:右龘叚
𤆌:纵组火又
37214:正序纵包龘尸示囗囗示版层
37689:臼𦥑丨叟头
37320:睿𥈠
37742:纵三组丷干囗变体取
65571:纵组丿口
37422:𠂢
37131:弄
37629:横组口另
38168:窢卝干版缩头芈𦍋
37197:纵组䒑夫
37471:底龘兼
37232:纵三组田一口
38152:纵组执云
37310:纵组囗头龘肖贝
37206:羌
37159:纵组亠丷
𪞐:正序纵包龘冂古
𢼄:横组户攵
37449:横组户戈
37923:纵组十回
38469:纵组羊䒑
37039:爰
38081:纵三组口䒑口
38424:亮
37125:横组丿丿
37463:𣪘鱻惐横组囗窢缺丿艮囗殳
37868:纵组口冋
37461:纵组口囗正序纵包龘冂卄
37166:纵组囗头龘肖貝
37683:纵三组口䒑加
37608:纵组口旨
37079:窢西版覃
37384:嘗
37988:厶版疐囗囗右龘嚔
37569:横组口𨥫鱻鬾头留版
38362:纵组囗中版古囗㓁
37287:纵组囗中版古囗冖
37228:底龘襄
𠪚:正序纵包龘厂敢
37646:反序拟包横组辶囗纵组罒㒸
38400:纵组肀口
𡋑:插序巫幽型全二包龘土口口
38270:底龘畏
38373:纵三组冖吅囗底龘襄
37751:包龘口囗纵组丷干
𠃓:右龘杨
20137:纵组一巛
37144:横组囗无钩刂囗又
17079:纵组土八鱻惐纵组土儿
𠧗:纵组上下
37176:㐫
38301:坔
38043:寽
37062:头用尚
38106:横组方方
37304:穿头中版呈
42932:纵组龹土
65106:㚇
38503:界
37675:纵组田囗无丨氺
38245:巷
37883:纵三组囗头龘冓八土
60400:纵三组𠂉口皿
𣪠:横组囗車版击囗殳
38338:纵组囗横组乡隹囗土
38354:纵三组十罒衣
37138:㐮
38090:㕡
38002:㕓
𤳳:横组畕畕
𠃜:眉版尸
37151:纵组士冖
37744:纵组冖业
99852:丨丨版中
37578:纵组冖豆
37234:底龘亞
38497:纵四组士乛工一囗囗头龘壽
38012:头龘夀
40475:纵组日夂
𦣻:纵组一自囗囗目版百
37338:纵组囗头用负囗目
37284:中序拟横三组火言火
38302:纵组一囗中序拟横三组止自巳
21633:包龘𦥑囗目版百
38480:横组亻囗叉版夂
37531:纵三组罒冖夕
37376:头龘奐囗囗八版头用负
37194:横组丬夕
𡗞:纵组幺大
37258:米版向
55905:釆版向
37452:横组丬寽
37715:纵组隹寸
38230:纵组隹田
𦋹:罒版品
99857:头龘妻
37088:𠂔
𢦰:武
61050:头龘婁
38236:忝
37410:横组贝贝
37102:纵组囟比
39625:纵组龹女
37308:𣁋鱻鬾山一几版鱻魊山一儿版鱻魊山兀版鱻魊山几版
38335:横组男女
37916:纵组囗头用负囗比
45755:正序纵包龘厂女
37051:戠
38225:纵组囗反序包龘北口囗女
37246:𣁋鱻鬾山一王版鱻魊山一𡈼版鱻魊山一壬版
37665:拟包横组免生
37657:拟包横组兔生
38273:横组女𨥫鱻鬾头留版
𡚇:右龘嬽
37980:纵组囗横三组口口口囗女
37813:纵组冖子
𠨯:正序纵包龘厂子
37534:纵组丰口
𠯚:纵三组口一囗儿版川
37942:纵组囗又丷版必囗山
37455:纵三组一由八
𡶇:纵组必山
37885:纵三组囗头龘冓八㔾
37936:纵组心皿
22503:横组爿丙
22505:横组爿未
37887:纵三组囗头龘冓八囗底龘冬
38403:纵组囗罒版百囗丁
37616:纵组必冉
37702:横组丬囗又版帚
38112:纵组囗尾大版目版百囗分
38426:横组爿囗又版帚
𪻆:横组爿言
𤕻:横组爿吾
37817:纵组珎貝
37787:纵组珤貝
𪨃:纵组夕寸
92250:纵组囗斜月版夕囗寸
37445:头龘惠
38436:纵组囗彐鱻鬾尾大版囗横组工口
37052:纵组业𦍌
37427:缺丶戈
37071:纵组又囗二版丰
37118:弁
38204:横组山歹
37870:君
38138:纵三组一木山
37998:纵组示山
37639:横组禾尤
37367:纵组尤山
𣢟:横组甘欠
37346:底步版烕
38233:正序纵包龘厂配
59268:横组𠂤辛
37882:纵组豕囗横组土土
37120:㥯
43236:纵组隹冏
37949:厳
38322:䒑版㜸
37435:缺丿囟版鼠
47445:横组工几
37199:无足寒
37992:萈
32259:纵组一己
37142:横组巳巳
37207:横组丨丿
37172:纵组冖巾
37490:纵三组亠丷冖囗囗尾冖版立
21897:帶版卅
37467:纵组旲巾
38088:𣁋鱻鬾山一巾版
37441:窢人版纵组八干
𢎨:正序纵包龘弔丿囗囗底龘第
𧈧:纵组厶虫
37884:纵三组囗头龘冓八弓
10031:横组丰丰
31196:包龘比矢
37388:纵组冖果
𪫌:纵组粉廾
38194:纵组囗横组米糸囗廾
38118:纵组囗横组米糸囗廾
37393:正序纵包龘厂彡
40520:纵组幺夂
37678:纵组丷𤴓囗囗纵组䒑龰
37262:纵组从龰囗囗右龘從
37593:纵组正正
37379:纵三组十罒心囗囗缺𠃊㥁
38381:𣁋鱻鬾山一土版
37805:𣁋鱻鬾山一王版鱻魊山一𡈼版鱻魊山一壬版
38266:𣁋鱻鬾山一糸版
37635:横组訔攵囗囗𣁋鱻鬾山言版
38384:纵四组日出大氺
𠮦:纵组丷口
37970:纵组囗直化用囗心
37135:戒
38327:横组忄禾
37489:纵组囗头龘兴囗凶
37979:纵组冗心
95490:纵组厶心
38125:纵组㠯心
37352:纵组丿囗撇化干
38073:正鱻鬾撇顶版鱻魊横顶版鱻魊𠃊止版鱻魊丄止版
14692:芯夹版区
37784:横组忄貝
38206:㤩
38462:纵三组爫冖心
37047:头用㱿囗囗头用无弓彀
𪻧:横组来犬
65029:窢廿兩版㒼
37801:廾版馮
37888:㥑
38120:徝
38119:猌
𢽟:横组來攵
37927:横组舌自
37935:纵三组囗躯龘害罒心
37851:纵三组亠罒衣
38077:横组忄𨥫鱻鬾头留版
37198:徵
37732:赣
37986:贛
37524:头龘憂
59430:癸
𠠵:拟包横组九力
𡯄:拟包横组尢力
37512:纵组一丰
38242:処
37276:𠃌版东囗囗右龘炼
𡿪:纵组巛夕
37130:𠂢
𢪰:横组扌歹
37905:反序拟包纵组夨日
37429:纵组申又囗囗申版叟
37655:尾
37649:委
37759:横组分手
37342:纵组日匂囗囗匂版曷
𧈡:纵组又虫囗囗又版蚤
𦥛:臿鱻鬾穿底版
37701:纵组爫囗缺丿缶囗囗缺丿午版䍃
45383:纵组免囗底龘冬
65046:斜月夕版䍃
37053:屖
𢪒:横组手手
38318:纵组耳囗无丨氺
90779:夕版容
37479:産產
37466:纵组人音
38308:着
99813:右下罒版監
37590:適
38350:纵组大手
16221:纵组窊㼌
37446:各
38508:子版肴囗囗乂版孝
38369:横组申攵
37749:纵组龶囗底龘万
37210:纵组囗无钩𠃌囗耳鱻惐纵组丅耳囗囗左龘敢
38239:纵组龷月囗囗左龘散
37438:啇
𢽬:横组東攵
37643:纵组囗尾冖版上囗釆
𠩬:正序纵包龘厂來
55103:横三组丿二丨
53596:横三组丿示丨
37451:纵组冖斗
37253:纵组人斗
𠁁:左龘斲
𠨣:亞版留
60146:纵组𠂉几
60979:纵组𠂉巾
60969:纵组𠂉子
60223:纵组𠂉斤
60099:纵组𠂉毛
38188:右龘旅
38217:纵组𠂉巿
37795:纵组𠂉皮
37941:纵组𠂉瓦
38375:纵组𠂉生
37799:纵组𠂉令
38187:纵组𠂉尼
60092:纵组𠂉矢
38454:纵组𠂉兆
37761:纵组𠂉㐬
60339:纵组𠂉肖
65397:纵组𠂉奇
60238:纵组𠂉其
37766:纵组𠂉票
38368:纵组𠂉番
37794:纵组𠂉亶
38201:纵组𠂉會
38486:纵组𠂉遂
38038:於
38254:叱
37218:纵组一勿
37572:卭
38416:纵三组一厸一
38010:倒日儿版免
37504:昌
37345:尭
37948:纵组旲日
37440:㳟
38156:纵三组出大本
50778:头龘曹
59548:纵组罒又
38024:纵组囗丷八囗田
38332:纵组囗丷八囗脸龘曾
𦔳:力版变体取
37951:纵组亼囗脸龘曾
38405:横组臣月
38441:本版卉
37453:卉
38065:㲺
32273:纵组二水
38085:阉版束
𪲰:横组木歹
99981:日版占
38055:纵组厶夲
37395:横组氵刅
𠫡:纵组厶木
38435:横组占又
38157:争爭
37602:纵组亠舛
37932:纵组䒑未
37792:中序拟横三组冫白囗右龘氺
38341:彐版品
37399:纵组人木
37516:纵三组士冖石
𠳮:纵组右冋
37459:纵组酉灬
99837:中序拟横三组幺白幺
38292:离
37789:术版杀鱻惐朮版杀
37494:菐
37354:纵组㐬皿
37224:纵三组𠂉卌一
38062:纵组冖䂞
38209:丑版品
37961:缺心隱
37312:匱
37644:遷
37940:纵组囗头龘囊咎
38063:蓮
37592:纵组棥冖
37237:寸版即
38399:纵组棥罒
𠤕:纵组匕矢
37040:纵组士示
37929:纵组叕酉
𣥂:缺丶少
38317:反序拟包纵组凵米囗囗米版凶
37818:小版烕
59452:纵组𠂤止
37485:底万头负版殳
37377:纵组𠂉囗右龘杨
60782:左龘段
𡱒:正序纵包龘尸共
99815:毌
37770:㲋
38314:正序纵包龘厂毛
𤴁:直夕宐版疉
37155:纵组几口
𢎀:纵组弋月
37275:纵组刃止
37324:函
𠛼:横组并刂
𫃢:横三组丿米丨
38079:纵组止囗无丨氺
37323:纵组爫夫
37917:横组关刂
𦚏:纵组立月囗囗左龘龍
37406:㚅
38139:纵组艹両
37862:纵三组山夂囗二版丰
𡌥:幺幺版坙
37852:纵三组㓁工口
94561:纵组艹两
𣱷:正序纵包龘厂水
38315:敘
37254:纵组匕水
38175:纵组山並
37865:横组彳囗纵组夂月
44429:纵组𦉫豕囗囗纵组罒囗底龘豕
38475:衆眾
37107:纵组林月
𣈅:纵组林日
38432:纵组囗米版向囗丂囗囗缺一粤
39975:方版曼
37924:纵三组宀帚又
37370:睿𥈠
37553:纵四组士冖一木
37425:纵组黒土囗囗十版墨
𠾂:纵三组來一回
38089:拟包纵组廌去
𧰟:横组豊盍
37735:横组泉泉
37703:纵组丿丹囗囗亠版舟
37899:纵组了灬
37767:攸
37185:灬版与
37171:木型纵组了叹
37402:纵组囗头龘负旧
38333:横组𦣝巳
27156:横组刍攵
37632:横组囗纵组巛歹囗刂
37823:横三组丿臣巳
37535:无足版融竖版纵组千黑
37326:纵组匕火
38387:横组隹欠
37147:同版𦥯鱻鬾同版鱻魊冂一丅版
37568:纵三组林大火
37831:横组熏力囗鱻馘灬底版
37508:亅版不出头版肀
38336:纵组一友
38086:底龘爲
38408:纵组罒囗寸版即鱻鬾厶版鱻魊丨二版
37876:正序纵包龘户甫
37270:纵组冖牛
47747:正序纵包龘厂牛
37294:d?丶最后=>O?缺乚尤
38180:横组讠犬
38280:横组言犬
37991:舄
37714:纵三组畄一口
38114:嚴
37800:纵组囗中序拟横三组冫幺囗右龘氺十
37240:右龘旅
𤤤:横组𤣩禾
37874:莠
37573:纵组朱貝
38122:賛
38360:横组瓜豕
38129:纵三组罒冖瓦
37291:正序纵包龘厂生
37912:纵组心用鱻鬾直用版鱻魊弯用版
37679:反序拟包纵组凵田
37617:纵组口田
38007:纵组田八
38348:纵组田一
38227:反序拟包纵组凵田
38244:纵组囗无丨氺囗冝
34383:正序纵包龘弓土囗囗土版㢧
38511:㽬
48378:横组丶丿
38200:纵三组十冖田
39595:纵组龴疋
38249:纵组一囗出头兀囗囗开版元
38080:横组弓殳
𠨐:横组囗提化匕囗卩
37415:出头版纵组囗无丨氺囗十
38276:纵组䒑八
37223:头龘监
37355:纵三组肀一灬
37236:头龘監
28987:头龘盥
𪯧:横组幸攵
𨠭:纵组合酉
38025:横组臣囗纵组𠂉古
𢿐:横组囗纵组幺幸囗攵
37386:芯三版且鱻惐目一版旦
37192:反序拟包横组𠃊目
37903:氺鱻鬾八八版鱻魊丷八版
38026:纵组囗反序拟包横组𠃊目囗八
47519:木型纵组亻从鱻惐中序拟横三组人亻人
37993:纵三组一口𧘇
45891:血鱻鬾丿罒版
38415:尾冖版上
37401:纵四组一八人目
38146:纵三组罒冖目
95136:白版臱
38177:闞
38040:纵组乛囗反序横组丿亅
37411:纵组大石
37313:横组囗斜月版夕囗乛乀版龴囗囗头龘祭
37257:纵组回示
43127:纵组罒羽
65144:喜
𤇕:纵组禾灬
37781:纵组爫旧
97555:纵组匕禾
37532:纵三组爫彐心囗囗缺工㥯
15107:纵组囗插序巫幽型全二包龘土口口囗回囗囗头喪版嗇
38091:横组正見
37716:纵组土囗融并甲电版㫣
37963:纵组土黽
37630:横组釆𥜽鱻鬾厶禸版
𩰬:鬲鱻鬾口㐄版
38275:纵组夅夂
37517:纵组𠔿比囗囗𠔿版昆
𥃲:纵组目廾
38298:横组車㔾
𣐝:横组木匝
37736:纵组目厺
38019:纵三组目大㔾鱻馘巳版
37468:纵组罒戍
37797:纵组艮皿
37897:纵三组目大么
37580:插序全包龘戈巾囗囗巾版戒
37734:纵组巫㕣
𤿺:横组其皮
37359:甄
38159:纵三组目大良
37647:米版囟
37362:横组囗触底版纵组丵臼囗殳
38479:纵组囗横组𠂤辛囗米
37546:糹三点
37400:纵组十冖
38488:百
37475:纵组刀巴
38446:纵组夂糸
42504:纵组亠兄
37567:者鱻鬾加丶版
38015:纵组彐囗底龘豕
38268:纵组囗芯三版且囗小鱻惐県
37989:插序全包龘𢦏业囗囗业版哉
37442:纵三组目大糸囗囗非䋰
37729:雨型二包龘囗断头巾靐糹虫
37433:蓬
37177:纵组米糸
15966:正序纵包龘厂墨鱻鬾黒版
37636:纵组母縣之且版?笔顺码错?
99836:缺一纟
37816:横组讠刂
𦌂:纵组罒田
37879:㓹鱻鬾厂包炎刂版
37841:横组革马
38407:纵组土久
38447:纵组一夫鱻惐㺯
37409:缺丨爪
63648:无足黑
38485:融横版横组囗纵组禾丂囗戈
54060:纵组夂羽
95438:纵组人羽
37928:撇顶版口版与
37939:纵组耂囗头龘至
𦔷:横组耳幺
𦔻:横组耳口
38048:纵组囗横组幺幺囗廾
38011:纵组囗横组幺幺囗大
𢇇:纵组囗横组幺幺囗丱
38103:右上包龘耳王
37305:纵组八十囗囗非仐
65438:纵组匕匕
38033:人版氺
𠯳:纵组勿口
𣍩:横组月禾囗鱻鬾弯月版囗或肉月版?
38143:马版卷
37443:旅
38499:纵组冖肙
38281:横组末成
37274:寬
61027:纵组𠂉品
37233:纵组囗窢儿版穴囗方
𠫔:纵组一厶
38355:纵三组口冖至
37827:正序纵包龘勹灬
38346:夹车𦥑囗囗头龘舆
38501:头龘與
37385:纵组隹臼
38262:纵组干口
37498:纵组人土
𦧚:横组舌舌
37609:纵组冖舛
65460:底龘五
38296:纵四组巛冖厶㐄
37311:纵组丿凡
38246:纵组冖土
37814:纵组冖卂
37880:纵组人木
37853:纵组冖木
𠕽:纵组冖水
37829:纵组冖火
38108:纵组冖玉
37677:纵组冖鸟
38359:纵组乃叱
37975:纵组犬廾
38279:纵组一囗穿头中版呈
37696:拟包横组見丶
37340:纵组目廾
37668:纵组冖虫
38096:纵组冖糸
38506:纵组冖酉
37615:纵组冖金
37328:纵组冖鳥
37771:纵组冖吕
38052:横组阝产
37613:纵组死廾
37997:纵组巩女
38509:包龘戊贝
38404:包龘戊占
24687:包龘戊臣
38500:包龘戊貝
37848:纵组化叱
37335:修
38113:横组鱼刂
𨳐:正序纵包龘門女
37908:纵组宀囗拟包横组元攵囗囗攵版寇
𫕶:正序纵包龘门隹
37709:触顶版纵三组一𠈌囗二版丰
37190:纵组品亏
38386:横组单斤
38228:飧
37974:横组镸共
37575:纵三组罒冖伐
37954:横组氵囗纵组帚又
37743:横组歹昜
37628:飱
37436:横组歹韭
37560:纵四组亠口冖死
38439:纵三组罒冖死
38370:纵三组罒冖侵
38232:漂
38363:㙯
𧛱:纵组保衣
38351:親
38136:纵组歮木
65288:横组單斤
37893:纵组囗头用雨囗肥
37892:横组禾魚
37973:横组甚育
𤾡:横组白爲
38256:横组虫囗纵组夂産
37706:横组弓雚
37808:鼈
𧇃:拟包纵组虍林
37638:纵三组囗头龘肖日小
37705:横组虫歹
𠣜:正序纵包龘勹虫
96546:纵组必虫
37424:纵组日䖵
37527:纵组天天
𧋐:横组虫束
38307:㡿
37163:纵组人虫
38510:纵组旲虫
37718:纵组出虫
99831:尋
38423:纵组禺虫
38149:纵组右䖵
𧈹:纵组大虫
38144:纵组即虫
37710:横组豸刂
37773:纵组囗头龘囊石
38226:水平镜像龘㡭
38255:纵组皕血
37432:纵组口𧘇
37157:无足鳥
38193:纵组亠邑
38422:纵组非𧘇
37920:纵组囗躯龘寒衣
37272:䙴
38420:僕
37645:出头交叠拟纵组冂凵
37363:纵组刀牛
37244:纵组二口
38049:正序纵包龘厂囗纵组八言
37654:纵组共言
37838:纵组旲言
37830:矞
37495:纵组人口
𠮛:纵组一口
38163:正序纵包龘冂囗纵组䒑丨
𠁳:反序拟二包纵组山丰丰鱻惐插序巫幽型全二包龘山丰丰
37930:纵组冂囗出头豕
𠀐:纵组中一
37731:纵三组一囗缺丶少囗貝
37697:貝版眉
38392:纵组士罒
38505:纵组示貝
37482:纵组囗木型纵组十从囗冖
38319:纵组囗木型纵组十吅囗冖
38050:纵组囗躯龘寒貝
38027:横组臣忠
65140:纵组夂貢
38102:纵组艹贝
37966:纵组囗躯龘寒贝
38476:纵组夂贡
38130:纵组丶囗缺亠之
37950:纵组囗躯龘寒足
38431:纵组禺足
37725:水平镜像龘㡭
38284:纵组囗横组𠂤辛囗足
37036:无丨氺
99547:夹車𦥑囗囗头龘輿
𦆕:横三组糹車糹囗鱻鬾魊糹魊糸版
38393:横三组纟车纟
𡴎:纵组屮𠂤
38075:纵组止𠂤
38068:正序纵包龘𠃌囗撇化版二版丰囗囗左龘那
37700:阝版即
37953:纵组囗反序拟包横组𠃊目囗巛
38481:横组囗右龘侯阝
37594:横组乡皀
37861:纵组冘皿
𥁓:纵组右皿
37669:纵组酉分
38356:纵组一里
37136:纵组山巾
92470:纵组灭又
𡕢:纵组灭夂
38009:派
37663:纵组囟比
.,.+30s/,\(\d\+\|[\U10000-\U10ffFF]\),\@=/\r\1:\r/g
    growing


%s/\<\>//g
㐬:d,48108,37110,
㓒:d,59263,𠇍,
.,$s/^\(\d\+\|\S\):\(\S\+\)$/%s\/\\<\1\\>\/\2\/g
%s/\<37045\>/纵组亠口/g
%s/\<16397\>/擧/g
%s/\<99898\>/融合纵组山人/g
%s/\<48108\>/纵组亠厶囗囗𠫓/g
%s/\<37110\>/儿版川/g
%s/\<61446\>/底龘襄/g
%s/\<90009\>/横组亻亻/g
%s/\<90024\>/戾/g
%s/\<19467\>/啇/g
%s/\<65178\>/業/g
%s/\<65417\>/達/g
%s/\<12058\>/與/g
%s/\<39046\>/蔑/g
%s/\<95161\>/系/g
%s/\<35189\>/无头六/g
%s/\<37278\>/拟包横组元女囗囗女版㝴/g
%s/\<𫊣\>/萬/g
%s/\<𠬶\>/又版帚/g
%s/\<19452\>/冏/g
%s/\<59263\>/横组冫七/g
%s/\<𠇍\>/底龘隳/g
%s/\<99933\>/烕/g
%s/\<16771\>/絜/g
%s/\<55377\>/左龘斲/g
%s/\<90045\>/正序纵包龘厂炎/g
%s/\<60966\>/朁/g
%s/\<90050\>/菲/g
%s/\<90051\>/纵三组𥫗一韭/g
%s/\<59683\>/薛/g
%s/\<19795\>/巂/g
%s/\<97660\>/横组生丸/g
%s/\<90052\>/養/g
%s/\<42088\>/盧/g
%s/\<96647\>/右龘漢/g
%s/\<90014\>/㔾/g
%s/\<39028\>/左龘㕟/g
%s/\<37680\>/左龘㕟/g
%s/\<39029\>/䜭/g
%s/\<39030\>/左龘㕢/g
%s/\<39487\>/左龘㕢/g
%s/\<39488\>/纵组又韭/g
%s/\<26539\>/冗/g
%s/\<12082\>/犮/g
%s/\<95030\>/缺丨匈/g
%s/\<39060\>/寻/g
%s/\<12085\>/夆/g
%s/\<99979\>/囷/g
%s/\<90060\>/芴/g
%s/\<65732\>/屰/g
%s/\<39068\>/纵组罒方/g
%s/\<12089\>/矦/g
%s/\<𣬉\>/纵组囟比/g
%s/\<𠫤\>/左龘郄/g
%s/\<𡰯\>/左龘刷/g
%s/\<𪠫\>/纵组臼又/g
%s/\<𠮠\>/窢万版另/g
%s/\<65370\>/紫/g
%s/\<59270\>/祭/g
%s/\<60997\>/過/g
%s/\<45436\>/鄉/g
%s/\<25860\>/臺/g
%s/\<94304\>/節/g
%s/\<39070\>/豦/g
%s/\<12098\>/顔/g
%s/\<59273\>/纵组𠂉力/g
%s/\<65045\>/豖/g

exe '%s/\<21235\>/浝/g | %s/\<37212\>/纵组𦍌牛/g | %s/\<39074\>/虖/g | %s/\<12203\>/衮/g | %s/\<65313\>/厥/g | %s/\<23590\>/埶/g | %s/\<39078\>/夢/g | %s/\<19905\>/廛/g | %s/\<17619\>/羲/g | %s/\<48247\>/戲/g | %s/\<26827\>/䒑/g | %s/\<38353\>/纵组田疋/g | %s/\<47310\>/攸/g | %s/\<33141\>/羌/g | %s/\<90104\>/坴/g | %s/\<99787\>/叜/g | %s/\<91748\>/爯/g | %s/\<27279\>/横组禾尤/g | %s/\<39002\>/纵四组士冖一女/g | %s/\<65036\>/奚/g'

exe '%s/\<𢛧\>/纵组隹心/g | %s/\<𢧵\>/横组雀戈/g | %s/\<𦾐\>/藍/g | %s/\<𤰩\>/横组田予/g | %s/\<𡚐\>/奭/g | %s/\<𤯔\>/纵组一生/g | %s/\<𣅀\>/纵组亠日/g | %s/\<𠂬\>/无梁巵/g | %s/\<𣦼\>/横组歺又/g'

exe '%s/\<43362\>/虘/g | %s/\<90116\>/當/g | %s/\<39092\>/瞢/g | %s/\<90118\>/毚/g | %s/\<90119\>/疊/g | %s/\<39003\>/纵四组士冖一子/g | %s/\<48126\>/纵组宀王/g | %s/\<21239\>/横组亻㐁/g | %s/\<21240\>/横组爿米/g | %s/\<61475\>/袁/g | %s/\<97679\>/執/g | %s/\<45440\>/横组爿夢/g | %s/\<45441\>/横组爿囗帚版夢/g | %s/\<45417\>/巩/g | %s/\<59279\>/氶/g | %s/\<90122\>/尨/g | %s/\<23055\>/岡/g | %s/\<45444\>/敃/g | %s/\<65028\>/窢𦥑版叟/g | %s/\<65133\>/荅/g | %s/\<45305\>/皋/g | %s/\<65393\>/與/g | %s/\<90016\>/蒦/g | %s/\<61472\>/徴/g | %s/\<39097\>/黎/g | %s/\<39099\>/欝/g | %s/\<57347\>/横组工口/g | %s/\<61844\>/㠩/g | %s/\<90135\>/臽/g | %s/\<28527\>/冐/g'

exe '%s/\<𠭥\>/横组祟又/g | %s/\<𠚤\>/纵组囗头龘负丶/g | %s/\<𤰇\>/右龘備/g | %s/\<𤽄\>/纵组白小/g | %s/\<𦙌\>/缺丿胤/g | %s/\<𡨄\>/无足寒/g | %s/\<𤞣\>/猒/g | %s/\<𡿿\>/包龘或巛/g | %s/\<𠂈\>/丩/g | %s/\<𠔼\>/正序纵包龘冂一/g | %s/\<𦤶\>/窢夂版致/g | %s/\<𦯕\>/纵组艹宋/g | %s/\<𡬳\>/纵三组爫罒寸/g | %s/\<𡻎\>/纵组山隽/g | %s/\<𦾈\>/纵组艹喿/g | %s/\<𥇛\>/目版爽/g | %s/\<𠬢\>/纵组屮又/g | %s/\<𪠊\>/正序纵包龘厂赤/g | %s/\<𠵛\>/纵组品丂/g | %s/\<𣧄\>/纵组巛歹/g | %s/\<𦍐\>/纵组人羊/g | %s/\<𠧪\>/仌版卤/g | %s/\<𣑦\>/纵组巩木/g | %s/\<𦭶\>/纵组艹先/g | %s/\<𠱠\>/横三组口口口/g | %s/\<𡌦\>/纵组非土/g | %s/\<𡬽\>/横组票寸/g | %s/\<𢆍\>/无二重/g | %s/\<𠧢\>/匕版卓/g | %s/\<𠮥\>/纵组囗头龘负口/g | %s/\<𣎳\>/乚版木/g | %s/\<𡊭\>/纵组必土/g | %s/\<𪟆\>/横组屰刂/g'


exe '%s/\<46156\>/敄/g | %s/\<59284\>/窢亾版荒/g | %s/\<60985\>/祭/g | %s/\<48405\>/㬅/g | %s/\<59050\>/右龘龍/g | %s/\<48664\>/賓/g | %s/\<65345\>/韱/g | %s/\<39109\>/纵组爫囗正序纵包龘尸囗纵组囗横四组止丨丨巳囗夂/g | %s/\<45450\>/敞/g | %s/\<45451\>/敬/g | %s/\<65071\>/攴/g | %s/\<65395\>/右龘旅/g | %s/\<45736\>/㡀/g | %s/\<90141\>/纵组爾王/g | %s/\<90142\>/纵组大早/g | %s/\<37108\>/横组彳丨/g | %s/\<40260\>/无䒑豈/g | %s/\<59292\>/兦/g | %s/\<62291\>/旡/g | %s/\<99977\>/㬰/g | %s/\<45456\>/孜/g | %s/\<90151\>/罙/g | %s/\<65050\>/匊/g | %s/\<24595\>/头龘憂/g | %s/\<13905\>/亟/g | %s/\<90939\>/㒸/g | %s/\<90158\>/拟包纵组尼木/g | %s/\<90159\>/圂/g'



exe '%s/\<21875\>/禾版戚/g | %s/\<12180\>/産產/g | %s/\<45460\>/貌/g | %s/\<65412\>/壽/g | %s/\<45461\>/貍/g | %s/\<26350\>/壹/g | %s/\<39005\>/纵组欠心/g | %s/\<39407\>/憲/g | %s/\<45581\>/隱/g | %s/\<90169\>/戹/g | %s/\<59296\>/头龘监/g | %s/\<39319\>/帀版风/g | %s/\<61052\>/表/g | %s/\<92757\>/纵组从龰囗囗右龘從/g | %s/\<42692\>/秉/g | %s/\<90175\>/芮/g | %s/\<51179\>/纵组左月囗囗右龘隋/g | %s/\<39006\>/纵三组士冖手/g | %s/\<65043\>/上彐版疌/g | %s/\<90181\>/荀/g | %s/\<61053\>/袁/g | %s/\<90187\>/扈/g | %s/\<41114\>/兜/g | %s/\<23795\>/乾/g | %s/\<39140\>/處/g | %s/\<39141\>/䖏/g | %s/\<39143\>/寒/g | %s/\<51998\>/肅/g | %s/\<38207\>/猒/g | %s/\<21265\>/毁毀/g'




exe '%s/\<39146\>/榮/g | %s/\<45353\>/寨/g | %s/\<65286\>/麃/g | %s/\<39150\>/纵组隹冏/g | %s/\<12218\>/繁/g | %s/\<39151\>/爵/g | %s/\<12220\>/雚/g | %s/\<47107\>/獻/g | %s/\<90205\>/籋/g | %s/\<41708\>/騫/g | %s/\<43157\>/直夕宐版疉/g | %s/\<38208\>/窢冖彑版宐/g | %s/\<38116\>/丶版彑鱻惐夕版彑鱻惐丶版互/g | %s/\<25747\>/疊/g | %s/\<34288\>/睿/g | %s/\<39162\>/纵组囗撇化屮囗撇化屮/g | %s/\<59298\>/幺幺兀版㡭/g | %s/\<92492\>/正序纵包龘勹方/g | %s/\<43540\>/纵组人亓/g | %s/\<90213\>/纵组几口/g | %s/\<39007\>/横组亻丨/g | %s/\<39008\>/纵组夂日/g | %s/\<39165\>/帚/g | %s/\<41067\>/疌/g | %s/\<39167\>/侖/g | %s/\<12244\>/啓/g | %s/\<37112\>/横组育攵/g | %s/\<90218\>/纵组山曷/g'
exe '%s/\<12249\>/羸/g | %s/\<59300\>/右龘旅/g | %s/\<61055\>/𠂢/g | %s/\<65196\>/寽/g'



exe '%s/\<90228\>/芳/g | %s/\<37025\>/垔/g | %s/\<23129\>/恆/g | %s/\<39176\>/畟/g | %s/\<40415\>/圅/g | %s/\<60224\>/纵组𠂉丹/g | %s/\<45925\>/朔/g | %s/\<65200\>/纵组尤旨/g | %s/\<65004\>/巵/g | %s/\<90007\>/纵组匕木/g | %s/\<90243\>/覓/g | %s/\<99903\>/育/g | %s/\<42076\>/壺/g | %s/\<90246\>/萃/g | %s/\<39184\>/牽/g | %s/\<92159\>/棻/g | %s/\<39186\>/虜/g | %s/\<90251\>/纵组夅貝鱻惐纵组夂貢/g | %s/\<47005\>/头龘囊/g | %s/\<90253\>/蓉/g | %s/\<59304\>/右龘儍/g | %s/\<39188\>/菐/g | %s/\<39189\>/盡/g | %s/\<60323\>/右下罒版監/g | %s/\<97435\>/蓋/g | %s/\<39190\>/賔/g | %s/\<39191\>/遭/g | %s/\<65382\>/巤/g'



exe '%s/\<39195\>/適/g | %s/\<91974\>/篙/g | %s/\<59308\>/貝版覧/g | %s/\<17618\>/羲/g | %s/\<60651\>/覧/g | %s/\<39201\>/彝/g | %s/\<12292\>/藥/g | %s/\<20884\>/真/g | %s/\<65119\>/匽/g | %s/\<37243\>/纵组白方/g | %s/\<43359\>/䖒/g | %s/\<39206\>/憂/g | %s/\<39207\>/纵组眔魚/g | %s/\<37069\>/厭/g | %s/\<32204\>/纵组士囗一版冃/g | %s/\<39211\>/纵三组士冖王/g | %s/\<39212\>/纵四组士冖一卵/g | %s/\<47876\>/横组未攵/g | %s/\<97020\>/𠦝/g | %s/\<12016\>/纵组人毛/g | %s/\<90276\>/茸/g | %s/\<90282\>/叉版圣/g | %s/\<90283\>/䏍/g | %s/\<39216\>/交叠四丶廾/g | %s/\<59312\>/纵组𠂉疋/g | %s/\<97147\>/横组氵氵/g | %s/\<37685\>/横组扌囗纵组𠂉子/g | %s/\<39221\>/木版弃/g | %s/\<90291\>/纵组天井鱻惐纵组夭井/g | %s/\<90292\>/加丶尿囗囗包龘户水/g'


exe '%s/\<90294\>/纵组穴王/g | %s/\<65059\>/丏/g | %s/\<90297\>/纵组爫旧/g | %s/\<39295\>/宫/g | %s/\<12328\>/纵组穴囗大版灭/g | %s/\<59315\>/炎版㡭/g | %s/\<13069\>/冘/g | %s/\<39231\>/纵组艹㐬/g | %s/\<90305\>/包龘或大囗囗包龘戈吴/g | %s/\<90306\>/最/g | %s/\<65415\>/彳/g | %s/\<90312\>/絮/g | %s/\<39235\>/裔/g | %s/\<39236\>/䀄/g | %s/\<90317\>/葛/g | %s/\<90318\>/葉/g | %s/\<12341\>/纵组大革/g | %s/\<12344\>/箄/g | %s/\<39237\>/冩/g | %s/\<12347\>/閻/g | %s/\<90322\>/黄/g | %s/\<25284\>/㽔/g | %s/\<61153\>/還/g | %s/\<24485\>/歛/g | %s/\<90325\>/簡/g | %s/\<39241\>/纵组夂黑/g | %s/\<39752\>/横组亻丨/g | %s/\<40315\>/纵组夂黑/g | %s/\<97650\>/䋣/g | %s/\<90326\>/簟/g | %s/\<59316\>/纵组𠂉與/g | %s/\<38394\>/纵组𠂉與/g'



exe '%s/\<𥁑\>/纵组必皿/g | %s/\<𨥏\>/纵组父金囗囗父金版釜/g | %s/\<𦝚\>/横组月盈/g | %s/\<𠎤\>/双口版龠/g | %s/\<𡻟\>/横组山莫/g | %s/\<12358\>/横组屏屏/g | %s/\<90328\>/纍/g | %s/\<12017\>/二火版层/g | %s/\<𫁙\>/横组禾午/g'


exe '%s/\<37070\>/纵组臼土/g | %s/\<59317\>/横三组丿㠯巳/g | %s/\<39246\>/亭/g | %s/\<𥄷\>/横组目巨/g | %s/\<39009\>/纵四组士冖一火/g | %s/\<59318\>/丞/g | %s/\<12363\>/峯/g | %s/\<97708\>/横三组丿臣己/g | %s/\<𪣂\>/纵组火土/g | %s/\<24593\>/奉/g | %s/\<22294\>/備/g | %s/\<37307\>/底龘崋/g | %s/\<65398\>/日头崋/g | %s/\<90338\>/䓬/g | %s/\<45472\>/横组臽攵/g | %s/\<37417\>/无足燕/g | %s/\<12353\>/僉/g | %s/\<12368\>/節/g | %s/\<24747\>/中序拟横三组火辛火/g | %s/\<24071\>/賴/g | %s/\<37060\>/右龘漢/g | %s/\<99846\>/头龘興/g | %s/\<𦉬\>/纵组罒丁/g'


exe '%s/\<44634\>/壳/g | %s/\<92454\>/累/g | %s/\<40610\>/營/g | %s/\<39258\>/夒/g | %s/\<90252\>/苟/g | %s/\<12389\>/纵组囗横组讠大贝/g | %s/\<𦣞\>/右龘姬/g | %s/\<48555\>/蚩/g | %s/\<39012\>/纵四组士冖一犬/g | %s/\<39263\>/母贝版實/g | %s/\<92177\>/馵/g | %s/\<12399\>/囂/g | %s/\<90360\>/巿/g'


exe '%s/\<90361\>/纵组丿𤴓/g | %s/\<21282\>/横组臣㕚/g | %s/\<94435\>/筆/g | %s/\<97714\>/横组石豕/g | %s/\<97658\>/头龘與/g | %s/\<42893\>/畿/g | %s/\<𤬦\>/纵组冖瓦/g | %s/\<37153\>/头龘𦥯/g | %s/\<62210\>/缺一马/g | %s/\<41940\>/雍/g | %s/\<90381\>/黨/g'




exe '%s/\<45482\>/肀/g | %s/\<97717\>/横组古缶/g | %s/\<59331\>/横组土囗纵组𠂉鹵/g | %s/\<21292\>/木型纵组聿皕/g | %s/\<55390\>/横组石又/g | %s/\<45486\>/横组户攵/g | %s/\<97768\>/横组户戈/g | %s/\<59148\>/專/g | %s/\<90394\>/莽/g | %s/\<61060\>/睘/g | %s/\<59334\>/纵组古㐄/g | %s/\<97723\>/㓞/g | %s/\<20325\>/罔/g | %s/\<90405\>/苴/g | %s/\<45009\>/楽/g | %s/\<60986\>/察/g | %s/\<65392\>/呈/g | %s/\<90415\>/芺/g'



exe '%s/\<𣶒\>/右龘淵/g | %s/\<98995\>/横组句又/g | %s/\<92568\>/纵组支只/g | %s/\<39310\>/倉/g | %s/\<90428\>/荼/g | %s/\<90429\>/莘/g | %s/\<99701\>/窢乂版刀头大鼻孔四脚日背龟囗囗右龘䆋35251125511511511/g | %s/\<65737\>/穴/g'



exe '%s/\<37140\>/纵组目大/g | %s/\<19988\>/矞/g | %s/\<45495\>/過/g | %s/\<21304\>/横组爿臬/g | %s/\<𩊐\>/横组革耳/g | %s/\<10358\>/横组䏠凡/g | %s/\<97732\>/横组夕力/g | %s/\<97733\>/包龘口夕/g | %s/\<45502\>/刪/g | %s/\<43380\>/侖/g | %s/\<44549\>/咼/g | %s/\<45505\>/俊/g | %s/\<45506\>/㕟/g | %s/\<𦥝\>/舀/g | %s/\<90444\>/纵组日羽囗囗右龘塌/g | %s/\<𠝻\>/横组甚刂/g | %s/\<45508\>/散/g | %s/\<𥫛\>/纵组𥫗厶/g | %s/\<37353\>/纵组大車/g | %s/\<47912\>/隊/g | %s/\<91547\>/棠/g | %s/\<45511\>/数/g | %s/\<21319\>/摠/g | %s/\<39761\>/遷/g | %s/\<21322\>/毅/g | %s/\<65320\>/黎/g | %s/\<59371\>/巤/g | %s/\<45517\>/䙔/g'


exe '%s/\<𥬥\>/无廾算/g | %s/\<10359\>/横组脒几/g | %s/\<12471\>/簽/g | %s/\<97767\>/横组户又/g | %s/\<37289\>/无丿妥/g | %s/\<97769\>/横组每殳/g | %s/\<45215\>/蔡/g | %s/\<59347\>/覧/g | %s/\<91939\>/蕉/g | %s/\<12484\>/䇔/g | %s/\<18201\>/薰/g | %s/\<39014\>/纵四组士冖一缶/g | %s/\<42644\>/薦/g | %s/\<37009\>/耒/g'



exe '%s/\<42820\>/冫版肉月/g | %s/\<39349\>/纵组力囗无丨氺/g | %s/\<𡱁\>/正序纵包龘尸矢/g | %s/\<𧴪\>/纵组囗头龘肖貝/g | %s/\<37486\>/头龘齊/g | %s/\<39015\>/纵四组士冖一月/g | %s/\<39372\>/纵组夂月/g | %s/\<𡕙\>/纵组夂月/g'

exe '%s/\<25666\>/肎/g | %s/\<25919\>/纵组囗长腿甘囗冖/g | %s/\<39362\>/疌/g | %s/\<26662\>/纵组吅冖/g | %s/\<99840\>/包龘匚炎/g | %s/\<25329\>/舜/g | %s/\<90495\>/符/g | %s/\<39366\>/冨/g'


exe  ' %s/\<99721\>/右上龘侯/g | %s/\<37165\>/纵组艹冖/g | %s/\<61063\>/役/g | %s/\<𡗥\>/纵组大屯/g | %s/\<61064\>/徂/g | %s/\<21347\>/姧/g | %s/\<41469\>/㓂/g | %s/\<21349\>/娏/g | %s/\<37191\>/栗/g | %s/\<97792\>/横组缶且/g | %s/\<92577\>/茈/g | %s/\<97798\>/横组白百/g | %s/\<37448\>/横组乡隹/g | %s/\<46512\>/敕/g | %s/\<21356\>/横组𤴔朿/g | %s/\<61065\>/厶版遠/g | %s/\<21365\>/嫂/g | %s/\<𦭝\>/纵组艹罒/g | %s/\<97804\>/横组目畐/g | %s/\<45550\>/遜/g | %s/\<21371\>/稱/g | %s/\<45552\>/褐/g | %s/\<𠔁\>/纵组八八/g | %s/\<21377\>/底龘爾囗囗交疊巾㸚/g | %s/\<45554\>/縢/g | %s/\<61066\>/中序拟横三组止白巳/g | %s/\<48145\>/纵组八夂囗鱻馘儿版鱻魊夊版/g | %s/\<22776\>/横组幸匊/g | %s/\<45559\>/雜/g | %s/\<65321\>/叢/g | %s/\<97820\>/躅/g '



exe  ' %s/\<65322\>/横组囗右龘漢囗鳥/g | %s/\<𧄶\>/纵组艹䜌/g | %s/\<21394\>/㸐/g | %s/\<45560\>/横三组木缶木/g | %s/\<45561\>/横组鬯彡/g | %s/\<47951\>/横三组木缶木/g | %s/\<37528\>/底龘鬰/g | %s/\<97641\>/卧/g | %s/\<97642\>/虒/g '



exe  ' %s/\<91311\>/窢卝干版缩头芈𦍋/g | %s/\<39018\>/纵组夂虫/g | %s/\<40076\>/㐬/g | %s/\<90756\>/並/g | %s/\<95860\>/笄/g | %s/\<97844\>/神/g | %s/\<30377\>/熏/g | %s/\<48413\>/憲/g | %s/\<12541\>/厲/g | %s/\<42308\>/篾/g | %s/\<92894\>/萬/g | %s/\<90510\>/乂版友/g | %s/\<65057\>/袞/g | %s/\<90519\>/纵组果衣/g | %s/\<39387\>/蹇/g | %s/\<𡗜\>/大版灭/g | %s/\<39389\>/卣/g | %s/\<65580\>/囟/g | %s/\<37241\>/纵组丑山/g | %s/\<𠯑\>/纵组氏口/g | %s/\<59366\>/米版亾/g | %s/\<48860\>/纵组丰木/g | %s/\<37091\>/纵组臼工/g '

exe  ' %s/\<12571\>/单止歰/g | %s/\<60530\>/奊/g | %s/\<37103\>/賈/g | %s/\<46843\>/遝/g | %s/\<92690\>/纵组免免/g | %s/\<59377\>/㡭/g | %s/\<39465\>/憂/g | %s/\<59370\>/日版延/g | %s/\<53407\>/纵组囗头龘上冖/g | %s/\<37901\>/纵组一谷/g | %s/\<62913\>/头龘監/g | %s/\<99519\>/横组臣殳/g | %s/\<61072\>/卮/g | %s/\<51101\>/纵组囗头龘业冖/g | %s/\<59373\>/聚/g | %s/\<39415\>/臯/g | %s/\<45572\>/横组囗无钩刂囗又/g | %s/\<90552\>/芰/g | %s/\<𪯻\>/横组文文/g | %s/\<39418\>/纵组龹貝/g | %s/\<42044\>/虍版睿/g | %s/\<90557\>/纵组囗斜月版夕囗廾/g '



exe  ' %s/\<90561\>/纵组水月/g | %s/\<57516\>/头龘瞢/g | %s/\<39431\>/龠/g | %s/\<𡉊\>/纵三组一八土囗囗八版至/g | %s/\<𫉶\>/戉版蔑/g | %s/\<𤴡\>/疐/g | %s/\<39437\>/辱/g | %s/\<59381\>/包龘口囗头龘肖/g | %s/\<65804\>/包龘𦥑囟囗囗囟版头龘興/g | %s/\<𨛳\>/横组昔阝/g | %s/\<65085\>/矍/g | %s/\<65242\>/出头乇/g | %s/\<𩇮\>/纵组非手/g | %s/\<𥪴\>/横组章夅/g | %s/\<𡵱\>/纵组山斤/g | %s/\<49608\>/眔/g | %s/\<39457\>/圅/g | %s/\<21413\>/木型纵组十玨/g | %s/\<90601\>/烹/g | %s/\<90602\>/脣/g | %s/\<𫓇\>/横组釒阝/g | %s/\<90606\>/葴/g | %s/\<39461\>/亷/g | %s/\<90609\>/蒪/g | %s/\<97837\>/横组求求/g | %s/\<12650\>/纵组覀囗横组臣卩/g | %s/\<39467\>/正序纵包龘𠂆万囗囗撇顶厉/g | %s/\<59248\>/纵组囗头龘惠𧘇/g | %s/\<59386\>/无梁兮/g | %s/\<39472\>/纵组山囗底龘隳/g | %s/\<12667\>/夾女版㥷/g | %s/\<39474\>/賓/g | %s/\<39475\>/芯鹵版悤/g | %s/\<97841\>/横组氵壬/g '





exe  ' %s/\<63064\>/復/g | %s/\<21423\>/潭/g | %s/\<91012\>/纵组厶鼎/g | %s/\<26025\>/横组囗纵组林月攴/g | %s/\<45582\>/儵/g | %s/\<12674\>/僉/g | %s/\<𢆰\>/纵组一幺/g | %s/\<𧈪\>/蚩/g | %s/\<90622\>/悹/g | %s/\<59247\>/横组𠂔欠/g | %s/\<59246\>/横组𠂔次/g | %s/\<97581\>/纵组次韭/g | %s/\<𪪇\>/缺乀朿/g | %s/\<39490\>/窢弯冄版纵组彡冄/g | %s/\<39491\>/豸/g | %s/\<59389\>/咼/g | %s/\<90635\>/纵组彡否/g | %s/\<𦓔\>/纵组而而/g | %s/\<37004\>/飠/g | %s/\<97850\>/横组歹又/g '



exe  ' %s/\<95907\>/正序纵包龘勹吉/g | %s/\<48616\>/纵组龶皿/g | %s/\<61638\>/會/g | %s/\<65299\>/薄/g | %s/\<12032\>/窢𠂉版纵组人馬/g | %s/\<39525\>/蹇/g | %s/\<37281\>/纵组幺月/g | %s/\<𩫏\>/纵五组亠口回口十/g | %s/\<37271\>/纵组人氺/g | %s/\<21223\>/横三组弓者弓/g | %s/\<39530\>/脊/g | %s/\<𠄣\>/亙/g | %s/\<𠅇\>/罔/g | %s/\<41895\>/拟包纵组虍魚/g | %s/\<39541\>/虜/g | %s/\<90340\>/負/g | %s/\<37856\>/横组魚束/g | %s/\<39543\>/瞢/g | %s/\<39026\>/拟包纵组虍鱼/g | %s/\<90677\>/奚/g | %s/\<17311\>/寇/g | %s/\<65403\>/睘/g | %s/\<61086\>/後/g | %s/\<97649\>/横组臣又/g | %s/\<37267\>/黍/g | %s/\<60995\>/纵组𠂉昜/g '



exe  ' %s/\<99553\>/横组知于/g | %s/\<39557\>/責/g | %s/\<99697\>/干干版幵/g | %s/\<37330\>/头龘啬/g | %s/\<37104\>/缺丿𧘇/g | %s/\<𢆉\>/纵组丷干/g | %s/\<38458\>/横组囗正序纵包龘冂丶囗正序纵包龘冂丶/g | %s/\<37024\>/二版丰/g | %s/\<10001\>/横组丿丨/g | %s/\<38498\>/纵组爫糸/g | %s/\<29554\>/融并甲电版㫣/g | %s/\<37774\>/纵组十旱/g | %s/\<37283\>/左龘亂/g | %s/\<37456\>/底龘赤/g | %s/\<37106\>/纵三组亠口冖/g | %s/\<37186\>/纵组日小/g | %s/\<37596\>/纵三组冖土九/g | %s/\<37866\>/纵组回旦/g | %s/\<37565\>/芯一版区/g | %s/\<37509\>/分/g | %s/\<37526\>/纵组一木/g '
exe  ' %s/\<𡚬\>/纵组二女/g | %s/\<37259\>/无腿兴/g | %s/\<37252\>/帀版风/g | %s/\<65346\>/纵组口囗儿版川囗囗三腿兄/g | %s/\<𠕁\>/正序纵包龘冂卄/g | %s/\<37260\>/右龘侯/g | %s/\<37952\>/横组丑刂/g | %s/\<65347\>/又版帚/g | %s/\<37444\>/呂/g | %s/\<38005\>/㣊/g | %s/\<37849\>/彐版𡰪/g | %s/\<37582\>/纵组夂犬/g | %s/\<39613\>/纵组夂火囗囗非灸/g | %s/\<37728\>/放/g | %s/\<37293\>/目版拐化直/g | %s/\<37167\>/要/g | %s/\<37426\>/上彐版疌/g | %s/\<37969\>/半型纵组𠈌十/g | %s/\<37676\>/半型纵组丷十/g | %s/\<37146\>/右龘備/g | %s/\<45642\>/效/g '
exe  ' %s/\<37021\>/䍃/g | %s/\<𦐇\>/纵组日羽囗囗右龘塌/g | %s/\<37065\>/纵组𠂉昜/g | %s/\<37605\>/纵三组囟八夂囗囗右龘傻/g | %s/\<38383\>/芯用版䓒/g | %s/\<23907\>/纵组吅从/g | %s/\<38107\>/䙴/g | %s/\<37707\>/横组車攵/g | %s/\<37619\>/纵组覀舛/g | %s/\<37825\>/粟/g | %s/\<37295\>/右龘儍/g | %s/\<37382\>/賓/g | %s/\<37833\>/賞/g | %s/\<37094\>/暴/g | %s/\<48411\>/賣/g | %s/\<63569\>/底免版兄/g | %s/\<38418\>/中序拟横三组囗左龘卬囗白囗空心彐/g | %s/\<21631\>/中序拟横三组囗左龘北白匕/g | %s/\<37337\>/出头巾版㒳/g | %s/\<99918\>/横组月巜/g | %s/\<37086\>/缺一卫/g | %s/\<𢆶\>/横组幺幺/g '



exe  ' %s/\<37460\>/拟包横组元攴囗囗攴版㝴/g | %s/\<37121\>/奏/g | %s/\<37154\>/无足鸟/g | %s/\<37934\>/纵组豆几/g | %s/\<37633\>/反序拟包纵组凵囗纵组丷干/g | %s/\<38060\>/万底版另/g | %s/\<37030\>/左龘颈/g | %s/\<37285\>/左龘制/g | %s/\<37105\>/窢郎版良/g | %s/\<𣏂\>/术版杀/g | %s/\<37063\>/头龘黎/g | %s/\<37087\>/横组未攵/g | %s/\<24225\>/正序纵包龘厂刀囗囗刀版历/g | %s/\<37807\>/纵组冖力/g | %s/\<37044\>/头龘学/g | %s/\<37027\>/𤇾/g | %s/\<59978\>/纵组𠂉囗一隹版存/g | %s/\<37119\>/𡿺/g | %s/\<38261\>/纵组从十/g | %s/\<37277\>/甲版早/g | %s/\<37660\>/正序纵包龘冂囗纵组丷干/g | %s/\<37143\>/左龘卬/g '
exe  ' %s/\<37116\>/左龘印/g | %s/\<37084\>/窢缺丿艮/g | %s/\<37589\>/横组原原/g | %s/\<𤰔\>/由版古/g | %s/\<37117\>/纵组厶大/g | %s/\<37562\>/纵组人三/g | %s/\<38343\>/头龘叏/g | %s/\<65522\>/中版古/g | %s/\<37333\>/纵组爫冖/g | %s/\<𡰥\>/左龘叚/g | %s/\<65362\>/右龘叚/g | %s/\<𤆌\>/纵组火又/g | %s/\<37214\>/正序纵包龘尸示囗囗示版层/g | %s/\<37689\>/臼𦥑丨叟头/g | %s/\<37320\>/睿𥈠/g | %s/\<37742\>/纵三组丷干囗变体取/g | %s/\<65571\>/纵组丿口/g | %s/\<37422\>/𠂢/g | %s/\<37131\>/弄/g | %s/\<37629\>/横组口另/g | %s/\<38168\>/窢卝干版缩头芈𦍋/g '



exe  ' %s/\<37197\>/纵组䒑夫/g | %s/\<37471\>/底龘兼/g | %s/\<37232\>/纵三组田一口/g | %s/\<38152\>/纵组执云/g | %s/\<37310\>/纵组囗头龘肖贝/g | %s/\<37206\>/羌/g | %s/\<37159\>/纵组亠丷/g | %s/\<𪞐\>/正序纵包龘冂古/g | %s/\<𢼄\>/横组户攵/g | %s/\<37449\>/横组户戈/g | %s/\<37923\>/纵组十回/g | %s/\<38469\>/纵组羊䒑/g | %s/\<37039\>/爰/g | %s/\<38081\>/纵三组口䒑口/g | %s/\<38424\>/亮/g '


exe  ' %s/\<37125\>/横组丿丿/g | %s/\<37463\>/𣪘鱻惐横组囗窢缺丿艮囗殳/g | %s/\<37868\>/纵组口冋/g | %s/\<37461\>/纵组口囗正序纵包龘冂卄/g | %s/\<37166\>/纵组囗头龘肖貝/g | %s/\<37683\>/纵三组口䒑加/g | %s/\<37608\>/纵组口旨/g | %s/\<37079\>/窢西版覃/g | %s/\<37384\>/嘗/g | %s/\<37988\>/厶版疐囗囗右龘嚔/g | %s/\<37569\>/横组口𨥫鱻鬾头留版/g | %s/\<38362\>/纵组囗中版古囗㓁/g | %s/\<37287\>/纵组囗中版古囗冖/g | %s/\<37228\>/底龘襄/g | %s/\<𠪚\>/正序纵包龘厂敢/g | %s/\<37646\>/反序拟包横组辶囗纵组罒㒸/g '


exe  ' %s/\<𡋑\>/插序巫幽型全二包龘土口口/g | %s/\<38270\>/底龘畏/g | %s/\<38373\>/纵三组冖吅囗底龘襄/g | %s/\<37751\>/包龘口囗纵组丷干/g | %s/\<𠃓\>/右龘杨/g | %s/\<20137\>/纵组一巛/g | %s/\<37144\>/横组囗无钩刂囗又/g | %s/\<17079\>/纵组土八鱻惐纵组土儿/g | %s/\<𠧗\>/纵组上下/g | %s/\<37176\>/㐫/g | %s/\<38301\>/坔/g | %s/\<38043\>/寽/g | %s/\<37062\>/头用尚/g | %s/\<38106\>/横组方方/g | %s/\<37304\>/穿头中版呈/g | %s/\<42932\>/纵组龹土/g | %s/\<65106\>/㚇/g | %s/\<38503\>/界/g | %s/\<37675\>/纵组田囗无丨氺/g | %s/\<38245\>/巷/g | %s/\<37883\>/纵三组囗头龘冓八土/g | %s/\<60400\>/纵三组𠂉口皿/g | %s/\<𣪠\>/横组囗車版击囗殳/g | %s/\<38338\>/纵组囗横组乡隹囗土/g | %s/\<38354\>/纵三组十罒衣/g | %s/\<37138\>/㐮/g | %s/\<38090\>/㕡/g | %s/\<38002\>/㕓/g | %s/\<𤳳\>/横组畕畕/g | %s/\<𠃜\>/眉版尸/g | %s/\<37151\>/纵组士冖/g | %s/\<37744\>/纵组冖业/g '


exe  ' %s/\<99852\>/丨丨版中/g | %s/\<37578\>/纵组冖豆/g | %s/\<37234\>/底龘亞/g | %s/\<38497\>/纵四组士乛工一囗囗头龘壽/g | %s/\<38012\>/头龘夀/g | %s/\<40475\>/纵组日夂/g | %s/\<𦣻\>/纵组一自囗囗目版百/g | %s/\<37338\>/纵组囗头用负囗目/g | %s/\<37284\>/中序拟横三组火言火/g | %s/\<38302\>/纵组一囗中序拟横三组止自巳/g | %s/\<21633\>/包龘𦥑囗目版百/g | %s/\<38480\>/横组亻囗叉版夂/g | %s/\<37531\>/纵三组罒冖夕/g | %s/\<37376\>/头龘奐囗囗八版头用负/g | %s/\<37194\>/横组丬夕/g | %s/\<𡗞\>/纵组幺大/g | %s/\<37258\>/米版向/g | %s/\<55905\>/釆版向/g | %s/\<37452\>/横组丬寽/g | %s/\<37715\>/纵组隹寸/g | %s/\<38230\>/纵组隹田/g | %s/\<𦋹\>/罒版品/g | %s/\<99857\>/头龘妻/g | %s/\<37088\>/𠂔/g | %s/\<𢦰\>/武/g | %s/\<61050\>/头龘婁/g | %s/\<38236\>/忝/g | %s/\<37410\>/横组贝贝/g | %s/\<37102\>/纵组囟比/g | %s/\<39625\>/纵组龹女/g | %s/\<37308\>/𣁋鱻鬾山一几版鱻魊山一儿版鱻魊山兀版鱻魊山几版/g | %s/\<38335\>/横组男女/g | %s/\<37916\>/纵组囗头用负囗比/g | %s/\<45755\>/正序纵包龘厂女/g | %s/\<37051\>/戠/g | %s/\<38225\>/纵组囗反序包龘北口囗女/g | %s/\<37246\>/𣁋鱻鬾山一王版鱻魊山一𡈼版鱻魊山一壬版/g | %s/\<37665\>/拟包横组免生/g | %s/\<37657\>/拟包横组兔生/g | %s/\<38273\>/横组女𨥫鱻鬾头留版/g '




%s/\<𡚇\>/右龘嬽/g
exe  ' %s/\<37980\>/纵组囗横三组口口口囗女/g | %s/\<37813\>/纵组冖子/g | %s/\<𠨯\>/正序纵包龘厂子/g | %s/\<37534\>/纵组丰口/g | %s/\<𠯚\>/纵三组口一囗儿版川/g | %s/\<37942\>/纵组囗又丷版必囗山/g | %s/\<37455\>/纵三组一由八/g | %s/\<𡶇\>/纵组必山/g | %s/\<37885\>/纵三组囗头龘冓八㔾/g | %s/\<37936\>/纵组心皿/g | %s/\<22503\>/横组爿丙/g | %s/\<22505\>/横组爿未/g | %s/\<37887\>/纵三组囗头龘冓八囗底龘冬/g | %s/\<38403\>/纵组囗罒版百囗丁/g | %s/\<37616\>/纵组必冉/g | %s/\<37702\>/横组丬囗又版帚/g | %s/\<38112\>/纵组囗尾大版目版百囗分/g | %s/\<38426\>/横组爿囗又版帚/g | %s/\<𪻆\>/横组爿言/g | %s/\<𤕻\>/横组爿吾/g | %s/\<37817\>/纵组珎貝/g | %s/\<37787\>/纵组珤貝/g | %s/\<𪨃\>/纵组夕寸/g | %s/\<92250\>/纵组囗斜月版夕囗寸/g | %s/\<37445\>/头龘惠/g | %s/\<38436\>/纵组囗彐鱻鬾尾大版囗横组工口/g | %s/\<37052\>/纵组业𦍌/g | %s/\<37427\>/缺丶戈/g | %s/\<37071\>/纵组又囗二版丰/g | %s/\<37118\>/弁/g | %s/\<38204\>/横组山歹/g | %s/\<37870\>/君/g | %s/\<38138\>/纵三组一木山/g | %s/\<37998\>/纵组示山/g | %s/\<37639\>/横组禾尤/g | %s/\<37367\>/纵组尤山/g | %s/\<𣢟\>/横组甘欠/g | %s/\<37346\>/底步版烕/g | %s/\<38233\>/正序纵包龘厂配/g | %s/\<59268\>/横组𠂤辛/g | %s/\<37882\>/纵组豕囗横组土土/g | %s/\<37120\>/㥯/g | %s/\<43236\>/纵组隹冏/g | %s/\<37949\>/厳/g | %s/\<38322\>/䒑版㜸/g | %s/\<37435\>/缺丿囟版鼠/g | %s/\<47445\>/横组工几/g '





exe  ' %s/\<37199\>/无足寒/g | %s/\<37992\>/萈/g | %s/\<32259\>/纵组一己/g | %s/\<37142\>/横组巳巳/g | %s/\<37207\>/横组丨丿/g | %s/\<37172\>/纵组冖巾/g | %s/\<37490\>/纵三组亠丷冖囗囗尾冖版立/g | %s/\<21897\>/帶版卅/g | %s/\<37467\>/纵组旲巾/g | %s/\<38088\>/𣁋鱻鬾山一巾版/g | %s/\<37441\>/窢人版纵组八干/g | %s/\<𢎨\>/正序纵包龘弔丿囗囗底龘第/g | %s/\<𧈧\>/纵组厶虫/g | %s/\<37884\>/纵三组囗头龘冓八弓/g | %s/\<10031\>/横组丰丰/g | %s/\<31196\>/包龘比矢/g | %s/\<37388\>/纵组冖果/g | %s/\<𪫌\>/纵组粉廾/g | %s/\<38194\>/纵组囗横组米糸囗廾/g | %s/\<38118\>/纵组囗横组米糸囗廾/g | %s/\<37393\>/正序纵包龘厂彡/g | %s/\<40520\>/纵组幺夂/g | %s/\<37678\>/纵组丷𤴓囗囗纵组䒑龰/g | %s/\<37262\>/纵组从龰囗囗右龘從/g | %s/\<37593\>/纵组正正/g | %s/\<37379\>/纵三组十罒心囗囗缺𠃊㥁/g | %s/\<38381\>/𣁋鱻鬾山一土版/g | %s/\<37805\>/𣁋鱻鬾山一王版鱻魊山一𡈼版鱻魊山一壬版/g | %s/\<38266\>/𣁋鱻鬾山一糸版/g | %s/\<37635\>/横组訔攵囗囗𣁋鱻鬾山言版/g | %s/\<38384\>/纵四组日出大氺/g | %s/\<𠮦\>/纵组丷口/g | %s/\<37970\>/纵组囗直化用囗心/g | %s/\<37135\>/戒/g | %s/\<38327\>/横组忄禾/g | %s/\<37489\>/纵组囗头龘兴囗凶/g | %s/\<37979\>/纵组冗心/g | %s/\<95490\>/纵组厶心/g | %s/\<38125\>/纵组㠯心/g '


%s/\<37352\>/纵组丿囗撇化干/g
%s/\<38073\>/正鱻鬾撇顶版鱻魊横顶版鱻魊𠃊止版鱻魊丄止版/g

exe  ' %s/\<14692\>/芯夹版区/g | %s/\<37784\>/横组忄貝/g | %s/\<38206\>/㤩/g | %s/\<38462\>/纵三组爫冖心/g | %s/\<37047\>/头用㱿囗囗头用无弓彀/g | %s/\<𪻧\>/横组来犬/g | %s/\<65029\>/窢廿兩版㒼/g | %s/\<37801\>/廾版馮/g | %s/\<37888\>/㥑/g | %s/\<38120\>/徝/g | %s/\<38119\>/猌/g | %s/\<𢽟\>/横组來攵/g | %s/\<37927\>/横组舌自/g | %s/\<37935\>/纵三组囗躯龘害罒心/g | %s/\<37851\>/纵三组亠罒衣/g | %s/\<38077\>/横组忄𨥫鱻鬾头留版/g | %s/\<37198\>/徵/g | %s/\<37732\>/赣/g | %s/\<37986\>/贛/g | %s/\<37524\>/头龘憂/g | %s/\<59430\>/癸/g | %s/\<𠠵\>/拟包横组九力/g | %s/\<𡯄\>/拟包横组尢力/g | %s/\<37512\>/纵组一丰/g | %s/\<38242\>/処/g | %s/\<37276\>/𠃌版东囗囗右龘炼/g | %s/\<𡿪\>/纵组巛夕/g | %s/\<37130\>/𠂢/g | %s/\<𢪰\>/横组扌歹/g | %s/\<37905\>/反序拟包纵组夨日/g | %s/\<37429\>/纵组申又囗囗申版叟/g | %s/\<37655\>/尾/g | %s/\<37649\>/委/g | %s/\<37759\>/横组分手/g | %s/\<37342\>/纵组日匂囗囗匂版曷/g | %s/\<𧈡\>/纵组又虫囗囗又版蚤/g | %s/\<𦥛\>/臿鱻鬾穿底版/g | %s/\<37701\>/纵组爫囗缺丿缶囗囗缺丿午版䍃/g | %s/\<45383\>/纵组免囗底龘冬/g | %s/\<65046\>/斜月夕版䍃/g | %s/\<37053\>/屖/g | %s/\<𢪒\>/横组手手/g | %s/\<38318\>/纵组耳囗无丨氺/g | %s/\<90779\>/夕版容/g | %s/\<37479\>/産產/g | %s/\<37466\>/纵组人音/g | %s/\<38308\>/着/g | %s/\<99813\>/右下罒版監/g | %s/\<37590\>/適/g | %s/\<38350\>/纵组大手/g | %s/\<16221\>/纵组窊㼌/g | %s/\<37446\>/各/g | %s/\<38508\>/子版肴囗囗乂版孝/g | %s/\<38369\>/横组申攵/g | %s/\<37749\>/纵组龶囗底龘万/g '





exe  ' %s/\<37210\>/纵组囗无钩𠃌囗耳鱻惐纵组丅耳囗囗左龘敢/g | %s/\<38239\>/纵组龷月囗囗左龘散/g | %s/\<37438\>/啇/g | %s/\<𢽬\>/横组東攵/g | %s/\<37643\>/纵组囗尾冖版上囗釆/g | %s/\<𠩬\>/正序纵包龘厂來/g | %s/\<55103\>/横三组丿二丨/g | %s/\<53596\>/横三组丿示丨/g | %s/\<37451\>/纵组冖斗/g | %s/\<37253\>/纵组人斗/g | %s/\<𠁁\>/左龘斲/g | %s/\<𠨣\>/亞版留/g | %s/\<60146\>/纵组𠂉几/g | %s/\<60979\>/纵组𠂉巾/g | %s/\<60969\>/纵组𠂉子/g | %s/\<60223\>/纵组𠂉斤/g | %s/\<60099\>/纵组𠂉毛/g | %s/\<38188\>/右龘旅/g | %s/\<38217\>/纵组𠂉巿/g | %s/\<37795\>/纵组𠂉皮/g | %s/\<37941\>/纵组𠂉瓦/g | %s/\<38375\>/纵组𠂉生/g | %s/\<37799\>/纵组𠂉令/g | %s/\<38187\>/纵组𠂉尼/g | %s/\<60092\>/纵组𠂉矢/g | %s/\<38454\>/纵组𠂉兆/g | %s/\<37761\>/纵组𠂉㐬/g | %s/\<60339\>/纵组𠂉肖/g | %s/\<65397\>/纵组𠂉奇/g | %s/\<60238\>/纵组𠂉其/g | %s/\<37766\>/纵组𠂉票/g | %s/\<38368\>/纵组𠂉番/g | %s/\<37794\>/纵组𠂉亶/g | %s/\<38201\>/纵组𠂉會/g | %s/\<38486\>/纵组𠂉遂/g | %s/\<38038\>/於/g | %s/\<38254\>/叱/g | %s/\<37218\>/纵组一勿/g | %s/\<37572\>/卭/g | %s/\<38416\>/纵三组一厸一/g | %s/\<38010\>/倒日儿版免/g | %s/\<37504\>/昌/g | %s/\<37345\>/尭/g | %s/\<37948\>/纵组旲日/g | %s/\<37440\>/㳟/g | %s/\<38156\>/纵三组出大本/g | %s/\<50778\>/头龘曹/g | %s/\<59548\>/纵组罒又/g | %s/\<38024\>/纵组囗丷八囗田/g | %s/\<38332\>/纵组囗丷八囗脸龘曾/g | %s/\<𦔳\>/力版变体取/g | %s/\<37951\>/纵组亼囗脸龘曾/g | %s/\<38405\>/横组臣月/g '




exe  ' %s/\<38441\>/本版卉/g | %s/\<37453\>/卉/g | %s/\<38065\>/㲺/g | %s/\<32273\>/纵组二水/g | %s/\<38085\>/阉版束/g | %s/\<𪲰\>/横组木歹/g | %s/\<99981\>/日版占/g | %s/\<38055\>/纵组厶夲/g | %s/\<37395\>/横组氵刅/g | %s/\<𠫡\>/纵组厶木/g | %s/\<38435\>/横组占又/g | %s/\<38157\>/争爭/g | %s/\<37602\>/纵组亠舛/g | %s/\<37932\>/纵组䒑未/g | %s/\<37792\>/中序拟横三组冫白囗右龘氺/g | %s/\<38341\>/彐版品/g | %s/\<37399\>/纵组人木/g | %s/\<37516\>/纵三组士冖石/g | %s/\<𠳮\>/纵组右冋/g | %s/\<37459\>/纵组酉灬/g | %s/\<99837\>/中序拟横三组幺白幺/g | %s/\<38292\>/离/g | %s/\<37789\>/术版杀鱻惐朮版杀/g | %s/\<37494\>/菐/g | %s/\<37354\>/纵组㐬皿/g | %s/\<37224\>/纵三组𠂉卌一/g | %s/\<38062\>/纵组冖䂞/g | %s/\<38209\>/丑版品/g | %s/\<37961\>/缺心隱/g | %s/\<37312\>/匱/g | %s/\<37644\>/遷/g | %s/\<37940\>/纵组囗头龘囊咎/g | %s/\<38063\>/蓮/g | %s/\<37592\>/纵组棥冖/g | %s/\<37237\>/寸版即/g | %s/\<38399\>/纵组棥罒/g | %s/\<𠤕\>/纵组匕矢/g | %s/\<37040\>/纵组士示/g | %s/\<37929\>/纵组叕酉/g | %s/\<𣥂\>/缺丶少/g | %s/\<38317\>/反序拟包纵组凵米囗囗米版凶/g | %s/\<37818\>/小版烕/g | %s/\<59452\>/纵组𠂤止/g | %s/\<37485\>/底万头负版殳/g | %s/\<37377\>/纵组𠂉囗右龘杨/g | %s/\<60782\>/左龘段/g | %s/\<𡱒\>/正序纵包龘尸共/g | %s/\<99815\>/毌/g | %s/\<37770\>/㲋/g | %s/\<38314\>/正序纵包龘厂毛/g | %s/\<𤴁\>/直夕宐版疉/g | %s/\<37155\>/纵组几口/g | %s/\<𢎀\>/纵组弋月/g | %s/\<37275\>/纵组刃止/g | %s/\<37324\>/函/g | %s/\<𠛼\>/横组并刂/g | %s/\<𫃢\>/横三组丿米丨/g | %s/\<38079\>/纵组止囗无丨氺/g | %s/\<37323\>/纵组爫夫/g | %s/\<37917\>/横组关刂/g | %s/\<𦚏\>/纵组立月囗囗左龘龍/g | %s/\<37406\>/㚅/g | %s/\<38139\>/纵组艹両/g | %s/\<37862\>/纵三组山夂囗二版丰/g | %s/\<𡌥\>/幺幺版坙/g | %s/\<37852\>/纵三组㓁工口/g | %s/\<94561\>/纵组艹两/g | %s/\<𣱷\>/正序纵包龘厂水/g | %s/\<38315\>/敘/g | %s/\<37254\>/纵组匕水/g | %s/\<38175\>/纵组山並/g | %s/\<37865\>/横组彳囗纵组夂月/g | %s/\<44429\>/纵组𦉫豕囗囗纵组罒囗底龘豕/g | %s/\<38475\>/衆眾/g | %s/\<37107\>/纵组林月/g | %s/\<𣈅\>/纵组林日/g | %s/\<38432\>/纵组囗米版向囗丂囗囗缺一粤/g | %s/\<39975\>/方版曼/g | %s/\<37924\>/纵三组宀帚又/g | %s/\<37370\>/睿𥈠/g | %s/\<37553\>/纵四组士冖一木/g | %s/\<37425\>/纵组黒土囗囗十版墨/g | %s/\<𠾂\>/纵三组來一回/g | %s/\<38089\>/拟包纵组廌去/g | %s/\<𧰟\>/横组豊盍/g | %s/\<37735\>/横组泉泉/g | %s/\<37703\>/纵组丿丹囗囗亠版舟/g | %s/\<37899\>/纵组了灬/g | %s/\<37767\>/攸/g | %s/\<37185\>/灬版与/g | %s/\<37171\>/木型纵组了叹/g | %s/\<37402\>/纵组囗头龘负旧/g '


exe  ' %s/\<38333\>/横组𦣝巳/g | %s/\<27156\>/横组刍攵/g | %s/\<37632\>/横组囗纵组巛歹囗刂/g | %s/\<37823\>/横三组丿臣巳/g | %s/\<37535\>/无足版融竖版纵组千黑/g | %s/\<37326\>/纵组匕火/g | %s/\<38387\>/横组隹欠/g | %s/\<37147\>/同版𦥯鱻鬾同版鱻魊冂一丅版/g | %s/\<37568\>/纵三组林大火/g | %s/\<37831\>/横组熏力囗鱻馘灬底版/g | %s/\<37508\>/亅版不出头版肀/g | %s/\<38336\>/纵组一友/g | %s/\<38086\>/底龘爲/g | %s/\<38408\>/纵组罒囗寸版即鱻鬾厶版鱻魊丨二版/g | %s/\<37876\>/正序纵包龘户甫/g | %s/\<37270\>/纵组冖牛/g | %s/\<47747\>/正序纵包龘厂牛/g | %s/\<37294\>/d?丶最后=>O?缺乚尤/g | %s/\<38180\>/横组讠犬/g | %s/\<38280\>/横组言犬/g | %s/\<37991\>/舄/g | %s/\<37714\>/纵三组畄一口/g | %s/\<38114\>/嚴/g | %s/\<37800\>/纵组囗中序拟横三组冫幺囗右龘氺十/g | %s/\<37240\>/右龘旅/g | %s/\<𤤤\>/横组𤣩禾/g | %s/\<37874\>/莠/g | %s/\<37573\>/纵组朱貝/g | %s/\<38122\>/賛/g | %s/\<38360\>/横组瓜豕/g | %s/\<38129\>/纵三组罒冖瓦/g | %s/\<37291\>/正序纵包龘厂生/g | %s/\<37912\>/纵组心用鱻鬾直用版鱻魊弯用版/g | %s/\<37679\>/反序拟包纵组凵田/g | %s/\<37617\>/纵组口田/g | %s/\<38007\>/纵组田八/g | %s/\<38348\>/纵组田一/g | %s/\<38227\>/反序拟包纵组凵田/g | %s/\<38244\>/纵组囗无丨氺囗冝/g | %s/\<34383\>/正序纵包龘弓土囗囗土版㢧/g | %s/\<38511\>/㽬/g | %s/\<48378\>/横组丶丿/g | %s/\<38200\>/纵三组十冖田/g | %s/\<39595\>/纵组龴疋/g | %s/\<38249\>/纵组一囗出头兀囗囗开版元/g | %s/\<38080\>/横组弓殳/g | %s/\<𠨐\>/横组囗提化匕囗卩/g | %s/\<37415\>/出头版纵组囗无丨氺囗十/g | %s/\<38276\>/纵组䒑八/g | %s/\<37223\>/头龘监/g | %s/\<37355\>/纵三组肀一灬/g | %s/\<37236\>/头龘監/g | %s/\<28987\>/头龘盥/g | %s/\<𪯧\>/横组幸攵/g | %s/\<𨠭\>/纵组合酉/g | %s/\<38025\>/横组臣囗纵组𠂉古/g | %s/\<𢿐\>/横组囗纵组幺幸囗攵/g | %s/\<37386\>/芯三版且鱻惐目一版旦/g | %s/\<37192\>/反序拟包横组𠃊目/g | %s/\<37903\>/氺鱻鬾八八版鱻魊丷八版/g | %s/\<38026\>/纵组囗反序拟包横组𠃊目囗八/g | %s/\<47519\>/木型纵组亻从鱻惐中序拟横三组人亻人/g | %s/\<37993\>/纵三组一口𧘇/g | %s/\<45891\>/血鱻鬾丿罒版/g | %s/\<38415\>/尾冖版上/g | %s/\<37401\>/纵四组一八人目/g | %s/\<38146\>/纵三组罒冖目/g | %s/\<95136\>/白版臱/g | %s/\<38177\>/闞/g | %s/\<38040\>/纵组乛囗反序横组丿亅/g | %s/\<37411\>/纵组大石/g | %s/\<37313\>/横组囗斜月版夕囗乛乀版龴囗囗头龘祭/g | %s/\<37257\>/纵组回示/g | %s/\<43127\>/纵组罒羽/g | %s/\<65144\>/喜/g | %s/\<𤇕\>/纵组禾灬/g | %s/\<37781\>/纵组爫旧/g | %s/\<97555\>/纵组匕禾/g | %s/\<37532\>/纵三组爫彐心囗囗缺工㥯/g | %s/\<15107\>/纵组囗插序巫幽型全二包龘土口口囗回囗囗头喪版嗇/g | %s/\<38091\>/横组正見/g | %s/\<37716\>/纵组土囗融并甲电版㫣/g | %s/\<37963\>/纵组土黽/g | %s/\<37630\>/横组釆𥜽鱻鬾厶禸版/g | %s/\<𩰬\>/鬲鱻鬾口㐄版/g | %s/\<38275\>/纵组夅夂/g | %s/\<37517\>/纵组𠔿比囗囗𠔿版昆/g | %s/\<𥃲\>/纵组目廾/g | %s/\<38298\>/横组車㔾/g | %s/\<𣐝\>/横组木匝/g | %s/\<37736\>/纵组目厺/g | %s/\<38019\>/纵三组目大㔾鱻馘巳版/g | %s/\<37468\>/纵组罒戍/g | %s/\<37797\>/纵组艮皿/g | %s/\<37897\>/纵三组目大么/g | %s/\<37580\>/插序全包龘戈巾囗囗巾版戒/g | %s/\<37734\>/纵组巫㕣/g | %s/\<𤿺\>/横组其皮/g | %s/\<37359\>/甄/g | %s/\<38159\>/纵三组目大良/g | %s/\<37647\>/米版囟/g | %s/\<37362\>/横组囗触底版纵组丵臼囗殳/g | %s/\<38479\>/纵组囗横组𠂤辛囗米/g | %s/\<37546\>/糹三点/g | %s/\<37400\>/纵组十冖/g | %s/\<38488\>/百/g | %s/\<37475\>/纵组刀巴/g | %s/\<38446\>/纵组夂糸/g | %s/\<42504\>/纵组亠兄/g | %s/\<37567\>/者鱻鬾加丶版/g | %s/\<38015\>/纵组彐囗底龘豕/g | %s/\<38268\>/纵组囗芯三版且囗小鱻惐県/g | %s/\<37989\>/插序全包龘𢦏业囗囗业版哉/g | %s/\<37442\>/纵三组目大糸囗囗非䋰/g | %s/\<37729\>/雨型二包龘囗断头巾靐糹虫/g | %s/\<37433\>/蓬/g | %s/\<37177\>/纵组米糸/g | %s/\<15966\>/正序纵包龘厂墨鱻鬾黒版/g | %s/\<37636\>/纵组母縣之且版?笔顺码错?/g | %s/\<99836\>/缺一纟/g | %s/\<37816\>/横组讠刂/g | %s/\<𦌂\>/纵组罒田/g | %s/\<37879\>/㓹鱻鬾厂包炎刂版/g | %s/\<37841\>/横组革马/g | %s/\<38407\>/纵组土久/g | %s/\<38447\>/纵组一夫鱻惐㺯/g '

exe  ' %s/\<37409\>/缺丨爪/g | %s/\<63648\>/无足黑/g '



exe  ' %s/\<38485\>/融横版横组囗纵组禾丂囗戈/g | %s/\<54060\>/纵组夂羽/g | %s/\<95438\>/纵组人羽/g | %s/\<37928\>/撇顶版口版与/g | %s/\<37939\>/纵组耂囗头龘至/g | %s/\<𦔷\>/横组耳幺/g | %s/\<𦔻\>/横组耳口/g | %s/\<38048\>/纵组囗横组幺幺囗廾/g | %s/\<38011\>/纵组囗横组幺幺囗大/g | %s/\<𢇇\>/纵组囗横组幺幺囗丱/g | %s/\<38103\>/右上包龘耳王/g | %s/\<37305\>/纵组八十囗囗非仐/g | %s/\<65438\>/纵组匕匕/g | %s/\<38033\>/人版氺/g | %s/\<𠯳\>/纵组勿口/g | %s/\<𣍩\>/横组月禾囗鱻鬾弯月版囗或肉月版?/g | %s/\<38143\>/马版卷/g | %s/\<37443\>/旅/g | %s/\<38499\>/纵组冖肙/g | %s/\<38281\>/横组末成/g | %s/\<37274\>/寬/g | %s/\<61027\>/纵组𠂉品/g | %s/\<37233\>/纵组囗窢儿版穴囗方/g | %s/\<𠫔\>/纵组一厶/g | %s/\<38355\>/纵三组口冖至/g | %s/\<37827\>/正序纵包龘勹灬/g | %s/\<38346\>/夹车𦥑囗囗头龘舆/g | %s/\<38501\>/头龘與/g | %s/\<37385\>/纵组隹臼/g | %s/\<38262\>/纵组干口/g | %s/\<37498\>/纵组人土/g | %s/\<𦧚\>/横组舌舌/g | %s/\<37609\>/纵组冖舛/g | %s/\<65460\>/底龘五/g | %s/\<38296\>/纵四组巛冖厶㐄/g | %s/\<37311\>/纵组丿凡/g | %s/\<38246\>/纵组冖土/g | %s/\<37814\>/纵组冖卂/g | %s/\<37880\>/纵组人木/g | %s/\<37853\>/纵组冖木/g | %s/\<𠕽\>/纵组冖水/g | %s/\<37829\>/纵组冖火/g | %s/\<38108\>/纵组冖玉/g | %s/\<37677\>/纵组冖鸟/g | %s/\<38359\>/纵组乃叱/g | %s/\<37975\>/纵组犬廾/g | %s/\<38279\>/纵组一囗穿头中版呈/g | %s/\<37696\>/拟包横组見丶/g | %s/\<37340\>/纵组目廾/g | %s/\<37668\>/纵组冖虫/g | %s/\<38096\>/纵组冖糸/g | %s/\<38506\>/纵组冖酉/g | %s/\<37615\>/纵组冖金/g | %s/\<37328\>/纵组冖鳥/g | %s/\<37771\>/纵组冖吕/g | %s/\<38052\>/横组阝产/g | %s/\<37613\>/纵组死廾/g | %s/\<37997\>/纵组巩女/g | %s/\<38509\>/包龘戊贝/g | %s/\<38404\>/包龘戊占/g | %s/\<24687\>/包龘戊臣/g | %s/\<38500\>/包龘戊貝/g | %s/\<37848\>/纵组化叱/g | %s/\<37335\>/修/g | %s/\<38113\>/横组鱼刂/g | %s/\<𨳐\>/正序纵包龘門女/g | %s/\<37908\>/纵组宀囗拟包横组元攵囗囗攵版寇/g | %s/\<𫕶\>/正序纵包龘门隹/g | %s/\<37709\>/触顶版纵三组一𠈌囗二版丰/g | %s/\<37190\>/纵组品亏/g | %s/\<38386\>/横组单斤/g | %s/\<38228\>/飧/g | %s/\<37974\>/横组镸共/g | %s/\<37575\>/纵三组罒冖伐/g | %s/\<37954\>/横组氵囗纵组帚又/g | %s/\<37743\>/横组歹昜/g | %s/\<37628\>/飱/g | %s/\<37436\>/横组歹韭/g | %s/\<37560\>/纵四组亠口冖死/g | %s/\<38439\>/纵三组罒冖死/g | %s/\<38370\>/纵三组罒冖侵/g | %s/\<38232\>/漂/g | %s/\<38363\>/㙯/g | %s/\<𧛱\>/纵组保衣/g | %s/\<38351\>/親/g | %s/\<38136\>/纵组歮木/g | %s/\<65288\>/横组單斤/g | %s/\<37893\>/纵组囗头用雨囗肥/g | %s/\<37892\>/横组禾魚/g | %s/\<37973\>/横组甚育/g | %s/\<𤾡\>/横组白爲/g | %s/\<38256\>/横组虫囗纵组夂産/g | %s/\<37706\>/横组弓雚/g | %s/\<37808\>/鼈/g | %s/\<𧇃\>/拟包纵组虍林/g | %s/\<37638\>/纵三组囗头龘肖日小/g | %s/\<37705\>/横组虫歹/g | %s/\<𠣜\>/正序纵包龘勹虫/g | %s/\<96546\>/纵组必虫/g | %s/\<37424\>/纵组日䖵/g | %s/\<37527\>/纵组天天/g | %s/\<𧋐\>/横组虫束/g | %s/\<38307\>/㡿/g | %s/\<37163\>/纵组人虫/g | %s/\<38510\>/纵组旲虫/g | %s/\<37718\>/纵组出虫/g | %s/\<99831\>/尋/g | %s/\<38423\>/纵组禺虫/g | %s/\<38149\>/纵组右䖵/g | %s/\<𧈹\>/纵组大虫/g | %s/\<38144\>/纵组即虫/g | %s/\<37710\>/横组豸刂/g | %s/\<37773\>/纵组囗头龘囊石/g | %s/\<38226\>/水平镜像龘㡭/g | %s/\<38255\>/纵组皕血/g | %s/\<37432\>/纵组口𧘇/g | %s/\<37157\>/无足鳥/g | %s/\<38193\>/纵组亠邑/g | %s/\<38422\>/纵组非𧘇/g | %s/\<37920\>/纵组囗躯龘寒衣/g | %s/\<37272\>/䙴/g | %s/\<38420\>/僕/g | %s/\<37645\>/出头交叠拟纵组冂凵/g | %s/\<37363\>/纵组刀牛/g | %s/\<37244\>/纵组二口/g | %s/\<38049\>/正序纵包龘厂囗纵组八言/g | %s/\<37654\>/纵组共言/g | %s/\<37838\>/纵组旲言/g | %s/\<37830\>/矞/g | %s/\<37495\>/纵组人口/g | %s/\<𠮛\>/纵组一口/g | %s/\<38163\>/正序纵包龘冂囗纵组䒑丨/g | %s/\<𠁳\>/反序拟二包纵组山丰丰鱻惐插序巫幽型全二包龘山丰丰/g | %s/\<37930\>/纵组冂囗出头豕/g | %s/\<𠀐\>/纵组中一/g | %s/\<37731\>/纵三组一囗缺丶少囗貝/g | %s/\<37697\>/貝版眉/g | %s/\<38392\>/纵组士罒/g | %s/\<38505\>/纵组示貝/g | %s/\<37482\>/纵组囗木型纵组十从囗冖/g | %s/\<38319\>/纵组囗木型纵组十吅囗冖/g | %s/\<38050\>/纵组囗躯龘寒貝/g | %s/\<38027\>/横组臣忠/g | %s/\<65140\>/纵组夂貢/g | %s/\<38102\>/纵组艹贝/g | %s/\<37966\>/纵组囗躯龘寒贝/g | %s/\<38476\>/纵组夂贡/g | %s/\<38130\>/纵组丶囗缺亠之/g | %s/\<37950\>/纵组囗躯龘寒足/g | %s/\<38431\>/纵组禺足/g | %s/\<37725\>/水平镜像龘㡭/g | %s/\<38284\>/纵组囗横组𠂤辛囗足/g | %s/\<37036\>/无丨氺/g | %s/\<99547\>/夹車𦥑囗囗头龘輿/g | %s/\<𦆕\>/横三组糹車糹囗鱻鬾魊糹魊糸版/g | %s/\<38393\>/横三组纟车纟/g | %s/\<𡴎\>/纵组屮𠂤/g | %s/\<38075\>/纵组止𠂤/g | %s/\<38068\>/正序纵包龘𠃌囗撇化版二版丰囗囗左龘那/g | %s/\<37700\>/阝版即/g | %s/\<37953\>/纵组囗反序拟包横组𠃊目囗巛/g | %s/\<38481\>/横组囗右龘侯阝/g | %s/\<37594\>/横组乡皀/g | %s/\<37861\>/纵组冘皿/g | %s/\<𥁓\>/纵组右皿/g | %s/\<37669\>/纵组酉分/g | %s/\<38356\>/纵组一里/g | %s/\<37136\>/纵组山巾/g | %s/\<92470\>/纵组灭又/g | %s/\<𡕢\>/纵组灭夂/g | %s/\<38009\>/派/g | %s/\<37663\>/纵组囟比/g '

    growing

%s/包囗冂一\|包囗厂赤\|包囗尸矢\|包囗𠂆万囗囗撇顶厉\|包囗勹吉\|包囗冂卄\|包囗冂囗纵组丷干\|包囗尸示囗囗示版层\|包囗冂古\|包囗厂女\|包囗厂子\|包囗厂配\|包囗弔丿囗囗底龘第\|包囗厂來\|包囗尸共\|包囗厂毛\|包囗厂水\|包囗户甫\|包囗厂牛\|包囗厂生\|包囗弓土囗囗土版㢧\|包囗厂墨之黒版\|包囗門女\|包囗门隹\|包囗厂囗纵组八言\|包囗𠃌囗撇化版二版丰囗囗左龘那\|包囗厂炎/正序纵\0/g

%s/正序纵包囗/正序纵包龘/g
%s/\<包囗/包龘/g
%s/包囗/包龘/g

%s/\<左囗囗\@!\(\S\)\>/左龘\1/g
%s/左囗囗\@!/左龘/g

%s/\<右囗囗\@!\(\S\)\>/右龘\1/g
%s/\<头囗囗\@!\(\S\)\>/头龘\1/g
%s/\<底囗囗\@!\(\S\)\>/底龘\1/g

%s/囗囗右囗囗\@!/囗囗右龘/g
%s/右囗囗\@!/右龘/g
%s/头囗囗\@!/头龘/g
%s/底囗囗\@!/底龘/g

%s/躯囗囗\@!\([寒害]\)/躯龘\1/g
%s/心囗囗\@!\([寒害]\)/心龘\1/g
%s/脸囗囗\@!\([曾]\)/脸龘\1/g

%s/躯囗囗\@!/躯龘/g
%s/心囗囗\@!/心龘/g
%s/脸囗囗\@!/脸龘/g


%s/\([左右][上下]\)囗囗\@!/\1龘/g
%s/水平镜像囗㡭/水平镜像龘㡭/g

%s/心龘囗\@!\([寒害]\)/胸龘\1/g

    growing
===
===
]]]



[[
䒑兰
丆石
丆han
亻但
亻dan
卩dan
𠂇丆厂有
𠂉午
龶青
龴矛甬
龵看
#反有午司飞象仓光看青共罕恭:goto
[龵龴龶䒑𦍌𥫗𠂉𠃊亼亽肀𤇾龺龹𢦏龸𡗗龷𠃌𠂇丆]

乙
乛
乚
𠃊
𠃋
𠃌
𠃍
𠃑
𠄌
𠄎
𡿨
===
#部件拼音:here
丆han?
廾gong?
巿fu/po vs 市shi
攵攴pu
亡亾兦wang
集亼亽ji
冂冏囧jiong
冂同tong
匚fang
雪彐xue
坎凵kan
冒冃mao
草艸艹屮cao
聿肀yu
邑阝yi乂乛乚弋乁衤乊
乚hao?毫?
乛zhe?折?
亅jue?孓?
竖丨shu
丨gun?棍?
乀fu
撇丿pie
爿丬pan
犬犭quan
釆bian
采cai
豖chu
豕shi
quan犮
qi亓丌
qun夋
qie疌
qin堇兓
qian佥僉
==
view ../../python3_src/nn_ns/CJK/CJK_pinyin__ucd/allHanyuPinyinPrime_list.txt
a
ai
an
ang卬
ao
ba丷八
bai
ban
bang
bao勹宀包宝勽
bei孛
ben夲本夯
beng
bi贲
bian釆辡
biao灬髟
bie
bin
bing冫疒仌氷幷仒
bo癶卜孛
bu卜
ca
cai采
can朁
cang仓仺倉
cao屮艹艸肏
ce册冊畟夨
cen叅叄
ceng
cha
chai
chan廛毚羼丳
chang镸
chao鼌
che
chen爯
cheng氶丞爯
chi彳
chong
chou篘
chu亍豖岀出刍
chua
chuai
chuan巛川舛
chuang刅囪仺
chui
chun
chuo辶辵
ci朿
cong悤匆囱
cou
cu
cuan汆
cui隹
cun
cuo
da亣眔畗
dai歺歹
dan亶卩亻
dang凼
dao刂
de
dei
den
deng
di氐籴翟啇弚疐厎
dia
dian丶
diao弔
die
din
ding
diu
dong##夂
dou
du
duan耑
dui
dun
duo
e歺仒
ei
en
eng
er尓尒
fa
fan攵犭棥
fang匚
fei
fen
feng夆
fo
fou缶
fu乀阝阜乁甶尃甫巿旉釜冨畐孚罘畗
ga玍
gai丐匄匃
gan倝
gang罓岡
gao睾皋皐夰
ge鬲亇
gei
gen艮亘亙
geng庚
gong廾厷
gou冓
gu
gua咼呙罣冎叧
guai夬叏
guan雚贯盥毌卝丱
guang
gui
gun丨衮袞
guo呙咼
ha
hai亥
han
hang亢
hao乚
he曷寉
hei黒黑
hen
heng
hng
hong沗厷
hou矦侯垕
hu戸戶户扈虍虎乕乊乎隺
hua
huai褱褢
huan巜奂豢雚奐
huang巟
hui卉
hun
huo灬蒦
ji亽亼集皀旡旣既彑屰丮乁亟焏
jia叚戞戛
jian幵戋
jiang夅匞
jiao敫纟糸
jie卩卪疌节節捷孑
jin釒钅堇兓仐
jing坕坙巠
jiong冂冏囧冋臦
jiu臼韭久乆丩灸纠
ju豦瞿
juan隽雋巂奆
jue亅孓
jun
ka
kai
kan凵
kang亢
kao丂
ke厼
kei
ken
keng
kong
kou
ku
kua
kuai
kuan
kuang卝丱
kui
kun
kuo
la
lai
lan坔
lang
lao耂
le
lei耒厽
len
leng
li鬲隶刕叕吏叓豊戾
lia
lian奁
liang冫両兩两
liao
lie奊
lin粦
ling夌霝霛
liu
lo寽
long尨
lou娄婁
lu卤鹵坴彔录甪
luan卵
lun仑侖
luo寽
lv寽
lve寽畧略圙
m
ma亇
mai
man
mang尨茻厖
mao冃卯冒冐冇皃夘戼 #戼丣
me
mei睂槑氼
men
meng黽瞢黾尨庬
mi冖幂芈糸羋冞
mian宀丏臱
miao
mie芈乜
min皿
ming
miu
mo匁
mou牟厶
mu牟茻
n
na
nai
nan
nang囊
nao
ne疒
nei内內
nen
neng
ng
ni氼屰兒
nia
nian卄廿秊秊
niang
niao
nie圼喦帇
nin
ning宁寜寕寗甯寧寍
niu牜
nong
nou
nu
nuan奻
nun
nuo
nv
nve
o
ou禺
pa
pai
pan爿丬
pang尨沗夆庬
pao
pei
pen
peng
pi疋匹丕
pian片
piao
pie丿撇
pin朩汖
ping
po叵巿攴
pou咅
pu攵攴扑
qi丌亓弃咠桼
qia
qian佥僉凵
qiang羌
qiao丂巧
qie疌
qin堇覃兓
qing靑青
qiong
qiu酋
qu瞿厺
quan犭犬犮
que隺
qun夋
ran冄冉
rang
rao
re
ren壬亻人刄刃
reng
ri
rong冗宂
rou禸
ru
rua
ruan
rui睿
run
ruo叒
sa卅
sai
san
sang
sao
se歰
sen
seng
sha歰
shai
shan彡
shang丄
shao
she佘
shei
shen穼罙冞昚眘
sheng
shi豕礻示氏饣飠食乄丗世卋
shou扌
shu戍朮术丨竖束殳黍疋忄
shua
shuai卛甩率衰
shuan闩
shuang
shui氺水氵
shun舜
shuo
si罒四巳私厶糸糹纟丝虒
song吅
sou叜叟
su粛肅玊
suan祘
sui夊绥
sun
suo
ta
tai冭太臺
tan
tang
tao夲仐夵
te
teng
ti戻扌
tian畠兲忝呑
tiao
tie
ting
tong冂同
tou亠
tu兎啚圖圗禿秃
tuan彖
tui
tun氽吞呑
tuo乇
wa呙咼
wai
wan夗毌
wang亡亾兦网罒罔罓
wei厃危隹
wen昷文亠
weng
wo呙咼卧臥
wong
wu兀
xi覀卥翕匸夕
xia丅
xian臽県彡仙仚屳
xiang
xiao
xie奊契
xin囟鑫
xing巠坙
xiong敻夐匈匂
xiu
xu戌
xuan吅昍玆
xue彐學
xun巽巺卂
ya襾疋亞覀
yan讠弇妟厃訁喦嵒
yang
yao幺爻
ye
yi乂阝乛乊衤乁乊乚邑睪叕
yin廴乚冘乑垔
ying
yo
yong甬邕
you卣酉尢尤冘丣
yu聿肀庾臾亐
yuan円夗肙贠
yue龠刖戉楽樂
yun勻匀员贠
za
zai甾災
zan兂
zang臧
zao皂
ze夨庂
zei
zen
zeng曾曽
zha乍
zhai翟豸亝
zhan
zhang
zhao爫鼌鼂
zhe乛乇
zhei
zhen
zheng
zhi卮豸黹巵##夂
zhong夂乑
zhou
zhu丶壴罜尌
zhua
zhuai
zhuan叀耑
zhuang
zhui隹奞
zhun
zhuo叕
zi甾笫
zong
zou辶赱
zu
zuan
zui
zun
zuo
ê
===
view ../../python3_src/nn_ns/CJK/CJK_pinyin__cedict/hanzi2pinyins.py
ang2:卬昂昻
ba1:〨丷八巴
bao1:勹包
bi1:屄皀逼
bian4:卞弁苄釆
biao1:髟彪
bing1:仌兵冫冰氷
bing4:並併倂并幷竝
ce4:冊册畟
chan3:丳产產産
chang4:鬯
che4:屮
chi4:彳
chou3:丑丒醜
chu1:出岀
chu4:亍豖
chuan1:巛川
chui2:垂埀
chuo4:㲋辵辶辍龊
cong1:匆怱悤
cong2:丛叢
cuan1:汆
da2:妲羍达逹達
diao4:吊弔
dou1:兜兠
dui4:兌兑对対對
duo3:朵朶
e4:厄咢噩垩堊悪戹
er3:尒尓尔爾
er4:〢二
fan2:凡凢
fang1:匚方
feng1:丰
feng2:夆
...单音字
,,,
...多音字
===
view /sdcard/0my_files/tmp/out4py/汉语字典囗.py..nn_ns.fileformat.sqlite3_dump_cmd.out.txt
,夂
:8799:夂:3:354:ttny:zhi:zhǐ
:夂zhǐ
/从后至。
/
/夂
/zhōng
/古同“终”。
,夊
:8800:夂:3:354:qyi:sui:suī
:夊suī
/〔夊夊〕古同“绥绥”，慢慢行走的样子，如“雄狐夊夊。”（今作“有狐绥绥”）。
,攵
:10888:攵:4:3134:ttgy:pu:pū
:攵pū
/古同“攴”。
,攴
:10889:攵:4:2154:hcu:pu:pū
:攴pū
/轻轻地击打。
/古同“扑”，戒尺。
,夅
:8804:夂:6:354152:tahj:jiang:jiàng
:夅jiàng
/同“降”。
/
/夅
/xiáng
/古同“降”。
,夆
:8805:夂:7:3541112:tdhj:feng:féng
:夆féng
/逆；抵触。
/遇；相逢。
/
/夆
/fēng
/古通“锋”。
/
/夆
/páng
/姓。
,夋
:8806:夂:7:5434354:cwtu:qun:qūn
:夋qūn
/〔夋夋〕行走迟缓的样子。
/倨。
,夐
:8814:夂:14:35253425111354:qmwt:xiong:xiòng
:夐xiòng
/远：“平沙无垠，夐不见人。”
/姓。
/
/夐
/xuàn
/营求：“非梦卜夐求，殆无幸矣。”
######################敻夐#攵夂
,敻
:10940:攵:14:35253425111354:qmwt:xiong:xiòng
:敻xiòng
/远：“平沙无垠，敻不见人。”
/姓。
/
/敻
/xuàn
/营求。

,殳
:11500:殳:4:3554:mcu:shu:shū
:殳shū
/古代的一种武器，用竹木做成，有棱无刃。
/戟柄。
/古八体书之一：殳书（用于兵器上）。
/姓。

,禸
:8362:忄:4:2554:mci:rou:róu
:禸róu
/古同“蹂”。
,忈
:11961:心:6:114544:fnu:ren:rén
:忈rén
/古同“仁”，仁爱；亲。
,冄
:940:冂:4:2511:mfd:ran:rǎn
:冄rǎn
/同“冉”。
,罓
:941:冂:4:2534:mqi:wang:wǎng
:罓wǎng
/同“网”。用作偏旁。
,冃
:942:冂:4:2511:mfd:mao:mào
:冃mào
/古同“帽”。
,円
:943:冂:4:2521:mhgd:yuan:yuán
:円yuán
/古同“圆”。
,冉
:944:冂:5:25211:mfd:ran:rǎn
:冉rǎn
/龟甲的边。
/〔冉冉〕a.毛、枝条等柔软下垂；如“柳枝冉冉”；b.慢慢地，如“月亮冉冉升起”。
/姓。
,冊
:945:冂:5:25221:mak:ce:cè
:冊cè
/同“册”。
,冎
:946:冂:5:25525:mnmb:gua:guǎ
:冎guǎ
/古同“剐”。
,冋
:947:冂:5:25251:mkd:jiong:jiōng
:冋jiōng
/古同“冂”。
,犮
:11052:犬:5:13544:dcu:quan:quǎn
:犮quǎn
/古同“犬”。
/
/犮
/bá
/古同“拔”。
/古同“跋”，踩；踏；登。
/犬跑的样子。
,隺
:19028:隹:10:4532411121:pwyd:hu:hú
:隺hú
/极高。
/
/隺
/hè
/古通“鹤”。
/鸟往高处飞。
,厺
:1772:厶:5:13454:dcu:qu:qù
:厺qù
/古同“去”。
,厾
:1773:厶:6:512154:nfci:du:dū
:厾dū
/用指头、棍棒等轻击轻点：厾点（指画家随意点染）。厾一个点儿。
,厽
:1774:厶:6:545454:cccu:lei:lěi
:厽lěi
/垒土块为墙。
,瞿
:13372:目:18:251112511132411121:hhwy:qu:qú
:瞿qú
/古代戟一类的兵器。
/〔瞿聃〕佛陀与老子，为“
/〔瞿昙〕佛教创始人释迦牟尼，姓瞿昙。后以瞿昙为佛的代称，亦称“乔达摩”。
/姓。佛”、“道”两教宗奉的教主。
/
/瞿
/jù
/惊视，惊恐四顾：瞿瞿（ａ．惊顾的样子；ｂ．迅速张望的样子；ｃ．勤谨的样子）。瞿然。
,丂
:64:一:2:15:gnv:kao:kǎo
:丂kǎo
/气要舒出的样子。
/古同“考”。
/
/丂
/qiǎo
/古通“巧”。
/
/丂
/yú
/古同“于”。
,丆
:65:一:2:13:dgt:mo,ye,o,ne:mo,ye,o,ne
:丆义未详。
,丄
:66:一:2:21:hgd:shang:shàng
:丄shàng
/古同“上”。
,丅
:67:一:2:12:ghk:xia:xià
:丅xià
/古同“下”。
,咅
:3909:口:8:41431251:ukf:pou:pǒu
:咅pǒu
/义同“呸”，表示斥责或唾弃。
,朩
:9751:木:4:1234:sghy:pin:pin
:朩义未详。
,汖
:11535:水:7:2522534:miu:pin:pìn
:汖pìn
/剥取??麻的茎皮。
,厖
:292:厂:9:131353334:ddne:mang:máng
:厖máng
/石头大的样子。
/古通“尨”。
/丰厚；厚重。
/有；拥有。
/杂；乱。
/长毛狗，亦泛指犬。
,狵
:5273:犭:10:3531353334:qtde:mang:máng
:狵máng
/古同“尨”，毛多色杂的狗。
,尨
:8788:尢:7:1353334:dnee:mang,meng:máng,méng
:尨lóng
/古同“龙”。
/
/尨
/máng
/多毛的狗。
/杂色：“衣之尨服。”
/
/尨
/méng
/〔尨茸〕蓬乱的样子，如“孤裘尨尨。”
/
/尨
/páng
/古通“庞”，高大：“虎见之，尨然大物也。”
/姓。

,喦
:4186:口:12:251251251252:kkkm:yan:yán
:喦yán
/同“岩”①。
,嵒
:5611:山:12:251251251252:kkkm:yan:yán
:嵒yán
/同“岩”。
,嵓
:5618:山:12:252251251251:mkkk:yan:yán
:嵓yán
/古同“岩”。
/古同“严”，严实。
,岩
:5448:山:8:25213251:mdf:yan:yán
:岩yán
/高峻的山崖：岩壁。岩壑。
/构成地壳的石头：岩石。岩洞。岩浆。岩层。熔岩。
/险要，险峻：岩险。岩邑。
/山洞：中空成岩。岩居穴处。

######################秊秊
,秊
:12644:禾:8:31234312:ttfj:nian:nián
:秊nián
/同“年”。
,秊
:20770:禾:8:None:ttfj:nian:nián
:秊nián
/这个字是属于特殊字,有知道详细资料的人,请来信告之!
    #秊0xF995(CJK Compatibility Ideographs)

,丣
:98:一:7:1315251:gajn:you:yǒu
:丣yǒu
/古同“酉”。
,戼
:9232:户:8:13151251:angn:mao:mǎo
:戼mǎo
/古同“卯”。

,氷
:11527:水:5:42534:yii:bing:bīng
:氷bīng
/同“冰”。
,氶
:11528:水:5:52534:bii:zheng:zhěng
:氶zhěng
/古同“拯”。
/〔氶水〕河名，源出中国山东省，流入运河。
/古县名，在今中国山东省枣庄市。
/
/氶
/chéng
/古同“承”。
/姓。
/
/氶
/zhèng
/〔氶乡〕中国汉侯国名。
,氺
:11529:水:5:24134:ihyy:shui:shuǐ
:氺shuǐ
/古同“水”。
,汆
:11530:水:6:342534:tyiu:cuan:cuān
:汆cuān
/烹调方法，把食物放在开水里稍微一煮：汆丸子。汆萝卜。
/方言，烧水用的金属器具，能很快地把水煮开：汆子。水汆儿。
,氽
:11531:水:6:342534:wiu:tun:tǔn
:氽tǔn
/方言，漂浮：木头在水上氽。
,氼
:11532:水:6:253434:iwu:ni:nì
:氼nì
/古同“溺”，沉没；沉溺。

,槑
:10404:木:14:25112342511234:ksks:mei:méi
:槑méi
/古同“梅”。
,睂
:13267:目:12:343421325111:wwhh:mei:méi
:睂méi
/古同“眉”。
,仌
:1099:人:4:3434:wwu:bing:bīng
:仌bīng
/古同“冰”。
,仒
:1100:人:4:3444:wuu:e,o:e,o
:仒义未详。
,仐
:1101:人:4:3412:wfj:jin:jīn
:仐jīn
/古同“今”。
/
/仐
/sǎn
/古同“伞”。

,夶
:3327:大:6:134134:ddy:bi:bǐ
:夶bǐ
/古同“比”。
,夻
:3328:大:6:134251:dkf:hua:huà
:夻huà
/喧哗：“不夻不敖。”
/大口。
,夵
:3329:大:6:134234:diu:yan:yǎn
:夵yǎn
/物上大下小。
/
/夵
/tāo
/　ㄊㄠˉ
/古同“夲1”。
,夿
:3330:大:7:1345215:dcb:ba:bā
:夿bā
/大。
/地名用字。
,奀
:3331:大:7:1324134:gidu:en:ēn
:奀ēn
/方言，瘦小（多用于人名）。
,奂
:3332:大:7:3525134:qmdu:huan:huàn
:奂huàn
/盛，多。
/文采鲜明。
,奁
:3333:大:7:1341345:daqu:lian:lián
:奁（奩）
/lián
/女子梳妆用的镜匣，泛指精巧的小匣子：妆奁（嫁资）。印奁。奁资（女子出嫁时，从娘家带到婆家的财物）。
,叐
:1984:又:5:31354:tdcu:ba:bá
:叐bá
/狗跑的样子。
/古通“跋”。
/古通“拔”。
,叏
:1985:又:5:51254:nhcu:guai:guái
:叏guái
/古同“夬”。
,叒
:1986:又:6:545454:cccu:ruo:ruò
:叒ruò
/古同“若”（ａ．顺；ｂ．指“若木”）。
,叓
:1987:又:7:1251254:gkhc:li:lì
:叓lì
/古同“吏”。
,叕
:1992:又:8:54545454:cccc:zhuo:zhuó
:叕zhuó
/连缀。
/短，不足：“圣人之思脩，愚人之思叕。”
/
/叕
/yǐ
/张网的样子。
/
/叕
/lì
/止。
/系。
/
/叕
/jué
/速。
,脩
:12290:月:10:3223542511:whte:xiu:xiū
:脩xiū
/同“修”。
/干肉：“凡肉脩之颁赐，皆掌之。”
/旧时指教学的酬金：束脩。脩金。
/干枯。
,坔
:7832:土:7:2534121:iff:di:dì
:坔dì
/古同“地”。
/
/坔
/làn
/方言，平地涌泉：坔水。
######################肯:肉月
,肯
:12193:月:8:21212511:hef:ken:kěn
:肯kěn
/许可，愿意：首肯（点头答应）。
/骨头上附着的肉：肯綮（筋骨结合的地方，喻重要的关键）。中肯（喻言论正中要害）。

===
view /sdcard/0my_files/tmp/out4py/script.中文字典囗..格式化囗新华字典囗..新华字典.out.txt

:卝
/guàn
:亼
/jí
/古同“集”。
:亽
/jí
/古同“亼”。
:卝
/guàn
/古代儿童将头发束成两角的样子。
:肀
/yù
/古同“聿”。用作偏旁部首。
#反有午司飞象仓光看青共罕恭:here
,⺁
:fǎn
,
:yǒu
,
:wǔ
,
:sī
,⺄
:fēi
,⺈
:xiàng
,⺋
:cāng
,
:máo
,⺌
:guāng
,
:kàn
,
:qīng
,
:gòng
,⺳
:hǎn
,⺗
:gōng

:吅
/xuān
/古同“喧”，大声呼叫。
/吅
/sòng
/古同“讼”，诉讼。
]]


e ../../python3_src/nn_ns/fileformat/font/freetype2/freetype2-note.txt
py_adhoc_call script.hz.部件拆分 @print_chars_  =16 =0x20000 =0x30000 >  /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..print_chars_.out.txt
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..print_chars_.out.txt

打印囗手机中文字体文件包含的高位字符囗
py_adhoc_call script.hz.部件拆分 @打印囗手机中文字体文件包含的高位字符囗  -pack =16 >  /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗手机中文字体文件包含的高位字符囗.out.txt
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗手机中文字体文件包含的高位字符囗.out.txt

py_adhoc_call script.hz.部件拆分 @打印囗手机中文字体文件包含的高位字符囗  +pack =16 >  /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗手机中文字体文件包含的高位字符囗.pack.out.txt
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗手机中文字体文件包含的高位字符囗.pack.out.txt
    提取常用部件:[[
𠂆𠂇𠂉
𠂊
𠃊𠃋𠃌
𠃍𠃑
𠄌𠄎
𡿨
𠤎
𠆢𠆤
𠫓
𠘨
𠔉
𠔿𦉪𦉫𦉰
𭕄
𦥯
𤇾
𥫗
𢦏
𧘇
𠦄
𠦝
𠬝
𠮷
壬𡈼王
𡗗
𡘓
𠧧
𠘰
𠂔𠂢𠂤𠂰
𠈌
𢇃
𢇁
𦈢
𤣩
𦍋
𦍌
𦚯
𨸏
昷𥁕
𣎴𥘅
食饣飠𩙿
臣𦣝
臼𦥑
𤴓𤴔
足𧾷
你你
兔兔
再再
冬冬
割割
勇勇
勺勺
卉卿
屮屮
慈慈
真眞真
貫貫

巽
𡈽
𡯁𡯂𡰪
𡿺𢁅𢁉
䕫蜨諭
嶲
𠕇𠖎
𦣪
𫝆
𨐌
    ]]

py_adhoc_call script.hz.部件拆分 @打印囗手机中文字体文件包含的高位字符囗  +pack +排除笔顺码文件中的汉字 =16 >  /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗手机中文字体文件包含的高位字符囗.pack.排除笔顺码文件中的汉字.out.txt
view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..打印囗手机中文字体文件包含的高位字符囗.pack.排除笔顺码文件中的汉字.out.txt
    提取常用部件:[[
龰龱
𭕄𮕩你兔再冤冬割勇勺卉
周咢善姬寃将屮巽形慈
憲成拔晉冕杞杓桒栟槪櫛沿浩滋潮炭
爨爵眞真絣芳芽䕫蜨諭貫軔輸嶲
##兼容区:艹艹辶
    ]]


#]]]'''
__all__ = r'''
提取基本面编码空间里的汉字囗
iter_parse_modified_output_file_
    main4phase1_
    列出可推导出来的部件笔顺码囗囗用于更新补丁囗
手机中文字体文件包含的高位字符范围囗

    打印囗手机中文字体文件包含的高位字符囗

迭代囗子孙部件名囗
    迭代囗囗规范部件名囗
        构造囗伪笔顺码到非数字部件名列表囗囗规范部件名囗
            打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗

分析囗部件名囗
    生成拆分囗囗规范部件名囗









load_汉字到笔顺码
get_OPS_
get_OPS_ex_
get_OPS__prefix_


print_chars_
print_chars__rngs_
print_chars__pack_
iter5rngs_


比较笔顺码囗囗汉语字典囗囗汉字笔顺表囗
    加载笔顺码囗囗汉语字典囗
    迭代加载笔顺码囗囗汉语字典囗

'''.split()#'''
__all__

def 比较笔顺码囗囗汉语字典囗囗汉字笔顺表囗(路径囗仅提取笔顺码囗汉语字典, /, *, patch):
    #提取笔顺码暨比较:goto
    from seed.mapping_tools.dict_op import mapping_symmetric_diff4patch__immutable__default, mapping_symmetric_patch4lhs__immutable__default, mapping_symmetric_patch4rhs__immutable__default
    #def mapping_symmetric_diff4patch__immutable__default(lhs, rhs, /, *, validate=False):
        #'Eq u v => Map (a|c) u -> Map (b|c) v -> Map (a|c|b) ((2,u)|(3,(u,v))|(1,v))'

    from seed.mapping_tools.dict_op import mapping_zipped_symmetric_partition__immutable, mapping_grouped_zipped_symmetric_partition__immutable
    #def mapping_grouped_zipped_symmetric_partition__immutable(may_zipped_pair_grouper, lhs, rhs, /):
        #'may (u->v->w) -> Map (a|c) u -> Map (b|c) v -> (Map a u, Map w (Map c (u,v)), Map b v)'
    #from seed.tiny import filter4dict_value

    bk2js = 部件到笔顺码 = 汉字到笔顺码 = load_汉字到笔顺码(patch=patch)
        #29685:未打补丁
    hz2js = 加载笔顺码囗囗汉语字典囗(路径囗仅提取笔顺码囗汉语字典)
        #21004
    #symmetric_patch = mapping_symmetric_diff4patch__immutable__default(hz2js, bk2js)
    (lonly_dict, grouped_zipped_common_dict, ronly_dict) = mapping_grouped_zipped_symmetric_partition__immutable(None, hz2js, bk2js)
    dict4bug = grouped_zipped_common_dict[False]
    dict4news = lonly_dict
    r'''[[[
    ===
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/my_found_bugs.txt
    爋u720Bh !43343125431211534444 =43343125431211444453
    ===
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/my_patch_ex.txt
    空心彐=右上叚=缺丨口:51
    ===
    #]]]'''#'''
    dict4bug
    dict4news
    sep_line = '#'*22
    print(sep_line)
    for hz, js in sorted(dict4news.items()):
        s = f'{hz}:{js}'
        print(s)
    print(sep_line)

    for hz, (js4new, js4old) in sorted(dict4bug.items()):
        s = f'{hz}u{ord(hz):X}h !{js4old} ={js4new}'
        print(s)
    print(sep_line)

def 加载笔顺码囗囗汉语字典囗(路径囗仅提取笔顺码囗汉语字典, /):
    from seed.tiny import dict_add__eq
    patch = r'''
    衖:332122513511112-->衚
    衚:332431325111112-->衜
    '''#'''
    kv2k = dict(s.split('-->') for s in patch.split())

    it = 迭代加载笔顺码囗囗汉语字典囗(路径囗仅提取笔顺码囗汉语字典)
    hz2js = {}
    for k,v in it:
        if v is None:
            # 麇:None
            # 牙合:None
            continue
        if (hz := kv2k.get(f'{k}:{v}', '')):
            k = hz
        dict_add__eq(hz2js, k, v)
            #ValueError: ('衖', '332122134112', '332122513511112')
    return hz2js
def 迭代加载笔顺码囗囗汉语字典囗(路径囗仅提取笔顺码囗汉语字典, /):
    with open(路径囗仅提取笔顺码囗汉语字典, 'rt', encoding='utf8') as ifile:
        for s in ifile:
            s = s.strip()
            hz, js = s.split(':')
            yield hz, js
def 手机中文字体文件包含的高位字符范围囗():
    r'''[[[
    total:42071
py_adhoc_call   nn_ns.fileformat.font.freetype2.freetype2_ftdump   @str.accumulate_font_char_rngs_  +compact --font_dir:'/system/fonts/' :'NotoSerifCJK-Regular.ttc' :'SysSans-Hans-Regular.ttf' :'NotoSansCJK-Regular.ttc' :'SysSans-Hant-Regular.ttf' --may_bg_rngs='[(0x3400,0x11_00_00)]' > /sdcard/0my_files/tmp/out4py/nn_ns.fileformat.font.freetype2.freetype2_ftdump.accumulate_font_char_rngs_..cjk.out.txt
view /sdcard/0my_files/tmp/out4py/nn_ns.fileformat.font.freetype2.freetype2_ftdump.accumulate_font_char_rngs_..cjk.out.txt
du -h /sdcard/0my_files/tmp/out4py/nn_ns.fileformat.font.freetype2.freetype2_ftdump.accumulate_font_char_rngs_..cjk.out.txt
    12K
    #]]]'''#'''
    compact_txt = r'''
#42071
;1:E81E,E826,E83B,E843,E864,1F200,1F202,1F237,1F23B,2000B,20021,20024,2003E,20046,2004E,20068,20094,200A2,200A4,200B0,200D1,200D7,200EE,200F5,2010C,2010E,20118,2012C,20158,20164,201A2,201A4,201A9,201AB,201C1,201D4,201F2,20204,2020C,20239,2025B,2028E,20299,2029E,202A0,202B7,202E5,2030A,20325,2032B,20341,20371,203A0,203A7,203B5,203C9,203CB,203F5,203F9,203FC,2041F,2042D,2044A,20465,20487,2048E,204A3,204D7,204FC,204FE,20509,2053F,20547,2058E,205A5,205B1,205B3,205C3,205CA,205D0,205EB,20611,20615,20628,20630,20656,20676,206EC,2070E,20731,2074F,20779,207C8,20807,2082C,2083A,20873,208B9,208D5,2090E,20916,20923,20954,20979,2097C,20984,2099D,209E7,20A11,20A50,20A64,20A6F,20A8A,20AB4,20AC2,20ACD,20AD3,20B0D,20B1D,20B8F,20B9F,20BB7,20BBF,20BC6,20BCB,20BE2,20BEB,20BFB,20BFF,20C0B,20C0D,20C20,20C34,20C53,20C65,20C7C,20C8D,20C96,20C9C,20CB5,20CB8,20CDD,20CED,20CFF,20D15,20D28,20D58,20D6F,20D71,20D74,20D7C,20D96,20D9C,20DA7,20DB2,20DC8,20DE1,20E04,20E16,20E1D,20E4C,20E64,20E6D,20E73,20E8C,20E98,20E9D,20EA2,20EB6,20EDD,20F1D,20F26,20F3B,20F4C,20F5F,20F64,20F8D,20F90,20FAD,20FBC,20FDF,21014,2104F,2105C,2106F,2107B,21088,21096,2109D,210B4,210CF,210D3,210E4,2112F,2113B,2113D,21145,21148,2114F,21155,21180,21187,211D9,21201,2124F,21255,21274,2128D,212B0,212D7,2131B,21336,2133A,21344,2138E,21398,2139A,2139C,213ED,213FE,21413,21416,21424,2143F,21452,2148A,21497,214B6,214E8,214FD,21577,21582,21594,21596,215D7,2160A,21613,21619,2163E,21647,21661,21692,216B4,216B8,216BA,216D3,216D5,216DF,216FE,21706,2170D,21710,21742,21757,217AB,217C3,217C7,217DF,217EF,21820,2182D,21840,21845,21852,2185E,21877,2187B,218D1,218FA,21915,2191C,21922,21927,2193B,21944,21958,2196A,2197C,21980,21983,21988,21996,219C3,219DB,219F3,21A1A,21A2D,21A34,21A45,21A4B,21A63,21B44,21C2A,21C56,21C70,21CA2,21CA5,21CAC,21D2D,21D53,21D5E,21D62,21D78,21D90,21D92,21D9C,21DA1,21DBA,21DCA,21DD1,21DE0,21DEB,21DF9,21E1C,21E23,21E37,21E3D,21E89,21EA4,21EA8,21EC8,21ED5,21F0F,21F15,21F1E,21F5C,21F6A,21F76,21F9E,21FA1,21FE8,21FFA,22045,22049,2207E,2209A,220C7,220FC,2212A,2215B,22173,221A1,221C1,221C3,22208,22218,2227C,2231E,22321,22325,223AD,223BD,223D0,223D7,223FA,22465,22471,2248B,22491,224B0,224BC,224C1,224C9,224CC,224E1,224ED,22513,2251B,22530,22554,2258D,225AF,225BE,22609,2262B,22668,2267A,22696,22698,22712,22714,2271B,2271F,2272A,22775,22781,22796,227CD,22803,2285B,22871,228AB,228AD,228C1,228F7,22926,22939,2294F,22967,2296B,22980,2298F,22993,22A66,22AB8,22ACF,22AD5,22AE6,22AE8,22B0E,22B22,22B3F,22B43,22B46,22B6A,22BA6,22BCA,22BCE,22C1D,22C24,22C38,22C4C,22C51,22C55,22C62,22C6F,22C88,22C9B,22CA1,22CA9,22CB2,22CB7,22CC2,22CC6,22CC9,22D12,22D44,22D4C,22D67,22D8D,22D95,22DA0,22DB7,22DE1,22DEE,22E0D,22E36,22E42,22E78,22E8B,22EB3,22EE0,22EEF,22F74,22FCC,22FE3,22FEB,23033,23044,2304B,23066,2308E,230B7,230BC,230DA,230FD,23103,2313D,2317D,23182,231B3,231B6,231EA,231F5,2320F,23225,2322F,23256,2325E,23262,23281,232D2,23300,2330A,2331F,23343,23372,233B4,233CC,233D0,233D5,233DA,233E4,233E6,233FE,23400,2343F,23465,2346F,23472,23519,23530,23551,2355A,23567,23584,23599,2359C,235BB,235C4,235CB,235F3,23600,23617,2361A,23640,23647,23659,2365F,23677,2368E,2369E,236A6,236AD,236BA,236DF,236EE,23703,2370C,23716,2371C,23720,2372D,2372F,2373F,23766,23781,237A2,237BC,237C2,237E7,237F1,237FF,23824,2383A,2383D,239C2,23A98,23AA7,23AD9,23ADB,23AEE,23AFA,23B1A,23B5A,23C63,23C7F,23CB5,23CB7,23CBE,23D0E,23D18,23D40,23D5B,23D7E,23D8F,23DD3,23DE3,23E06,23E11,23E23,23E39,23EB9,23EBF,23ED7,23F35,23F41,23F4A,23F61,23F8F,23FB4,23FB7,23FC0,23FC5,24011,2404B,24057,24085,24091,24096,240C9,240E1,240EC,2410F,24119,24144,2414E,2415C,2415F,24161,24177,2417A,241AC,241B5,241C6,241CD,241E2,241FC,241FE,2420E,2421B,2424B,24256,24259,24284,24293,24295,242A5,242BF,242C1,242EE,242F1,242FA,2430D,2431A,24334,24348,2438C,24396,243C1,243D0,243F2,243F8,24404,24473,244B9,244BC,244CE,244D3,244D6,24505,24521,24578,245C8,24618,24665,24674,24697,246A5,246D4,24706,24725,2472F,2478F,247E0,247F1,24812,24823,24882,24896,248E9,248FB,2490C,24919,2492F,2497B,2497F,24982,24994,249A4,249A7,249A9,249C5,249D0,249E3,249E5,249FB,24A01,24A0E,24A15,24A3E,24A42,24A45,24A4A,24A5D,24A71,24A7D,24A8C,24AC0,24AC7,24AD1,24ADF,24AE2,24AE9,24B0F,24B56,24BF5,24C09,24C16,24CC9,24CD9,24D06,24DB8,24E04,24E0E,24E37,24E3B,24E50,24E6A,24E8B,24EA5,24EA7,24F0E,24F5C,24F82,24F86,24F97,24F9A,24FA9,24FB8,24FC2,24FF2,2502C,2504A,25052,25055,2509D,25122,2512B,25148,251A9,251CD,251E3,2521E,2524C,25250,25299,252C7,252D8,2530E,25311,25313,2533E,253B5,253FE,25419,25425,25446,2546C,2546E,2548E,2549A,254D9,2550E,25535,2553F,25562,25581,25584,2558F,255B9,255D5,255DB,255E0,25605,25635,25651,2567F,25683,25695,256E3,256F6,25706,2571D,25725,2573D,257A9,257B4,257C7,25832,2583A,25857,2585D,25872,25874,258C8,258DE,258E1,25903,25946,25956,25978,259AC,259C4,259CC,259D4,25A54,25A95,25A9C,25AD7,25AE9,25AF1,25B74,25B89,25B97,25BC6,25BE4,25BE8,25C01,25C06,25C21,25C91,25CA4,25CFE,25D20,25D30,25D43,25D99,25DA1,25DB9,25E0E,25E2E,25E44,25E49,25E56,25E62,25E65,25EA6,25EBC,25EC2,25EE8,25F1A,25F23,25F4B,25F5C,25FD4,25FFB,2600C,26017,26021,26029,26048,26057,26060,26064,26083,26097,260ED,26102,26121,261B2,261DD,26258,26261,26270,26286,262D0,26335,26351,263BE,263F5,263F8,26402,2644A,26469,26484,2648D,26498,26512,26572,265A0,265A4,265AD,265BF,26612,26626,26676,2667E,266B5,266DA,266E8,266FC,26716,2671D,26741,2677C,26799,267CC,267D8,2681C,26846,2685E,2686E,26888,2688A,26893,268C7,268DD,268EA,2690E,26911,26926,26939,26951,2696F,26999,269A8,269B5,269DD,269F2,269FA,26A1E,26A34,26A42,26A58,26A8C,26AB7,26AFF,26B05,26B0A,26B13,26B15,26B23,26B28,26B75,26B82,26B9D,26BB3,26BC0,26BF7,26C21,26C29,26C46,26C73,26C9E,26CA4,26CBD,26CC0,26CC3,26CD1,26CDD,26D51,26D74,26DAE,26DDC,26DF0,26E00,26E05,26E07,26E12,26E40,26E65,26E6E,26E72,26E77,26E84,26E88,26E8B,26E99,26F26,26F94,26F9F,26FA1,26FBE,2700E,2704B,27088,270CD,270D2,270F0,270F4,270F8,27109,27139,27144,27175,271CD,2721B,27267,27280,27285,2728B,272B2,272B6,272E6,27352,2739A,27410,27422,27449,27450,27484,27486,274BD,27574,275A3,275E0,275E4,27607,2760C,27625,27639,27684,27723,27741,27752,2775E,277CC,27858,27870,2789D,278B2,278C8,27924,27967,2797A,27985,279A0,279B4,279DD,279FD,27A0A,27A0E,27A3E,27A51,27A53,27A59,27A79,27A84,27AF4,27B02,27B06,27B0B,27B18,27B48,27B65,27BB3,27BBE,27BC7,27BEF,27BF4,27C12,27C3C,27C6C,27CB1,27CB8,27CC5,27CEF,27D2F,27D66,27D73,27D84,27D8F,27D98,27DA0,27DBD,27DDC,27E10,27E4D,27E4F,27E7D,27EAF,27F1B,27F2E,27FB7,27FF9,28002,28009,2801E,28048,28083,2808A,28090,280BB,280F4,2812E,2814F,2815D,2816F,28189,281AF,281BC,28207,28218,2821A,28256,28277,2827C,28282,2829B,282CD,282E2,282F3,28306,28318,2832F,2833A,28365,2836D,2837D,2838A,283CD,283F6,28408,2840C,28412,28455,28468,2846C,28473,28482,284DC,28501,285E8,285F4,28600,2860B,28625,2863B,28678,28695,286B2,286BC,286E6,286FA,2870F,28713,287E0,28804,2882B,2890D,28933,28946,28956,28964,28968,2897E,289A8,289B8,289C0,289DC,289DE,289E1,28A0F,28A16,28A1E,28A25,28A29,28A32,28A36,28A71,28AC0,28AC6,28AEA,28AFC,28B0C,28B13,28B2F,28B46,28B49,28B4C,28B4E,28B50,28B6C,28B8F,28B99,28BB9,28BC5,28BD4,28BD7,28BEF,28BF5,28BFF,28C03,28C09,28C23,28C26,28C2B,28C30,28C39,28C3B,28C47,28C4F,28C51,28C54,28CCA,28CCD,28CD2,28CDD,28D10,28D34,28D71,28D8A,28D99,28DA1,28DB9,28DFB,28E0F,28E17,28E1F,28E36,28E39,28E89,28E97,28E99,28EAC,28ED9,28EE7,28EEB,28EF6,28F32,28FC5,28FF8,29079,29088,2908B,29093,290C0,2910D,29110,2913C,2914D,2915B,2915E,29170,2919C,291A8,291D5,291E3,291EB,292A0,292B1,2941D,29420,29433,2943F,29448,29490,294D0,294DE,294E5,294E7,29509,2959E,295B0,295B8,295CF,295D7,295E9,295F4,2967F,296F0,29719,29720,29732,29750,297D4,29810,2983B,29857,298A4,298C6,298D1,298EA,298F1,298FA,29903,29905,2992F,29945,2995D,2996A,2999D,299C3,299C9,29A28,29A4D,29A72,29B05,29B0E,29BD5,29C73,29CAD,29D3E,29D4B,29D5A,29D7C,29D98,29D9B,29DDB,29DF6,29E06,29E15,29E2D,29E3D,29E49,29E68,29E8A,29EAC,29EB0,29EDB,29EE9,29EF8,29F23,29F30,29F7E,29F83,29F8C,29FB7,29FCE,29FD7,29FDE,2A014,2A01A,2A02F,2A082,2A087,2A0B9,2A0E1,2A0ED,2A0F3,2A0FE,2A107,2A123,2A150,2A190,2A1AB,2A1DF,2A1F5,2A220,2A233,2A293,2A29F,2A2AD,2A2B2,2A2B4,2A2B6,2A2BA,2A2BD,2A2DF,2A2FF,2A351,2A38C,2A3A9,2A3ED,2A434,2A437,2A45B,2A4D0,2A4DF,2A5C6,2A5CB,2A5F1,2A61A,2A632,2A64A,2A65B,2A664,2A6A9,2A6B2,2A7DD,2A8FB,2A917,2A9E6,2AA30,2AA36,2AA58,2ADFF,2AFA2,2B1ED,2B300,2B363,2B36F,2B372,2B37D,2B404,2B410,2B413,2B461,2B4E7,2B4EF,2B4F6,2B4F9,2B536,2B5B3,2B5E7,2B5F4,2B62A,2B62C,2B689,2B6AD,2B6ED,2B746,2B751,2B753,2B75A,2B75C,2B765,2B77C,2B782,2B789,2B78B,2B78E,2B794,2B7A9,2B7AC,2B7AF,2B7BD,2B7C5,2B7C9,2B7CF,2B7D2,2B7D8,2B7E6,2B7F0,2B7F7,2B7F9,2B7FC,2B806,2B80A,2B80D,2B817,2B81A,2B81C,2B8B8,2BAC7,2BB5F,2BB62,2BB7C,2BB83,2BC1B,2BD77,2BD87,2BDF7,2BE29,2C081,2C0A9,2C0CA,2C115,2C1D5,2C1D9,2C1F9,2C27C,2C288,2C2A4,2C317,2C35B,2C361,2C364,2C386,2C488,2C494,2C497,2C542,2C613,2C618,2C621,2C629,2C62F,2C642,2C72C,2C72F,2C79F,2C7C1,2C7D3,2C7FD,2C8D9,2C8DE,2C8E1,2C8F3,2C907,2C90A,2C91D,2CA02,2CA0E,2CA7D,2CAA9,2CB29,2CB31,2CB3B,2CB3F,2CB41,2CB4A,2CB4E,2CB64,2CB69,2CB6C,2CB6F,2CB73,2CB76,2CB78,2CB7C,2CBB1,2CBCE,2CC56,2CC5F,2CCFD,2CCFF,2CD0A,2CD8B,2CD8D,2CDA8,2CDD5,2CE18,2CE1A,2CE23,2CE26,2CE2A,2CE7C,2CE88,2CE93,2D544,2E014,2E278,2E569,2E6EA,2F804,2F80F,2F815,2F818,2F81A,2F822,2F825,2F828,2F82C,2F833,2F83B,2F846,2F852,2F862,2F86D,2F873,2F884,2F894,2F8A6,2F8AC,2F8B2,2F8B6,2F8CD,2F8D3,2F8E1,2F8E5,2F8EA,2F8ED,2F8FC,2F903,2F90B,2F90F,2F91A,2F945,2F947,2F96C,2F9B2,2F9BC,2F9D0,2F9D4,2F9F4
;2:E82B,E831,E854,1F18F,1F230,20086,20089,20213,20274,202BF,20413,20491,205D5,205DF,20619,20BA8,20C3A,20C77,20CCF,20D31,20D7E,20E09,20E95,20ED7,20F2D,20F30,2101D,2123C,2127B,212A8,212E3,212FD,21375,21454,2146D,21726,21773,217F5,21BC1,21D45,21DB6,21E33,2217A,2261B,227B4,2285F,22B4F,22C26,22D07,22DA3,2307D,231A4,231C3,231C8,23289,232E0,233D2,233DE,233F4,233F9,2344A,23450,234E4,23594,23763,24103,2413F,242C9,2439C,243BC,243E9,24435,2445A,24487,24629,24916,24933,24962,249DA,249DE,249EC,24A12,24AC9,24B6E,24C9E,24D13,24DEA,2517D,25220,25531,25565,255A7,25771,25AAE,25AE3,25C4A,25C64,25CC0,25ED7,260A4,261AD,26221,2626A,2634B,26488,267B3,26A2D,26A51,26B5B,26B96,26C40,26CB7,26DEA,26F73,26FDE,27052,2710C,27126,27164,273DA,273FE,27614,27631,27693,2770E,27735,27784,27ABD,27D53,28023,280BD,280E8,2853C,2856B,285C8,286AA,286D7,28948,289AA,289E3,289E7,28A59,28B21,28B9C,28BC1,28BD9,28C1C,28E65,28EB2,290E4,290EC,294D9,29EC3,2A0F8,2A133,2A192,2A1B4,2A601,2B127,2B137,2B50D,2B5AE,2B61C,2B695,2B776,2C029,2C64A,2CB2D,2CB38,2CB5A,2CBBF,2CCF5,2CD02,2CD8F,2CD9F,2CDAD,2F83F,2F877,2F899,2F8DB,2F920,2F994,2F9DE
;3:E816,FFDA,20345,20C41,20D4C,20EAA,20FB4,210BF,210C7,210F4,213C4,216C0,216E6,216FA,2173A,21828,21839,21883,218BD,21903,21910,231F7,232AB,235CD,237D5,23CC7,23DF8,2408B,24155,241A3,24276,248FF,24974,249AB,24A65,24AB1,24ABA,251E5,2542E,257DF,25BB2,25E81,25FE0,26410,266AF,26FF6,270AD,275FD,27655,27B38,2896B,28987,289BA,28A81,28B2B,290AF,29947,2B626,2C62B
;4:FE68,200CA,2037E,20CD3,20EF8,20FEA,21075,21302,217D9,21861,218D6,226F3,23231,23E88,24362,248F0,249F6,24A77,24A93,24AA4,2555B,26159,26B50,26E42,289F9,28A99,28ACB,28B63
;5:FB00,20D45,20E0D,217F8,2189E,23638,23C97,23CFC,23F7E,24039,249B7,24A4D,26C7E
;6:FFC2,FFCA,FFD2,2176C,217B0,23E2C,23EF7,23FEB,2493E,28BE7
;7:FFE0,FFE8,20E75
;8:23DB6,24988,26DA0,26ED0
;9:1F240,26D22,28A43,28ADD
;A:FE10,1F210,24A21
;D:1F100
;12:1F19B
;13:FE54
;14:1F21B
;17:D7B0
;1D:A960
;1E:1F170
;23:FE30
;31:D7CB
;5D:1F110
;BE:FF01
;16E:F900
;19B6:3400
;2BA4:AC00
;51F0:4E00
'''#'''
    compact_txt
    from seed.data_funcs.rngs import ranges2compact_txt_, ranges5compact_txt_
    ranges = ranges5compact_txt_(compact_txt)
    assert ranges.len_ints() == 42071
    return ranges

def 提取基本面编码空间里的汉字囗(*, opath):
    from nn_ns.CJK.CJK_struct.cjk_decomp_0_4_0.read_cjk_decomp import default_iter_read_cjk_decomp
    #def default_iter_read_cjk_decomp(iter_read_cjk_decomp=None, /, *, original=False):
    #    '-> Iter (hanzi|uint|nm8bk, (case, [(hanzi|uint|nm8bk)]))'


    with open(opath, 'xt', encoding='utf8') as ofile:
        for hz_or_x, (case, bks) in default_iter_read_cjk_decomp():
            if type(hz_or_x) is str and len(hz_or_x) == 1:
                hz = hz_or_x
                if ord(hz) < 0x1_00_00:
                    tail = (case, *bks)
                    s = ','.join(map(str, tail))
                    print(f'{hz}:{s},', file=ofile)

def iter_parse_modified_output_file_(*, ipath, only_leading_finished_part=False):
    '-> line_nm_op_bks_triples/Iter (s/line_content, nm/str, op/str, [bk/str])'
    OPS = get_OPS_()
    with open(ipath, 'rt', encoding='utf8') as ifile:
        for line in ifile:
            line = line.strip()
                # remove '\n'
            if line[:1] in '#':
                continue
            s, _, smay_comment = line.partition(' #')
            assert not ' ' in s, s
            assert not '#' in s, s
            if s == 'doing:here':
                if only_leading_finished_part:
                    return
                continue
            assert len(s.split()) == 1, s
            assert s[-1] == ',', s
            assert s.count(':') == 1, s
            nm, op_bks = s.split(':')
            op, *bks, _ = op_bks.split(',')
            assert op in OPS, (op, OPS, s)
            assert op
            assert all(bks), (s, bks)
            yield (line, nm, op, bks)
            #yield (s, nm, op, bks, smay_comment)
#end-def iter_parse_modified_output_file_(*, ipath, only_leading_finished_part=False):

def 打印囗伪笔顺码暨非数字部件名囗囗规范部件名囗(*, ipath, may_bk2js=None):
    xx_js2bks = 构造囗伪笔顺码到非数字部件名列表囗囗规范部件名囗(ipath=ipath, may_bk2js=may_bk2js)

    for xx_js, bks in sorted(xx_js2bks.items()):
        for bk in bks:
            print(f'{xx_js!s}:{bk!s}')
    xx_js2bks
    return
    return xx_js2bks
def 构造囗伪笔顺码到非数字部件名列表囗囗规范部件名囗(*, ipath, may_bk2js=None):
    '-> {伪笔顺码:[非数字部件名]} # [伪笔顺码 <- regex"_|(?=\S)\D\S*"]'
    from collections import defaultdict
    if may_bk2js is None:
        bk2js = 部件到笔顺码 = 汉字到笔顺码 = load_汉字到笔顺码(patch=True)
    else:
        bk2js = may_bk2js
    bk2js
    ######################
    it = 迭代囗囗规范部件名囗(ipath=ipath, include_number_name=False)
    xx_js2bks = defaultdict(list)
    for bk in it:
        xx_js = bk2js.get(bk, '_')
        xx_js2bks[xx_js].append(bk)
    xx_js2bks = dict(xx_js2bks)

    for bks in xx_js2bks.values():
        bks.sort()
    xx_js2bks
    return xx_js2bks
def 迭代囗囗规范部件名囗(*, ipath, include_number_name, iter__vs__return_sets=False):
    '-> ((Iter bk) if not iter__vs__return_sets else (nm_set, bk_set)) #using:迭代囗子孙部件名囗'
    assert type(include_number_name) is bool
    def iter_add_bks_(bks, /):
        for bk in bks:
            yield from iter_add_bk_(bk)
    def iter_add_bk_(bk, /):
        assert type(bk) is str
        #???暂时性命名: '?' in bk
        #   ok:see:生成拆分囗囗规范部件名囗
        #
        if bk in bk_set:
            return
        for bk in 迭代囗子孙部件名囗(bk):
            if not bk in bk_set and (include_number_name or not bk[0].isdigit()):
                bk_set.add(bk)
                yield bk
    ######################
    nm_set = set()
    bk_set = set()
    def __():
        it = iter_parse_modified_output_file_(ipath=ipath, only_leading_finished_part=False)
        for (s, nm, op, bks) in it:#line_nm_op_bks_triples:
            assert type(nm) is str
            assert not nm[0].isdigit()
            nm_set.add(nm)
            yield from iter_add_bks_([nm])
            yield from iter_add_bks_(bks)
    it = __()
    if iter__vs__return_sets is False:
        return it
    elif iter__vs__return_sets is True:
        for _ in it:pass
        nm_set
        bk_set
        return (nm_set, bk_set)
    else:
        raise 000
    raise 000
#end-def 迭代囗囗规范部件名囗(*, ipath, include_number_name, iter__vs__return_sets=False):
def 生成拆分囗囗规范部件名囗(*, ipath, may_opath=None):
    if 0:
        ##obsolete:since not dive into...
        #   new version using:迭代囗子孙部件名囗
        #
        it = iter_parse_modified_output_file_(ipath=ipath, only_leading_finished_part=False)
        ls = [*it]
        bk_set = set()
        nm_set = set()
        for (s, nm, op, bks) in ls:#line_nm_op_bks_triples:
            assert type(nm) is str
            nm_set.add(nm)
            bk_set.update(bk for bk in bks if type(bk) is str)
        (nm_set, bk_set)
    else:
        (nm_set, bk_set) = 迭代囗囗规范部件名囗(ipath=ipath, include_number_name=False, iter__vs__return_sets=True)
        (nm_set, bk_set)
    (nm_set, bk_set)
    bks4todo = sorted(bk_set -nm_set)
    def f(may_ofile, /):
        for bk in bks4todo:
            if '?' in bk:
                # 暂时性命名:非规范命名:不能自动生成拆分
                continue
            (nm, comment, smay_op, bks) = 分析囗部件名囗(bk)
            if not smay_op:
                # 特色命名:规范命名:非标准规范命名:不能自动生成拆分
                continue
            op = smay_op
            tail = (op, *bks)
            s = ','.join(tail)
            for nm in sorted({nm, bk}):
                print(f'{nm}:{s},', file=may_ofile)
    if may_opath is None:
        f(None)
    else:
        opath = may_opath
        with open(opath, 'xt', encoding='utf8') as ofile:
            f(ofile)

def _prepare4phase1_(*, extra=False):
    def 找出可能会被显示出来的高位面汉字囗(excluded_hzs='', /):
        汉字到笔顺码 = load_汉字到笔顺码(patch=False)
        return ''.join(sorted(hz for hz in 汉字到笔顺码 if ord(hz) > 0xFFff and hz not in excluded_hzs))
    #
    if 0:
        ok_hzs = 找出可能会被显示出来的高位面汉字囗('')
        if 0b001: print(ok_hzs)
    #
    手机字体不显示的汉字列表 = '𠇑𠇺𠖄𠚼𠝞𠞭𠠝𠩂𠭴𠮜𠮻𠲮𠲿𠴭𠴳𠵖𠷇𠷬𠹁𡍤𡜵𡟓𡳞𢈉𢊷𢓜𢕕𢖺𢗝𢪥𢫓𢫫𢫮𢯩𢯰𢰳𢱤𢲸𢶀𣆲𣍐𣛴𣯀𣹇𤖯𤛘𤞚𤶃𤷆𤸫𥌚𥍉𥎊𥒲𥡥𥥷𥦁𥦌𥭘𥴊𥼶𥽕𥿽𦊓𦑌𦗀𦜆𦜓𦧊𦨜𧉟𧌄𧎳𧜞𧧸𧬩𧰵𧺣𧽻𧿳𨁍𨁸𨂰𨃟𨅔𨉣𨎩𨑜𨓚𨧱𨭛𩏠𩑾𩛩𩜇𩨑𩪘𩵱𩹾𪍣𪐞𪘧'
    #
    if extra:

        ok_hzs = 找出可能会被显示出来的高位面汉字囗(手机字体不显示的汉字列表)
        if 0b000: print(ok_hzs)
        ok_hz_set = frozenset(ok_hzs)
    #
        return (手机字体不显示的汉字列表, ok_hzs, ok_hz_set)
    return 手机字体不显示的汉字列表

def 打印囗手机中文字体文件包含的高位字符囗(sz4block, /, *, pack=False, 排除笔顺码文件中的汉字=False):
    pt_rngs = 手机中文字体文件包含的高位字符范围囗()
    if 排除笔顺码文件中的汉字:
        from seed.data_funcs.rngs import make_Ranges, sorted_ints_to_iter_nontouch_ranges
        汉字到笔顺码 = load_汉字到笔顺码(patch=False)
        excludes = make_Ranges(sorted_ints_to_iter_nontouch_ranges(sorted(map(ord, (s for s in 汉字到笔顺码 if len(s)==1)))))
        pt_rngs -= excludes
    ######################
    rngs = pt_rngs.ranges
    if pack:
        print_chars__pack_(sz4block, map(chr, iter5rngs_(rngs)))
        return
    else:
        print_chars__rngs_(sz4block, rngs)
def print_chars__pack_(sz4block, iter_chars, /):
    from itertools import islice
    assert sz4block > 0
    it = iter(iter_chars)
    while 1:
        s = ''.join(islice(it, sz4block))
        if not s:break
        print(s)
def print_chars_(sz4block, begin, end, /):
    print_chars__rngs_(sz4block, [(begin, end)])
def iter5rngs_(rngs, /):
    for (begin, end) in rngs:
        yield from range(begin, end)
def print_chars__rngs_(sz4block, rngs, /):
    def _1_(begin, end, /):
        us = range(begin, end, sz4block)
        i = begin
        for j in us[1:]:
            yield i, j
            i = j
        yield i, end
    def _2_(begin, end, /):
        for i, j in _1_(begin, end):
            s = ''.join(map(chr, range(i,j)))
            if s:
                print(s)
                #yield s
    def _3_(rngs, /):
        for (begin, end) in rngs:
            _2_(begin, end)
    _3_(rngs)
    return
def _8doc__assert_var_setting_(**nm2v):
    for nm, v in sorted(nm2v.items()):
        assert v == (r := _8doc__var_setting_(nm)), (nm, v, r)

def _8doc__var_setting_(nm, /):
    from ast import literal_eval
    doc = __doc__
    s = f'\n{nm} = '
    i = doc.index(s)
    j = i + len(s)
    k = doc.index('\n', j)
    content = doc[j:k]
    return literal_eval(content)

def __():
    pattern4regex4spec_char = r'[囗龘靐鱻]'
    pattern4regex4decorated_prefix = r'(?P<decorator>[^囗龘靐鱻]*?)(?P<basic_prefix>[纵横][三四五六七八九十]?组|包龘|[左右头底躯胸脸]龘|[左右][上下]龘|水平镜像龘|雨型二包龘|反序拟二包纵组|插序巫幽型全二包龘)'
    OPS__with_prefix_Nary = 'a横x组? d纵x组? F拟包纵组2 L反序拟包横组2 O插序全包龘2 G拟包横组2 A正序纵包龘2 S正序互包龘2 ~融横版横组2 J反序横组2 %下沉交叠拟纵组2 &插序下沉交叠拟纵组2 V正序拟下包纵组2 I融竖版纵组2 ^出头交叠拟纵组2 '
    OPS = 'a d F L O G A S ~ J % & V I ^ '
        #def___OPS:goto
    assert f"\nOPS = {OPS!r}\n" in __doc__
    assert f"\nOPS__with_prefix_Nary = {OPS__with_prefix_Nary!r}\n" in __doc__
    #assert f"\npattern4regex4decorated_prefix = {pattern4regex4decorated_prefix!r}\n" in __doc__
    #assert f"\npattern4regex4spec_char = {pattern4regex4spec_char!r}\n" in __doc__
    (_8doc__assert_var_setting_
    (OPS=OPS
    ,OPS__with_prefix_Nary=OPS__with_prefix_Nary
    ,pattern4regex4decorated_prefix=pattern4regex4decorated_prefix
    ,pattern4regex4spec_char=pattern4regex4spec_char
    ))

    OPS4well_order = 'a d F G A S % V ^ '
    OPS4bad_order = 'O ~ & I '
    OPS4inv_order = 'L J '
    assert len(OPS) == len(OPS4well_order) + len(OPS4bad_order) + len(OPS4inv_order)
    assert set(OPS) == set(OPS4well_order) | set(OPS4bad_order) | set(OPS4inv_order)

    op2prefix = {s[0]:s[1:-1] for s in OPS__with_prefix_Nary.split()}
    op2str_Nary = {s[0]:s[-1] for s in OPS__with_prefix_Nary.split()}
    assert all(ord(prefix[-1]) >= 0x3400 for prefix in op2prefix.values())
    assert all((d:=str_Nary[-1])=='?' or d.isdigit() for str_Nary in op2str_Nary.values())
    op2may_Nary = {op: None if (d:=str_Nary[-1])=='?' else int(d) for op, str_Nary in op2str_Nary.items()}

    prefix2op = {prefix:op for op,prefix in op2prefix.items()}
    assert len(op2prefix)*2 == len(OPS)
    assert len(op2prefix) == len(prefix2op)
    def get_OPS_():
        return OPS
    def get_OPS_ex_():
        return (OPS, OPS4well_order, OPS4inv_order, OPS4bad_order)
    def get_OPS__prefix_():
        return (op2prefix, op2may_Nary, prefix2op, pattern4regex4spec_char, pattern4regex4decorated_prefix)
    return (get_OPS_, get_OPS_ex_, get_OPS__prefix_)

(get_OPS_, get_OPS_ex_, get_OPS__prefix_) = __()

def __():
    import re
    #import Enum, auto
    #class 部件名囗分析况型(Enum):
    #    atomic = auto()
    #    op_bks = auto()
    (op2prefix, op2may_Nary, prefix2op, pattern4regex4spec_char, pattern4regex4decorated_prefix) = get_OPS__prefix_()
    regex4decorated_prefix = re.compile(pattern4regex4decorated_prefix)
    regex4spec_char = re.compile(pattern4regex4spec_char)
    #regex4ad = re.compile(f'[纵横].?组')
    def 分析囗部件名囗(bk, /):
        '-> (nm, comment, smay_op, bks)'
        #see:重命名调用前缀以消除歧义:龘䲜䨻
        #vs:比较不同函数的输入囗囗部件名是否标准规范:here
        #   * 分析囗部件名囗()只拆分 标准规范型 即 [op <- OPS] 即[decorated_prefix <- prefix2op]
        #   * 迭代囗子孙部件名囗()/parse__middle__assert_end_()/parse__middle_() 拆分任意规范型 即 允许任意[decorated_prefix <- regex4decorated_prefix]
        #
        #
        try:
            (nm, comment, smay_op, bks) = 囗分析囗部件名囗(bk)
        except Exception as e:
            raise Exception(bk) from e
        assert bool(bks) is bool(smay_op)
        return (nm, comment, smay_op, bks)
    def 囗分析囗部件名囗(bk, /):
        #T = 部件名囗分析况型
        #xxx:nm, _, comment = bk.rpartition('囗囗')
        nm, _, comment = bk.partition('囗囗')
        def mk_atomic_result_():
            smay_op = ''
            bks = []
            return (nm, comment, smay_op, bks)
        #鱻惐?
        #囗或?
        #之？
        if len(nm) == 1 or '鱻惐' in nm or '囗或' in nm or (nm[-1] == '版' and '之' in nm) or '?' in nm:
            # x鱻惐y
            # x囗或y
            # x囗或v版
            # x之u版囗或v版
            # x之v版
            # x之或v或u版
            # x?y #暂时性命名
            return mk_atomic_result_()
            #return (T.atomic, nm, comment)
        if None is (m := regex4decorated_prefix.match(nm)):
            if not None is regex4spec_char.search(nm): raise Exception(nm)
            return mk_atomic_result_()
        decorated_prefix = m.group(0)
        decorator = m['decorator']
        prefix = decorated_prefix[len(decorator):]
        if decorated_prefix[-1] == '组' and len(prefix) <= 3:
            if decorator:
                return mk_atomic_result_()
            #纵组/横组
            #if not None is (m := regex4ad.match(nm)):
            #   #纵组/横组
            #   prefix = m.group(0)
            (op, sz) = postprocess4ad_(prefix)
            bks, end_, end = parse_payload_(nm, 0, prefix, sz, finish=True)
            smay_op = op
            return (nm, comment, smay_op, bks)
            #return (T.op_bks, nm, comment, op, bks)
        for prefix4op, op in prefix2op.items():
            if nm.startswith(prefix4op):
                break
        else:
            return mk_atomic_result_()
        prefix4op, op
        sz = op2may_Nary[op]
        bks, end_, end = parse_payload_(nm, 0, prefix4op, sz, finish=True)
        smay_op = op
        return (nm, comment, smay_op, bks)
    #end-def 分析囗部件名囗(bk, /):
    def postprocess4ad_(prefix, /):
        '-> (op, sz)'
        assert 2 <= len(prefix) <= 3, prefix
        assert prefix[-1] == '组'
        if 0:
            if prefix == '反序拟二包纵组':
                ad = 'd'
                sz = 3
                sz = 2
        ad = 'da'['纵横'.index(prefix[0])]
        if len(prefix) == 2:
            sz = 2
        else:
            _,s,_ = prefix
            sz = 3+'三四五六七八九十'.index(s)
        sz
        op = ad
        return (op, sz)
    def parse_payload_(nm, begin, prefix, sz, /, *, finish):
        '-> (bks, end_, end)'
        assert nm.startswith(prefix, begin)
        bks = []
        begin += len(prefix)
        end_ = end = begin
        for i in range(sz):
            assert begin < len(nm), (nm, bks)
            bk, end_, end = parse1_at_(nm, begin)
            bks.append(bk)
            begin = end
        if finish:
            assert end == len(nm), (nm, end)
        return (bks, end_, end)
    def parse1_at_(nm, begin, /):
        '-> (whole_bk, end_, end)'
        assert begin < len(nm), nm
        assert not nm[begin] == '龘靐鱻'
            #def__pattern4regex4spec_char:goto
                # 囗龘靐鱻 except 囗
        if not nm[begin] == '囗':
            end_ = end = begin+1
            whole_bk = nm[begin:end]
        else:
            begin += 1
            (whole_bk, decorator, smay_prefix, bks, end_, end) = parse__middle_(nm, begin)
            #bug:whole_bk = nm[begin:end]
            #  !! ++靐
        assert whole_bk == nm[begin:end_]
        return (whole_bk, end_, end)
    def _find__slack_op_end_(nm, begin, /):
        slack_op_end = _find__('囗龘靐鱻', nm, begin)
        return slack_op_end
    def _find__(seps, nm, begin, /):
        slack_op_end = len(nm)
        for sep in seps:
            imay = nm.find(sep, begin, slack_op_end)
            assert not imay == 0
            slack_op_end = slack_op_end if imay < 0 else imay
        return slack_op_end
    def parse__middle__assert_end_(nm, begin, may_end, /):
        '-> (whole_bk, decorator, smay_prefix, bks, end_)'
        #vs:比较不同函数的输入囗囗部件名是否标准规范:goto
        #
        (whole_bk, decorator, smay_prefix, bks, end_, end) = parse__middle_(nm, begin)
        end5INPUT = len(nm) if may_end is None else may_end
        assert end5INPUT == end, (nm, begin, end_, end, end5INPUT, nm[begin:end], nm[begin:end5INPUT])
        return (whole_bk, decorator, smay_prefix, bks, end_)
    def parse__middle_(nm, begin, /):
        '-> (whole_bk, decorator, smay_prefix, bks, end_, end)'
        #vs:比较不同函数的输入囗囗部件名是否标准规范:goto
        #
        (decorator, smay_prefix, bks, end_, end) = _parse__middle_(nm, begin)
        whole_bk = nm[begin:end_]
        assert whole_bk
        assert end_ == end or (end_+1 == end and nm[end_] == '靐' and len(whole_bk) > 1)
            #now:靐=> (whole_bk, ..., end_, ...)
        #assert (len(bks)==1 and (bk0:=bks[0]) and begin+len(bk0)==end_ and bks == [nm[begin:end_]]) is (not smay_prefix), (nm, smay_prefix, bks)
        assert bool(bks) is bool(smay_prefix)
            #now:靐=> (whole_bk, ...)
                #old: bks==[whole_bk] when smay_prefix==''
        return (whole_bk, decorator, smay_prefix, bks, end_, end)
    #end-def parse__middle_(nm, begin, /):
    def _parse__middle_(nm, begin, /):
        '-> (decorator, smay_prefix, bks, end_, end) # [whole_bk == nm[begin:end_]]'
        #slack_op_end = _find__slack_op_end_(nm, begin)
        assert None is regex4spec_char.match(nm[begin]), nm
        if None is (m := regex4decorated_prefix.match(nm, begin)):
            #end_ = len(nm)
            end_ = _find__('囗靐', nm, begin)
                #def__pattern4regex4spec_char:goto
                    # 囗龘靐鱻 except 龘鱻
            whole_bk = nm[begin:end_]
            assert whole_bk
            m = nm[end_:end_+1]
            if m == '靐':
                #特色命名结束符
                if not len(whole_bk) >= 2: raise Exception(nm, begin, nm[:begin], whole_bk)
                end = end_ + 1
            else:
                assert m in '囗' # in ('', '囗')
                end = end_ + 0
            end_, end
            if not None is regex4spec_char.search(whole_bk): raise Exception(nm, whole_bk) # <<== 龘鱻
            smay_prefix = ''
            decorator = ''
            bks = []
            return (decorator, smay_prefix, bks, end_, end)

        decorated_prefix = m.group(0)
        decorator = m['decorator']
        prefix = decorated_prefix[len(decorator):]
        smay_prefix = prefix
        tight_op_end = m.end(0)

        if prefix[-1] == '龘' and prefix[-2] in '左右头底躯胸脸' '上下' '像': #水平镜像龘
            #def__pattern4regex4decorated_prefix:goto
            sz = 1
            assert not nm[tight_op_end] == '囗'
            end_ = end = tight_op_end+1
            bk0 = nm[tight_op_end:end]
            bks = [bk0]
            return (decorator, smay_prefix, bks, end_, end)

        if prefix[-1] == '组':
            #纵组/横组
            k = 2 if prefix[-2] in '纵横' else 3
                # 反序拟二包纵组 --> 纵组
            (op, sz) = postprocess4ad_(prefix[-k:])
            sz
            if '二包' in decorated_prefix[-len(prefix)-2:]:
                # 三参数判定:part1:here
                #?二包纵组?
                #反序拟二包纵组3
                assert sz == 2
                assert decorated_prefix.endswith('二包纵组')
                assert decorated_prefix.endswith('反序拟二包纵组')
                sz = 3
        else:
            assert prefix[-1] == '龘'
            if prefix[-2] == '包':
                sz = 3 if prefix[-3:] == '二包龘' else 2
                    #雨型二包龘3
                    #插序巫幽型全二包龘3
                    # 三参数判定:part2:here
            else:
                raise Exception(prefix)
                op = prefix2op.get(prefix)
                sz = op2may_Nary[op]
                assert not sz is None
                sz = 2
            sz
        sz
        assert (sz == 3) is (prefix.endswith('三组') or '二包' in prefix)
            # 三参数判定:here
        bks, end_, end = parse_payload_(nm, begin, decorated_prefix, sz, finish=False)
        return (decorator, smay_prefix, bks, end_, end)
    #end-def _parse__middle_(nm, begin, /):
    def 迭代囗子孙部件名囗(bk, /):
        '-> Iter bk'
        #vs:比较不同函数的输入囗囗部件名是否标准规范:goto
        #
        bks4done = set()
        try:
            yield from 囗迭代囗子孙部件名囗(bks4done, bk)
        except Exception as e:
            raise Exception(bk) from e
        return
    def 囗迭代囗子孙部件名囗(bks4done, bk, /):
        '-> Iter bk'
        bk5INPUT = bk
        (nm, comment, smay_op, bks) = 分析囗部件名囗(bk5INPUT)
            #去除bk5INPUT:囗囗comment
        if not nm == bk5INPUT:
            yield bk5INPUT
        assert bool(bks) is bool(smay_op)
        #nm:已去除: 囗囗comment
        #   但未除去:囗或 鱻惐
        nms = nm.split('鱻惐')
        if not nms == [nm]:
            yield nm
        whole_nm = nm
        for nm in nms:
            yield from 囗囗迭代囗子孙部件名囗(bks4done, bk5INPUT, whole_nm, nm)
    def 囗囗迭代囗子孙部件名囗(bks4done, bk5INPUT, whole_nm, nm, /):
        '-> Iter bk'
        if nm in bks4done: return
        #nm:已去除: 鱻惐 囗囗comment
        #   但未除去:囗或
        nm_, _, or_tail = nm.partition('囗或')
        if not nm_ == nm:
            yield nm
            if nm_ in bks4done: return
        #nm_:已去除:囗或,鱻惐,囗囗comment
        if len(nm_) == 1 or '?' in nm_:
            #去除: ^[囗龘靐鱻]$   .*?.*
                #def__pattern4regex4spec_char:goto
            yield nm_
            return
        #nm_:已去除:regex'^[囗龘靐鱻]$',?,囗或,鱻惐,囗囗comment

        ######################
        #以下全部:已去除:?,囗或,鱻惐,囗囗comment

        bks4todo = [nm_]
            #bks4todo:已去除:regex'^[囗龘靐鱻]$'
        while bks4todo:
            bk = bks4todo.pop()
            if bk in bks4done:
                continue
            bks4done.add(bk)
            #bk:已去除:regex'^[囗龘靐鱻]$'
            yield bk
            if bk[-1] == '版' and '之' in bk:
                continue
            #bk:已去除:x之v版,regex'^[囗龘靐鱻]$'
            #   ==>> assert end==$
            try:
                (whole_bk, decorator, smay_prefix, bks, end_) = parse__middle__assert_end_(bk, 0, None)
                    # @bk<-bks. 不是 regex'^[囗龘靐鱻]$'
            except Exception as e:
                raise Exception(bk5INPUT, whole_nm, nm, nm_, sorted(bks4done), bks4todo, bk) from e
            assert whole_bk == bk
            assert bool(bks) is bool(smay_prefix)
            #bks:已去除:regex'^[囗龘靐鱻]$'
            bks4todo.extend(bks)
#end-def 迭代囗子孙部件名囗(bk, /):

    return (分析囗部件名囗, 迭代囗子孙部件名囗)
(分析囗部件名囗, 迭代囗子孙部件名囗) = __()
def _prepare4phase1__try_to_findout_encoding4font4cellphone_():
    #笔顺码 作者 究竟用的是啥 字集？？
    #view /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/cjk_subsets/cjk_subsets__relationship.py.result.txt
    ##############################
    _all_eqv_hz_encodings = r'''
    big5
    big5hkscs
    cp1258
    cp932
    cp949=euc_kr=iso2022_kr=johab
    cp950
    euc_jis_2004
    euc_jisx0213
    euc_jp=iso2022_jp_1=iso2022_jp_ext
    gb18030=utf8
    gb2312=hz
    gbk
    iso2022_jp=shift_jis
    iso2022_jp_2
    iso2022_jp_2004=shift_jis_2004
    iso2022_jp_3=shift_jisx0213
    '''.split()#'''
    all_eqv_hz_encodings = [s.split('=')[0] for s in _all_eqv_hz_encodings]

    ##############################
    snd_max_hz_encodings = r'''
    big5hkscs
    cp932
    euc_jis_2004
    euc_jisx0213
    gbk
    iso2022_jp_2
    '''.split()#'''
    def contains_(encoding, txt, /):
        try:
            txt.encode(encoding)
        except UnicodeEncodeError:
            return False
        return True
    def iter_encodings__all_(txt, encodings, /):
        for encoding in encodings:
            if contains_(encoding, txt):
                yield (encoding)
    def iter_encodings__any_(txt, encodings, /):
        for encoding in encodings:
            if any(contains_(encoding, ch) for ch in txt):
                yield (encoding)
    def iter_encoding_sz_pairs_(txt, encodings, /):
        for encoding in encodings:
            yield (encoding, sum(contains_(encoding, ch) for ch in txt))

    def main1():
        txt0 = 手机字体不显示的汉字列表 = _prepare4phase1_()
        txt1 = ('𠀋𠀡𠀾𠁆𠁎𠁨𠂆𠂇𠂉𠂊𠂔𠂢𠂤𠂰𠃊𠃋' '𪚲')
            #𠀋0x2000B𠀡0x20021𠀾0x2003E𠁆0x20046𠁎0x2004E𠁨0x20068𠂆0x20086𠂇0x20087𠂉0x20089𠂊0x2008A𠂔0x20094𠂢0x200A2𠂤0x200A4𠂰0x200B0𠃊0x200CA𠃋0x200CB ... 𪚲0x2A6B2
            #𠀋0x2000B ... 𪚲0x2A6B2
        txt2 = '𪚲'
            # <<-- ok_hzs
        for txt in [txt0, txt1, txt2]:
            #encodings = [*iter_encodings__all_(txt, snd_max_hz_encodings)]
                # <NONE>
            #encodings = [*iter_encodings__any_(txt, snd_max_hz_encodings)]
                # txt1:big5hkscs euc_jis_2004 euc_jisx0213
                # txt2:euc_jis_2004 euc_jisx0213
            encodings = [*iter_encodings__any_(txt, all_eqv_hz_encodings)]
                #txt0:gb18030
                #txt1:big5hkscs euc_jis_2004 euc_jisx0213 gb18030 iso2022_jp_2004 iso2022_jp_3
                #txt2:euc_jis_2004 euc_jisx0213 gb18030 iso2022_jp_2004 iso2022_jp_3
            encodings_ver1 = 'big5hkscs euc_jis_2004 euc_jisx0213 iso2022_jp_2004 iso2022_jp_3'.split()
            if encodings:
                print(txt)
                print(' '.join(encodings))
    def main2():
        encodings_ver1 = 'big5hkscs euc_jis_2004 euc_jisx0213 iso2022_jp_2004 iso2022_jp_3'.split()
        (手机字体不显示的汉字列表, ok_hzs, ok_hz_set) = _prepare4phase1_(extra=True)
        txt = ok_hzs
        encodings = encodings_ver1

        print(f'total:{len(txt)}')
        for encoding, sz in iter_encoding_sz_pairs_(txt, encodings):
            print(f'{encoding}:{sz}')
        r'''[[[
        total:2050
        big5hkscs:1680
        euc_jis_2004:303
        euc_jisx0213:302
        iso2022_jp_2004:303
        iso2022_jp_3:302
        ######################
        !! [iso2022_jp_2004 < euc_jis_2004]
        !! [iso2022_jp_3 < euc_jisx0213]
        ==>>:encodings_ver2:
        big5hkscs:1680
        iso2022_jp_2004:303
        iso2022_jp_3:302

        ==>>:
py -m seed.text.charset_filter -i '(E("big5hkscs") & N("CJK")).to_CharsetCharFilter()'
CharsetCharFilter(((11904, 11905), (11908, 11909), (11910, 11913), (11914, 11915), ..., (194964, 194965), (194994, 194995), (195004, 195005), (195028, 195029)))

py -m seed.text.charset_filter -i '(E("iso2022_jp_2004") & N("CJK")).to_CharsetCharFilter()'
CharsetCharFilter(((13314, 13315), (13318, 13319), (13356, 13357), (13358, 13359), ..., (173111, 173112), (173553, 173554), (173570, 173571), (173594, 173595), (173746, 173747)))

py -m seed.text.charset_filter -i '(E("iso2022_jp_3") -E("iso2022_jp_2004")).to_CharsetCharFilter()'
CharsetCharFilter(((39709, 39710),))
hex 39710
'0x9b1e'
py -m seed.text.charset_filter -i '(E("iso2022_jp_2004") -E("iso2022_jp_3")).to_CharsetCharFilter()'
CharsetCharFilter(((20465, 20466), (21085, 21086), (21534, 21535), (22099, 22100), (23032, 23033), (23643, 23644), (24183, 24184), (30246, 30247), (32363, 32364), (39708, 39709), (134047, 134048)))
hex  39708 39709 134047 134048
'0x9b1c'
'0x9b1d'
'0x20b9f'
'0x20ba0'
hex 173747
'0x2a6b3'
𪚲0x2A6B2
也就是说：在[0x20000..], [iso2022_jp_2004 /-\ [0x20000..] === {0x20b9f} \-/ (iso2022_jp_3 /-\ [0x20000..])]
        ==>>:encodings_ver3:
        big5hkscs /-\ [0x20000..0x2a6b3]:1680
        iso2022_jp_2004 /-\ [0x20000..]:303
        还差 [(2050 -(1680+303-common)) == 67+common]
py -m seed.text.charset_filter -i '(E("big5hkscs") & E("iso2022_jp_2004")).to_CharsetCharFilter()'
CharsetCharFilter(((0, 128), (162, 164), (167, 169), ..., (65507, 65508), (134047, 134048), (134765, 134766), (135990, 135991), (144730, 144731), (145215, 145216), (146686, 146687), (146752, 146753), (152013, 152014), (155352, 155353), (156492, 156493), (156674, 156675), (158033, 158034), (160013, 160014), (162436, 162437), (166217, 166218), (166441, 166442), (167478, 167479)))
hex 65507 65508 134047 134048 167478 167479
'0xffe3'
'0xffe4'
'0x20b9f'
'0x20ba0'
'0x28e36'
'0x28e37'
py -m seed.text.charset_filter -i '(R({0x20000:0x110000}) & E("big5hkscs") & E("iso2022_jp_2004")).to_CharsetCharFilter()'
CharsetCharFilter(((134047, 134048), (134765, 134766), (135990, 135991), (144730, 144731), (145215, 145216), (146686, 146687), (146752, 146753), (152013, 152014), (155352, 155353), (156492, 156493), (156674, 156675), (158033, 158034), (160013, 160014), (162436, 162437), (166217, 166218), (166441, 166442), (167478, 167479)))
py -m seed.text.charset_filter -i '(R({0x20000:167479}) & E("big5hkscs") & E("iso2022_jp_2004")).to_CharsetCharFilter().len()'
17
    ==>>:
        encodings_ver3还差 [(2050 -(1680+303-17)) == 67+17 == 84]
            笔顺码 作者 究竟用的是啥 字集？？

        #]]]'''#'''
        encodings_ver2 = 'big5hkscs iso2022_jp_2004 iso2022_jp_3'.split()
        encodings_ver3 = 'big5hkscs iso2022_jp_2004'.split()
    #main1()
    main2()
#end-def _prepare4phase1__try_to_findout_encoding4font4cellphone_():
def load_汉字到笔顺码(*, patch):
    _patch__nm2js
    from seed.tiny import fmap4dict_value, dict_add__eq
    from nn_ns.CJK.CJK_data.汉字笔顺 import 汉字到笔顺码
    if patch:
        汉字到笔顺码 = dict(汉字到笔顺码)
        for nm, js in _patch__nm2js.items():
            dict_add__eq(汉字到笔顺码, nm, js)
    return 汉字到笔顺码
#end-def load_汉字到笔顺码(*, patch):
def _mk_funcs4phase1_():
    from seed.mapping_tools.dict_op import inv__k2v_to_v2ks
    from seed.tiny import fmap4dict_value
    import re
    汉字到笔顺码 = load_汉字到笔顺码(patch=True)
    #笔顺码到汉字集合 = inv__k2v_to_v2ks(汉字到笔顺码)
    笔顺码到汉字列表 = fmap4dict_value(sorted, inv__k2v_to_v2ks(汉字到笔顺码))
    手机字体不显示的汉字列表 = _prepare4phase1_()
    def is_bad_bk_(bk, /):
        #return (len(bk) == 1 and ord(bk) > 0xFFff and not bk in ok_hz_set)
        return (len(bk) == 1 and ord(bk) > 0xFFff and not (bk in 汉字到笔顺码 and not bk in 手机字体不显示的汉字列表))

    #def bk_predicator_(bk, /):
    def is_bk4todo_(bk, /):
        #return bk[0].isdigit() or (len(bk) == 1 and ord(bk) > 0xFFff and not bk in ok_hz_set)
        return bk[0].isdigit() or is_bad_bk_(bk)
    def is_bk4unknown_js_(bk, /):
        return not bk in 汉字到笔顺码
        return len(bk) > 1 and not bk[0].isdigit() and not bk in 汉字到笔顺码
    def filter__phase1_(line_nm_op_bks_triples, /, *, only_leading_finished_part=False):
        f = is_bk4unknown_js_ if only_leading_finished_part else is_bk4todo_
        for (s, nm, op, bks) in line_nm_op_bks_triples:
            idc4bk = []
            for idx4bk, bk in enumerate(bks):
                if f(bk):
                    idc4bk.append(idx4bk)
            if idc4bk:
                yield (s, nm, op, bks, idc4bk)

    def 尝试找出笔顺码囗囗第一阶段囗(line_nm_op_bks_idc4bk__iter, /):
        '-> Iter (t0, t1) # t0/(line_content, nm, op, bks) # t1/(int%4, ?)'
        OPS = get_OPS_()
        (OPS, OPS4well_order, OPS4inv_order, OPS4bad_order) = get_OPS_ex_()
        for (s, nm, op, bks, idc4bk) in line_nm_op_bks_idc4bk__iter:
            t0 = (s, nm, op, bks)
            _bks_ = [bks[i] for i in idc4bk]
            if not None is (hz_js := 汉字到笔顺码.get(nm)):
                hz_js
                #if len(idc4bk) == 1 and op in OPS4well_order:
                if len(idc4bk) == 1 and not op in OPS4bad_order:
                    [skip_idx4bk] = idc4bk
                    if op in OPS4well_order:
                        reordered_bks = bks
                        reordered_skip_idx4bk = skip_idx4bk
                        pass
                    elif op in OPS4inv_order:
                        assert len(bks) == 2
                        reordered_bks = bks[::-1]
                        assert 0 <= skip_idx4bk <= 1
                        reordered_skip_idx4bk = 1-skip_idx4bk
                        pass
                    else:
                        raise 000
                    (_bk_, fail, m) = 尝试推导唯一需重命名部件的笔顺码囗(hz_js, reordered_bks, reordered_skip_idx4bk)
                    if not fail:
                        (_js_, _nms_) = m
                    if not fail and not _nms_:
                        _nms_ = 尝试拆成两个部件囗(_js_)
                    if not fail:
                        t1 = (3, (hz_js, _bk_, _js_, _nms_))
                    else:
                        t1 = (2, (hz_js, _bk_))
                else:
                        t1 = (1, (hz_js, _bks_))
            else:
                        t1 = (0, _bks_)
                        #def__case__0123:here
            yield (t0, t1)
    def 尝试拆成两个部件囗(_js_, /):
        _L_ = len(_js_)
        bks_pairs = []
        min_sz = 3
        min_sz = 1
        for sz in range(min_sz, _L_-min_sz+1):
            jsL = _js_[:sz]
            jsR = _js_[sz:]
            if not len(bkLs := 笔顺码到汉字列表.get(jsL, ())) >= 1:
                continue
            if not len(bkRs := 笔顺码到汉字列表.get(jsR, ())) >= 1:
                continue
            if 0:
                if len(bkLs) == 1 == len(bkRs):
                    [bkL] = bkLs
                    [bkR] = bkRs
                    _nm_ = f'#{bkL}{bkR}'
                    _nms_ = [_nm_]
                    return _nms_
            bks_pairs.append((bkLs, bkRs))
        _nms_ = []
        for (bkLs, bkRs) in bks_pairs:
            nmL = '#' + '-'.join(bkLs)
            nmR = '#' + '-'.join(bkRs)
            _nm_ = nmL + nmR
            _nms_.append(_nm_)

        return _nms_
    def 尝试推导唯一需重命名部件的笔顺码囗(hz_js, bks, skip_idx4bk, /):
        bks_ = bks[:skip_idx4bk]
        _bk_ = bks[skip_idx4bk]
        _bks = bks[skip_idx4bk+1:]
        js_ = 尝试求和笔顺码囗(bks_)
        fail = js_ is None
        if not fail:
            _js = 尝试求和笔顺码囗(_bks)
            fail = _js is None
        if not fail:
            L_ = len(js_)
            _L = len(_js)
            L = len(hz_js)
            fail = not (L_+_L < L and hz_js.startswith(js_) and hz_js.endswith(_js))
        if not fail:
            _js_ = hz_js[L_:L-_L]
            _nms_ = 笔顺码到汉字列表.get(_js_, ())
            _nms_ = sorted(_nms_)
        if not fail:
            return (_bk_, fail, (_js_, _nms_))
        return (_bk_, fail, None)

    def 尝试求和笔顺码囗(bks, /):
        bk_jss = []
        for bk in bks:
            if None is (bk_js := 汉字到笔顺码.get(bk)):
                return None
            bk_jss.append(bk_js)
        whole_js = ''.join(bk_jss)
        return whole_js

    #assert 尝试拆成两个部件囗('321511121') == ['#臼#土-士-工-扌']
    #assert [*尝试找出笔顺码囗囗第一阶段囗([('㷐:a,火,37070,', '㷐', 'a', ['火', '37070'], [1])])] == [(('㷐:a,火,37070,', '㷐', 'a', ['火', '37070']), (3, ('4334321511121', '37070', '321511121', ['#臼#土-士-工-扌'])))]

    def _show__bks_(_bks_, /):
        for _bk_ in _bks_:
            print(f'{_bk_}:')

    regex4cjk_compatibility_char = re.compile(r'[\uF900-\uFAff\U0002F800-\U0002FA1f]')
    def contains__cjk_compatibility_char_(s, /):
        return not None is regex4cjk_compatibility_char.search(s)
    def 列出可推导出来的部件笔顺码囗囗用于更新补丁囗(*, ipath):
        'to update "_patch__nm2js"'
        from collections import defaultdict
        (OPS, OPS4well_order, OPS4inv_order, OPS4bad_order) = get_OPS_ex_()
        ######################
        def print_bk_js_(_bk_, _js_, /):
            if contains__cjk_compatibility_char_(_bk_):
                print(f",'{_bk_!s}':'{_js_!s}'")
                #may output:\u????:print(f',{_bk_!r}:{_js_!r}')
            else:
                print(f',{_bk_!s}={_js_!r}')
        #end-def print_bk_js_(_bk_, _js_, /):
        ######################
        def print_nm_bk_js_(nm, _bk_, _js_, /):
            nm, _bk_, _js_
            if _js_ in bk2jss[_bk_]:
                return#continue
            bk2jss[_bk_].append(_js_)
            bk2nms[_bk_].append(nm)
            #if not None is (existed_js := _patch__nm2js.get(_bk_)):
            if not None is (existed_js := 汉字到笔顺码.get(_bk_)):
                if not _js_ == existed_js:
                    bk2errs[_bk_].append((existed_js, _js_, nm))
                return#continue
            print_bk_js_(_bk_, _js_)
        #end-def print_nm_bk_js_(nm, _bk_, _js_, /):
        ######################
        ######################
        ######################
        it = _iter_read_(ipath, True)
        bk2jss = defaultdict(list)
        bk2nms = defaultdict(list)
        bk2errs = defaultdict(list)
        new_nm2js = {}
            #一部件多个拆分:只取 首个拆分
        for (line_content, nm, op, bks), (case, payload) in it:
            if case == 3:
                #减法-->求_bk_笔顺码
                (hz_js, _bk_, _js_, _nms_) = payload
                print_nm_bk_js_(nm, _bk_, _js_)
            ######################
        #构造囗伪笔顺码到非数字部件名列表囗囗规范部件名囗(ipath=ipath, may_bk2js=汉字到笔顺码)
        #it = 迭代囗囗规范部件名囗(ipath=ipath, include_number_name=False)
        #for bk in it:
        #now using 生成拆分囗囗规范部件名囗 instead...
            elif case == 0 and not (_bks_ := payload) and not op in OPS4bad_order:
                #加法-->求nm笔顺码
                #def__case__0123:goto
                if nm in new_nm2js:
                    #一部件多个拆分:只取 首个拆分
                    continue
                nm, op, bks
                jss = [汉字到笔顺码[bk] for bk in bks]
                if op in OPS4well_order:
                    ffff = iter
                elif op in OPS4inv_order:
                    ffff = reversed
                js4nm = ''.join(ffff(jss))
                new_nm2js[nm] = js4nm
                print_nm_bk_js_(nm, nm, js4nm)
                    #第一个nm: 用于 定位拆分#多拆分情形=>首个拆分
                    #第二个nm: 用作 部件名 对应于 笔顺码
            ######################
        ######################
        ######################
        ######################

        for _bk_, errs in sorted(bk2errs.items()):
            for (existed_js, _js_, nm) in errs:
                print(f',{_bk_}=?={existed_js}=!={_js_}@{nm}')
        ######################
        for _bk_, jss in sorted(bk2jss.items()):
            if len(jss) > 1:
                nms = bk2nms[_bk_]
                js_nm_pairs__str = '|'.join(f'{js}@{nm}' for js, nm in zip(jss,nms))
                print(f',{_bk_}=?={js_nm_pairs__str}')
        ######################


    def _iter_read_(ipath, only_leading_finished_part, /):
        it = iter_parse_modified_output_file_(ipath=ipath, only_leading_finished_part=only_leading_finished_part)
        it = filter__phase1_(it, only_leading_finished_part=only_leading_finished_part)
        it = 尝试找出笔顺码囗囗第一阶段囗(it)
        return it
    def main4phase1_(*, ipath):
        it = _iter_read_(ipath, False)
        for (line_content, nm, op, bks), (case, payload) in it:
            print(line_content)
            if case == 0:
                _bks_ = payload
                _show__bks_(_bks_)
            elif case == 1:
                (hz_js, _bks_) = payload
                print(f'{nm}>{hz_js}')
                _show__bks_(_bks_)
            elif case == 2:
                (hz_js, _bk_) = payload
                print(f'{nm}>{hz_js}')
                print(f'{_bk_}:')
            elif case == 3:
                (hz_js, _bk_, _js_, _nms_) = payload
                print(f'{nm}>{hz_js}')
                print(f'{_bk_}:{_js_}')
                for _nm_ in _nms_:
                    print(f'{_bk_}:{_nm_}')
            else:
                raise 000
    assert '勺勺' in _patch__nm2js
    assert '勺勺' in 汉字到笔顺码
    return (
    (main4phase1_
    ,列出可推导出来的部件笔顺码囗囗用于更新补丁囗
    ))
#end-def _mk_funcs4phase1_():
if 0:
    #必须移动到_patch__nm2js之后
    (main4phase1_
    ,列出可推导出来的部件笔顺码囗囗用于更新补丁囗
    ) = _mk_funcs4phase1_()

__all__

# to update _patch__nm2js:see:列出可推导出来的部件笔顺码囗囗用于更新补丁囗
r'''[[[
[\UF900-\UFAff\U2F800-\U2FA1f]
    标识 兼容汉字
        见:_debug__keyword_auto_convert()
        见:_patch__nm2js
        见:regex4cjk_compatibility_char
[\U100-\U33FF][『』]\@<!
    排除 笔划

#]]]'''#'''
_patch__nm2js = (dict
#手动添加:
(撇化羊='431113'
,巿市囗囗亠='41252'
,巿市囗囗十='1252'
,窢儿版穴='44534'
,无钩𠃌='5'
,冫版肉月='3541'#xxx⺼ <- [\U100-\U33FF]
#⺼,='3541'
    #SyntaxError: invalid character '⺼' (U+2EBC)
    #_patch__nm2js['⺼'] = '3511'
    #   ⺼-->冫版肉月
,窢肉月='3511' #使用『月』笔顺
,头龘齊='4143253354'
,横组亻丨='322'
,头龘𦥯='32113434511'
,右龘漢='12212511134'
,右龘姬='1225125'
,头龘欠囗囗𠂊结尾在右囗囗非头龘负='35'
,头龘负囗囗𠂊结尾在中囗囗非头龘欠='35'
,无丶夕囗囗𠂊结尾在左囗囗非头龘欠='35'
,空心彐='51'
,龷='1221' #头龘共/头龘昔
,头龘尝='24345'
,龸='24345' #头龘尝
,头龘肖='243' #⺌
,龶='1121' #头龘青 #xxx胸龘害 多种
#xxx,㓁⺳='4534' #窢儿版㓁 #xxx⺳ <- [\U100-\U33FF]
,缺丿𧘇='534'
    #喪=>:
    #𡋑:插序巫幽型全二包龘土口口
,正序纵包龘冂卄囗囗断手冊='25122' #正序纵包龘冂卄,断手冊
,纵组囗中版古囗冖='1251245' #===头龘囊#重复！
#已有:𦍌#断尾羊
,无丨氺='4134' #氺四点
,纵组𠂉囗一隹版存='31132411121' #类似『奞』
#,纵组左月囗囗右龘隋='131212511' #右龘隋 #底用肉月
#,纵组日羽囗囗右龘塌='2511541541' #右龘塌 #日曰冃
,纵组丶丶鱻惐冫囗囗底龘冬='44' #底龘冬
,无足寒='4451122134' #头龘塞
,正序纵包龘冂卄='25122' #断手冊
,亦鱻惐直化亦='413234'
,头用亦='412234'
    #『头用亦vs亦鱻惐直化亦』其实 两者都是混同，但依G笔顺码，故 同出而异名
,纵组丶丶='44' #仒?TODO:重验
#,=''
######################
######################
######################
######################
######################
# 自动生成:
#py_adhoc_call   script.hz.部件拆分   @列出可推导出来的部件笔顺码囗囗用于更新补丁囗 --ipath:../汉字粗拆分/script.hz.部件拆分..提取基本面编码空间里的汉字囗.out-modified.txt > /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..列出可推导出来的部件笔顺码囗囗用于更新补丁囗.out.txt
#view /sdcard/0my_files/tmp/out4py/script.hz.部件拆分..列出可推导出来的部件笔顺码囗囗用于更新补丁囗.out.txt
,头用爪='3443'
,纵组亠口='41251'
,融合纵组山人='5234'
,底龘襄='112213534'
,横组亻亻='3232'
,变体乍='31211'
,纵组巛山='555252'
,底龘㑒='125134'
,纵组厶友='541354'
,变体耴='1221115'
,纵组火廾='4334132'
,纵组口失='25131134'
,纵组帚又='5114525254'
,纵组古可='1225112512'
,变体囚='25341'
,拟包横组元女囗囗女版㝴='1135531'
,又版帚='5114554'
,窢郎版良='451154'
,纵组大开='1341132'
,由版画='12512152'
,左龘斲='5515515121'
,正序纵包龘厂炎='1343344334'
,纵三组𥫗一韭='3143141211121111'
,圆圈版零='5'
,横组生丸='31121354'
,纵组囟比='3253411535'
,左龘郄='341354'
,左龘刷='513252'
,左龘㕟='2125122'
,左龘㕢='214512511134'
,缺丨匈='35345'
,录彔='51124134'
,纵组臼又='32151154'
,窢万版另='25153'
,无八赛='445112212534'
,纵组隹心='324111214544'
,横组雀戈='234324111211534'
,内內='2534'
,纵组𠂉力='3153'
,横组田予='251215452'
,纵组𦍌牛='4311213112'
,纵组田疋='2512152134'
,纵组一生='131121'
,纵组亠日='412511'
,窢八版兇='345234'
,纵组丷干='43112'
,无梁巵='335215'
,底龘隳='342444'
,吕呂='251251'
,横组歺又='2135454'
,横组禾尤='312341354'
,纵四组士冖一女='121451531'
,纵四组士冖一子='121451521'
,横组亻㐁='32125341'
,横组爿米='5213431234'
,横组祟又='522521123454'
,横组爿夢='52131222522145354'
,横组爿囗帚版夢='5213122252214551145252'
,窢日儿版皃='3251135'
,兔免='35251354'
,尢尤='135'
,纵组囗头龘负丶='354'
,艸山='522'
,窢𦥑版叟='321511254'
,儿版川='325'
,横组工口='121251'
,窢亾版荒='122415325'
,右龘龍='1515111'
,纵组爫囗正序纵包龘尸囗纵组囗横四组止丨丨巳囗夂='3443513222121515354'
,无头六='134'
,右龘旅='313534'
,右龘備='1221325112'
,纵组爾王='134252343434341121'
,纵组白小='32511234'
,纵组大早='134251112'
,横组彳丨='3322'
,缺丿胤='55425115'
,口版敳='25212513134'
,小丶版心囗囗底龘恭='2444'
,罒版拐化直='12252215'
,头龘黎='31234353'
,头龘憂='13251145'
,拟包纵组尼木='513351234'
,禾版戚='1331234534'
,産產='41431331121'
,纵组欠心='35344544'
,包龘或巛='12511555534'
,正序纵包龘冂一='251'
,头龘监='22314'
,帀版风='351252'
,纵组从龰囗囗右龘從='34342134'
,纵组左月囗囗右龘隋='131212511'
,窢夂版致='1541213134'
,上彐版疌='215112134'
,龨='1324111215'
,纵组艹宋='1224451234'
,纵三组爫罒寸='344325221124'
,毁毀='3215111213554'
,纵组山隽='2523241112153'
,纵组隹冏='324111212534251'
,纵组艹喿='1222512512511234'
,直夕宐版疉='2512125121251214452541'
,攴攵='2154'
,二版丰='112'
,窢奂奐='3525134'
,撇化半='43113'
,目版爽='1251112511134'
,纵组囗撇化屮囗撇化屮='523523'
,幺幺兀版㡭='5545541355'
,纵组人亓='341132'
,纵组屮又='52254'
,纵组几口='35251'
,纵组夂日='3542511'
,直化卉鱻惐十十版卉='12122'
,正序纵包龘厂赤='131213234'
,昷𥁕='251125221'
,晋晉='1224312511'
,莽鱻馘卄犬版鱻魊十十犬版鱻魊卄大版='1221344132'
,礻示='4524'
,窢戶版啓='45133134251'
,爲為='344335554444'
,横组育攵='415425113134'
,纵组山曷='252251135345'
,纵组品丂='25125125115'
,横组冫七='4115'
,纵组巛歹='5551354'
,纵组人羊='34431112'
,仌版卤='212534341'
,纵组巩木='1213541234'
,纵组艹先='122312135'
,纵组尤旨='1354352511'
,横三组口口口='251251251'
,纵组非土='21112111121'
,纵组匕木='351234'
,纵组夅貝鱻惐纵组夂貢='3541522511134'
,头龘囊='1251245'
,右龘儍='3444445234354'
,右下罒版監='12512531425221'
,貝版覧='1251253142511134'
,无二重='3125112'
,纵组白方='325114153'
,纵组眔魚='252212334435251214444'
,龰='2134'
,纵组士囗一版冃='121251'
,匕版卓='21251115'
,纵三组士冖王='121451121'
,纵四组士冖一卵='1214513543524'
,睿𥈠='21451343425111'
,纵组囗头龘负口='35251'
,横组未攵='112343134'
,纵组人毛='343115'
,乚版木='1235'
,叉版圣='544121'
,臾㬰='32151134'
,交叠四丶廾='4132444'
,臼𦥑='321511'
,纵组𠂉疋='3152134'
,横组氵氵='441441'
,纵组必土='45434121'
,横组扌囗纵组𠂉子='12131521'
,窢𠂉版弥='51531234'
,木版弃='41541234'
,纵组天井鱻惐纵组夭井='11341132'
,加丶尿囗囗包龘户水='45132534'
,囧鱻惐包龘四口='2534251'
,窢八版包龘四口='25342511'
,横组屰刂='43152322'
,纵组穴王='445341121'
,纵组爫旧='344322511'
,纵组穴囗大版灭='4453413443'
,窢工版横组土尨='1211353334'
,纵组囗火版亾囗火版亾鱻惐炎版㡭='4334143345'
,纵组必皿='4543425221'
,纵组艹㐬='1224154325'
,包龘或大囗囗包龘戈吴='12511134534'
,纵组父金囗囗父金版釜='343434112431'
,羡羨='431121413534'
,横组月盈='3511535425221'
,纵组大囗二版革鱻惐纵组大革='134122125112'
,双口版龠='34125125125122'
,横组山莫='2521222511134'
,大版灭='13443'
,窢断尾聿='511121'
,二火版层='513114334'
,横组禾午='312343112'
,纵组臼土='321511121'
,窢臣版横三组丿㠯巳='325151515'
,横组目巨='251111515'
,纵四组士冖一火='1214514334'
,横三组丿臣己='3125125515'
,纵组火土='4334121'
,底龘崋='1122112'
,横组臽攵='353215113134'
,无足燕='122125121135'
,中序拟横三组火辛火='414311243344334'
,头龘興='3211251251511'
,纵组罒丁='2522112'
,壳売='1214535'
,纵组囗横组讠大贝='451342534'
,纵四组士冖一犬='1214511344'
,母贝版實='445554142534'
,纵组丿𤴓='312134'
,横组臣㕚='1251255444'
,横组石豕='132511353334'
,头龘與='3211152511'
,窢儿版㓁='4534'
,纵组冖瓦='451554'
,缺一马='55'
,窢交叠一巛版甾='55525121'
,横组古缶='12251311252'
,横组土囗纵组𠂉鹵='1213121253444441'
,木型纵组聿皕='511112132511132511'
,横组石又='1325154'
,横组户攵='45133134'
,横组户戈='45131534'
,纵组古㐄='12251152'
,剥剶='5112413422'
,右龘淵='322151512'
,底龘年='1212'
,横组句又='3525154'
,纵组支只='125425134'
,窢乂版刀头大鼻孔四脚日背龟囗囗右龘䆋35251125511511511='35251125511511511'
,纵组目大='25111134'
,横组爿臬='52133251111234'
,横组革耳='122125112122111'
,横组䏠凡='351141431354'
,单丿勿='353'
,横组夕力='35453'
,包龘口夕='253541'
,纵组日羽囗囗右龘塌='2511541541'
,横组甚刂='12211134522'
,无廾算='31431425111'
,横组脒几='351143123435'
,横组户又='451354'
,无丿妥='443531'
,横组每殳='31554143554'
,爫鱻惐斜月版夕='3443'
,纵四组士冖一缶='121451311252'
,戌戍='134534'
,斜月版夕='3544'
,壬王='3121'
,匀勻='3541'
,末未='11234'
,纵组力囗无丨氺='534134'
,正序纵包龘尸矢='51331134'
,直鱻惐目版拐化直='12251111'
,窢加丶版者='12132511'
,真眞='1225111134'
,纵组囗头龘肖貝='2432511134'
,纵四组士冖一囗肉月='1214512511'
,黄黃='12212512134'
,窢廿兩版㒼='12212523434'
,窢釆版奥='325431234134'
,尔尓='31234'
,纵组囗长腿甘囗冖='1221145'
,风版用='35112'
,纵组吅冖='25125145'
,包龘匚炎='1433443345'
,纵组乃木囗囗非朵='351234'
,右上龘侯='51'
,纵组艹冖='12245'
,屺𡵆='252515'
,纵组大屯='1341525'
,窢朮版刹='34123422'
,窢毋版毒='112155414'
,窢西版垔='125221121'
,横组缶且='31125225111'
,横组白百='32511132511'
,横组乡隹='55332411121'
,横组𤴔朿='52121125234'
,厶版遠='542513234454'
,丞氶='525341'
,窢目版横组日畐='25111125125121'
,横组幸匊='1214311235431234'
,横组囗右龘漢囗鳥='1221251113432511154444'
,卧臥='12512524'
,纵组八干='34112'
,纵组亠厶囗囗𠫓='4154'
,纵组罒方='252214153'
,纵组宀王='4451121'
,纵组罒万='25221153'
,窢卝干版缩头芈𦍋='2121112'
,纵组夂虫='354251214'
,窢母版貫='55212511134'
,乂版友犮='1334'
,术朮='12344'
,纵组果衣='25111234413534'
,覀西='125221'
,窢西版覃='125221251112'
,窢王版任='323121'
,纵组丑山='5211252'
,纵组氏口='3515251'
,秃禿='3123435'
,米版亾='4312345'
,纵组丰木='11121234'
,窢土版纵组臼工='321511121'
,单止歰='5345342121'
,窢𠃊大版奊='121121154'
,窢氺版遝='2522123344454'
,纵组免免='35251353525135'
,日版延='2511154'
,纵三组囗头龘上冖一='21451'
,头龘監='125125314'
,横组臣殳='1251253554'
,纵组囗头龘业冖='224345'
,衆眾='325221323334'
,横组囗无钩刂囗又='2254'
,横组文文='41344134'
,窢円版青='11212511'
,窢𦥑版臾='32151134'
,纵组龹貝='4311342511134'
,虍版睿='215315343425111'
,纵组𠂉丶囗囗半𥫗='314'
,衮袞='4134543534'
,纵组囗斜月版夕囗廾='3544132'
,纵组水月='25342511'
,头龘瞢='1222522145'
,纵三组一八土囗囗八版至='134121'
,窢囪版悤='32535414544'
,窢戊版戉版蔑='1222522115534'
,窢厶版疐='12452512152134'
,包龘𦥑囟囗囗囟版头龘興='3211325341511'
,干鱻惐撇化千='313'
,釆采='34431234'
,窢兂版朁='153515352511'
,横组昔阝='1221251152'
,出头乇='315'
,窢乂版犮='13544'
,又版容='445343454'
,纵组非手='211121113112'
,横组章夅='41431251112354152'
,朵鱻惐纵组乃木='351234'
,纵组山斤='2523312'
,木型纵组十玨='1211211121'
,横组求求='12413441241344'
,纵组覀囗横组臣卩='12522112512552'
,正序纵包龘𠂆万囗囗撇顶厉='33153'
,纵组囗头龘惠𧘇='125112143534'
,无梁兮='345'
,敖鱻惐横组囗纵组士方攵='1121533134'
,纵组山囗底龘隳='252342444'
,夾女版㥷='4131343434531'
,芯鹵版悤='32534444414544'
,头用雨='14524444'
,横组氵壬='4413121'
,纵组厶鼎='54251115132125'
,横组囗纵组林月攴='1234123425112154'
,纵组一幺='1554'
,窢撇屮版蚩='5221251214'
,纵组又韭='54211121111'
,横组𠂔欠='35233534'
,横组𠂔次='3523413534'
,纵组次韭='413534211121111'
,兀丌='135'
,窢缺丿艮='51154'
,窢弯冄版纵组彡冄='3332511'
,纵组彡否='3331324251'
,纵组而而='132522132522'
,飠𩙿='34451154'
,横组歹又='135454'
,缺乀朿='12523'
,正序纵包龘勹吉='35121251'
,纵组龶皿='112125221'
,叜鱻馘又版容='445433454'
,窢横顶版臿='312321511'
,窢乂版鬲='1251254312'
,窢𠂉版纵组人馬='341211254444'
,窢人版纵组八干='34112'
,纵组幺月='5542511'
,纵五组亠口回口十='4125125251125112'
,横三组弓者弓='51512132511515'
,窢大十版本='12341'
,争爭='355112'
,郎郞='45115452'
,拟包纵组虍魚='21531535251214444'
,窢刀版賴='1251234352511134'
,拟包纵组虍鱼='21531535251211'
,即卽='5115452'
,奥奧='325431234134'
,横组臣又='12512554'
,开幵='1132'
,纵组𠂉昜='31251113533'
,大版算='31431425111134'
,横组知于='31134251112'
,厶版疐囗囗右龘嚔='124525121542134'
,干干版幵='112112'
,横组囗正序纵包龘冂丶囗正序纵包龘冂丶='254254'
,横组丿丨='32'
,纵组爫糸='3443554234'
,融并甲电版㫣='251125115'
,纵组十旱='122511112'
,左龘亂='344354255454'
,𠂉鱻惐头龘欠囗囗𠂊结尾在右囗囗非头龘负='35'
,窢直化版底龘赤='3234'
,纵三组亠口冖='4125145'
,纵组日小='2511234'
,纵组回旦='25251125111'
,几囗囗非儿='35'
,横撇='5'
,芯一版区='151'
,壬鱻惐一士版王='3121'
,半型纵组丷十='4312'
,㠯囗囗非吕呂='25151'
,纵组一木='11234'
,纵组二女='11531'
,无腿兴='4431'
,纵组口囗儿版川囗囗三腿兄='251325'
,覀囗囗非西='125221'
,再鱻馘双杠冄版='125211'
,吕囗囗非呂='251251'
,每毎='3155414'
,右龘侯='5131134'
,横组丑刂='521122'
,呂囗囗非吕='2513251'
,彐版𡰪='5113251'
,纵组夂犬='3541344'
,纵组夂火囗囗非灸='3544334'
,目版拐化直='12251115'
,青鱻馘円版鱻魊弯月版='11212511'
,纵三组目一八囗囗非具='25111134'
,爯鱻馘双杠冄版='344325211'
,者鱻馘加丶版='12132511'
,臿鱻馘横顶版='312321511'
,叟鱻馘𦥑版鱻魊不穿底版='321511254'
,半型纵组𠈌十='3434343412'
,丆直用版石鱻惐丆弯用版石鱻惐厂直用版㕅='1325112'
,悤鱻鬾魊囱魊囪版='32535414544'
,纵三组囟八夂囗囗右龘傻='32534134354'
,芯用版䓒='1223525112'
,纵组吅从='2512513434'
,横组車攵='12511123134'
,曾曽='432524312511'
,朁鱻馘出头兂兂版='153515352511'
,纵组覀舛='125221354152'
,蔿蒍='122344335554444'
,纵组夂黑='354254312114444'
,底免版兄='25135'
,臼囗囗非𦥑='321511'
,中序拟横三组囗左龘卬囗白囗空心彐='325113551'
,中序拟横三组囗左龘北白匕='3251121135'
,出头巾版㒳='2523434'
,横组月巜='251155'
,缺一卫='52'
,丷八='43'
,头龘其='122111'
,尾大版曲='251221'
,横组幺幺='554554'
,正序纵包龘冂囗纵组厶又='255454'
,几儿='35'
,土鱻惐二版丰='121'
,头用尚='24345251'
,头龘兴='443'
,直化斤='3212'
,长腿版甘='12211'
,芯三版且鱻惐目一版旦='251111'
,目鱻馘长腿版='25111'
,厶版无钩袁='542513234'
,无钩袁='1212513234'
,坴鱻馘儿版='12134121'
,前囗或弯月版囗或丶丶直月版='431251122'
,纵组䒑夫='4311134'
,纵三组田一口='251211251'
,纵组执云='1213541154'
,㕣鱻馘儿版='34251'
,冃日='2511'
,直化井='1122'
,头龘冓囗囗胸龘寒='11221'
,拟包横组元攴囗囗攴版㝴='11352154'
,提横='1'
,牙鱻鬾魊𠃋魊丄版='1523'
,半鱻馘八版='43112'
,犮鱻馘乂版='13544'
,夌鱻馘儿版='12134354'
,垔鱻馘西版='125221121'
,倉鱻馘亼版='3445113251'
,横四组冫丿臣巳='413125125515'
,横三组冫臣巳='413125125515'
,賣鱻馘四版='121252212511134'
,几版乙='5'
,无足鸟='3545'
,纵组豆几='125143135'
,反序拟包纵组凵囗纵组丷干='4311252'
,撇化千='313'
,气鱻馘乙版='3115'
,弯月='3511'
,文鱻馘丄版='4134'
,半鱻惐撇化半鱻惐八版撇化半='43113'
,万底版另='25153'
,左龘颈='54121'
,左龘制='311252'
,龹𠔉='431134'
,杀鱻馘𠃊版='341234'
,刃刄='534'
,肙鱻馘肉月版='2512511'
,肖鱻馘肉月版鱻魊小版='2432511'
,底用刖='251122'
,术版杀鱻惐朮版杀='3412344'
,非鱻鬾魊丨丨魊丿丨版='21112111'
,彔囗囗非录='55124134'
,录囗囗非彔='51124134'
,砉鱻馘撇顶丰版='111213251'
,害鱻鬾横顶丰版鱻魊撇顶丰版鱻魊横顶龶版鱻魊撇顶龶版='4451112251'
,正序纵包龘厂刀囗囗刀版历='1353'
,𨥫鱻鬾头留版='3545334112431'
,刃囗囗非刄='534'
,刄囗囗非刃='534'
,纵组冖力='4553'
,头龘学='44345'
,告吿='3121251'
,每囗囗非毎='3155414'
,直化用鱻惐田='25112'
,卷鱻馘八版='43113455'
,冒鱻馘日目版='251125111'
,日曰冃='2511'
,甚鱻鬾八版鱻魊儿版='122111345'
,劵鱻馘八版='43113453'
,堇鱻馘艹倒日版='12212511121'
,强強='515251251214'
,絭鱻馘八版='431134554234'
,巳己='515'
,无钩𧘇='3234'
,直月鱻惐弯月鱻惐冃='2511'
,头龘啬='12431'
,横组丿丿='33'
,冫鱻惐提二囗囗非二='41'
,双丿版乂='334'
,𣪘鱻惐横组囗窢缺丿艮囗殳='511543554'
,躳鱻馘呂版='3251113251251'
,纵组从十='343412'
,头龘上='21'
,甲版早='251112'
,正序纵包龘冂囗纵组丷干='2543112'
,左龘卬='35'
,左龘印='351'
,左龘卯='353'
,左龘卵='3543'
,横组原原='13325112341332511234'
,由版古='125121'
,纵组厶大='54134'
,纵组人三='34111'
,头龘叏='512'
,中版古='12512'
,纵组爫冖='344345'
,直化亦='412234'
,撇化半鱻馘八版='43113'
,纵组火又='433454'
,正序纵包龘尸示囗囗示版层='51311234'
,臼𦥑丨叟头='3215112'
,睿囗囗非𥈠='21451343425111'
,纵三组丷干囗变体取='4311212211154'
,变体取='12211154'
,丩鱻馘丄版='52'
,天囗囗非夭='1134'
,今鱻鬾亽版鱻魊亼版='3445'
,屯鱻鬾横顶版鱻魊撇顶版='1525'
,匀勻鱻馘提二版='3541'
,纵组丿口='3251'
,王𡈼囗囗非壬='1121'
,断尾牛='3121'
,夭囗囗非天='3134'
,戹鱻馘戶版='45135'
,氐鱻鬾氏丶版鱻魊氏一版='35154'
,次鱻鬾冫版鱻魊二版鱻魊提二版='413534'
,关鱻馘八版='431134'
,艾鱻鬾卄艹版鱻魊十十版='12234'
,赤鱻馘直化版='1213234'
,那鱻馘双杠版='511352'
,良鱻馘横顶版='4511534'
,横组口另='25125153'
,别別='2515322'
,兑兌='4325135'
,言鱻馘横顶版='4111251'
,角鱻馘两腿版='3535112'
,夋鱻馘儿版='5434354'
,窢不穿底版纵组肀口='5112251'
,麦鱻鬾龶夂版鱻魊撇化丰又版='1121354'
,纵组囗头龘肖贝='2432534'
,皂皀='3251115'
,即囗囗非丿缺亽𩙿版囗囗非卽='5115452'
,昌鱻鬾日日版鱻魊日曰版='25112511'
,戾鱻鬾户版鱻魊戶版鱻魊戸版='45131344'
,羌鱻鬾撇化羊乚版鱻魊𦍌儿版='4311135'
,於鱻馘𠂉版='41533444'
,垂鱻鬾卄艹版鱻魊十十版='31212211'
,豖豕='13533434'
,空鱻馘儿版='44534121'
,纵组十回鱻惐纵组亠回鱻惐纵组丄回='12252511'
,启鱻馘戶版='4513251'
,纵组羊䒑鱻惐纵组𦍌䒑='431112431'
,昝鱻鬾卜版鱻魊人版='354242511'
,要鱻鬾覀版鱻魊襾版='125221531'
,奐鱻鬾八版鱻魊人版鱻魊儿版='352534134'
,纵三组口䒑口='251431251'
,曷鱻鬾匃版鱻魊匂版='251135345'
,卽鱻鬾皀版鱻魊丿缺亽𩙿版囗囗非即='325113552'
,韋鱻鬾㐄版鱻魊底年版='521251152'
,皀鱻惐缺丿艮='51154'
,龱='25341'
,即鱻馘丿缺亽𩙿版囗囗非卽='5115452'
,俞兪='341251122'
,插序巫幽型全二包龘土口口='122512511'
,契鱻鬾丰版鱻魊龶版='111253134'
,纵组口冋='25125251'
,彦彥='414313333'
,奔鱻鬾廾版鱻魊𠂇十版='13412132'
,查査='123425111'
,头龘学鱻惐头用尚='44345'
,插序巫幽型全二包龘土人人='1234341'
,兹茲='431554554'
,纵组口囗正序纵包龘冂卄='25125122'
,既旣='511541535'
,右龘漢囗鱻馘艹倒日版='12212511134'
,纵三组口䒑加='25143153251'
,纵组口旨='251352511'
,絜鱻馘彡版='111253554234'
,横组口𨥫鱻鬾头留版='2513545334112431'
,纵组囗中版古囗㓁='125124534'
,正序纵包龘厂敢='1351221113134'
,反序拟包横组辶囗纵组罒㒸='25221431353334454'
,纵三组冖吅囗底龘襄='45251251112213534'
,包龘口囗纵组丷干='25431121'
,右龘杨='533'
,纵组一巛='1555'
,纵组土八鱻惐纵组土儿='12134'
,八鱻惐儿='34'
,纵组上下='211124'
,寽鱻鬾近爫版鱻魊斜月炙头版='3443124'
,取鱻惐变体取='12211154'
,横组方方='41534153'
,穿头中版呈='2511121'
,纵组龹土='431134121'
,纵组田囗无丨氺='251214134'
,冢鱻馘豕版='4513533434'
,纵三组囗头龘冓八土='1122134121'
,头龘冓='11221'
,纵三组𠂉口皿='3125125221'
,將鱻馘寽版='52133544124'
,虚虛='21531522431'
,黑黒='254312114444'
,横组囗車版击囗殳='1251112523554'
,纵组囗横组乡隹囗土='55332411121121'
,纵三组十罒衣='1225221413534'
,横组畕畕='25121251212512125121'
,眉版尸='5213'
,纵组士冖='12145'
,纵组冖业='4522431'
,纵组冖豆='451251431'
,纵四组士乛工一囗囗头龘壽='12151211'
,头龘夀='11525121'
,卜人='24'
,㐄鱻馘丄版囗囗底龘年='152'
,纵组八夂囗鱻馘儿版鱻魊夊版='34354'
,夂夊='354'
,纵组日夂囗鱻馘曰版鱻魊夊版='2511354'
,中序拟横三组火言火='411125143344334'
,卜鱻馘交叠丨乀版='24'
,彐鱻鬾尾大版='511'
,横组亻囗叉版夂='323544'
,纵三组罒冖夕='2522145354'
,央鱻鬾不出头版='25134'
,头用负鱻鬾八版鱻魊人版鱻魊儿版='352534'
,㓞鱻鬾丰版鱻魊提丰版鱻魊提龶版='111253'
,横组丬夕='412354'
,纵组幺大='554134'
,纵组一自囗囗目版百='1325111'
,米版向='325431234'
,釆版向='3253431234'
,横组丬寽='4123443124'
,纵组隹寸='32411121124'
,纵组隹田='3241112125121'
,罒版品='252212522125221'
,户戶='4513'
,丰鱻馘撇顶版='1112'
,头龘妻='15112'
,市巿='1252'
,䏍鱻鬾直月版鱻魊肉月版鱻魊弯月版='542511'
,似鱻馘厶版='325434'
,昌鱻馘纵组日曰版='25112511'
,头龘婁='25112512'
,㸒鱻鬾壬版鱻魊𡈼版='34433121'
,横组贝贝='25342534'
,巸鱻馘𦣝版='1225125515'
,胡鱻鬾弯月版鱻魊直月版鱻魊肉月版='122513511'
,纵组龹女='431134531'
,蚩鱻鬾屮版鱻魊撇化屮版鱻魊山䖝版='5221251214'
,𣁋鱻鬾山一几版鱻魊山一儿版鱻魊山兀版鱻魊山几版='2521353134'
,弱鱻鬾冫版鱻魊丿丿版='5154151541'
,横组男女='2512153531'
,纵组囗头用负囗比='3525341535'
,正序纵包龘厂女='13531'
,纵组囗反序包龘北口囗女='25121135531'
,𣁋鱻鬾山一王版鱻魊山一𡈼版鱻魊山一壬版='252111213134'
,拟包横组免生='352513531121'
,拟包横组兔生='3525135431121'
,與鱻鬾芯丨版鱻魊芯丿版='3211152511134'
,横组女𨥫鱻鬾头留版='5313545334112431'
,丨丨版中='25122'
,底龘亞='2155121'
,日曰='2511'
,纵组囗头用负囗目='35253425111'
,包龘𦥑囗目版百='32111325111511'
,右龘嬽='2522121252215134'
,纵组囗横三组口口口囗女='251251251531'
,右上龘嬽='2522121252215'
,纵组冖子='45521'
,正序纵包龘厂子='13521'
,丶版彑鱻惐夕版彑鱻惐丶版互='2541'
,丰龶鱻鬾横顶版鱻魊撇顶版='1112'
,纵三组口一囗儿版川='2511325'
,纵组囗又丷版必囗山='5443252'
,又丷版必='5443'
,纵三组一由八='12512134'
,纵组必山='45434252'
,纵三组囗头龘冓八㔾='112213455'
,纵组心皿='454425221'
,横组爿丙='521312534'
,奐鱻鬾魊八魊人魊儿版鱻惐奐之或大或无头六版='352534134'
,横组爿未='521311234'
,纵三组囗头龘冓八囗底龘冬='112213444'
,纵组囗罒版百囗丁='132522112'
,纵组必冉='4543425211'
,横组丬囗又版帚='4125114554'
,纵组囗尾大版目版百囗分='13251113453'
,横组爿囗又版帚='52135114554'
,横组爿言='52134111251'
,横组爿吾='52131251251'
,木朩='1234'
,纵组珎貝='1121352342511134'
,纵组珤貝='11213112522511134'
,纵组夕寸鱻惐寽='354124'
,纵组囗斜月版夕囗寸囗鱻馘冫版鱻魊断折夕版='3544124'
,头龘惠='12511214'
,纵组囗彐鱻鬾尾大版囗横组工口='511121251'
,纵组业𦍌='22431431121'
,缺丶戈='153'
,直化卉='12122'
,夭天='3134'
,由田='25121'
,纵组又囗二版丰='54112'
,横组山歹='2521354'
,纵三组一木山='11234252'
,纵组示山='11234252'
,纵组尤山='1354252'
,横组甘欠='122113534'
,底步版烕='131233534'
,鬼鱻鬾撇化甲版鱻魊甶儿版='325113554'
,正序纵包龘厂配='131253511515'
,横组𠂤辛='3251514143112'
,戢鱻鬾融横版鱻魊断横版='251122111534'
,纵组豕囗横组土土='1353334121121'
,罪鱻馘撇竖版='2522121112111'
,微鱻馘儿版='3322521353134'
,營鱻鬾吕版鱻魊呂版='4334433445251251'
,䒑版㜸='4313251514143112521'
,㜸鱻鬾䒑版鱻魊艹版='4313251514143112521'
,缺丿囟版鼠='253415445445'
,凡鱻鬾几丶版鱻魊不出头丸版鱻魊撇化卂版='354'
,横组工几='12135'
,纵组一己='1515'
,横组巳巳='515515'
,横组巳巳囗鱻馘己版='515515'
,横组丨丿='23'
,横组丨丿鱻惐横组丶丿='23'
,纵组冖巾='45252'
,纵三组亠丷冖囗囗尾冖版立='414345'
,纵组旲巾='2511134252'
,𣁋鱻鬾山一巾版='25212523134'
,戠鱻鬾融横版='414312511534'
,憲鱻魌丰龶鱻鬾横顶版鱻魊撇顶版鱻魊彡版='4451112252214544'
,丄版㐄囗囗底龘年='1212'
,干鱻鬾撇化版鱻魊直化版='113'
,纵组人干='34112'
,正鱻鬾撇顶版鱻魊横顶版鱻魊𠃊止版鱻魊丄止版='3215'
,壬𡈼='3121'
,巳已己='515'
,杀鱻鬾朩版鱻魊木版='341234'
,术版杀='3412344'
,正序纵包龘弔丿囗囗底龘第='51523'
,纵组屮又囗鱻馘撇化屮版='52254'
,𦣝鱻惐口版臣='1225125'
,纵组厶虫='54251214'
,纵三组囗头龘冓八弓='1122134515'
,畢鱻鬾甲版鱻魊田版='2511122112'
,包龘比矢='153113435'
,纵组冖果='4525111234'
,纵组粉廾='4312343453132'
,纵组囗横组米糸囗廾='431234554234132'
,正序纵包龘厂彡='13333'
,左龘颈鱻惐圣='54121'
,寺鱻鬾土版鱻魊士版='121124'
,纵组幺夂='554354'
,呈鱻鬾王版鱻魊𡈼版='2511121'
,纵组丷𤴓囗囗纵组䒑龰='4312134'
,卸鱻鬾丄止版鱻魊𠃊止版='311212152'
,𣁋鱻鬾山一几版鱻魊山一儿版鱻魊山兀版='2521353134'
,纵组正正='1212112121'
,纵三组十罒心囗囗缺𠃊㥁='12252214544'
,𣁋鱻鬾山一土版='25211213134'
,𣁋鱻鬾山一糸版='25215542343134'
,横组訔攵囗囗𣁋鱻鬾山言版='25241112513134'
,纵四组日出大氺='25115225213424134'
,天夭='1134'
,刍鱻鬾彐版鱻魊右倒巾版='35511'
,纵组丷口='43251'
,任鱻馘一士王版='323121'
,㓞鱻馘彡版='111253'
,舌鱻惐纵组干口='312251'
,纵组囗直化用囗心='251124544'
,吳鱻鬾无二与版鱻魊丨无钩𠃌版鱻魊𠃊版='2515134'
,囱囗囗非囪='3253541'
,横组忄禾='44231234'
,纵组囗头龘兴囗凶='4433452'
,纵组冗心='45354544'
,纵组厶心='544544'
,纵组㠯心='251514544'
,参叁='54134333'
,直化卅='1222'
,帶版卅='132215'
,彐鱻鬾尾大版鱻魊右倒巾版='511'
,芯夹版区='11431345'
,单単='43251112'
,横组忄貝='4422511134'
,纵三组爫冖心='3443454544'
,头用㱿囗囗头用无弓彀='1214513554'
,蚤鱻鬾叉版鱻魊㕚版='544251214'
,既鱻惐丿底𩙿版旣='511541535'
,横组来犬='14312341344'
,廾版馮='41121125132'
,横组來攵='123434343134'
,横组舌自='312251325111'
,纵三组囗躯龘害罒心='1112252214544'
,躯龘害='1112'
,黽鱻鬾闭肠版鱻魊开塞版='2511251211511'
,纵三组亠罒衣='4125221413534'
,疐鱻鬾乛版鱻魊厶版='12452512152134'
,養鱻鬾撇化羊版鱻魊𦍌食版='43111344511534'
,横组忄𨥫鱻鬾头留版='4423545334112431'
,縣鱻鬾芯三且版鱻魊𠃊目版='2511112343554234'
,户戶戸='4513'
,戶戸='3351'
,勺鱻鬾丶版鱻魊一版='354'
,丑鱻鬾尾大版鱻魊双杠版='5211'
,反鱻鬾撇顶版鱻魊横顶版='3354'
,拟包横组九力='3553'
,平鱻鬾丷版鱻魊八版='14312'
,宂鱻鬾几版鱻魊儿版='44535'
,包鱻鬾巳版鱻魊己版='35515'
,拟包横组尢力='13553'
,半鱻鬾丷版鱻魊八版='43112'
,另叧='25153'
,纵组一丰='11112'
,𠃌版东囗囗右龘炼='15534'
,用鱻鬾弯月版鱻魊直月版='35112'
,纵组巛夕='555354'
,横组扌歹='1211354'
,邦鱻鬾横顶撇化丰版鱻魊撇顶撇化丰版='111352'
,反序拟包纵组夨日='2511154'
,角鱻鬾三腿版鱻魊两腿版='3535112'
,纵组申又囗囗申版叟='2511254'
,舍舎='34112251'
,戾鱻鬾户版鱻魊戶版鱻魊戸大戻版='45131344'
,卷鱻鬾丷龹版鱻魊八𠔉版='43113455'
,龵手='3113'
,纵组日匂囗囗匂版曷='25113535'
,纵组又虫囗囗又版蚤='54251214'
,並鱻鬾虚业版鱻魊虛业版='43122431'
,酋鱻鬾丷版鱻魊八版='431253511'
,奏鱻鬾天版鱻魊夭版='111341134'
,纵组臼工='321511121'
,契鱻鬾三丰版鱻魊彡丰版='111253134'
,臿鱻鬾穿底版='312321511'
,纵组爫囗缺丿缶囗囗缺丿午版䍃='344311252'
,纵组免囗底龘冬='352513544'
,差鱻鬾撇化羊版鱻魊𦍌丿版='431113121'
,斜月夕版䍃='3544311252'
,益鱻鬾丷版鱻魊八版='4313425221'
,窊鱻鬾厶瓜版鱻魊无口虫瓜版='4453433544'
,横组手手='31123112'
,纵组耳囗无丨氺='1221114134'
,夕版容='4453434354'
,殺鱻鬾魊朩魊朮魊术版='3412343554'
,屏屛='513431132'
,纵组人音='34414312511'
,着鱻鬾撇化羊版鱻魊𦍌丿版='43111325111'
,虜鱻鬾田版鱻魊毌版='2153152512153'
,節鱻鬾魊即魊卽版='3143145115452'
,巤鱻鬾乂版鱻魊人版='555253415445445'
,纵组大手='1343112'
,顛顚='1225111134132511134'
,纵组窊㼌='44534335443354433544'
,覽覧='125125314252212511135'
,横组分手='34533112'
,子版肴='3413521'
,横组申攵='251123134'
,纵组龶囗底龘万='112153'
,㡀鱻鬾丷版鱻魊八版='4325234'
,尚鱻鬾丷版鱻魊八版='24325251'
,纵组囗无钩𠃌囗耳鱻惐纵组丅耳囗囗左龘敢='5122111'
,纵组龷月囗囗左龘散='12212511'
,横组東攵='125112343134'
,纵组囗尾冖版上囗釆='21453431234'
,头用负='352534'
,正序纵包龘厂來='1312343434'
,横三组丿二丨='3211'
,横三组丿示丨='3211234'
,舋鱻鬾同版鱻魊冂一丅版='32112512515114525111'
,纵组冖斗='454412'
,冓鱻鬾单杠版鱻魊双杠版='1122125211'
,纵组人斗='344412'
,亲鱻鬾魊朩魊木版='414311234'
,左龘斲囗囗角似口版囗或角似卯版囗囗鬬__5515515121_vs_35215515121='5515515121'
,亞版留='3545312155121'
,纵组𠂉几='3135'
,纵组𠂉巾='31252'
,纵组𠂉子='31521'
,纵组𠂉斤='313312'
,纵组𠂉丹囗鱻鬾亠丹版鱻魊丄丹直化版='313541'
,纵组𠂉毛='313115'
,纵组𠂉巿囗囗十='311252'
,纵组𠂉皮='3153254'
,纵组𠂉瓦='311554'
,纵组𠂉生='3131121'
,纵组𠂉令='3134454'
,纵组𠂉尼='3151335'
,纵组𠂉矢='3131134'
,纵组𠂉兆='31341534'
,纵组𠂉㐬='314154325'
,纵组𠂉肖='312432511'
,纵组𠂉奇='3113412512'
,纵组𠂉其='3112211134'
,纵组𠂉票='3112522111234'
,纵组𠂉番='31343123425121'
,纵组𠂉亶='314125251125111'
,纵组𠂉會='313412524312511'
,纵组𠂉遂='31431353334454'
,纵组𠂉與='313211152511134'
,旡鱻鬾𠃋版鱻魊丄版='1535'
,匕鱻鬾撇顶版鱻魊横顶版='35'
,天鱻馘倒二版='1134'
,纵组一勿='13533'
,处鱻鬾卜版鱻魊人版='35424'
,纵三组一厸一='154541'
,断尾聿='511121'
,倒日儿版免='35252135'
,纵组旲日='25111342511'
,纵三组出大本='5225213412341'
,底龘更囗囗似㬰似曳='251134'
,头龘曹='1251221'
,由版古鱻惐纵组亠田='125121'
,纵组囗丷八囗田='4325121'
,纵组囗丷八囗脸龘曾='43252431'
,日冃='2511'
,力版变体取='12211153'
,纵组亼囗脸龘曾='341252431'
,脸龘曾='252431'
,包龘口囗倒小='252431'
,月鱻鬾直月版鱻魊弯月版='2511'
,月鱻鬾弯月版鱻魊肉月版='3511'
,纵组亡月鱻鬾弯月版鱻魊斜月夕版='4153511'
,横组臣月鱻鬾弯月版='1251253511'
,朩木='1234'
,巿市囗囗十亠='1252'
,缺丿艮='51154'
,纵组罒又='2522154'
,木型纵组了叹='5225154'
,子版肴囗囗乂版孝='3413521'
,本版卉='12321'
,斥鱻鬾乂卜版鱻魊下版='33124'
,纵组二水='112534'
,厉鱻鬾撇顶版鱻魊横顶版='33153'
,阉版束='1251234'
,穿心倒日版古='12512'
,幵鱻鬾撇化干直化干版鱻魊干干版='113112'
,横组木歹='12341354'
,日版占='212511'
,纵组厶夲='5413412'
,纵组人氺='3424134'
,横组氵刅='4415344'
,条鱻鬾魊朩魊木魊夂魊攵版='3541234'
,纵组山分='2523453'
,㐬鱻鬾亠厶𠫓版鱻魊七丶𠫓版='4154325'
,横组占又='2125154'
,育鱻鬾亠厶𠫓版鱻魊七丶𠫓版鱻魊直月版鱻魊肉月版='41542511'
,右龘淵囗鱻馘直化版='322151512'
,纵组分木='34531234'
,纵组亠舛='41354152'
,横组分木='34531234'
,纵组䒑未='43111234'
,亟鱻鬾了版鱻魊丂版='52251541'
,中序拟横三组冫白囗右龘氺='325114134'
,神鱻鬾礻版鱻魊示版='452425112'
,彐版品='511511511'
,殺鱻鬾魊朩魊朮木版='3412343554'
,纵组人木='341234'
,纵三组士冖石='1214513251'
,纵组右冋='1325125251'
,真鱻鬾芯三版鱻魊十目一八版='1225111134'
,既旣鱻馘丨二版='511541535'
,旣鱻馘丨二版='32511351535'
,纵组酉灬='12535114444'
,中序拟横三组幺白幺='32511554554'
,朗鱻鬾郎版鱻魊郞版='4511543511'
,脩鱻鬾魊夂魊攵魊直月魊肉月版='3223542511'
,䇠鱻鬾主版鱻魊龶版='31431441121'
,殺鱻鬾术版鱻魊朮版='34123443554'
,纵组㐬皿='415432525221'
,纵三组𠂉卌一='31122221'
,纵组冖䂞='45132511234'
,肅鱻馘中间多一隔横直化版='5112322151512'
,甯鱻鬾直用版鱻魊弯用版='445454425112'
,貿鱻鬾头留版鱻魊卯版='354532511134'
,丑版品='521152115211'
,缺心隱='523443121511'
,聖鱻鬾魊王魊𡈼版='1221112511121'
,風鱻鬾撇顶䖝版鱻魊横顶䖝版='353251214'
,綿鱻鬾糹版鱻魊糸版='55444432511252'
,林鱻鬾木木版鱻魊丶乚版鱻魊乚乚版='12341234'
,匱鱻鬾目版鱻魊且版='12512125111345'
,節鱻鬾魊即魊卽魊丨二版='3143145115452'
,纵组囗头龘囊咎='125124535424251'
,咎鱻鬾魊卜魊人版='35424251'
,賣鱻鬾魊罒魊四版='121252212511134'
,辥鱻鬾撇化屮版鱻魊山版='5233251514143112'
,賴鱻鬾𠂊版鱻魊刀版='1251234352511134'
,蕭鱻馘中间多一隔横直化肅版='1225112322151512'
,寸版即='51154124'
,冫二鱻惐提二='41'
,与鱻惐刁版占='151'
,纵组匕矢='3531134'
,纵组士示='12111234'
,纵组叕酉='545454541253511'
,缺丶少='233'
,反序拟包纵组凵米囗囗米版凶='43123452'
,小版烕='131234534'
,纵组𠂤止='3251512121'
,底万头负版殳='3554'
,纵组𠂉囗右龘杨='31533'
,戋㦮='11534'
,左龘段='32111'
,主龶='41121'
,杀鱻鬾朩版鱻魊木版鱻魊朮版鱻魊术版='341234'
,正序纵包龘尸共='513122134'
,纵三组士冖几='1214535'
,纵三组士冖车='121451521'
,纵四组士冖一糸='121451554234'
,纵四组士冖一角='1214513535112'
,纵四组士冖一口='121451251'
,纵四组士冖一弓='121451515'
,纵四组士冖一木='1214511234'
,纵四组士冖一几='12145135'
,纵四组士冖一王='1214511121'
,纵四组士冖一目='12145125111'
,纵四组士冖一禾='12145131234'
,纵四组士冖一米='121451431234'
,纵四组士冖一豕='1214511353334'
,纵四组士冖一車='1214511251112'
,纵四组士冖一鳥='12145132511154444'
,毋母毌='5531'
,母毋毌='55414'
,正序纵包龘厂毛='133115'
,横组毛毛='31153115'
,气折笔='5'
,卂鱻鬾十版鱻魊𠂇版='512'
,卞鱻鬾亠卜版鱻魊丄卜版鱻魊十丶版='4124'
,夂囗囗非攵='354'
,冗鱻鬾几版鱻魊儿版='4535'
,巿市囗囗十丄='1252'
,纵组几口囗鱻鬾魊几魊儿魊八版='35251'
,吴吳='2511134'
,耒鱻馘撇顶版='111234'
,并幷='431132'
,𠂢鱻鬾带钩版鱻魊无钩版='333534'
,纵组弋月鱻鬾弯月版鱻魊肉月版='1542511'
,纵组刃止='5342121'
,函鱻鬾了版鱻魊丂版='52413452'
,戾鱻鬾户版鱻魊戶版='45131344'
,肥鱻鬾弯月版鱻魊肉月版='35115215'
,㦿鱻鬾魊户魊戶版='45131234'
,靑鱻鬾直円版鱻魊弯円版='11212521'
,忝鱻鬾魊天魊夭版='11342444'
,纵组水水='25342534'
,横组并刂='43113222'
,横三组丿米丨='34312342'
,纵组止囗无丨氺='21214134'
,纵组爫夫='34431134'
,横组关刂='43113422'
,奐鱻鬾魊八魊人魊儿版='352534134'
,巷鱻鬾魊巳魊己版='122134515'
,兗鱻鬾魊八魊儿版='413425135'
,纵组立月囗囗左龘龍囗囗直月肉月='414312511'
,恬鱻鬾魊千魊干版='442312251'
,炭鱻鬾魊𠂇魊厂版='252134334'
,勇鱻鬾直用版鱻魊田版='542511253'
,穿心巛版甾囗囗右龘輺='155525121'
,纵组艹両='122125252'
,纵三组山夂囗二版丰='252354112'
,羗鱻鬾撇化羊版鱻魊𦍌丿版='431113554'
,幺幺版坙='1554554121'
,兹茲玆='431554554'
,蚩鱻鬾屮版鱻魊撇化屮版='5221251214'
,纵三组㓁工口='4534121251'
,带帯='122245252'
,纵组艹两='1221253434'
,扈鱻鬾魊户魊戶魊戸版='45132515215'
,教敎='12135213134'
,右龘漢囗鱻鬾廿版鱻魊龷版鱻魊艹不出头倒日版='12212511134'
,正序纵包龘厂水='132534'
,纵组匕水='352534'
,纵组山並='25243122431'
,纵组夂月囗囗直月肉月='3542511'
,纵组𦉫豕囗囗纵组罒囗底龘豕='25221353334'
,衆鱻鬾丿罒乑版鱻魊血底眾版鱻魊血乑版='325221323334'
,散㪚='122125113134'
,纵组林月囗鱻鬾魊直月魊弯月魊肉月魊缺丶朮魊木版='123412342511'
,纵组林日='123412342511'
,丂版奥鱻惐丂版奧囗囗缺一粤鱻惐缺一粵='32543123415'
,虞鱻鬾魊吴魊吳版='2153152511134'
,方版曼='2511252214153'
,纵三组宀帚又='4455114525254'
,亷廉='4143135112234'
,鼻鱻鬾魊丌魊廾版='32511125121132'
,翟鱻鬾羽版鱻魊彐彐版='54154132411121'
,纵四组士冖一木鱻惐纵三组士冖禾='12145312343554'
,墨鱻鬾魊黒魊黑版='25112114444121'
,纵三组來一回='123434341252511'
,頽鱻鬾魊几魊儿版='3123435132511134'
,爵鱻鬾厶版鱻魊丨二版='34432522151154124'
,鬵鱻鬾魊旡魊兂版='153515351251254312'
,拟包纵组廌去鱻惐纵组廌去='413522115444412154'
,横组豊盍='25122112514311215425221'
,横组泉泉='325112534325112534'
,彐鱻馘右倒巾版='511'
,灰鱻鬾魊𠂇魊厂版='134334'
,纵组丿丹囗囗亠版舟='33541'
,头龘奐囗囗八版头用负='352534'
,开幵鱻惐干干版幵='1132'
,纵组了灬='524444'
,灬版与='154444'
,纵组囗头龘负旧='3522511'
,育鱻鬾直月版鱻魊弯月版='41542511'
,斜月夕版肰='35441344'
,横组丰丰='11121112'
,纵组棥冖='12343434123445'
,纵组棥罒='12343434123425221'
,糹糸='554444'
#xxx,𣴎鱻鬾氺版='4311212534'
,𣴎鱻鬾氺版='43112124134'
,提化匕='15'
,横组𦣝巳='125125515'
,横组刍攵='355113134'
,横组囗纵组巛歹囗刂='555135422'
,横三组丿臣巳='3125125515'
,宫宮='445251251'
,无足版融竖版纵组千黑='3125431211'
,纵组匕火='354334'
,横组隹欠='324111213534'
,赫鱻馘直化版='12132341213234'
,同版𦥯鱻鬾同版鱻魊冂一丅版='321125125151145'
,横组熏力囗鱻馘灬底版='3125431211444453'
,雚鱻鬾魊卄魊卝版='12225125132411121'
,亅版不出头版肀='5112'
,底龘爲='35554444'
,纵组罒囗寸版即鱻鬾厶版鱻魊丨二版='2522151154124'
,庸鱻鬾魊直月魊弯月版='41351125112'
,正序纵包龘户甫='45131251124'
,纵组冖牛='453112'
,交叠拟纵组玄冖='4155445'
,右龘備囗鱻鬾魊龷直甪魊龷弯甪魊艹厂直用版='1221325112'
,正序纵包龘厂牛='133112'
,瓜鱻鬾魊厶魊无口虫版='33544'
,冊鱻鬾双杠版='252211'
,横组讠犬='451344'
,纵组日月囗鱻鬾魊日魊曰魊直月魊肉月版囗囗非冐='25112511'
,䍃鱻鬾魊爫魊斜月夕版='3443311252'
,横组言犬='41112511344'
,纵三组畄一口='443251211251'
,廣鱻鬾魊黄魊黃版='41312212512134'
,横组蕇斤鱻惐蘄='1222512512511123312'
,亠丄='41'
,册冊='35351'
,横组𤣩禾='112131234'
,虎鱻鬾魊几魊儿版='21531535'
,周鱻鬾魊土魊二丰版='35121251'
,䍃鱻鬾斜月夕版鱻魊爫版='3544311252'
,䍃鱻鬾爫版='3443311252'
,睘鱻鬾魊𠄌魊丨版='2522112513534'
,纵组朱貝='3112342511134'
,同版𦥯鱻鬾同版鱻魊冂一丅版鱻惐冂一空心彐='321125125151145'
,撇化辛='4143113'
,横组瓜豕='335441353334'
,区鱻鬾魊乂魊又版='1345'
,纵三组罒冖瓦='25221451554'
,正序纵包龘厂生='1331121'
,直化用='25112'
,纵组心用鱻鬾直用版鱻魊弯用版='454425112'
,用鱻鬾直月版鱻魊弯月版='25112'
,反序拟包纵组凵田鱻鬾魊田魊由版='2512152'
,底龘畏='1534'
,纵组口田='25125121'
,头龘留='35453'
,纵组田八='2512134'
,纵组田一='251211'
,直化丣='1221551'
,反序拟包纵组凵田='2512152'
,纵组囗无丨氺囗冝='41344525111'
,正序纵包龘弓土囗囗土版㢧='515121'
,横组丶丿='43'
,窢冖彑版宐='45551'
,纵组冖彑囗鱻馘宐鱻鬾宀直夕一版='45551'
,纵三组十冖田='124525121'
,纵组龴疋='5452134'
,纵组一囗出头兀囗囗开版元='1135'
,横组弓殳='5153554'
,横组囗提化匕囗卩='1552'
,出头版纵组囗无丨氺囗十='413412'
,纵组䒑八囗鱻魌䒑鱻鬾魊丷魊八版='43134'
,纵三组肀一灬='511214444'
,头龘盥='32112534511'
,横组幸攵='121431123134'
,纵组合酉='3412511253511'
,横组臣囗纵组𠂉古='1251253112251'
,横组囗纵组幺幸囗攵='554121431123134'
,无钩刂='22'
,半𥫗鱻鬾𠂉丶版鱻魊𠂉一版='314'
,且鱻鬾芯三版='251111'
,反序拟包横组𠃊目='251115'
,氺鱻鬾八八版鱻魊丷八版='23344'
,纵组囗反序拟包横组𠃊目囗八='25111534'
,具鱻鬾芯三且版鱻魊目一八版='25111134'
,木型纵组亻从鱻惐中序拟横三组人亻人='323434'
,纵三组一口𧘇='12513534'
,血鱻鬾丿罒版='325221'
,纵三组罒冖目='252214525111'
,閒鱻鬾魊直月魊弯月版='251125113511'
,白版臱='32511445344153'
,纵组乛囗反序横组丿亅='523'
,毒鱻鬾魊母魊毋魊毌版='112155414'
,纵组大石='13413251'
,笔划横折撇='5'
,示礻='11234'
,横组囗斜月版夕囗乛乀版龴囗囗头龘祭='354454'
,纵组回示='25251111234'
,纵组罒羽='25221541541'
,纵组禾灬='312344444'
,纵组尤旨鱻惐纵组尤㫖='1354352511'
,纵组匕禾='3531234'
,纵三组爫彐心囗囗缺工㥯='34435114544'
,纵组囗插序巫幽型全二包龘土口口囗回囗囗头喪版嗇='122512511252511'
,囱囪='3253541'
,横组正見='121212511135'
,纵组土囗融并甲电版㫣='121251125115'
,纵组土黽='1212511251211511'
,横组釆𥜽鱻鬾厶禸版='34312342125342554'
,纵组亠丷='4143'
,断头电='25115'
,鬲鱻鬾口㐄版='1251152254312'
,纵组夅夂='354152354'
,衰鱻鬾一卄一版鱻魊廿一版='41122113534'
,肋鱻鬾弯月版鱻魊肉月版='351153'
,纵组𠔿比囗囗𠔿版昆='25341535'
,纵组目廾='25111132'
,即鱻惐卽鱻鬾丨二版='5115452'
,横组車㔾='125111255'
,横组木匝='123412525'
,纵组目厺='2511113454'
,纵三组目大㔾鱻馘巳版='2511113455'
,㔾巳='55'
,纵组罒戍='25221134534'
,寇鱻鬾魊攴魊攵版='44511352154'
,纵组艮皿='51153425221'
,纵三组目大么='25111134354'
,插序全包龘戈巾囗囗巾版戒='252211252534'
,纵组巫㕣囗鱻魌巫鱻馘头嗇版='123434134251'
,脾鱻鬾弯月版鱻魊肉月版='351132511312'
,禄祿='452451124134'
,横组其皮='1221113453254'
,纵三组目大良='251111344511534'
,録錄='3411243151124134'
,邊鱻鬾自版囗囗非白版='325111445344153454'
,户戸='4513'
,米版囟='3254312341'
,横组囗触底版纵组丵臼囗殳='22431431123215113554'
,纵组囗横组𠂤辛囗米='3251514143112431234'
,糹三点='444'
,纵组十冖='1245'
,纵组夂糸囗鱻鬾魊夂魊攵版='354554234'
,横组户攵囗鱻鬾魊户魊戶魊戸版='45133134'
,敏鱻鬾魊每魊毎版='31554143134'
,纵三组目大糸囗囗非䋰='25111134554234'
,纵组米糸='431234554234'
,缺一纟='55'
,辱鱻鬾拟包纵组辰寸版='1311534124'
,十版击='1252'
,横组讠刂='4522'
,纵组罒田='2522125121'
,㓹鱻鬾厂包炎刂版='134334433422'
,畱鱻鬾直化丣版鱻魊丣版='122155125121'
,横组革马='122125112551'
,拟包横组乚厶='554'
,永鱻惐纵组亠水鱻惐纵组丄水='45534'
,纵组一夫鱻惐㺯='11134'
,冏鱻馘儿版='2534251'
,正序纵包龘冂古='2512251'
,木型纵组十吅='12251251'
,纵三组林大火='123412341344334'
,纵组囗中序拟横三组冫幺囗右龘氺十='554413412'
,中序拟横三组冫幺囗右龘氺='5544134'
,纵组丿囗𠄌版厶='354'
,纵组刀巴='535215'
,次鱻鬾冫版鱻魊二版='413534'
,纵组亠兄='4125135'
,者鱻鬾加丶版='121325114'
,扁鱻鬾魊户魊戶魊戸版='451325122'
,致鱻鬾魊攵魊夂版='1541213134'
,纵组彐囗底龘豕='511353334'
,益鱻鬾魊丷魊八版='4313425221'
,辱鱻鬾魊拟包纵组魊纵组版='1311534124'
,率鱻鬾丷八版鱻魊八八版='41554413412'
,纵组目兆囗囗目版晁='25111341534'
,插序全包龘𢦏业囗囗业版哉='12122431534'
,曾鱻鬾魊丷魊八版='432524312511'
,廛鱻鬾魊八魊儿版='413251121134121'
,正序纵包龘厂墨鱻鬾黒版='1325112114444121'
,車版击='125111252'
,触底版纵组丵臼='2243143112321511'
,下沉交叠拟纵组玄冖='4155445'
,厶鱻惐无口虫='54'
,叉版夂='3544'
,乛乀版龴='54'
,纵组幺幸='55412143112'
,纵组林月='123412342511'
,纵组𠂉鹵='3121253444441'
,帚版夢='122252214551145252'
,纵组𠂉古='3112251'
,纵组厶又='5454'
,底龘冬='44'
,肉月='2511'
,出头兀='135'
,𠄌版厶='54'
,反序横组丿亅='23'
,反序包龘北口='25121135'
,头龘业='2243'
,头龘负='35'
,尾冖版上='2145'
,尾大版目版百='1325111'
,横组米糸='431234554234'
,横组讠大='45134'
,罒版百='1325221'
,长腿甘='12211'
,一版冃='251'
,底龘豕='353334'
,正序纵包龘尸囗纵组囗横四组止丨丨巳囗夂='513222121515354'
,缺丿缶='11252'
,横组臣卩='12512552'
,横组土土='121121'
,底龘万='53'
,一隹版存='132411121'
,纵四组一八人目='1343425111'
,横组丨一='21'
,纵组囗横四组止丨丨巳囗夂='222121515354'
,横四组止丨丨巳='222121515'
,无顶夒鱻鬾白版='32511212151534354'
,纵组一囗中序拟横三组止自巳='13251112121515'
,中序拟横三组止自巳='3251112121515'
,中序拟横三组止白巳='325112121515'
))
_patch__nm2js.update(
{'慈鱻鬾魊兹魊茲版囗囗慈慈':'4315545544544'
,'勺勺':'354'
,'冬冬':'35444'
,'辥鱻鬾魊屮𠂤魊山𠂤魊屮㠯版':'5233251514143112'
,'屮':'523'
})
#end-_patch__nm2js
def _debug__keyword_auto_convert():
    r'''[[[
bug_report:
    e ../lots/NOTE/Python/python-bug/keyword-auto-convert.txt
#勺0x52FA勺0x2F828
CJK Compatibility Ideographs Supplement
Range: 2F800–2FA1F
    勺0x2F828 === 勺0x52FA
    #]]]'''#'''
    nm1 = '勺勺'
    nm2 = '勺勺'
    d = dict(勺勺='354')
    assert d == {nm1:'354'}
    assert not d == {nm2:'354'}
    assert dict(**{nm2:'354'}) == {nm2:'354'}
    assert not '勺勺' in (d:=dict(勺勺='354')), d
if 1:
    _debug__keyword_auto_convert()
if 1:
    #必须移动到_patch__nm2js之后
    (main4phase1_
    ,列出可推导出来的部件笔顺码囗囗用于更新补丁囗
    ) = _mk_funcs4phase1_()

from script.hz.部件拆分 import *

